Repository: openstack/security-doc
Catalog: security-guide/source/locale/*/LC_MESSAGES/security-guide.po
Languages: de, id, tr_tr

source: Port mirroring service involves sending a copy of packets entering or leaving one port to another port, which is usually different from the original destinations of the packets being mirrored. Tap-as-a-Service (TaaS) is an extension to the OpenStack networking service (neutron). It provides remote port mirroring capability for tenant virtual networks. This service has been primarily designed to help tenants (or the cloud administrator) debug complex virtual networks and gain visibility into their VMs, by monitoring the network traffic associated with them. TaaS honors tenant boundaries and its mirror sessions are capable of spanning across multiple compute and network nodes. It serves as an essential infrastructure component that can be utilized for supplying data to a variety of network analytics and security applications.
de: Port-Spiegelungsdienst beinhaltet das Senden einer Kopie von Paketen, die einen Port eingeben oder verlassen, einen anderen Port, der sich normalerweise von den ursprünglichen Zielen der Pakete unterscheidet, die gespiegelt sind. Tap-as-a-Service (TaaS) ist eine Erweiterung des OpenStack Networking Service (Neutron). Es bietet Remote-Port-Mirroring-Fähigkeit für virtuelle Tenant-Netzwerke. Dieser Service wurde in erster Linie dazu gedacht, den Tenants (oder dem Cloud-Administrator) zu helfen, komplexe virtuelle Netzwerke zu debuggen und in ihre VMs zu sehen, indem sie den damit verbundenen Netzwerkverkehr überwachen. TaaS ehrt Tenantgrenzen und seine Spiegelsitzungen sind in der Lage, über mehrere Compute- und Netzwerkknoten zu reisen. Es dient als wesentliche Infrastrukturkomponente, die für die Bereitstellung von Daten für eine Vielzahl von Netzwerkanalysen und Sicherheitsanwendungen genutzt werden kann.
id: Layanan mirroring port melibatkan pengiriman salinan paket yang masuk atau meninggalkan satu port ke port lain, yang biasanya berbeda dari tujuan asli dari paket yang dicerminkan. Tap-as-a-Service (TaaS) merupakan perpanjangan layanan jaringan OpenStack (neutron). Ini menyediakan kemampuan mirroring port jarak jauh untuk jaringan virtual penyewa. Layanan ini dirancang terutama untuk membantu administrator jaringan penyewa (atau administrator awan) debug kompleks dan mendapatkan visibilitas ke VM mereka, dengan memantau lalu lintas jaringan yang terkait dengannya. TaaS menghormati batas penyewa dan sesi cerminnya mampu mencakup beberapa node komputasi dan jaringan. Ini berfungsi sebagai komponen infrastruktur penting yang dapat digunakan untuk memasok data ke berbagai analisis jaringan dan aplikasi keamanan.
tr_tr: Port yansıtma servisi, bir porta giren veya çıkan bir paket kopyasını, genellikle yansıtılan paketlerin özgün hedeflerinden farklı olan başka bir porta göndermeyi içerir. Service-as-a-Service (TaaS), OpenStack ağ servisinin (neutron) bir uzantısıdır. Kiracı sanal ağlar için uzaktan port yansıtma özelliği sağlar. Bu hizmet öncelikle kiracıların (veya bulut yöneticisinin) karmaşık sanal ağları hata ayıklamasına ve kendileriyle ilişkili ağ trafiğini izleyerek VM'lerinde görünürlük kazanmalarına yardımcı olmak için tasarlanmıştır. TaaS, kiracı sınırlarını ve ayna oturumlarını, birden çok hesaplama ve ağ düğümü arasında kapsayacak kapasiteye sahiptir. Çeşitli ağ analitiği ve güvenlik uygulamalarına veri tedarik etmek için kullanılabilen temel bir altyapı bileşenidir.

source: PostgreSQL SSL configuration
de: PostgreSQL SSL Konfiguration
id: Konfigurasi SSL PostgreSQL
tr_tr: PostgreSQL SSL yapılandırma

source: PostgreSQL has a number of desirable security features such as Kerberos authentication, object-level security, and encryption support. The PostgreSQL community has done well to provide solid guidance, documentation, and tooling to promote positive security practices.
de: PostgreSQL hat eine Reihe von wünschenswerten Sicherheitsmerkmalen wie Kerberos-Authentifizierung, Objekt-Level-Sicherheit und Verschlüsselungsunterstützung. Die PostgreSQL-Community hat es gut gemacht, solide Anleitungen, Dokumentation und Werkzeuge zur Verfügung zu stellen, um positive Sicherheitspraktiken zu fördern.
id: PostgreSQL memiliki sejumlah fitur keamanan yang diinginkan seperti otentikasi Kerberos, keamanan object-leve, dan dukungan enkripsi. Komunitas PostgreSQL telah berhasil menyediakan panduan, dokumentasi, dan perkakas yang solid untuk mempromosikan praktik keamanan yang positif.
tr_tr: PostgreSQL'in Kerberos kimlik doğrulama, nesne düzeyinde güvenlik ve şifreleme desteği gibi bir dizi istenen güvenlik özelliği vardır. PostgreSQL topluluğu, olumlu güvenlik uygulamalarını geliştirmek için sağlam bir rehberlik, belgelendirme ve araç sağlama konusunda iyi bir performans gösterdi.

source: Pre-Kilo releases will require a TLS proxy as the controller does not allow direct TLS connections. Configuring TLS proxies is covered in :doc:`../secure-communication/tls-proxies-and-http-services`, and we recommend following the advice there to create this type of installation.
de: Pre-Kilo-Releases benötigen einen TLS-Proxy, da der Controller keine direkten TLS-Verbindungen zulässt. Das Konfigurieren von TLS-Proxies ist abgedeckt in :doc:`../ secure-communication/tls-proxies-and-http-services`, und wir empfehlen Ihnen bei der Anleitung, diese Art der Installation zu erstellen.
id: Rilis Pre-Kilo akan memerlukan proxy TLS karena pengontrol tidak mengizinkan koneksi TLS langsung. Mengkonfigurasi proxy TLS tercakup dalam :doc:`../secure-communication/tls-proxies-and-http-services`, dan sebaiknya ikuti saran di sana untuk membuat jenis instalasi ini.
tr_tr: Denetleyici doğrudan TLS bağlantılarına izin vermediğinden, Kilo öncesi sürümler, TLS vekili gerektirecektir. TLS vekillerini yapılandırma şu adreste bulunur :doc:`../secure-communication/tls-proxies-and-http-services`, ve bu tür bir kurulum oluşturmak için aşağıdaki tavsiyeleri takip etmenizi öneririz.

source: Prepare for external audit
de: Vorbereitung auf externes Audit
id: Siapkan audit eksternal
tr_tr: Harici denetime hazırlık

source: Prevention is possible by using an external authentication system that blocks out an account after some configured number of failed login attempts. The account then may only be unlocked with further side-channel intervention.
de: Die Verhinderung ist möglich, indem ein externes Authentifizierungssystem verwendet wird, das ein Konto nach einer konfigurierten Anzahl von fehlgeschlagenen Anmeldeversuchen blockiert. Das Konto darf dann nur mit einem weiteren Seitenkanal-Eingriff freigeschaltet werden.

source: Primary users and use-cases
de: Primärnutzer und Gebrauchsfälle
id: Pengguna utama dan use-cases
tr_tr: Birincil kullanıcılar ve kullanım örnekleri

source: Prior to configuring roles, groups, and users, document your required access control policies for the OpenStack installation. The policies should be consistent with any regulatory or legal requirements for the organization. Future modifications to the access control configuration should be done consistently with the formal policies. The policies should include the conditions and processes for creating, deleting, disabling, and enabling accounts, and for assigning privileges to the accounts. Periodically review the policies and ensure that the configuration is in compliance with approved policies.
de: Bevor Sie Rollen, Gruppen und Benutzer konfigurieren, dokumentieren Sie die erforderlichen Zugriffskontrollrichtlinien für die OpenStack-Installation. Die Policen sollten mit den gesetzlichen oder rechtlichen Anforderungen der Organisation vereinbar sein. Zukünftige Änderungen an der Zutrittskontrollkonfiguration sollten konsequent mit den formalen Richtlinien erfolgen. Die Richtlinien sollten die Bedingungen und Prozesse zum Erstellen, Löschen, Deaktivieren und Aktivieren von Konten sowie zum Zuweisen von Berechtigungen für die Konten enthalten. Überprüfen Sie regelmäßig die Richtlinien und stellen Sie sicher, dass die Konfiguration den genehmigten Richtlinien entspricht.
id: Sebelum mengkonfigurasi peran, kelompok, dan pengguna, dokumentasikan kebijakan kontrol akses yang diperlukan untuk instalasi OpenStack. Kebijakan harus konsisten dengan peraturan atau persyaratan hukum untuk organisasi. Modifikasi kontrol konfigurasi akses harus dilakukan secara konsisten dengan kebijakan formal. Kebijakan harus mencakup kondisi dan proses untuk membuat, menghapus, melumpuhkan (disabling), dan mengaktifkan akun, dan menetapkan hak istimewa ke akun. Tinjau ulang kebijakan secara berkala dan pastikan konfigurasi tersebut sesuai dengan kebijakan yang disetujui.
tr_tr: Rolleri, grupları ve kullanıcıları yapılandırmadan önce, OpenStack kurulumu için gerekli erişim denetimi politikalarınızı belgeleyin. Politikalar, organizasyon için düzenleyici veya yasal gerekliliklerle tutarlı olmalıdır. Erişim kontrolü yapılandırmasında gelecekteki değişiklikler resmi politikalarla tutarlı bir şekilde yapılmalıdır. İlkeler, hesap oluşturma, silme, devre dışı bırakma ve etkinleştirme ve hesaplara ayrıcalık atama koşullarını ve süreçlerini içermelidir. Politikaları periyodik olarak gözden geçirin ve yapılandırmanın onaylanmış politikalara uygunluğundan emin olun.

source: Privacy
de: Privatsphäre
id: Privasi
tr_tr: Gizlilik

source: Privacy concerns for public and private cloud users are typically diametrically opposed. The data generated and stored in private clouds is normally owned by the operator of the cloud, who is able to deploy technologies such as :term:`data loss prevention (DLP) <Data loss prevention (DLP) software>` protection, file inspection, deep packet inspection and prescriptive firewalling. In contrast, privacy is one of the primary barriers for the adoption of public cloud infrastructures, as many of the previously mentioned controls do not exist.
de: Datenschutzbedenken für öffentliche und private Cloud-Benutzer sind typischerweise diametral entgegengesetzt. Die Daten, die in privaten Clouds erzeugt und gespeichert werden, befinden sich normalerweise im Besitz des Betreibers der Cloud, der in der Lage ist, Technologien wie z.B. :term: Datenverlustprävention (DLP) <Data loss prevention (DLP) software>`Schutz, Datei Inspektion, Deep Packet Inspection und prescriptive Firewalling. Im Gegensatz dazu ist die Privatsphäre eine der primären Barrieren für die Annahme von öffentlichen Cloud-Infrastrukturen, da viele der zuvor erwähnten Steuerelemente nicht vorhanden sind.
id: Masalah privasi untuk pengguna awan publik dan private biasanya bertentangan secara diametris. Data yang dihasilkan dan disimpan di awan private biasanya dimiliki oleh operator awan, yang mampu menerapkan teknologi seperti proteksi:term:`data loss prevention (DLP) <Data loss prevention (DLP) software>`, pemeriksaan berkas , inspeksi paket yang dalam dan firewall preskriptif. Sebaliknya, privasi adalah salah satu penghalang utama untuk adopsi infrastruktur awan publik, karena banyak kontrol yang telah disebutkan sebelumnya tidak ada.
tr_tr: Kamu ve özel bulut kullanıcıları için gizlilik kaygısı genelde karşıttır. Özel bulutlarda üretilen ve depolanan veriler normalde bulutun işletmecisine aittir; bu kişi, :term:`veri kaybını önleme (DLP) <Veri kaybını önleme (DLP) yazılımı>`, koruma, dosya denetimi, derin paket denetimi ve kurallara göre güvenlik duvarı gibi teknolojileri kullanabilir. Buna karşılık, gizlilik, daha önce bahsedilen denetimlerin çoğunun mevcut olmadığı için genel bulut altyapılarının benimsenmesindeki ana engellerden biridir.

source: Privacy is an increasingly important element of a compliance program. Businesses are being held to a higher standard by their customers, who have increased interest in understanding how their data is treated from a privacy perspective.
de: Privatsphäre ist ein immer wichtigeres Element eines Compliance-Programms. Unternehmen werden von ihren Kunden zu einem höheren Standard gehalten, die das Interesse daran haben, zu verstehen, wie ihre Daten aus Sicht der Privatsphäre behandelt werden.
id: Privasi adalah elemen yang semakin penting dari program kepatuhan. Bisnis dipegang dengan standar yang lebih tinggi oleh pelanggan mereka, yang telah meningkatkan minat untuk memahami bagaimana data mereka diperlakukan dari perspektif privasi.
tr_tr: Gizlilik, bir uyumluluk programının önemi giderek artan bir unsurudur. İşletmeler, verilerin gizlilik açısından nasıl ele alınacağını anlamaya olan ilgileri artan müşterileri tarafından daha yüksek bir standarda tutuluyor.

source: Private clouds are typically deployed by enterprises or institutions inside their networks and behind their firewalls. Enterprises will have strict policies on what data is allowed to exit their network and may even have different clouds for specific purposes. Users of a private cloud are typically employees of the organization that owns the cloud and are able to be held accountable for their actions. Employees often attend training sessions before accessing the cloud and will likely take part in regularly scheduled security awareness training. Public clouds by contrast cannot make any assertions about their users, cloud use-cases or user motivations. This immediately pushes the guest security domain into a completely *untrusted* state for public cloud providers.
de: Private Clouds werden typischerweise von Unternehmen oder Institutionen in ihren Netzwerken und hinter ihren Firewalls eingesetzt. Unternehmen haben strenge Richtlinien, welche Daten erlaubt werden, ihr Netzwerk zu verlassen und können sogar unterschiedliche Clouds für bestimmte Zwecke haben. Benutzer einer privaten Cloud sind typischerweise Angestellte der Organisation, die die Cloud besitzt und für ihre Handlungen verantwortlich gemacht werden können. Die Mitarbeiter besuchen oft Schulungen, bevor sie auf die Cloud zugreifen und werden wahrscheinlich an regelmäßig geplanten Sicherheitsbewusstseinstraining teilnehmen. Öffentliche Clouds dagegen können keine Behauptungen über ihre Benutzer, Cloud-Use-Cases oder User-Motivationen machen. Dies drückt sofort die Gast-Sicherheits-Domain in einen völlig *nicht vertrauenswürdigen* Status für öffentliche Cloud-Anbieter.
id: Awan private biasanya digunakan oleh perusahaan atau institusi di dalam jaringan mereka dan di balik firewall mereka. Perusahaan akan memiliki kebijakan yang tegas mengenai data yang diizinkan keluar dari jaringan mereka dan mungkin juga memiliki awan yang berbeda untuk tujuan tertentu. Pengguna awan private biasanya adalah karyawan organisasi yang memiliki awan dan dapat dimintai pertanggungjawaban atas tindakan mereka. Karyawan sering menghadiri sesi pelatihan sebelum mengakses awan dan kemungkinan akan mengikuti pelatihan kesadaran keamanan terjadwal secara reguler. Sebaliknya awan publik tidak dapat membuat pernyataan tentang pengguna mereka, kasus penggunaan awan atau motivasi pengguna. Ini segera mendorong domain keamanan tamu (guest security domain) ke status *untrusted * sepenuhnya untuk penyedia awan publik.
tr_tr: Özel bulutlar genellikle ağlarındaki organizasyonlar veya kurumlar tarafından ve güvenlik duvarlarının arkasında konuşlandırılır. İşletmeler, ağdan çıkmak için hangi verilere izin verildiğine ilişkin sıkı politikalara sahip olacak ve belirli amaçlar için farklı bulutlar bile gösterebilir. Özel bir bulut kullanıcısı genellikle buluta sahip olan ve eylemleri için sorumlu tutulabilen kuruluştaki çalışanlardır. Çalışanlar genellikle buluta erişmeden önce eğitim oturumlarına katılır ve büyük olasılıkla düzenli olarak planlanan güvenlik farkındalığı eğitimine katılır. Tersine kamu bulutları, kullanıcıları, bulut kullanım durumları veya kullanıcı motivasyonları hakkında herhangi bir iddiada bulunamaz. Bu, konuk güvenlik alanını, genel bulut sağlayıcıları için tamamen *güvenilmeyen* durumuna iter.

source: Privilege Escalation describes the ability of a user to act with the privileges of some other user in a system, bypassing appropriate authorization checks. A guest user performing an operation that allows them to conduct unauthorized operations with the privileges of an administrator is an example of this type of vulnerability.
de: Privileg Eskalation beschreibt die Fähigkeit eines Benutzers, mit den Privilegien eines anderen Benutzers in einem System zu handeln, wobei entsprechende Berechtigungsprüfungen umgangen werden. Ein Gastbenutzer, der eine Operation ausführt, die es ihnen ermöglicht, unbefugte Operationen mit den Berechtigungen eines Administrators durchzuführen, ist ein Beispiel für diese Art von Sicherheitsanfälligkeit.
id: Privilege Escalation menggambarkan kemampuan pengguna untuk bertindak dengan hak istimewa beberapa pengguna lain dalam sebuah sistem, melewati pemeriksaan otorisasi yang tepat. Pengguna tamu yang melakukan operasi yang memungkinkan mereka melakukan operasi yang tidak sah dengan hak istimewa administrator adalah contoh jenis kerentanan ini.
tr_tr: İmtiyaz Yükseltme, kullanıcının uygun yetkilendirme denetimlerini atlayarak bir sistemdeki bir başka kullanıcının ayrıcalıklarıyla hareket etme yeteneğini açıklar. Yönetici ayrıcalıklarıyla yetkisiz işlemleri yapmalarına izin veren bir işlemi gerçekleştiren bir konuk kullanıcı bu tür güvenlik açığının bir örneğidir.

source: Privilege elevation (1 level)
de: Privileghöhe (1 Ebene)
id: Privilege elevation (1 tingkat)
tr_tr: Imtiyaz yükselmesi (1 seviye)

source: Privilege elevation (2 levels)
de: Privileghöhe (2 Stufen)
id: Privilege elevation (2 tingkat)
tr_tr: Imtiyaz yükselmesi (2 seviye)

source: Privilege elevation (3 levels)
de: Privileghöhe (3 Stufen)
id: Privilege elevation (3 tingkat)
tr_tr: Öncelik yükseltmesi (3 seviye)

source: Privilege separation (OpenStack service processes should not have direct access to private keys used for SSL/TLS).
de: Privilegentrennung (OpenStack-Serviceprozesse sollten keinen direkten Zugriff auf private Schlüssel für SSL/TLS haben).
id: Pemisahan hak istimewa (proses layanan OpenStack seharusnya tidak memiliki akses langsung ke kunci privat yang digunakan untuk SSL/TLS).
tr_tr: Ayrıcalık ayrımı (OpenStack servis süreçleri, SSL/TLS için kullanılan özel anahtarlara doğrudan erişemez).

source: Privileges
de: Privilegien
id: Hak istimewa
tr_tr: Ayrıcalıklar

source: Produces a position independent executable, which is necessary for ASLR.
de: Erzeugt eine standunabhängige ausführbare Datei, die für ASLR notwendig ist.
id: Menghasilkan posisi independent executable, yang diperlukan untuk ASLR.
tr_tr: ASLR için gerekli olan konum bağımsız çalıştırılabilir üretir.

source: Product or project maturity
de: Produkt- oder Projektreife
id: Kematangan produk atau proyek
tr_tr: Ürün ya da proje olgunluğu

source: Project description and purpose
de: Projektbeschreibung und Zweck
id: Uraian dan tujuan proyek
tr_tr: Proje açıklaması ve amaç

source: Project network services workflow
de: Projektnetzwerk-Workflow
id: Alur kerja layanan jaringan proyek
tr_tr: Proje ağ servisi iş akışı

source: Promote privacy
de: Förderung der Privatsphäre
id: Promosikan privasi
tr_tr: Gizliliği yükseltmek

source: Protected data transfer
de: Geschützte Datenübertragung
id: Transfer data terlindungi
tr_tr: Korumalı veri aktarımı

source: Protected data transfer, protection for data at rest
de: Geschützte Datenübertragung, Schutz für Daten
id: Transfer data terlindungi, perlindungan data saat istirahat
tr_tr: Korumalı veri aktarımı, duran veri için koruma

source: Protection for data at rest, identification and authentication
de: Schutz für Daten in Ruhezustand, Identifikation und Authentifizierung
id: Perlindungan untuk data saat istirahat, identifikasi dan otentikasi
tr_tr: Duran veri koruması, tanımlama ve kimlik doğrulama

source: Protection of data at rest
de: Schutz der Daten in Ruhezustand
id: Perlindungan data saat istirahat
tr_tr: Duran verinin korunması

source: Protection of data at rest, protected data transfer
de: Schutz der Daten in Ruhezustand, geschützte Datenübertragung
id: Perlindungan data saat istirahat, transfer data yang terlindungi
tr_tr: Duran veri için koruma, korumalı veri aktarımı

source: Protocol
de: Protokoll
tr_tr: Protokol

source: Protocols
de: Protokolle
tr_tr: Protokoller

source: Protocols are enabled/disabled through SSL_CTX_set_options. We recommend disabling SSLv2/v3 and enabling TLS.
de: Protokolle werden durch SSL_CTX_set_options aktiviert/deaktiviert. Wir empfehlen, SSLv2/v3 zu deaktivieren und TLS zu aktivieren.
id: Protokol diaktifkan/dinonaktifkan melalui SSL_CTX_set_options. Sebaiknya nonaktifkan SSLv2/v3 dan aktifkan TLS.
tr_tr: Protokoller SSL_CTX_set_options aracılığıyla etkinleştirilir/devre dışı bırakılır. SSLv2/v3'ü devre dışı bırakmanızı ve TLS'yi etkinleştirmenizi öneririz.

source: Provide guidance to secure your OpenStack deployment
de: Stellt Anleitung zur Verfügung, um Ihre OpenStack-Bereitstellung zu sichern
id: Berikan panduan untuk mengamankan penyebaran OpenStack Anda
tr_tr: OpenStack yayınını güvenli tutmak için kılavuz sağlayın

source: Provide storage capacity or virtual machines for your cloud.
de: Geben Sie Speicherkapazität oder virtuelle Maschinen für Ihre Cloud.
id: Menyediakan kapasitas penyimpanan atau mesin virtual untuk awan Anda.
tr_tr: Bulutunuz için depolama kapasitesi veya sanal makineler sağlayın.

source: Provides DHCP services to tenant networks. This agent is the same across all plug-ins and is responsible for maintaining DHCP configuration. The *neutron-dhcp-agent* requires message queue access. *Optional depending on plug-in.*
de: Bietet DHCP-Dienste für Tenant-Netzwerke. Dieser Agent ist das gleiche über alle Plug-Ins und ist verantwortlich für die Wartung der DHCP-Konfiguration. Der *Neutron-DHCP-Agent* benötigt einen Warteschlangenzugriff. *Optional abhängig vom Plug-In.*
id: Menyediakan layanan DHCP ke jaringan penyewa. Agen ini sama di semua plug-in dan bertanggung jawab untuk menjaga konfigurasi DHCP. The *neutron-dhcp-agent* memerlukan akses antrian pesan. *Optional depending on plug-in.*
tr_tr: Kiracı ağlara DHCP servisleri sağlar. Bu aracı tüm eklentilerde aynıdır ve DHCP yapılandırmasını sürdürmekten sorumludur. *neutron-dhcp-agent*, ileti kuyruğu erişimi gerektirir. *İsteğe bağlı olarak eklentiye bağlı.*

source: Provides L3/NAT forwarding for external network access of VMs on tenant networks. Requires message queue access. *Optional depending on plug-in.*
de: Bietet L3/NAT-Weiterleitung für den externen Netzzugang von VMs auf Tenantnetzwerken. Erfordert den Nachrichtenwarteschlangenzugriff. *Optional abhängig vom Plug-In.*
id: Menyediakan forwarding L3/NAT untuk akses jaringan eksternal VM pada jaringan penyewa. Memerlukan akses antrian pesan. *Optional depending on plug-in.*
tr_tr: Kiracı ağlarda VM'lerin harici ağ erişimi için L3/NAT yönlendirme sağlar. Mesaj kuyruğu erişimi gerektirir. *İsteğe bağlı olarak eklentiye bağlı.*

source: Provides additional networking services to tenant networks. These SDN services may interact with *neutron-server*, *neutron-plugin*, and plugin-agents through communication channels such as REST APIs.
de: Bietet zusätzliche Netzwerkdienste für Tenantnetze an. Diese SDN-Dienste können mit *Neutron Server*, *Neutron-Plugin* und Plugin-Agenten über Kommunikationskanäle wie REST-APIs interagieren.
id: Menyediakan layanan jaringan tambahan untuk jaringan penyewa. Layanan SDN ini dapat berinteraksi dengan *neutron-server*, *neutron-plugin*, dan plugin-agents melalui saluran komunikasi seperti REST API.
tr_tr: Kiracı ağlarına ek ağ hizmetleri sağlar. Bu SDN servisleri, *neutron-server*, *neutron-plugin ve eklenti aracıyla, REST API'leri gibi iletişim kanallarıyla etkileşim kurabilir.
