Repository: openstack/security-doc
Catalog: security-guide/source/locale/*/LC_MESSAGES/security-guide.po
Languages: de, id, tr_tr

source: **Pass:** If user and group ownership of all these config files is set to keystone. The above commands show output of keystone keystone.
de: **Pass:** Wenn Benutzer- und Gruppenbesitz aller dieser Konfigurationsdateien auf keystone gesetzt ist. Die obigen Befehle zeigen die Ausgabe von keystone keystone.
id: **Pass:** Jika kepemilikan pengguna dan grup dari semua file konfigurasi ini diatur ke keystone. Perintah di atas menunjukkan output dari keystone.
tr_tr: **Başarılı:** Tüm bu yapılandırma dosyalarının kullanıcı ve grup sahipliği keystone ise. Yukarıdaki komut keystone keystone çıktısı verecektir.

source: **Pass:** If user and group ownership of all these config files is set to root and barbican respectively. The above commands show output of root / barbican.
de: **Pass:** Wenn Benutzer- und Gruppeneigentümer aller dieser Konfigurationsdateien auf root bzw. barbican gesetzt sind. Die obigen Befehle zeigen die Ausgabe von root/barbican an.
id: **Pass:** Jika kepemilikan pengguna dan grup dari semua file konfigurasi ini diset ke root dan barbican. Perintah di atas menunjukkan output dari root / barbican.

source: **Pass:** If user and group ownership of all these config files is set to root and cinder respectively. The above commands show output of root cinder.
de: **Pass:** Wenn Besitzer und Gruppenbesitz aller dieser Konfigurationsdateien auf root und cinder gesetzt sind. Die obigen Befehle zeigen die Ausgabe von root cinder.
id: ** Pass:** Jika kepemilikan pengguna dan grup dari semua file konfigurasi ini diset ke root dan cinder. Perintah di atas menunjukkan output dari root cinder.
tr_tr: **Başarılı:** Eğer bu yapılandırma dosyaların kullanıcı ve grup sahipliği root ve cinder olarak ayarlandıysa. Yukarıdaki komutlar root cinder çıktısını gösterir.

source: **Pass:** If user and group ownership of all these config files is set to root and manila respectively. The above commands show output of root manila.
de: **Pass:** Wenn Benutzer- und Gruppenbesitz aller dieser Konfigurationsdateien auf root und manila gesetzt ist. Die obigen Befehle zeigen die Ausgabe von root manila.
id: **Pass:** Jika kepemilikan pengguna dan grup dari semua file konfigurasi ini diset ke root dan manila masing-masing. Perintah di atas menunjukkan output dari manila root.
tr_tr: **Başarılı:** Tüm bu yapılandırma dosyalarının kullanıcı ve grup sahipliği sırasıyla root ve manila ise. Yukarıdaki komut root manila çıktısını verir.

source: **Pass:** If user and group ownership of all these config files is set to root and neutron respectively. The above commands show output of root neutron.
de: **Pass:** Wenn Benutzer- und Gruppenbesitz aller dieser Konfigurationsdateien auf root und neutron gesetzt ist. Die obigen Befehle zeigen die Ausgabe von root neutron.
id: **Pass:**Jika kepemilikan pengguna dan grup dari semua file konfigurasi ini diset ke root dan neutron. Perintah di atas menunjukkan output dari root neutron.
tr_tr: **Başarılı:** Tüm yapılandırma dosyalarının kullanıcı ve grup sahipliği sırasıyla root ve neutron ise. Yukarıdaki komutlar root neutron çıktısı vermeli.

source: **Pass:** If user and group ownership of all these configuration files is set to root and glance respectively. The above commands show output of root glance.
de: **Pass:** Wenn Benutzer- und Gruppenbesitz aller dieser Konfigurationsdateien auf root und glance gesetzt sind. Die obigen Befehle zeigen die Ausgabe von root glance.
id: **Pass:** Jika kepemilikan pengguna dan grup dari semua file konfigurasi ini disetel masing masing ke root dan glance. Perintah di atas menunjukkan output dari root glance.
tr_tr: **Başarılı:** Tüm bu yapılandırma dosyalarının kullanıcı ve grup sahipliği root ve glance ise. Yukarıdaki komut root glance çıktısı verir.

source: **Pass:** If user and group ownership of the config file is set to root and horizon respectively. The above commands show output of root horizon.
de: **Pass:** Wenn Benutzer- und Gruppenbesitz der Konfigurationsdatei auf root und horizon gesetzt ist. Die obigen Befehle zeigen die Ausgabe des root horizon.
id: **Pass:** Jika kepemilikan pengguna dan grup dari file konfigurasi diset ke root dan horizon masing-masing. Perintah di atas menunjukkan output dari root horizon.
tr_tr: **Başarılı:** Eğer yapılandırma dosyalarının kullanıcı ve grup sahipliği sırasıyla root ve horizon ise. Yukarıdaki komutlar root horizon çıktısını verir.

source: **Pass:** If value of parameter ``CSRF_COOKIE_SECURE`` in ``/etc/openstack-dashboard/local_settings.py`` is set to ``True``.
de: **Pass:** Wenn der Wert des Parameters ``CSRF_COOKIE_SECURE``in ``/etc /openstack-dashboard/local_settings.py``auf ``True`` gesetzt ist.
id: **Pass:** Jika nilai parameter ``CSRF_COOKIE_SECURE`` di ``/etc/openstack-dashboard/local_settings.py`` disetel ke ``True``.
tr_tr: **Başarılı:** ``/etc/openstack-dashboard/local_settings.py`` dosyasındaki ``CSRF_COOKIE_SECURE`` parametresinin değeri ``True`` ise.

source: **Pass:** If value of parameter ``DISABLE_PASSWORD_REVEAL`` in ``/etc/openstack-dashboard/local_settings.py`` is set to ``True``.
de: **Pass:** Wenn der Wert des Parameters ``DISABLE_PASSWORD_REVEAL``in `` / etc/openstack-dashboard/local_settings.py`` auf ``True``gesetzt ist.
id: **Pass:** Jika nilai parameter ``DISABLE_PASSWORD_REVEAL`` di ``/etc/openstack-dashboard/local_settings.py`` diatur ke ``True``.
tr_tr: **Başarılı:** Eğer ``/etc/openstack-dashboard/local_settings.py`` dosyasındaki ``DISABLE_PASSWORD_REVEAL`` parametresinin değeri ``True`` ise.

source: **Pass:** If value of parameter ``DISALLOW_IFRAME_EMBED`` in ``/etc/openstack-dashboard/local_settings.py`` is set to ``True``.
de: **Pass:** Wenn der Wert des Parameters ``DISALLOW_IFRAME_EMBED``in ``/ etc/openstack-dashboard/local_settings.py``auf ``True``gesetzt ist.
id: **Pass: ** Jika nilai parameter ``DISALLOW_IFRAME_EMBED`` di ``/etc/openstack-dashboard/local_settings.py`` diatur ke ``True``.
tr_tr: **Başarılı:** ``/etc/openstack-dashboard/local_settings.py`` dosyasındaki ``DISALLOW_IFRAME_EMBED`` parametresinin değeri ``True`` ise.

source: **Pass:** If value of parameter ``ENFORCE_PASSWORD_CHECK`` in ``/etc/openstack-dashboard/local_settings.py`` is set to ``True``.
de: **Pass:** Wenn der Wert des Parameters ``ENFORCE_PASSWORD_CHECK`` in ``/ etc/openstack-dashboard/local_settings.py`` auf ``True``gesetzt ist.
id: **Pass:** Jika nilai parameter ``ENFORCE_PASSWORD_CHECK`` di ``/etc/openstack-dashboard/local_settings.py`` disetel ke ``True``.
tr_tr: **Başarılı:** ``/etc/openstack-dashboard/local_settings.py`` dosyasında ``ENFORCE_PASSWORD_CHECK`` parametresi ``True`` ise.

source: **Pass:** If value of parameter ``PASSWORD_AUTOCOMPLETE`` in ``/etc/openstack-dashboard/local_settings.py`` is set to ``off``.
de: **Pass:** Wenn der Wert des Parameters ``PASSWORD_AUTOCOMPLETE``in ``/ etc/openstack-dashboard/local_settings.py`` auf ``off``gesetzt ist.
id: **Pass:**Jika nilai parameter ``PASSWORD_AUTOCOMPLETE`` di ``/etc/openstack-dashboard/local_settings.py`` diatur ke ``off``.
tr_tr: **Başarılı:** Eğer ``/etc/openstack-dashboard/local_settings.py`` dosyasındaki ``PASSWORD_AUTOCOMPLETE`` parametresinin değeri ``off`` ise.

source: **Pass:** If value of parameter ``PASSWORD_VALIDATOR`` in ``/etc/openstack-dashboard/local_settings.py`` is set to any value outside of the defaul allow all `"regex": '.*',`
de: **Pass:** Wenn der Wert des Parameters ``PASSWORD_VALIDATOR``in ``/etc /openstack-dashboard/local_settings.py``auf einen beliebigen Wert außerhalb des Default gesetzt ist, erlaube alle `\regex\: '.*',
id: **Pass:** Jika nilai parameter ``PASSWORD_VALIDATOR`` di ``/etc/openstack-dashboard/local_settings.py`` diatur ke nilai apapun di luar defaul mengizinkan semua `" regex ": '. *',`
tr_tr: **Başarılı:** ``/etc/openstack-dashboard/local_settings.py`` dosyasında ``PASSWORD_VALIDATOR`` parametresi `"regex": '.*',` dışında bir değer ise

source: **Pass:** If value of parameter ``SECURE_PROXY_SSL_HEADER`` in ``/etc/openstack-dashboard/local_settings.py`` is set to ``'HTTP_X_FORWARDED_PROTO', 'https'``
de: **Pass:** Wenn der Wert des Parameters ``SECURE_PROXY_SSL_HEADER``in `` / etc/openstack-dashboard/local_settings.py``auf `` ``'HTTP_X_FORWARDED_PROTO', 'https'`` gesetzt ist
id: **Pass:** Jika nilai parameter `` SECURE_PROXY_SSL_HEADER`` di ``/etc/openstack-dashboard/local_settings.py`` diatur ke ``'HTTP_X_FORWARDED_PROTO', 'https'``
tr_tr: **Başarılı:** Eğer ``/etc/openstack-dashboard/local_settings.py`` dosyasındaki ``SECURE_PROXY_SSL_HEADER`` parametresinin değeri ``'HTTP_X_FORWARDED_PROTO', 'https'`` ise.

source: **Pass:** If value of parameter ``SESSION_COOKIE_HTTPONLY`` in ``/etc/openstack-dashboard/local_settings.py`` is set to ``True``.
de: **Pass:** Wenn der Wert des Parameters ``SESSION_COOKIE_HTTPONLY``in `` / etc/openstack-dashboard/local_settings.py``auf ``True`` gesetzt ist.
id: **Pass:** Jika nilai parameter ``SESSION_COOKIE_HTTPONLY`` di ``/etc/openstack-dashboard/local_settings.py`` diatur ke ``True``.
tr_tr: **Başarılı:** Eğer ``/etc/openstack-dashboard/local_settings.py`` dosyasındaki ``SESSION_COOKIE_HTTPONLY`` parametresinin değeri ``True`` ise.

source: **Pass:** If value of parameter ``SESSION_COOKIE_SECURE`` in ``/etc/openstack-dashboard/local_settings.py`` is set to ``True``.
de: **Pass:** Wenn der Wert des Parameters ``SESSION_COOKIE_SECURE``in ``/ etc/openstack-dashboard/local_settings.py``auf ``True`` gesetzt ist.
id: **Pass:** Jika nilai parameter ``SESSION_COOKIE_SECURE`` di ``/etc/openstack-dashboard/local_settings.py`` disetel ke ``True``.
tr_tr: **Başarılı:** ``/etc/openstack-dashboard/local_settings.py`` dosyasındaki ``SESSION_COOKIE_SECURE`` parametresi ``True`` ise.

source: **Pass:** If value of parameter ``api_insecure`` under ``[glance]`` section in ``/etc/nova/nova.conf`` is set to ``False`` and value of parameter ``api_servers`` under ``[glance]`` section in ``/etc/nova/nova.conf`` is set to a value starting with ``https://``.
de: **Pass:** Wenn der Wert des Parameters ``api_insecure`` unter dem ``[glance] `` Abschnitt in ``/etc/nova/nova.conf``auf ``False`` und der Wert des Parameters ``api_servers`` unter dem ``[glace]` `Abschnitt in` `/ etc/nova/nova.conf`` auf einen Wert gesetzt ist, der mit` `https: //`` beginnt.
id: **Pass:** Jika nilai parameter ``api_insecure`` di bawah bagian ``[glance] `` di ``/etc/nova/nova.conf`` diatur ke ``False`` dan nilai parameter ``api_servers`` di bawah bagian ``[glance]``` dalam ``/etc/nova/nova.conf`` diatur ke nilai yang dimulai dengan ``https://``.
tr_tr: **Başarılı:** ``/etc/nova/nova.conf`` dosyasındaki ``[glance]`` bölümündeki ``api_insecure`` parametresinin değeri ``False`` ise ve ``/etc/nova/nova.conf`` dosyasındaki ``[glance]`` bölümündeki ``api_servers`` parametresinin değeri ``https://`` ile başlayan bir değer ise.

source: **Pass:** If value of parameter ``auth_protocol`` under ``[keystone_authtoken]`` section in ``barbican.conf`` is set to ``https``, or if value of parameter ``identity_uri`` under ``[keystone_authtoken]`` section in ``barbican.conf`` is set to Identity API endpoint starting with ``https://`` and value of parameter ``insecure`` under the same ``[keystone_authtoken]`` section in the same ``barbican.conf`` is set to ``False``.
de: ** Pass: ** Wenn der Wert des Parameters ``auth_protocol`` unter ``[keystone_authtoken] `` in ``barbican.conf`` auf ``https`` gesetzt ist oder wenn der Wert des Parameters ``identity_uri``unter ``[keystone_authtoken]``Abschnitt in ``barbican.conf`` wird auf Identity API Endpunkt gesetzt, beginnend mit ``https: //``und Wert des Parameters``insecure`` unter demselben ``[keystone_authtoken ] `` Abschnitt in derselben ``barbican.conf`` ist auf ``False`` gesetzt.
id: **Pass:** Jika nilai parameter ``auth_protocol`` di bawah bagian ``[keystone_authtoken] `` di ``barbican.conf`` diatur ke ``https``, atau jika nilai parameter ``identity_uri`` di bawah ``[keystone_authtoken ]`` di ``barbican.conf`` disetel ke Identity API endpoint yang dimulai dengan ``https: // `` dan nilai parameter ``insecure`` di bawah bagian ``[keystone_authtoken]`` yang sama dalam ``barbican.conf`` yang sama diatur ke ``False``.

source: **Pass:** If value of parameter ``auth_protocol`` under ``[keystone_authtoken]`` section in ``manila.conf`` is set to ``https``, or if value of parameter ``identity_uri`` under ``[keystone_authtoken]`` section in ``manila.conf`` is set to Identity API endpoint starting with ``https://`` and value of parameter ``insecure`` under the same ``[keystone_authtoken]`` section in the same ``manila.conf`` is set to ``False``.
de: **Pass:** Wenn der Wert des Parameters ``auth_protocol``unter `` [keystone_authtoken]`` Abschnitt in ``manila.conf`` auf ``https`` gesetzt ist oder wenn Wert des Parameters ``identity_uri`` unter ` `[keystone_authtoken]``Abschnitt in ``manila.conf`` auf Identity API Endpunkt mit ``https://`` und Wert des Parameters ``insecure`` unter dem gleichen ``[keystone_authtoken]``Abschnitt in der gleichen `` manila.conf`` auf ``False`` gesetzt ist.
id: **Pass:** Jika nilai parameter ``auth_protocol`` dibawah bagian ``[keystone_authtoken]`` dalam ``manila.conf`` diatur ke ``https``, atau jika nilai parameter ``identity_uri`` dibawah bagian ``[keystone_authtoken]`` dalam ``manila.conf`` diatur ke Identity API endpoint yang dimulai dengan ``https://`` dan nilai parameter ``insecure`` dibawah bagian ``[keystone_authtoken]`` yang sama dalam ``manila.conf`` yang sama diatur ke ``False``.
tr_tr: **Başarılı:** ``manila.conf`` dosyasında ``[keystone_authtoken]`` bölümündeki ``auth_protocol`` parametresinin değeri ``https`` ise ya da ``manila.conf`` dosyasında ``[keystone_authtoken]`` bölümündeki ``identity_uri`` paramtresinin değeri ``https://`` ile başlayan bir Kimlik API'ye ayarlı ise ya da ``manila.conf`` dosyasında ``[keystone_authtoken]`` bölümündeki ``insecure`` parametresinin değeri ``False`` ise.

source: **Pass:** If value of parameter ``auth_strategy`` under ``[DEFAULT]`` section in ``/etc/cinder/cinder.conf`` is set to ``keystone``.
de: **Pass:** Wenn der Wert des Parameters ``auth_strategy`` in der ``[DEFAULT]`` Sektion in ``/etc/cinder/cinder.conf`` auf ``keystone`` gesetzt ist.
id: **Pass:** Jika nilai parameter ``auth_strategy`` di bawah bagian ``[DEFAULT]`` di ``/etc/cinder/cinder.conf`` diatur ke ``keystone``.
tr_tr: **Geç:** Eğer ``/etc/cinder/cinder.conf`` altında ``[DEFAULT]`` bölümünde ``auth_strategy`` değeri ``keystone`` ise.

source: **Pass:** If value of parameter ``auth_strategy`` under ``[DEFAULT]`` section in ``/etc/glance/glance-api.conf`` is set to ``keystone`` and value of parameter ``auth_strategy`` under ``[DEFAULT]`` section in ``/etc/glance /glance-registry.conf`` is set to ``keystone``.
de: **Pass:** Wenn der Wert des Parameters ``auth_strategy``unter `` [DEFAULT] ``Abschnitt in ``/etc/glance/glance-api.conf``auf `` keystone`` und Wert von Parameter ``auth_strategy``unter ``[DEFAULT]`` Abschnitt in ``/etc/glance/glance-registry.conf``ist auf ``keystone``gesetzt.
id: **Pass:** Jika nilai parameter ``auth_strategy`` dibawah bagian ``[DEFAULT]`` di ``/etc/glance/glance-api.conf`` diatur ke ``keystone`` dan nilai parameter ``auth_strategy`` dibawah bagian ``[DEFAULT]`` di ``/etc/glance /glance-registry.conf`` diatur ke ``keystone``.
tr_tr: **Başarılı:** Eğer ``/etc/glance/glance-api.conf`` dosyasındaki ``[DEFAULT]`` sekmesindeki ``auth_strategy`` parametresinin değeri ``keystone`` ise ve ``/etc/glance /glance-registry.conf`` dosyasındaki ``[DEFAULT]`` sekmesindeki ``auth_strategy`` parametresinin değeri ``keystone`` ise.

source: **Pass:** If value of parameter ``auth_strategy`` under ``[DEFAULT]`` section in ``/etc/neutron/neutron.conf`` is set to ``keystone``.
de: **Pass:** Wenn der Wert des Parameters ``auth_strategy``unter `` [DEFAULT] ``Abschnitt in ``/etc/neutron/neutron.conf``auf `` keystone` gesetzt ist.
id: **Pass:** Jika nilai parameter ``auth_strategy`` di bawah bagian ``[DEFAULT]`` di ``/etc/neutron/neutron.conf`` diatur ke ``keystone``.
tr_tr: **Başarılı:** ``/etc/neutron/neutron.conf`` dosyasında ``[DEFAULT]`` bölümündeki ``auth_strategy`` parametresinin değeri ``keystone`` ise.

source: **Pass:** If value of parameter ``auth_strategy`` under ``[DEFAULT]`` section in ``/etc/nova/nova.conf`` is set to ``keystone``.
de: **Pass:** Wenn der Wert des Parameters ``auth_strategy``unter `` [DEFAULT] ``Abschnitt in ``/etc/nova/nova.conf``auf ``keystone` gesetzt ist.
id: **Pass:** Jika nilai parameter ``auth_strategy`` di bawah bagian ``[DEFAULT] `` di ``/etc/nova/nova.conf`` diatur ke `keystone``.
tr_tr: **Başarılı:** Eğer ``/etc/nova/nova.conf`` dosyasındaki ``[DEFAULT]`` bölümündeki ``auth_strategy`` değeri ``keystone`` ise.

source: **Pass:** If value of parameter ``auth_strategy`` under ``[DEFAULT]`` section in ``manila.conf`` is set to ``keystone``.
de: **Pass:** Wenn der Wert des Parameters ``auth_strategy``unter `` [DEFAULT]`` Abschnitt in ``manila.conf`` auf ``keystone` gesetzt ist.
id: **Pass:** Jika nilai parameter ``auth_strategy`` di bawah bagian ``[DEFAULT]`` dalam ``manila.conf`` diatur ke ``keystone``.
tr_tr: **Başarılı:** ``manila.conf`` dosyasında ``[DEFAULT]`` bölümündeki ``auth_strategy`` parametresinin değeri ``keystone`` ise.

source: **Pass:** If value of parameter ``auth_uri`` under ``[keystone_authtoken]`` section in ``/etc/cinder/cinder.conf`` is set to Identity API endpoint starting with ``https://`` and value of parameter ``insecure`` under the same ``[keystone_authtoken]`` section in the same ``/etc/cinder/cinder.conf`` is set to ``False``.
de: **Pass:** Wenn der Wert des Parameter ``auth_uri`` im ``[keystone_authtoken]`` Abschnitt in ``/etc/cinder/cinder.conf`` gesetzt ist zum Identity API Endpunkt startend mit ``https://`` und der Wert des Parameter ``insecure`` im selben ``[keystone_authtoken]`` Abschnitt in der selben ``/etc/cinder/cinder.conf`` auf ``False`` gesetzt ist.

source: **Pass:** If value of parameter ``auth_uri`` under ``[keystone_authtoken]`` section in ``/etc/glance/glance-api.conf`` is set to the Identity API endpoint starting with ``https://``, and the value of the parameter ``insecure`` is under the same ``[keystone_authtoken]`` section in the same ``/etc/glance/glance-registry.conf`` is set to ``False``.
de: **Pass:** Wenn der Wert des Parameters ``auth_uri`` unter `` [keystone_authtoken]`` Abschnitt in ``/etc/glance/glance-api.conf`` auf den Identity API Endpunkt beginnend mit ``https://`` gesetzt ist und der Wert des Parameters ``insecure`` unter demselben `` [keystone_authtoken]`` Abschnitt in der gleichen ``/etc/glance/ glance-registry.conf`` ist auf ``False`` gesetzt.

source: **Pass:** If value of parameter ``auth_uri`` under ``[keystone_authtoken]`` section in ``/etc/neutron/neutron.conf`` is set to Identity API endpoint starting with ``https://`` and value of parameter ``insecure`` under the same ``[keystone_authtoken]`` section in the same ``/etc/neutron/neutron.conf`` is set to ``False``.
de: **Pass:** Wenn der Wert des Parameters ``auth_uri``unter `` [keystone_authtoken]``Abschnitt in ``/etc/neutron/neutron.conf``auf Identity API Endpoint beginnend mit ``https:// ``und der Wert des Parameters ``insecure``unter demselben ``[keystone_authtoken] ``Abschnitt in der gleichen ``/etc/neutron/neutron.conf`` auf ``False``gesetzt ist.

source: **Pass:** If value of parameter ``auth_uri`` under ``[keystone_authtoken]`` section in ``/etc/nova/nova.conf`` is set to Identity API endpoint starting with ``https://`` and value of parameter ``insecure`` under the same ``[keystone_authtoken]`` section in the same ``/etc/nova/nova.conf`` is set to ``False``.
de: **Pass:** Wenn der Wert des Parameters ``auth_uri``unter dem `` [keystone_authtoken]`` Abschnitt in ``/etc/nova/nova.conf``auf Identity API Endpunkt auf ``https://`` und Wert des Parameters `` insecure``unter demselben ``[keystone_authtoken] ``Abschnitt in der gleichen ``/etc/nova/nova.conf`` auf ``False``gesetzt ist.

source: **Pass:** If value of parameter ``cinder_api_insecure`` under ``[DEFAULT]`` section in ``manila.conf`` is set to ``False``.
de: **Pass:** Wenn der Wert des Parameters ``cinder_api_insecure`` unter `` [DEFAULT]``Abschnitt in ``manila.conf`` auf ``False`` gesetzt ist.
id: **Pass:** Jika nilai parameter ``cinder_api_insecure`` di bawah bagian ``[DEFAULT] `` di ``manila.conf`` diatur ke ``False``.
tr_tr: **Başarılı:** ``manila.conf`` dosyasında ``[DEFAULT]`` bölümündeki ``cinder_api_insecure`` parametresinin değeri ``False`` ise.

source: **Pass:** If value of parameter ``glance_api_insecure`` under ``[DEFAULT]`` section in ``/etc/cinder/cinder.conf`` is set to ``False`` and value of parameter ``glance_api_servers`` is set to a value starting with ``https://``.
de: **Pass:** Wenn der Wert des Parameter ``glance_api_insecure`` im ``[DEFAULT]`` Abschnitt in der ``/etc/cinder/cinder.conf`` auf ``False`` gesetzt ist und der Wert des Parameter ``glance_api_servers`` ist auf einen Wert startend mit ``https://`` gesetzt.
id: **Pass:** Jika nilai parameter ``glance_api_insecure`` di bawah bagian ``[DEFAULT]`` di ``/etc/cinder/cinder.conf`` disetel ke ``False`` dan nilai parameter ``glance_api_servers`` disetel ke nilai yang diawali dengan ``https:// ``.
tr_tr: **Başarılı:** Eğer``/etc/cinder/cinder.conf`` altında ``[DEFAULT]`` bölümünde ``glance_api_insecure`` değeri ``False`` ise ya da ``glance_api_servers`` değeri ``https://`` ile başlamıyorsa.

source: **Pass:** If value of parameter ``hash_algorithm`` under ``[token]`` section in ``/etc/keystone/keystone.conf`` is set to SHA256.
de: **Pass:** Wenn der Wert des Parameters ``hash_algorithm``unter `` [token]``Abschnitt in ``/etc/keystone/keystone.conf``auf SHA256 gesetzt ist.
id: **Pass:** Jika nilai parameter ``hash_algorithm`` di bawah bagian ``[token] `` di ``/etc/keystone/keystone.conf`` diatur ke SHA256.
tr_tr: **Başarılı:** ``/etc/keystone/keystone.conf`` dosyasındaki ``[token]`` bölümündeki ``hash_algorithm`` parametresinin değeri SHA256 ise.

source: **Pass:** If value of parameter ``max_request_body_size`` in ``/etc/keystone/keystone.conf`` is set to default (114688) or some reasonable value based on your environment.
de: **Pass:** Wenn der Wert des Parameters ``max_request_body_size``in ``/ etc/keystone/keystone.conf``auf Standard (114688) oder einen angemessenen Wert basierend auf Ihrer Umgebung eingestellt ist.
id: **Pass:** Jika nilai parameter ``max_request_body_size`` di ``/etc/keystone/keystone.conf`` diatur ke default (114688) atau beberapa nilai wajar berdasarkan lingkungan Anda.
tr_tr: **Başarılı:** ``/etc/keystone/keystone.conf`` dosyasındaki ``max_request_body_size`` parametresinin değeri öntanımlı (114688) ise ya da ortamınıza göre uygun bir değer ise.
