Repository: openstack/security-doc
Catalog: security-guide/source/locale/*/LC_MESSAGES/security-guide.po
Languages: de, id, tr_tr

source: Acting alone, these attackers come in many guises, such as rogue or malicious employees, disaffected customers, or small-scale industrial espionage.
de: Alleine handelnd, kommen diese Angreifer in viele Gestalten, wie Schurken oder böswillige Angestellte, unzufriedene Kunden oder kleine Industriespionage.
id: Bertindak sendiri, penyerang ini datang dalam banyak samaran, seperti karyawan nakal atau jahat, pelanggan yang tidak puas, atau spionase industri skala kecil.
tr_tr: Tek başına hareket ederek, bu saldırganlar kötü niyetli veya kötü niyetli çalışanlar, rahatsız edilmemiş müşteriler veya küçük çaplı endüstriyel casusluk gibi pek çok kılıf oluşturuyor.

source: Actions may be taken to mitigate potential malicious activity such as blacklisting an IP address, recommending the strengthening of user passwords, or de-activating a user account if it is deemed dormant.
de: Es können Maßnahmen ergriffen werden, um potenzielle böswillige Aktivitäten wie etwa die Blacklisting einer IP-Adresse zu mildern, die Stärkung von Benutzerpasswörtern zu empfehlen oder ein Benutzerkonto zu deaktivieren, wenn es als ruhenden gilt.
id: Tindakan dapat dilakukan untuk mengurangi potensi aktivitas berbahaya seperti memasukkan alamat IP ke daftar hitam, merekomendasikan penguatan kata sandi pengguna, atau menonaktifkan akun pengguna jika dianggap tidak aktif.
tr_tr: Bir IP adresinin kara listeye alınması, kullanıcı parolalarının güçlendirilmesi tavsiyesinde bulunulması veya bir kullanıcı hesabının hazır olarak kabul edilmesi durumunda bir kullanıcı hesabının devre dışı bırakılması gibi potansiyel kötü amaçlı etkinlikleri hafifletmek için önlemler alınabilir.

source: Active developer and user communities
de: Aktive Entwickler- und User-Communities
id: Pengembang aktif dan komunitas pengguna
tr_tr: Etkin geliştirici ve kullanıcı kitlesi

source: Adam facilitated this Book Sprint. He also founded the Book Sprint methodology and is the most experienced Book Sprint facilitator around. Adam founded FLOSS Manuals—a community of some 3,000 individuals developing Free Manuals about Free Software. He is also the founder and project manager for Booktype, an open source project for writing, editing, and publishing books online and in print.
de: Adam erleichterte diesen Buchsprint. Er gründete auch die Book Sprint Methodik und ist der erfahrenste Book Sprint Moderator. Adam gründete FLOSS Manuals - eine Gemeinschaft von etwa 3.000 Personen, die kostenlose Handbücher über freie Software entwickeln. Er ist auch Gründer und Projektleiter für Booktype, ein Open-Source-Projekt zum Schreiben, Redigieren und Veröffentlichen von Büchern online und im Druck.
id: Adam memfasilitasi Book Sprint Ini. Dia juga mendirikan metodologi Book Sprint dan merupakan fasilitator Book Sprint yang paling berpengalaman. Adam mendirikan FLOSS Manuals - sebuah komunitas yang terdiri dari sekitar 3.000 individu yang mengembangkan Free Manuals tentang Free Software. Dia juga pendiri dan manajer proyek untuk Booktype, sebuah proyek open source untuk menulis, mengedit, dan menerbitkan buku secara online dan dicetak.
tr_tr: Adam bu Kitap Sprintini kolaylaştırdı. Ayrıca, Kitap Sprinti metodolojisini kurdu ve etrafında en deneyimli Kitap Sprinti kolaylaştırıcısıdır. Adam, FLOSS Kılavuzlarını kurdu; 3.000 kişiden oluşan bir topluluk, Özgür Yazılım hakkında Özgür Kılavuzlar geliştiriyor. Ayrıca, kitapları internet üzerinden, basılı olarak yazma, düzenleme ve yayınlama için açık kaynak kodlu bir proje olan Booktype'nin kurucusu ve proje yöneticisi.

source: Add Identity Providers, Mappings and Protocols.
de: Hinzufügen von Identitätsanbietern, Mappings und Protokollen.
tr_tr: Kimlik Sağlayıcıları, Eşlemeleri ve Protokolleri Ekleyin.

source: Add ``WSGIScriptAlias`` directive to your vhost configuration:
de: Fügen Sie ``WSGIScriptAlias``Richtlinie zu Ihrer Vhost Konfiguration hinzu:
tr_tr: vhost yapılandırmanıza ``WSGIScriptAlias`` yönergesini ekleyin:

source: Add the Federation extension driver to the ``[federation]`` section in the ``keystone.conf`` file. For example:
de: Fügen Sie den Föderationserweiterungs-Treiber in den ``[federation] `` Abschnitt in der ``keystone.conf``Datei hinzu. Beispielsweise:
tr_tr: ``keystone.conf`` dosyasındaki ``[federation]`` bölümününe Federasyon uzantı sürücünü ekleyin. Örneğin:

source: Add the ``federation_extension`` middleware to the ``api_v3`` pipeline in the ``keystone-paste.ini`` file. For example:
de: Fügen Sie die ``federation_extension``Middleware zur ``api_v3``Pipeline in der ``keystone-paste.ini``Datei hinzu. Beispielsweise:
tr_tr: ``keystone-paste.ini`` dosyasında ``federation_extension`` katman yazılımını ``api_v3`` hattına ekleyin. Örneğin:

source: Add the saml2 authentication method to the ``[auth]`` section in ``keystone.conf`` file:
de: Fügen Sie die saml2-Authentifizierungsmethode dem ``[auth] ``Abschnitt in ``keystone.conf``Datei hinzu:
tr_tr: ``keystone.conf`` dosyasındaki ``[auth]`` bölümüne saml2 kimlik doğrulama yöntemini ekleyin:

source: Add two ``<Location>`` directives to the ``wsgi-keystone.conf`` file:
de: Fügen Sie zwei ``<Location>``Richtlinien in der ``wsgi-keystone.conf`` Datei hinzu:
tr_tr: ``wsgi-keystone.conf`` dosyasına iki ``<Location>`` yönergesi ekleyin:

source: Adding it in a different location requires you set up your SELinux policy accordingly.
de: Wenn Sie es an einem anderen Ort hinzufügen, müssen Sie Ihre SELinux-Richtlinien entsprechend anpassen.
tr_tr: Farklı bir konuma eklemek, SELinux politikasını buna göre ayarlamanızı gerektirir.

source: Additional security features
de: Zusätzliche Sicherheitsmerkmale
id: Fitur keamanan tambahan
tr_tr: Ek güvenlik özellikleri

source: Additionally, it is possible for tenants of a bare metal system to modify system firmware. TPM technology, described in ?, provides a solution for detecting unauthorized firmware changes.
de: Darüber hinaus ist es möglich, dass Tenant eines Bare-Metal-Systems die System-Firmware ändern können. TPM-Technologie, beschrieben in ? Bietet eine Lösung für die Erkennung nicht autorisierter Firmware-Änderungen.

source: Additionally, the following security-related criteria are highly encouraged to be evaluated when selecting a hypervisor for OpenStack deployments: * Has the hypervisor undergone Common Criteria certification? If so, to what levels? * Is the underlying cryptography certified by a third-party?
de: Darüber hinaus sind die folgenden sicherheitsrelevanten Kriterien sehr ermutigt, bei der Auswahl eines Hypervisor für OpenStack-Implementierungen ausgewertet zu werden: * Hat der Hypervisor eine Common Criteria Zertifizierung unterzogen? Wenn ja, zu welchen Ebenen? * Ist die zugrunde liegende Kryptographie von einem Dritten zertifiziert?
id: Selain itu, kriteria terkait keamanan berikut sangat dianjurkan untuk dievaluasi saat memilih hypervisor untuk penerapan OpenStack: * Has the hypervisor undergone Common Criteria certification? If so, to what levels? * Apakah kriptografi yang mendasari disertifikasi oleh pihak ketiga?
tr_tr: Ayrıca, aşağıdaki güvenlikle ilgili ölçütlerin, OpenStack dağıtımları için bir hypervisor seçerken değerlendirilmesi cesaretlendirilir: * Hypervisor, Yaygın Kıstas sertifikasına girdi mi? Eğer öyleyse, hangi seviyelere kadar? * Altta yatan kriptografi bir üçüncü şahıs tarafından onaylandı mı?

source: Additionally, when combined with a version control system such as Git or SVN, you can track changes to your environment over time and re-mediate unauthorized changes that may occur. For example, a ``nova.conf`` file or other configuration file falls out of compliance with your standard, your configuration management tool can revert or replace the file and bring your configuration back into a known state. Finally a configuration management tool can also be used to deploy updates; simplifying the security patch process. These tools have a broad range of capabilities that are useful in this space. The key point for securing your cloud is to choose a tool for configuration management and use it.
de: Darüber hinaus können Sie, wenn sie mit einem Versionskontrollsystem wie Git oder SVN kombiniert werden, im Laufe der Zeit Änderungen an Ihrer Umgebung verfolgen und unerlaubte Änderungen, die auftreten können, erneut vermitteln. Zum Beispiel, eine ``nova.conf``Datei oder andere Konfigurationsdatei fällt aus der Einhaltung Ihres Standards, Ihr Konfigurations-Management-Tool kann die Datei wiederherstellen oder ersetzen und bringt Ihre Konfiguration wieder in einen bekannten Zustand. Schließlich kann ein Konfigurationsmanagement-Tool auch zur Bereitstellung von Updates verwendet werden. Vereinfachung des Sicherheitspatch-Prozesses. Diese Werkzeuge haben eine breite Palette von Fähigkeiten, die in diesem Raum nützlich sind. Der entscheidende Punkt für die Sicherung Ihrer Cloud ist, ein Werkzeug für das Konfigurationsmanagement zu wählen und es zu benutzen.
id: Selain itu, bila digabungkan dengan sistem kontrol versi seperti Git atau SVN, Anda dapat melacak perubahan pada lingkungan Anda dari waktu ke waktu dan memediasi kembali perubahan yang tidak sah yang mungkin terjadi. Misalnya, file ``nova.conf`` atau file konfigurasi lainnya tidak sesuai dengan standar Anda, alat manajemen konfigurasi Anda dapat mengembalikan atau mengganti file dan membawa konfigurasi Anda kembali ke keadaan yang sudah diketahui. Akhirnya alat manajemen konfigurasi juga bisa digunakan untuk menyebarkan update; menyederhanakan proses patch keamanan. Alat ini memiliki berbagai kemampuan yang berguna di ruang ini. Titik kunci untuk mengamankan awan Anda adalah memilih alat untuk pengelolaan konfigurasi dan menggunakannya.
tr_tr: Buna ek olarak, Git veya SVN gibi bir sürüm kontrol sistemi ile birleştirildiğinde, zaman içinde ortamınızdaki değişiklikleri izleyebilir ve gerçekleşebilecek yetkisiz değişiklikleri bulabilirsiniz. Örneğin, ``nova.conf`` dosyası veya diğer yapılandırma dosyası standartlarınızla uyuşmazsa, yapılandırma yönetim aracınız dosyayı geri döndürebilir veya değiştirebilir ve yapılandırmanızı bilinen bir duruma getirebilirsiniz. Sonunda bir yapılandırma yönetimi aracı da güncellemeleri dağıtmak için kullanılabilir; güvenlik düzeltme eki işlemini basitleştirir. Bu araçların bu alanda kullanışlı geniş bir yetenek yelpazesi var. Bulutunuzu güvence altına almanın kilit noktası, yapılandırma yönetimi için bir araç seçmek ve kullanmaktır.

source: Adds a set of rules to map Federation protocol attributes to Identity API objects. An Identity Provider has exactly one mapping specified per protocol.
de: Fügt einen Satz von Regeln hinzu, um Föderationsprotokollattribute zu Identity API-Objekten zuzuordnen. Ein Identity Provider hat genau eine Mapping pro Protokoll angegeben.
tr_tr: Federasyon protokol özniteliklerini Kimlik API nesnelerine eşlemek için bir dizi kural ekler. Bir Kimlik Sağlayıcı, protokol başına tam olarak bir eşleştirme bulundurur.

source: Administrative users
de: Administrative Benutzer
id: Pengguna administratif
tr_tr: Yönetici kullanıcılar

source: Administrators can enable instance signature verification by setting the ``verify_glance_signatures`` flag to ``True`` in the ``/etc/nova/nova.conf`` file. When enabled, the Compute service automatically validates the signed instance when it is retrieved from the Image service. If this verification fails, the boot won't occur. The OpenStack Operations Guide provides guidance on how to create and upload a signed image, and how to use this feature. For more information, see `Adding Signed Images <https://docs.openstack.org/ops-guide/ops-user-facing-operations.html#adding-signed-images>`_ in the Operations Guide.
de: Administratoren können die Instanzsignaturprüfung aktivieren, indem sie in der ``/etc/nova/nova.conf``-Datei das `` verify_glance_signatures``-Flag auf ``True`` setzen. Wenn diese Option aktiviert ist, überprüft der Compute-Dienst automatisch die signierte Instanz, wenn sie aus dem Image-Dienst abgerufen wird. Wenn diese Überprüfung fehlschlägt, tritt der Boot nicht auf. Das OpenStack Operations Guide enthält Anleitungen zum Erstellen und Hochladen eines signierten Abbildes und zur Verwendung dieser Funktion. Weitere Informationen finden Sie unter `Hinzufügen von Signierten Abbildern <https://docs.openstack.org/ops-guide/ops-user-facing-operations.html#adding-signed-images>`_ in der Betriebsanleitung.

source: Administrators care about security services: they configure the server side of such security services.
de: Administratoren sorgen für Sicherheitsdienste: Sie konfigurieren die Serverseite solcher Sicherheitsdienste.
id: Administrator peduli dengan layanan keamanan: mereka mengkonfigurasi sisi server dari layanan keamanan semacam itu.
tr_tr: Yöneticiler güvenlik servislerini önemser: bu güvenlik servislerinin sunucu tarafını yapılandırırlar.

source: Administrators must perform command and control over the cloud for various operational functions. It is important these command and control facilities are understood and secured.
de: Administratoren müssen Befehl und Kontrolle über die Cloud für verschiedene operative Funktionen ausführen. Es ist wichtig, dass diese Befehls- und Kontrolleinrichtungen verstanden und gesichert sind.
id: Administrator harus melakukan perintah dan kontrol atas awan untuk berbagai fungsi operasional. Penting agar fasilitas komando dan kontrol ini dipahami dan dijamin.
tr_tr: Yöneticiler çeşitli işletim işlevleri için bulut üzerinde komuta ve denetim yapmalıdır. Bu kumanda ve kontrol tesislerinin anlaşılması ve güvence altına alınması önemlidir.

source: After a share network is created, the Shared File Systems service retrieves network information determined by a network provider: network type, segmentation identifier if the network uses segmentation and IP block in CIDR notation from which to allocate the network.
de: Nachdem ein Freigabenetzwerk erstellt wurde, ruft der Shared File Systems-Dienst die von einem Netzbetreiber bestimmten Netzwerkinformationen ab: Netzwerktyp, Segmentierungskennung, wenn das Netzwerk Segmentierung und IP-Block in der CIDR-Notation verwendet, aus der das Netzwerk zugewiesen werden soll.
id: Setelah jaringan berbagi dibuat, layanan Shared File Systems mengambil informasi jaringan yang ditentukan oleh penyedia jaringan: jenis jaringan, identifikasi segmentasi jika jaringan menggunakan segmentasi dan blok IP dalam nota CIDR untuk mengalokasikan jaringan.
tr_tr: Bir paylaşım ağı oluşturulduktan sonra Paylaşımlı Dosya Sistemleri servisi, bir ağ sağlayıcısı tarafından belirlenen ağ bilgilerini alır: ağ, bölümleme kullanıyorsa, ağ türü, bölümleme tanımlayıcısı ve ağın alındığı bölümde CIDR gösteriminde IP bloğu.

source: After completing these initial certifications, the remaining certifications are more deployment specific. For example, clouds processing credit card transactions will need PCI-DSS, clouds storing health care information require HIPAA, and clouds within the federal government may require FedRAMP/FISMA, and ITAR, certifications.
de: Nach Abschluss dieser Erstzertifizierungen sind die verbleibenden Zertifizierungen mehr implementierungsspezifisch. Zum Beispiel benötigen Clouds, die Kreditkarten-Transaktionen verarbeiten, PCI-DSS, Clouds, die Gesundheitspflegeinformationen speichern, benötigen HIPAA, und Clouds innerhalb der Bundesregierung können FedRAMP/FISMA und ITAR, Zertifizierungen erfordern.
id: Setelah menyelesaikan sertifikasi awal ini, sisa sertifikasi lebih spesifik. Misalnya, pemrosesan transaksi kartu kredit cloud memerlukan PCI-DSS, cloud yang menyimpan informasi perawatan kesehatan memerlukan HIPAA, dan cloud di dalam pemerintah federal mungkin memerlukan sertifikasi FedRAMP / FISMA, dan ITAR.
tr_tr: Bu ilk sertifikaları tamamladıktan sonra kalan sertifikalar dağıtıma özgüdür. Örneğin, kredi kartı işlemlerini işleme koyan bulutların PCI-DSS'ye, bulutların sağlık bilgileri depolamak için HIPAA'ya ve federal hükümet içindeki bulutların FedRAMP / FISMA ve ITAR sertifikalarına ihtiyaç duyması gerekir.

source: After creating a share and getting its export location, users have no permissions to mount it and operate with files. The Shared File System service requires to explicitly grant access to the new share.
de: Nach dem Erstellen einer Freigabe und dem Erhalten seiner Stelle für den Export, haben die Benutzer keine Berechtigungen, um sie zu installieren und mit Dateien zu arbeiten. Der Shared File System Service erfordert explizit den Zugriff auf die neue Freigabe.
id: Setelah membuat bagian dan mendapatkan lokasi ekspornya, pengguna tidak memiliki izin untuk memasangnya dan mengoperasikannya dengan file. Layanan Shared File System mengharuskan untuk secara eksplisit memberikan akses ke bagian baru.
tr_tr: Bir paylaşım oluşturduktan ve dışa aktarma konumunu elde ettikten sonra, kullanıcıların onu takma ve dosyalarla çalışmaya yetkisi yoktur. Paylaşımlı Dosya Sistemi servisi, açık bir şekilde yeni paylaşıma erişim izni vermeyi gerektirir.

source: After the rule has status ``active`` we can connect to the ``10.254.0.3`` host again and check the ``/etc/exports`` file and see that the line with rule was added:
de: Nachdem die Regel den Status ``active``hat, können wir uns wieder mit dem ``10.254.0.3``Host verbinden und die ``/etc/exports``Datei überprüfen und sehen, dass die Zeile mit Regel hinzugefügt wurde:
id: Setelah aturan memiliki status ``active`` kita dapat terhubung ke host ``10.254.0.3`` lagi dan memeriksa file ``/etc/exports`` dan melihat bahwa baris dengan aturan telah ditambahkan:
tr_tr: Kuralın durumu ``active`` olduktan sonra tekrar ``10.254.0.3`` makinesine bağlanıp ``/etc/exports`` dosyasını kontrol edebilir ve kurallı satırı eklediğimizi görürüz:

source: After you are notified of a security update, the next step is to determine how critical this update is to a given cloud deployment. In this case, it is useful to have a pre-defined policy. Existing vulnerability rating systems such as the common vulnerability scoring system (CVSS) v2 do not properly account for cloud deployments.
de: Nachdem Sie über ein Sicherheitsupdate informiert sind, ist der nächste Schritt, um festzustellen, wie kritisch dieses Update auf eine gegebene Cloud-Bereitstellung ist. In diesem Fall ist es sinnvoll, eine vordefinierte Richtlinie zu haben. Bestehende Schwachstellen-Rating-Systeme wie das Common Vulnerability Scoring System (CVSS) v2 berücksichtigen keine Cloud-Implementierungen.

source: Algorithm
de: Algorithmus
id: Algoritma
tr_tr: Algoritma

source: Aligning the information system with in-scope standards and regulations involves internal tasks which must be conducted before a formal assessment. Auditors may be involved at this state to conduct gap analysis, provide guidance, and increase the likelihood of successful certification.
de: Das Ausrichten des Informationssystems mit den in-scope Standards und Vorschriften beinhaltet interne Aufgaben, die vor einer formalen Bewertung durchgeführt werden müssen. Auditoren können in diesem Staat beteiligt sein, um Lückenanalyse durchzuführen, Anleitung zu geben und die Wahrscheinlichkeit einer erfolgreichen Zertifizierung zu erhöhen.
id: Menyelaraskan sistem informasi dengan standar dan peraturan di dalam lingkup melibatkan tugas internal yang harus dilakukan sebelum penilaian formal. Auditor mungkin dilibatkan dalam keadaan ini untuk melakukan analisis gap, memberikan panduan, dan meningkatkan kemungkinan sertifikasi yang berhasil.
tr_tr: Bilgi sistemini kapsam ve standartlarla uyumlu hale getirmek, resmi bir değerlendirmeden önce yapılması gereken dahili görevleri içerir. Denetçiler, boşluk analizi yapmak, rehberlik sağlamak ve başarılı belgelendirme olasılığını artırmak için bu durumda yer alabilirler.

source: All SSH daemons have private host keys and, upon connection, offer a host key fingerprint. This host key fingerprint is the hash of an unsigned public key. It is important these host key fingerprints are known in advance of making SSH connections to those hosts. Verification of host key fingerprints is instrumental in detecting man-in-the-middle attacks.
de: Alle SSH-Dämonen haben private Host-Key und bieten bei der Verbindung einen Host-Key-Fingerabdruck. Dieser Host-Key-Fingerabdruck ist der Hash eines nicht signierten öffentlichen Schlüssels. Es ist wichtig, dass diese Host-Key-Fingerabdrücke im Voraus bekannt sind, um SSH-Verbindungen zu diesen Hosts zu machen. Die Überprüfung der Host-Key-Fingerabdrücke ist maßgeblich bei der Erkennung von Man-in-the-Middle-Attacken.
id: Semua daemon SSH memiliki private host key dan, setelah koneksi, tawarkan host key fingerprint. Host key fingerprint. ini adalah hash dari public key yang tidak ditandai. Pentingnya host key fingerprint ini diketahui sebelum membuat koneksi SSH ke host tersebut. Verifikasi host key fingerprint sangat berperan dalam mendeteksi serangan man-in-the-middle.
tr_tr: Tüm SSH servislerinin özel sunucu anahtarları vardır ve bağlantı sırasında bir ana anahtarın parmak izi sunar. Bu ana anahtar parmak izi, imzasız bir genel anahtarın özeti gibidir. Bu ana anahtar parmak izlerinin, bu sunuculara SSH bağlantıları yapmadan önce bilinmesi önemlidir. Ana anahtar parmak izlerinin doğrulanması, ortada adam saldırılarının tespitinde etkili olur.

source: All bugs, OSSAs and OSSNs are publicly disseminated through the openstack-dev mailing list with the [security] topic in the subject line. We recommend subscribing to this list as well as mail filtering rules that ensure OSSNs, OSSAs, and other important advisories are not missed. The openstack-dev mailinglist is managed through `http://lists.openstack.org/cgi-bin/mailman/listinfo/openstack-dev <http://lists.openstack.org/cgi-bin/mailman/listinfo/openstack-dev>`_. The openstack-dev list has a high traffic rate, and filtering is discussed in the thread `http://lists.openstack.org/pipermail/openstack-dev/2013-November/019233.html <http://lists.openstack.org/pipermail/openstack-dev/2013-November/019233.html>`_.
de: Alle Bugs, OSSAs und OSSNs werden öffentlich über die openstack-dev Mailingliste mit dem Thema [security] in der Betreffzeile verbreitet. Wir empfehlen Ihnen, diese Liste sowie Mail-Filter-Regeln zu verwenden, damit Sie die OSSNs, OSSAs und andere wichtige Hinweise nicht verpassen. Die openstack-dev Mailingliste wird über `http://lists.openstack.org/cgi-bin/mailman/listinfo/openstack-dev verwaltet <http://lists.openstack.org/cgi-bin/mailman/listinfo/openstack-dev>`_. Die openstack-dev-Liste hat eine hohe Verkehrsrate, und die Filterung wird im Thread "http://lists.openstack.org/pipermail/openstack-dev/2013-November/019233.html" diskutiert <http://lists.openstack.org/pipermail/openstack-dev/2013-November/019233.html>`_.
