Repository: openstack/security-doc
Catalog: security-guide/source/locale/*/LC_MESSAGES/security-guide.po
Languages: de, id, tr_tr

source: Once the node is running, we need to ensure that it remains in a good state over time. Broadly speaking, this includes both configuration management and security monitoring. The goals for each of these areas are different. By checking both, we achieve higher assurance that the system is operating as desired. We discuss configuration management in the management section, and security monitoring below.
de: Sobald der Knoten läuft, müssen wir sicherstellen, dass es in einem guten Zustand im Laufe der Zeit bleibt. Im Großen und Ganzen beinhaltet dies sowohl das Konfigurationsmanagement als auch die Sicherheitsüberwachung. Die Ziele für jeden dieser Bereiche sind unterschiedlich. Durch die Kontrolle von beiden erreichen wir eine höhere Sicherheit, dass das System wie gewünscht arbeitet. Wir besprechen das Konfigurationsmanagement im Managementbereich und die Sicherheitsüberwachung unten.
id: Setelah node berjalan, kita perlu memastikan bahwa itu tetap dalam keadaan baik dari waktu ke waktu. Secara umum, ini mencakup pengelolaan konfigurasi dan pemantauan keamanan. Tujuan masing-masing daerah berbeda. Dengan memeriksa keduanya, kami mencapai kepastian yang lebih tinggi bahwa sistem beroperasi sesuai keinginan. Kami membahas manajemen konfigurasi di bagian manajemen, dan pemantauan keamanan di bawah ini.
tr_tr: Düğüm çalışmaya başladıktan sonra, zamanla iyi durumda kalmasını sağlamalıyız. Genel olarak, bu hem yapılandırma yönetimi hem de güvenlik izleme içerir. Bu alanların her birinin hedefleri farklıdır. Her ikisini de kontrol ederek, sistemin istenen şekilde çalıştığını daha yüksek güvence altına alıyoruz. Yapılandırma yönetimini yönetim bölümünde ve güvenlik izlemeyi aşağıda tartışırız.

source: Once the updates are fully tested, they can be deployed to the production environment. This deployment should be fully automated using the configuration management tools described below.
de: Sobald die Updates vollständig getestet sind, können sie in der Produktionsumgebung eingesetzt werden. Diese Bereitstellung sollte mit den unten beschriebenen Konfigurationsmanagement-Tools vollständig automatisiert werden.
id: Setelah pembaruan diuji sepenuhnya, mereka dapat dikirim ke lingkungan produksi. Penyebaran ini harus sepenuhnya otomatis menggunakan alat manajemen konfigurasi yang dijelaskan di bawah ini.
tr_tr: Güncellemeler tamamen test edildikten sonra, canlı ortama uygulanabilir. Bu işlem, aşağıda açıklanan yapılandırma yönetimi araçlarını kullanarak tamamen otomatikleştirilmelidir.

source: Once you have your Identity service virtual host ready, configure Shibboleth and upload your metadata to the Identity Provider.
de: Sobald Sie Ihren Identity Service virtuellen Host bereit haben, konfigurieren Sie Shibboleth und laden Sie Ihre Metadaten zum Identity Provider hoch.
tr_tr: Kimlik servis sanal konağın hazır olduğunda, Shibboleth'i yapılandırın ve metaverilerinizi Kimlik Sağlayıcısı'na yükleyin.

source: One additional consideration when selecting a hypervisor is the availability of various formal certifications and attestations. While they may not be requirements for your specific organization, these certifications and attestations speak to the maturity, production readiness, and thoroughness of the testing a particular hypervisor platform has been subjected to.
de: Eine weitere Überlegung bei der Auswahl eines Hypervisor ist die Verfügbarkeit von verschiedenen formalen Zertifizierungen und Bescheinigungen. Während es sich nicht um Anforderungen an Ihre spezifische Organisation handelt, sprechen diese Zertifizierungen und Bescheinigungen über die Reife, die Produktionsbereitschaft und die Gründlichkeit der Prüfung einer bestimmten Hypervisor-Plattform.
id: Satu pertimbangan tambahan saat memilih hypervisor adalah tersedianya berbagai sertifikasi dan pengesahan formal. Meskipun persyaratan tersebut mungkin bukan persyaratan untuk organisasi khusus Anda, sertifikasi dan pengesahan ini berbicara mengenai kedewasaan, kesiapan produksi, dan ketelitian pengujian platform hypervisor tertentu telah menjadi sasaran.
tr_tr: Bir hipervizör seçerken ek bir düşünce, çeşitli resmi sertifikaların ve tasdiklerin bulunmasıdır. Organizasyonunuz için şartlar olmasa da, bu sertifikalar ve teyitler, belirli bir hipervizör platformunun testinin vade, üretim hazırlığı ve kapsamlılığıyla ilgilidir.

source: One as a public interface for consumers to reach.
de: Einer als eine öffentliche Schnittstelle für die Verbraucher zu erreichen.
id: Salah satunya sebagai antarmuka publik bagi konsumen untuk mencapainya.
tr_tr: Bir tanesi tüketicilerin ulaşabileceği bir kamusal arayüz olarak.

source: One critical policy decision for a cloud architect is what to do with the output from a security monitoring tool. There are effectively two options. The first is to alert a human to investigate and/or take corrective action. This could be done by including the security alert in a log or events feed for cloud administrators. The second option is to have the cloud take some form of remedial action automatically, in addition to logging the event. Remedial actions could include anything from re-installing a node to performing a minor service configuration. However, automated remedial action can be challenging due to the possibility of false positives.
de: Eine kritische politische Entscheidung für einen Cloud-Architekten ist, was mit der Ausgabe eines Sicherheits-Monitoring-Tools zu tun ist. Es gibt effektiv zwei Möglichkeiten. Die erste ist, um einen Menschen zu untersuchen und/oder Korrekturmaßnahmen zu warnen. Dies könnte durch Einbeziehen der Sicherheitsalarm in einem Protokoll oder Ereignis-Feed für Cloud-Administratoren erfolgen. Die zweite Option ist, dass die Cloud irgendeine Form von Abhilfemaßnahmen automatisch haben wird, zusätzlich zur Protokollierung der Veranstaltung. Abhilfemaßnahmen könnten alles von der Neuinstallation eines Knotens zur Ausführung einer kleineren Dienstkonfiguration enthalten. Automatische Abhilfemaßnahmen können jedoch aufgrund der Möglichkeit von falschen Positiven herausfordernd sein.
id: Salah satu keputusan kebijakan penting untuk arsitek awan adalah apa yang harus dilakukan dengan keluaran dari alat pemantau keamanan. Ada dua pilihan yang efektif. Yang pertama adalah mengingatkan manusia untuk menyelidiki dan / atau melakukan tindakan korektif. Ini bisa dilakukan dengan memasukkan peringatan keamanan di log atau event feed untuk administrator awan. Pilihan kedua adalah meminta agar awan mengambil beberapa bentuk tindakan perbaikan secara otomatis, selain mencatat kejadian tersebut. Tindakan perbaikan bisa mencakup apa saja dari menginstal ulang node untuk melakukan konfigurasi layanan kecil. Namun, tindakan perbaikan otomatis bisa jadi tantangan karena kemungkinan adanya positif palsu (false positive).
tr_tr: Bir bulut mimarına yönelik kritik bir ilke kararı, bir güvenlik izleme aracının çıktısıyla ne yapılacağıdır. Etkili olarak iki seçenek vardır. Birincisi, bir insanı araştırmak ve/veya düzeltici önlem almak için uyarmaktır. Bu, güvenlik alarmını bulut yöneticileri için bir günlük veya etkinlikler akışına dahil ederek yapılabilir. İkinci seçenek, bulutun olayı günlüğe eklemenin yanı sıra otomatik olarak iyileştirici bir işlem yapmasını sağlamaktır. Telafi edici eylemler, bir düğümün yeniden kurulmasından küçük servis yapılandırmasını gerçekleştirmeye kadar her şeyi içerebilir. Bununla birlikte, yanlış düzeltme olasılığı nedeniyle otomatik telafi işlemi zor olabilir.

source: One decision a cloud architect will need to make regarding Compute service configuration is whether to use :term:`VNC <Virtual Network Computing (VNC)>` or :term:`SPICE <Simple Protocol for Independent Computing Environments (SPICE)>`.
de: Eine Entscheidung, die ein Cloud-Architekt in Bezug auf Compute Service-Konfiguration machen muss, ist, ob :term:`VNC <Virtual Network Computing (VNC)>`oder :term:`SPICE <Simple Protocol for Independent Computing Environments (SPICE)>`zu verwenden ist.
id: Salah satu keputusan arsitek awan yang perlu dibuat mengenai konfigurasi layanan Compute adalah apakah akan digunakan :term:`VNC <Virtual Network Computing (VNC)>` atau :term:`SPICE <Simple Protocol for Independent Computing Environments (SPICE)>`.
tr_tr: Bir bulut mimarının İşleme hizmet yapılandırmasıyla ilgili yapması gereken bir karar, :term:`VNC <Virtual Network Computing (VNC)>` ya da :term:`SPICE <Simple Protocol for Independent Computing Environments (SPICE)>` kullanımıdır.

source: One of the biggest indicators of a hypervisor's maturity is the size and vibrancy of the community that surrounds it. As this concerns security, the quality of the community affects the availability of expertise if you need additional cloud operators. It is also a sign of how widely deployed the hypervisor is, in turn leading to the battle readiness of any reference architectures and best practices.
de: Einer der größten Indikatoren für eine Reife des Hypervisor ist die Größe und Lebendigkeit der Gemeinschaft, die sie umgibt. Da dies die Sicherheit betrifft, beeinflusst die Qualität der Community die Verfügbarkeit von Fachwissen, wenn Sie zusätzliche Cloud-Betreiber benötigen. Es ist auch ein Zeichen dafür, wie weit der Hypervisor eingesetzt wird, was wiederum zur Kampfbereitschaft von Referenzarchitekturen und Best Practices führt.
id: Salah satu indikator terbesar kematangan hypervisor adalah ukuran dan semangat komunitas yang mengelilinginya. Karena ini menyangkut keamanan, kualitas masyarakat akan mempengaruhi ketersediaan keahlian jika Anda membutuhkan operator awan tambahan. Ini juga merupakan tanda betapa luasnya penyebaran hypervisor ini, yang pada gilirannya menuju ke kesiapan perjuangan (battle readiness) setiap arsitektur referensi dan praktik terbaik.
tr_tr: Bir hipervizörün olgunluğunun en büyük göstergelerinden biri, onu çevreleyen topluluğun boyut ve canlılığıdır. Bu güvenlikle ilgiliyken topluluğun kalitesi, ek bulut operatörlerine gereksinim duyarsanız, uzmanlığın kullanılabilirliğini etkiler. Aynı zamanda, hipervizörün ne kadar yaygın olarak konuşlandırıldığının bir işaretidir, bu da referans mimarilerinin ve en iyi uygulamaların savaşa hazır hale gelmesine neden olur.

source: One of the main security concerns with any OpenStack deployment is the security and controls around sensitive files, such as the ``nova.conf`` file. Normally contained in the ``/etc`` directory, this configuration file contains many sensitive options including configuration details and service passwords. All such sensitive files should be given strict file level permissions, and monitored for changes through file integrity monitoring (FIM) tools such as iNotify or Samhain. These utilities will take a hash of the target file in a known good state, and then periodically take a new hash of the file and compare it to the known good hash. An alert can be created if it was found to have been modified unexpectedly.
de: Eines der wichtigsten Sicherheitsbedenken bei jeder OpenStack-Bereitstellung ist die Sicherheit und Kontrollen um sensible Dateien wie die `` nova.conf``Datei. Normalerweise im Verzeichnis ``/etc``gespeichert, enthält diese Konfigurationsdatei viele sensible Optionen wie Konfigurationsdetails und Service-Passwörter. Alle so sensiblen Dateien sollten strenge Berechtigungen auf Dateiebene erhalten und auf Änderungen durch FIM-Tools wie iNotify oder Samhain überwacht werden. Diese Dienstprogramme nehmen einen Hash der Zieldatei in einem bekannten guten Zustand, und nehmen dann regelmäßig einen neuen Hash der Datei und vergleichen sie mit dem bekannten guten Hash. Eine Warnung kann erstellt werden, wenn unerwartet etwas geändert wurde.
id: Salah satu masalah keamanan utama dengan penyebaran OpenStack adalah keamanan dan kontrol di sekitar file sensitif, seperti file ``nova.conf``. Biasanya terdapat di direktori ``/etc``, file konfigurasi ini berisi banyak pilihan sensitif termasuk rincian konfigurasi dan kata sandi layanan. Semua file sensitif tersebut harus diberi hak akses tingkat file yang ketat, dan memantau perubahan melalui alat file integrity monitoring (FIM) seperti iNotify atau Samhain. Utilitas ini akan mengambil hash dari file target dalam keadaan baik yang diketahui, dan kemudian secara berkala mengambil hash baru dari file tersebut dan membandingkannya dengan hash yang diketahui. Peringatan dapat dibuat jika ditemukan telah dimodifikasi secara tidak terduga.
tr_tr: Herhangi bir OpenStack dağıtımıyla ilgili en büyük güvenlik endişelerinden biri, hassas dosyaların etrafında, örneğin ``nova.conf`` dosyası gibi güvenlik ve denetimlerdir. Normalde ``/etc`` dizininde yer alan bu yapılandırma dosyası, yapılandırma ayrıntıları ve hizmet parolaları gibi birçok hassas seçeneği içerir. Bu gibi tüm hassas dosyalara katı dosya düzeyi izinleri verilmeli ve iNotify veya Samhain gibi dosya bütünlüğü izleme (FIM) araçları aracılığıyla değişiklikler izlenmelidir. Bu yardımcı programlar, bilinen bir iyi durumda hedef dosyanın karmasını alıp periyodik olarak dosyanın yeni bir karmasını alıp bilinen iyi karma ile karşılaştırır. Beklenmedik şekilde değiştirildiğinde bir uyarı oluşturulabilir.

source: One of the primary tasks of the data processing controller is to communicate with the instances it spawns. These instances are provisioned and then configured depending on the framework being used. The communication between the controller and the instances uses :term:`secure shell (SSH)` and HTTP protocols.
de: Eine der primären Aufgaben des Datenverarbeitungscontrollers ist es, mit den Instanzen zu kommunizieren, die es erzeugt. Diese Instanzen werden in Abhängigkeit von dem verwendeten Framework bereitgestellt und dann konfiguriert. Die Kommunikation zwischen dem Controller und den Instanzen verwendet :term:`secure shell (SSH)` und HTTP-Protokolle.
id: Salah satu tugas utama pengendali pengolahan data adalah berkomunikasi dengan instance yang ditimbulkannya. Instance ini tersedia dan kemudian dikonfigurasi tergantung pada kerangka yang digunakan. Komunikasi antara controller dan instance menggunakan :term:`secure shell (SSH)`dan protokol HTTP.
tr_tr: Veri işleme denetleyicisinin temel görevlerinden biri, oluşturduğu örneklerle iletişim kurmaktır. Bu örnekler hazırlanır ve daha sonra kullanılan çatıya bağlı olarak yapılandırılır. Denetleyici ve örnekler arasındaki iletişim :term: `güvenli kabuk (SSH)` ve HTTP protokollerini kullanır.

source: One of the virtues of running instances in a virtualized environment is that it opens up new opportunities for security controls that are not typically available when deploying onto bare metal. There are several technologies that can be applied to the virtualization stack that bring improved information assurance for cloud tenants.
de: Eine der Tugenden, Instanzen in einer virtualisierten Umgebung zu betreiben, ist, dass es neue Möglichkeiten für Sicherheitskontrollen eröffnet, die typischerweise nicht verfügbar sind, wenn sie auf blankem Metall eingesetzt werden. Es gibt mehrere Technologien, die auf den Virtualisierungsstapel angewendet werden können, der eine verbesserte Informationssicherung für Cloud-Tenants ermöglicht.
id: Salah satu kebajikan menjalankan instance di lingkungan virtual adalah membuka kesempatan baru untuk kontrol keamanan yang biasanya tidak tersedia saat menggunakan bare metal. Ada beberapa teknologi yang bisa diterapkan pada virtualization stack yang membawa perbaikan kepastian informasi bagi cloud tenant.
tr_tr: Örnekleri sanal ortamda çalıştırmanın faydalarından biri, olduğu gibi yerleştirirken genellikle bulunmayan güvenlik kontrolleri için yeni fırsatlar açmasıdır. Bulut kiracıları için gelişmiş bilgi güvenliği getiren sanallaştırma yığını için uygulanabilen birkaç teknoloji vardır.

source: Only the minimum level of access for users and system services is granted. This access is based upon role, responsibility and job function. This security principle of least privilege is written into several international government security policies, such as NIST 800-53 Section AC-6 within the United States.
de: Es wird nur der Mindestzugang für Benutzer und Systemdienste gewährt. Dieser Zugriff basiert auf Rolle, Verantwortung und Berufsfunktion. Dieses Sicherheitsprinzip des geringsten Privilegs ist in mehrere internationale Regierungssicherheitsrichtlinien geschrieben, wie z. B. NIST 800-53 Abschnitt AC-6 in den Vereinigten Staaten.
id: Hanya tingkat akses minimum untuk pengguna dan layanan sistem yang diberikan. Akses ini didasarkan pada peran, tanggung jawab dan fungsi pekerjaan. Prinsip keamanan yang paling tidak istimewa ini ditulis dalam beberapa kebijakan keamanan pemerintah internasional, seperti NIST 800-53 Section AC-6 di Amerika Serikat.
tr_tr: Kullanıcılar ve sistem hizmetleri için yalnızca minimum erişim seviyesi verilir. Bu erişim rol, sorumluluk ve iş işlevine dayanmaktadır. En az ayrıcalıklı güvenlik ilkesi, Amerika Birleşik Devletleri'ndeki NIST 800-53 Kısım AC-6 gibi bir dizi uluslararası hükümet güvenlik politikasında yazılıdır.

source: OpenSCAP is an open source tool which takes SCAP content (XML files that describe security controls) and applies that content to various systems. Most of the available content available today is for Red Hat Enterprise Linux and CentOS, but the tools work on any Linux or Windows system.
de: OpenSCAP ist ein Open-Source-Tool, das SCAP-Inhalte (XML-Dateien, die Sicherheitskontrollen beschreiben) und wendet diesen Inhalt auf verschiedene Systeme an. Die meisten verfügbaren Inhalte sind heute für Red Hat Enterprise Linux und CentOS verfügbar, aber die Werkzeuge arbeiten auf jedem Linux- oder Windows-System.
id: OpenSCAP adalah alat open source yang mengambil konten SCAP (file XML yang menjelaskan kontrol keamanan) dan menerapkan konten tersebut ke berbagai sistem. Sebagian besar konten yang tersedia saat ini tersedia untuk Red Hat Enterprise Linux dan CentOS, namun alat ini bekerja pada sistem Linux atau Windows manapun.
tr_tr: OpenSCAP, SCAP içeriğini (güvenlik denetimlerini açıklayan XML dosyaları) alan ve bu içeriği çeşitli sistemlere uygulayan açık kaynaklı bir araçtır. Mevcut mevcut içeriğin çoğu bugün Red Hat Enterprise Linux ve CentOS içindir, ancak araçlar herhangi bir Linux veya Windows sistemlerinde çalışmaktadır.

source: OpenStack :term:`Compute service (nova)` provides services to support the management of virtual machine instances at scale, instances that host multi-tiered applications, dev or test environments, "Big Data" crunching Hadoop clusters, or high-performance computing.
de: OpenStack :term:`Compute service (nova)` bietet Dienste zur Unterstützung der Verwaltung von virtuellen Maschineninstanzen im Wachstum, Instanzen, die mehrstufige Anwendungen, dev/Testumgebungen, "Big Data" fressende Hadoop-Cluster und/oder high performance computing.
id: OpenStack :term:`Compute service (nova)` menyediakan layanan untuk mendukung pengelolaan instance mesin virtual dalam skala, instance yang menjadi tuan rumah aplikasi multi-tier, lingkungan dev atau test, pemrosesan (crunching) "Big Data" di klaster Hadoop, atau komputasi berperforma tinggi.

source: OpenStack Admin Guide. SPICE Console. `SPICE Console <https://docs.openstack.org/admin-guide/compute-remote-console-access.html>`_.
de: OpenStack Admin Guide. SPICE Konsole. `SPICE Konsole <https://docs.openstack.org/admin-guide/compute-remote-console-access.html> `_.
tr_tr: OpenStack Yönetici Kılavuzu. SPICE Konsolu. `SPICE Konsolu <https://docs.openstack.org/admin-guide/compute-remote-console-access.html>`_.

source: OpenStack Block Storage (cinder) is a service that provides software (services and libraries) to self-service manage persistent block-level storage devices. This creates on-demand access to Block Storage resources for use with OpenStack Compute (nova) instances. This creates software-defined storage via abstraction by virtualizing pools of block storage to a variety of back-end storage devices which can be either software implementations or traditional hardware storage products. The primary functions of this is to manage the creation, attaching and detaching of the block devices. The consumer requires no knowledge of the type of back-end storage equipment or where it is located.
de: OpenStack Block Storage (Cinder) ist ein Service, der Software (Services und Bibliotheken) zum Self-Service-Management anhaltende Block-Level-Speichergeräte bereitstellt. Dies schafft On-Demand-Zugriff auf Block Storage-Ressourcen für die Verwendung mit OpenStack Compute (nova) Instanzen. Dies schafft Software-definierte Speicherung über Abstraktion durch Virtualisierung von Pools von Blockspeicher zu einer Vielzahl von Back-End-Speichergeräten, die entweder Software-Implementierungen oder herkömmliche Hardware-Speicherprodukte sein können. Die primäre Funktion hierfür besteht darin, die Erstellung, An- und Abhängen der Blockgeräte zu verwalten. Der Verbraucher braucht keine Kenntnis von der Art der Back-End-Speichergeräte oder wo es sich befindet.
id: OpenStack Block Storage (cinder) adalah layanan yang menyediakan perangkat lunak (services and libraries) untuk self-service mengelola perangkat penyimpanan block-level yang tetap. Ini menciptakan akses sesuai permintaan ke sumber Block Storage untuk digunakan dengan instance OpenStack Compute (nova). Ini menciptakan software-defined storage melalui abstraksi dengan virtualizing pool penyimpanan blok ke berbagai perangkat penyimpanan back-end yang dapat berupa implementasi perangkat lunak ataupun produk penyimpanan perangkat keras tradisional. Fungsi utama dari ini adalah mengelola creation, attaching dan detaching perangkat blok. Konsumen tidak memerlukan pengetahuan tentang jenis peralatan penyimpanan back-end atau tentang lokasinya.
tr_tr: OpenStack Blok Depolama Alanı (cinder), kalıcı blok seviyesinde depolama aygıtlarını yönetmek için kendi hizmetlerine yazılım (hizmetler ve kütüphaneler) sağlayan bir hizmettir. Bu, OpenStack Hesaplama (nova) örnekleriyle kullanmak için Blok Depolama kaynaklarına isteğe bağlı erişim sağlar. Bu, blok depolama havuzlarını yazılım uygulaması veya geleneksel donanım depolama ürünleri olabilen çeşitli arka uç depolama aygıtlarına sanallaştırarak soyutlamayla yazılım tanımlı bir depolama alanı oluşturur. Bunun temel işlevi, blok aygıtlarının oluşturulması, takılması ve çıkarılmasını yönetmektir. Tüketici, arka uç depolama ekipmanının tipi veya bulunduğu yerde hiçbir bilgiye sahip değildir.
