Repository: openstack/security-doc
Catalog: security-guide/source/locale/*/LC_MESSAGES/security-guide.po
Languages: de, id, tr_tr

source: Since share types due to their extra specifications help to filter or choose back ends before users create a share, using access to the share types you can limit clients in choice of specific back ends.
de: Da Freigabetypen aufgrund ihrer zusätzlichen Spezifikationen helfen, zu filtern oder wählen Sie Backends, bevor Benutzer eine Freigabe erstellen, mit Zugriff auf die Freigabetypen können Sie Kunden in der Wahl der spezifischen Backends begrenzen.
id: Karena jenis share menggunakan spesifikasi tambahan mereka membantu menyaring atau memilih kembali sebelum pengguna membuat share, dengan menggunakan akses ke jenis share Anda dapat membatasi klien dalam pilihan tujuan akhir tertentu.
tr_tr: Ek özelliklerlerinden ötürü paylaşım türleri, kullanıcılar bir paylaşım oluşturmadan önce filtreleme veya arka uç seçme konusunda yardımcı olduğundan, paylaşım türlerine erişimi kullanarak, istemcileri belirli arka uçların seçiminde sınırlayabilirsiniz.

source: Since the HDFS shared file system protocol uses NFS access it also can be configured to authenticate via IP address.
de: Da das HDFS-gemeinsam genutzte Dateisystemprotokoll NFS-Zugriff nutzt, kann es auch konfiguriert werden, um über IP-Adresse zu authentifizieren.
id: Karena protokol sistem file shared HDFS menggunakan akses NFS, ia juga dapat dikonfigurasi untuk melakukan otentikasi melalui alamat IP.
tr_tr: HDFS paylaşımlı dosya sistemi protokolü NFS erişimi kullandığından, IP adresi üzerinden kimlik doğrulama yapmak üzere yapılandırılabilir.

source: Siwczak, Piotr. Some Practical Considerations for Monitoring in the OpenStack Cloud. 2012. https://www.mirantis.com/blog/openstack-monitoring/
de: Siwczak, Piotr. Einige praktische Überlegungen zur Überwachung in der OpenStack Cloud. 2012. https://www.mirantis.com/blog/openstack-monitoring/

source: Solutions to the hardware infection problem are domain specific. The strategy is to identify how an instance can modify hardware state then determine how to reset any modifications when the instance is done using the hardware. For example, one option could be to re-flash the firmware after use. There is a need to balance hardware longevity with security as some firmwares will fail after a large number of writes. TPM technology, described in :ref:`management-secure-bootstrapping`, is a solution for detecting unauthorized firmware changes. Regardless of the strategy selected, it is important to understand the risks associated with this kind of hardware sharing so that they can be properly mitigated for a given deployment scenario.
de: Lösungen für das Hardware-Infektionsproblem sind domänenspezifisch. Die Strategie besteht darin, zu identifizieren, wie eine Instanz den Hardware-Status ändern kann, um zu bestimmen, wie man irgendwelche Änderungen zurücksetzt, wenn die Instanz mit der Hardware durchgeführt wird. Zum Beispiel könnte eine Option sein, um die Firmware nach Gebrauch wieder zu re-flashen. Es besteht die Notwendigkeit, die Hardware-Langlebigkeit mit der Sicherheit auszugleichen, da einige Firmware nach einer großen Anzahl von Schreibvorgängen scheitern werden. TPM-Technologie, beschrieben in :ref:`management-secure-bootstrapping`, ist eine Lösung für die Erkennung nicht autorisierter Firmware-Änderungen. Unabhängig von der gewählten Strategie ist es wichtig, die mit dieser Art von Hardware-Sharing verbundenen Risiken zu verstehen, damit sie für ein bestimmtes Bereitstellungsszenario ordnungsgemäß gemildert werden können.
id: Solusi untuk masalah infeksi perangkat keras adalah domain yang spesifik. Strateginya adalah untuk mengidentifikasi bagaimana sebuah instance dapat memodifikasi keadaan perangkat keras kemudian menentukan bagaimana mengatur ulang modifikasi apa pun bila instance dilakukan dengan menggunakan perangkat keras. Sebagai contoh, satu pilihan bisa untuk re-flash firmware setelah digunakan. Ada kebutuhan untuk menyeimbangkan umur panjang hardware dengan keamanan karena beberapa Firmwares akan gagal setelah sejumlah besar penulisan. Teknologi TPM, dijelaskan dalam :ref: `management-secure-bootstrapping`, adalah solusi untuk mendeteksi perubahan firmware yang tidak sah. Terlepas dari strategi yang dipilih, penting untuk memahami risiko yang terkait dengan pembagian perangkat keras semacam ini sehingga dapat dimitigasi dengan benar untuk skenario penerapan tertentu.
tr_tr: Donanım bozulması sorununun çözümleri, alana özgüdür. Strateji, bir örneğin donanım durumunu nasıl değiştirebileceğini belirlemek ve ardından donanım donanım kullanılarak örneği tamamladığında tüm değişiklikleri nasıl sıfırlayacağını belirlemektir. Örneğin, bir seçenek kullanıldıktan sonra üretici yazılımı yeniden başlatmak olabilir. Donanımların ömrünü güvenlikle dengelemek için bir ihtiyaç var, çünkü bazı yazılımlar çok sayıda yazdıktan sonra başarısız olacak. TPM teknolojisi, :ref: `management-secure-bootstrapping` bölümünde açıklanan, yetkisiz yazılım değişikliklerini tespit etmek için bir çözümdür. Seçilen strateji ne olursa olsun, bu tür bir donanım paylaşımıyla ilişkili riskleri anlamak, belirli bir dağıtım senaryosu için uygun şekilde hafifletilebilmesi önemlidir.

source: Some back-ends such as ZFS will support copy-on-write to prevent data exposure. In these cases, reads from unwritten blocks will always return zero. Other back ends such as LVM may not natively support this, thus the Block Storage plug-in takes the responsibility to override previously written blocks before handing them to users. It is important to review what assurances your chosen volume back-end provides and to see what mediations may be available for those assurances not provided.
de: Einige Back-Ends wie zFS unterstützen Kopie-zu-Schreiben, um Datenexposition zu verhindern. In diesen Fällen liest man aus ungeschriebenen Blöcken immer Null. Andere Backends wie LVM können dies nicht nativ unterstützen, so dass das Block Storage Plug-in die Verantwortung übernimmt, zuvor geschriebene Blöcke zu überschreiben, bevor sie an Benutzer weitergegeben werden. Es ist wichtig zu überprüfen, welche Zusicherungen Ihr ausgewähltes Volumen-Back-End bietet und um zu sehen, welche Vermittlungen für die nicht vorgesehenen Zusicherungen verfügbar sein können.
id: Beberapa back-end seperti ZFS akan mendukung copy-on-write untuk mencegah pemaparan data. Dalam kasus ini, pembacaan dari blok tidak tertulis akan selalu kembali nol. Back-end lainnya seperti LVM mungkin tidak mendukungnya secara native, sehingga plug-in Block Storage bertanggung jawab untuk mengganti blok yang sebelumnya ditulis sebelum menyerahkannya kepada pengguna. Penting untuk meninjau kembali pilihan Anda jaminan (assurance) yang tersedia untuk back-end volume dan untuk melihat mediasi apa yang mungkin tersedia untuk jaminan yang tidak diberikan.
tr_tr: ZFS gibi bazı arka uçlar, veri maruziyetini önlemek için yazma sırasında kopyalamayı destekleyecektir. Bu gibi durumlarda, yazılmamış bloklardaki okumalar daima sıfır döndürür. LVM gibi diğer arka uçlar da bunu doğal olarak desteklemeyebilir, bu nedenle Blok Depolama eklentisi, önceden yazılı blokları kullanıcılara teslim etmeden önce geçersiz kılma sorumluluğunu alır. Seçtiğiniz birimin arka uçunun sağladığı güvenceleri gözden geçirmek ve sağlanmayan teminatlar için hangi arabuluculukların kullanılabileceğini görmek önemlidir.

source: Some drivers support security services and other drivers do not support any of the security services mentioned above. For example, Generic Driver with the NFS or the CIFS shared file system protocol supports only authentication method through the IP address.
de: Einige Treiber unterstützen Sicherheitsdienste und andere Treiber unterstützen keine der oben genannten Sicherheitsdienste. Beispielsweise unterstützt der generische Treiber mit dem NFS oder dem CIFS-Dateisystemprotokoll nur die Authentifizierungsmethode über die IP-Adresse.
id: Beberapa driver mendukung layanan keamanan dan driver lainnya tidak mendukung layanan keamanan yang disebutkan di atas. Sebagai contoh, Generic Driver dengan NFS atau protokol file shared CIFS hanya mendukung metode otentikasi melalui alamat IP.
tr_tr: Bazı sürücüler güvenlik servislerini desteklemektedir ve diğer sürücüler yukarıda adı geçen güvenlik servislerini desteklemez. Örneğin, NFS veya CIFS paylaşımlı dosya sistemi protokollü Genel Sürücü, yalnızca IP adresi üzerinden kimlik doğrulama yöntemini destekler.

source: Some important definitions:
de: Einige wichtige Definitionen:
id: Beberapa definisi penting:
tr_tr: Bazı önemli tanımlamalar:

source: Some of the concerns with the use of SSL/TLS proxies as pictured above:
de: Einige der Bedenken mit der Verwendung von SSL/TLS Proxies wie oben abgebildet:
id: Beberapa kekhawatiran dengan penggunaan proxy SSL/TLS seperti yang digambarkan di atas:
tr_tr: Yukarıda gösterildiği gibi SSL/TLS vekillerini kullanmakla ilgili endişelerden bazıları:

source: Some share drivers may not support all types of segmentation, for details see specification for the driver in use.
de: Einige Share-Treiber unterstützen möglicherweise nicht alle Arten von Segmentierung, für Details siehe Spezifikation für den verwendeten Treiber.
id: Beberapa share driver mungkin tidak mendukung semua jenis segmentasi, untuk detail lihat spesifikasi driver yang sedang digunakan.
tr_tr: Bazı paylaşım sürücüleri her tür bölünmeyi desteklemeyebilir, ayrıntılar için, kullanılan sürücü için teknik belgelendirmeye bakın.

source: Specific SELinux policies are available for many OpenStack services. CentOS users can review these policies by `installing the selinux-policy source package`_. The most up to date policies appear in `Fedora's selinux-policy`_ repository. The `rawhide-contrib`_ branch has files that end in ``.te``, such as ``cinder.te``, that can be used on systems running SELinux.
de: Für viele OpenStack-Dienste stehen spezifische SELinux-Richtlinien zur Verfügung. CentOS-Benutzer können diese Richtlinien durch `Installieren des Selinux-Policy-Quellpakets` überprüfen. Die aktuellsten Richtlinien erscheinen in `Fedora's selinux-policy`_ Repository. Der `rawhide-contrib`_-Zweig hat Dateien, die in` `.te``enden, wie` `cinder.te``, die auf SELinux-Systemen verwendet werden können.
id: Kebijakan SELinux khusus tersedia untuk banyak layanan OpenStack. Pengguna CentOS dapat meninjau kebijakan ini dengan `installing the selinux-policy source package`_. Kebijakan yang paling mutakhir muncul di repositori 'selinux-policy`_ Fedora. The `rawhide-contrib`_ branch memiliki file yang diakhiri dengan ``.te``, seperti ``cinder.te``, yang dapat digunakan pada sistem yang menjalankan SELinux.
tr_tr: Birçok OpenStack servisi için belirli SELinux ilkeleri mevcuttur. CentOS kullanıcıları bu politikaları `selinux ilke kaynak paketini kurarak`_ gözden geçirebilirler. En güncel politikalar `Fedora'nın selinux-policy`_ deposunda görünür. `rawhide-contrib`_ dalında, ``.te`` ile biten, örneğin ``cinder.te`` gibi, SELinux çalıştıran sistemlerde kullanılabilen dosyalar bulunur.

source: Specific to various hypervisors is the treatment of instance memory. This behavior is not defined in OpenStack Compute, although it is generally expected of hypervisors that they will make a best effort to scrub memory either upon deletion of an instance, upon creation of an instance, or both.
de: Speziell für verschiedene Hypervisor ist die Behandlung von Instanz Speicher. Dieses Verhalten ist in OpenStack Compute nicht definiert, obwohl es in der Regel von Hypervisoren erwartet wird, dass sie eine beste Anstrengung machen, um Speicher zu löschen, entweder beim Löschen einer Instanz, bei der Erstellung einer Instanz oder beides.
id: Khusus untuk berbagai hypervisor adalah perawatan memori instance. Perilaku ini tidak didefinisikan dalam OpenStack Compute, meskipun pada umumnya diharapkan hypervisors bahwa mereka akan melakukan upaya terbaik untuk menghilangkan memori baik saat penghapusan sebuah instance, pada saat pembuatan sebuah instance, atau keduanya.
tr_tr: Çeşitli hipervizörlere özgü örnek bellek işlemdir. Bu davranış OpenStack Hesalama'da tanımlanmamıştır, ancak genellikle bir örneği silindikten sonra, bir örneğin oluşturulması üzerine ya da her ikisinde de belleği temizlemek için en iyi çaba gösterecekleri, üst hipervizörlerden beklenmekle birlikte, OpenStack Hesaplama'da tanımlanmamıştır.

source: Start instance on destination host
de: Instanz auf Zielhost starten
id: Start instance di host tujuan
tr_tr: Hedef sunucuda örneği başlatmak

source: Start the guest
de: Starten des Gasts
id: Start guest
tr_tr: Misafiri başlatmak

source: Start with a short timeout of 1 day during testing, and raise it to one year after testing has shown that you have not introduced problems for users. Note that once this header is set to a large timeout, it is (by design) very difficult to disable.
de: Beginnen Sie mit einem kurzen Timeout von 1 Tag während der Prüfung, und erhöhen Sie es auf ein Jahr nach dem Testen, wenn sich keine Probleme für Benutzer eingestellt haben. Beachten Sie, dass, sobald dieser Header auf ein großes Timeout gesetzt ist, es (durch Design) sehr schwer zu deaktivieren ist.
id: Mulailah dengan jangka waktu singkat (short timeout) 1 hari selama pengujian, dan naikkan ke satu tahun setelah pengujian telah menunjukkan bahwa Anda belum memperkenalkan masalah bagi pengguna. Perhatikan bahwa sekali header ini diatur ke batas waktu yang besar, (by design) itu menjadi sangat sulit untuk dinonaktifkan.
tr_tr: Test sırasında 1 gün kısa bir zaman aşımı ile başlayın ve testler, kullanıcılar için sorun yaşamadığınızı gösterdikten sonra bir yıla yükseltin. Bir kez bu başlık büyük bir zaman aşımı olarak ayarlandığında, (tasarım gereği) devre dışı bırakmanın çok zor olduğunu unutmayın.

source: State transition and wake events
de: Zustandsübergang und Weckereignisse
id: State transition dan wake events
tr_tr: Durum geçişi ve olayları uyandırmak

source: Static media
de: Statische Medien
id: Media statis
tr_tr: Statik medya

source: Stop the guest and sync disks
de: Stoppen der Gast- und Synchronisierungsdatenträger
id: Hentikan guest and sync disk
tr_tr: Misafiri durdurmak ve diskleri senkronize etmek

source: Storage API endpoints
de: Speicher-API-Endpunkte
tr_tr: Depolama API uç noktaları

source: Storage services
de: Speicherdienstleistungen
id: Layanan Storage
tr_tr: Depolama servisleri

source: Summary
de: Zusammenfassung
id: Ringkasan
tr_tr: Özet

source: Summary of existing technologies
de: Summe existierender Technologien
id: Ringkasan teknologi yang ada

source: Sunar, Eisenbarth, Inci, Gorka Irazoqui Apecechea. Fine Grain Cross-VM Attacks on Xen and VMware are possible!. 2014. `https://eprint.iacr.org/2014/248.pfd <https://eprint.iacr.org/2014/248.pdf>`_
de: Sunar, Eisenbarth, Inci, Gorka Irazoqui Apecechea. Fine Grain Cross-VM Angriffe auf Xen und VMware sind möglich !. 2014. `https://eprint.iacr.org/2014/248.pfd <https://eprint.iacr.org/2014/248.pdf> `_
id: Sunar, Eisenbarth, Inci, Gorka Irazoqui Apecechea. Fine Grain Cross-VM Attacks pada Xen dan VMware adalah mungkin. 2014. `https://eprint.iacr.org/2014/248.pfd <https://eprint.iacr.org/2014/248.pdf>`_
tr_tr: Sunar, Eisenbarth, İnci, Gorka Irazoqui Apecechea. Xen ve VMware'de Hassas Ayarlı Cross-VM Saldırıları mümkündür!. 2014. `https://eprint.iacr.org/2014/248.pfd <https://eprint.iacr.org/2014/248.pdf>`_

source: Supported authentication methods depend on which share driver, security service and shared file system protocol you configure and use. Supported shared file system protocols are NFS, CIFS, GlusterFS, and HDFS. Supported security services are LDAP, Kerberos protocols, or Microsoft Active Directory service. For details of supporting of features by different drivers, see `Manila share features support mapping <http://docs.openstack. org/developer/manila/devref/share_back_ends_feature_support_ mapping.html>`_.
de: Unterstützte Authentifizierungsmethoden hängen davon ab, welchen Share-Treiber, Sicherheitsdienst und gemeinsam genutztes Dateisystem-Protokoll Sie konfigurieren und verwenden. Unterstützte freigegebene Dateisystemprotokolle sind NFS, CIFS, GlusterFS und HDFS. Unterstützte Sicherheitsdienste sind LDAP, Kerberos-Protokolle oder Microsoft Active Directory-Dienst. Weitere Informationen zur Unterstützung von Features durch verschiedene Treiber finden Sie unter `Manila Share Features Support Mapping <http://docs.openstack. org/developer/manila/devref/share_back_ends_feature_support_ mapping.html> `_.
id: Metode otentikasi yang didukung bergantung pada share driver, layanan keamanan dan protokol sistem file shared yang Anda konfigurasikan dan gunakan. Protokol sistem file shared yang didukung adalah NFS, CIFS, GlusterFS, dan HDFS. Layanan keamanan yang didukung adalah LDAP, protokol Kerberos, atau layanan Microsoft Active Directory. Untuk rincian dukungan fitur oleh driver yang berbeda, lihat `Manila share features support mapping <http://docs.openstack. org/developer/manila/devref/share_back_ends_feature_support_ mapping.html>`_.
tr_tr: Desteklenen kimlik doğrulama yöntemleri hangi paylaşım sürücüsüne, güvenlik servisine ve yapılandırdığınız ve kullandığınız paylaşılan dosya sistemi protokolüne bağlıdır. Desteklenen paylaşımlı dosya sistemi protokolleri NFS, CIFS, GlusterFS ve HDFS'dir. Desteklenen güvenlik hizmetleri LDAP, Kerberos protokolleri veya Microsoft Active Directory servisidir. Özelliklerin farklı sürücülere göre desteklenmesiyle ilgili ayrıntılar için bkz. `Manila paylaşım özellikleri destekleme eşleştirme <http://docs.openstack. org/developer/manila/devref/share_back_ends_feature_support_ mapping.html>`_.

source: Supporting components, such as load-balancers, reverse proxies, DNS, or DHCP services
de: Unterstützungskomponenten wie Load-Balancer, Reverse Proxies, DNS oder DHCP Services
id: Komponen pendukung, seperti load-balancer, reverse proxy, DNS, atau layanan DHCP

source: Supports encrypted backups if the original volume is encrypted
de: Unterstützt verschlüsselte Backups, wenn das ursprüngliche Volume verschlüsselt ist
id: Mendukung backup terenkripsi jika volume asli dienkripsi
tr_tr: Orijinal hacim şifreliyse şifreli yedeklemeleri destekler

source: Symmetric keys can be used to encrypt Swift containers to mitigate the risk of users data being read if an unauthorised party were to gain physical access to a disk.
de: Symetrische Schlüssel können zur Verschlüsselung von Swift Containern benutzt werden, um das Risiko zu minimieren, dass Benutzer unauthorisiert Teile lesen können, wenn sie physikalischen Zugriff auf die Festplatte bekommen.
id: Kunci simetris dapat digunakan untuk mengenkripsi kontainer Swift untuk mengurangi risiko data pengguna dibaca jika pihak yang tidak berwenang memperoleh akses fisik ke disk.

source: System categorization:
de: Systemkategorisierung:
id: Kategorisasi sistem:
tr_tr: Sistem kategorilendirmesi:

source: System databases, such as MySQL or mongoDB
de: Systemdatenbanken wie MySQL oder mongoDB
id: Sistem database, seperti MySQL atau mongoDB
tr_tr: Sistem veritabanları, örn. MySQL ya da mongoDB

source: System documentation
de: Systemdokumentation
id: Dokumentasi sistem
tr_tr: Sistem belgelendirmesi

source: System documentation requirements
de: Anforderungen an die Systemdokumentation
id: Persyaratan dokumentasi sistem
tr_tr: Sistem belgelendirme gereksinimleri

source: System metadata
de: Systemmetadaten
tr_tr: Sistem metaverisi

source: System roles and types
de: Systemrollen und Typen
id: Peran dan tipe sistem
tr_tr: Sistem rolleri ve türleri

source: System validation
de: Systemvalidierung
id: Validasi sistem
tr_tr: Sistem doğrulama

source: Systems should be segregated in such a way that if one machine, or system-level service, is compromised the security of the other systems will remain intact. Practically, the enablement and proper usage of SELinux helps accomplish this goal.
de: Systeme sollten so getrennt werden, dass bei einer Kompromittierung einer Maschine oder eines System-Level-Service die Sicherheit der anderen Systeme intakt bleibt. Praktisch, die Aktivierung und die ordnungsgemäße Verwendung von SELinux hilft, dieses Ziel zu erreichen.
id: Sistem harus dipisahkan sedemikian rupa sehingga jika satu mesin, atau layanan tingkat sistem, dikompromikan, keamanan sistem lain akan tetap utuh. Praktis, pemakaian dan penggunaan SELinux yang tepat membantu mencapai tujuan ini.
tr_tr: Sistemler, bir makine veya sistem düzeyindeki hizmetten ödün verilmesi durumunda diğer sistemlerin güvenliğinin bozulmayacağı şekilde ayrılmalıdır. Pratikte, SELinux'un etkinleştirilmesi ve doğru kullanılması bu amaca ulaşılmasına yardımcı olur.

source: TLS libraries
de: TLS-Bibliotheken
id: Perpustakaan TLS
tr_tr: TLS kitaplıkları

source: TLS proxies and HTTP services
de: TLS-Proxies und HTTP-Dienste
id: Proxy TLS dan layanan HTTP
tr_tr: TLS vekiller ve HTTP servisler

source: Team expertise
de: Teamkompetenz
id: Keahlian tim
tr_tr: Takım uzmanlığı

source: Technologies involved
de: Beteiligte Technologien
id: Teknologi terlibat
tr_tr: Dahil olan teknolojiler

source: Technology
de: Technologie
id: Teknologi
tr_tr: Teknoloji

source: TempAuth is the default authentication for Object Storage. In contrast to Identity, it stores the user accounts, credentials, and metadata in object storage itself. More information can be found in the section `The Auth System <https://docs.openstack.org/swift/latest/overview_auth.html>`_ of the Object Storage (swift) documentation.
de: TempAuth ist die Standardauthentifizierung für Objektspeicher. Im Gegensatz zu Identity speichert er die Benutzerkonten, Anmeldeinformationen und Metadaten im Objektspeicher selbst. Weitere Informationen finden Sie im Abschnitt `Das Auth System <https://docs.openstack.org/swift/latest/overview_auth.html>`_ der Objektspeicher (swift) Dokumentation.
id: TempAuth adalah otentikasi default untuk Object Storage. Berbeda dengan Identity, ia menyimpan akun pengguna, kredensial, dan metadata dalam penyimpanan objek itu sendiri. Informasi lebih lanjut dapat ditemukan di bagian ini `The Auth System <https://docs.openstack.org/swift/latest/overview_auth.html>`_ dari dokumentasi Object Storage (swift).

source: Tenant data for compute could be encrypted over IPsec or other tunnels. This is not functionality common or standard in OpenStack, but is an option available to motivated and interested implementors.
de: Tenantdaten für Compute können über IPsec oder andere Tunnel verschlüsselt werden. Dies ist keine Funktionalität oder Standard in OpenStack, sondern ist eine Option für motivierte und interessierte Enduktoren.
id: Data penyewa untuk komputasi bisa dienkripsi melalui IPsec atau tunnel lainnya. Ini bukan fungsi umum atau standar di OpenStack, namun merupakan pilihan yang tersedia bagi pelaksana yang termotivasi dan tertarik.
tr_tr: Hesaplama için kiracı verileri IPsec veya diğer tüneller üzerinden şifrelenebilir. Bu, OpenStack'de yaygın olan veya standart olmayan bir işlevdir ancak motive olmuş ve ilgilenen uygulayıcılar için kullanılabilir bir seçenektir.

source: Tenant data privacy
de: Tenant Datenschutz
id: Privasi data penyewa
tr_tr: Kiracı veri gizliliği

source: Tenant data stored in an OpenStack cloud may include the following items:
de: Tenantdaten, die in einer OpenStack-Cloud gespeichert sind, können die folgenden Elemente enthalten:
id: Data penyewa yang tersimpan dalam awan OpenStack mungkin termasuk item berikut:
tr_tr: Bir OpenStack bulutunda saklanan kiracı verileri aşağıdaki öğeleri içerebilir:

source: Tenants provide details for the security service.
de: Die Tenants geben Auskunft über den Sicherheitsdienst.
id: Tenant (penyewa) memberikan rincian untuk layanan keamanan.
tr_tr: Kiracılar, güvenlik servisi için ayrıntılar sunar.
