Repository: openstack/security-doc
Catalog: security-guide/source/locale/*/LC_MESSAGES/security-guide.po
Languages: de, id, tr_tr

source: The architecture diagram shows the logical layout of the system so the security reviewers can step through the architecture with the project team. It is a logical diagram which shows how the components interact, how they connect to external entities, and where communications cross trust boundaries. Further information on architecture diagram, including a key of symbols, will be given in the upcoming architecture diagram guidance. Diagrams can be drawn in any tool that can produce a diagram which uses the symbols in the key, however `draw.io <https://draw.io>`__ is strongly recommended.
de: Das Architekturdiagramm zeigt das logische Layout des Systems, so dass die Sicherheitsbeurteiler die Architektur mit dem Projektteam durchlaufen können. Es ist ein logisches Diagramm, das zeigt, wie die Komponenten interagieren, wie sie sich mit externen Entitäten verbinden und wo die Kommunikation Vertrauensgrenzen überschreitet. Weitere Informationen zum Architekturdiagramm, einschließlich eines Schlüssels von Symbolen, werden in der anstehenden Architekturdiagrammführung gegeben. Diagramme können in jedem Werkzeug gezeichnet werden, das ein Diagramm erzeugen kann, das die Symbole im Schlüssel verwendet, aber `draw.io <https://draw.io>`__ wird dringend empfohlen
id: Diagram arsitektur menunjukkan tata letak logis dari sistem sehingga peninjau keamanan dapat melangkah melalui arsitektur dengan tim proyek. Ini adalah diagram logis yang menunjukkan bagaimana komponen berinteraksi, bagaimana mereka terhubung ke entitas eksternal, dan di mana komunikasi melintasi batas kepercayaan. Informasi lebih lanjut tentang diagram arsitektur, termasuk kunci simbol, akan diberikan dalam panduan diagram arsitektur yang akan datang. Diagram dapat ditarik dalam alat yang dapat menghasilkan diagram yang menggunakan simbol pada kunci, namun `draw.io <https://draw.io>` __ sangat disarankan.
tr_tr: Mimari diyagram, sistemin mantıksal düzenini gösterir, böylece güvenlik incelemecileri proje ekibi ile birlikte mimariye adım atabilir. Bileşenlerin nasıl etkileşim kurduğunu, dış varlıklarla nasıl bağlantı kurduklarını ve iletişimlerin güven sınırlarını aştıklarını gösteren mantıksal bir diyagramdır. Mimari diyagramında, sembollerin bir anahtarı da dahil olmak üzere daha fazla bilgi gelecek mimari şema rehberinde verilecektir. Diyagramlar tuştaki sembolleri kullanan bir diyagram oluşturabilen herhangi bir araçta çizilebilir, ancak `draw.io <https://draw.io>`__ şiddetle önerilir.

source: The authentication service requires the user to provide information based on something they have, such as a one-time password token or X.509 certificate, and something they know, such as a password.
de: Der Authentifizierungsdienst erfordert, dass der Benutzer Informationen auf der Grundlage von etwas, was sie haben, wie ein einmaliges Passwort-Token oder X.509-Zertifikat, und etwas, was sie wissen, wie ein Passwort.
id: Layanan otentikasi mengharuskan pengguna memberikan informasi berdasarkan sesuatu yang mereka miliki, seperti token password one-time atau sertifikat X.509, dan sesuatu yang mereka ketahui, seperti password.
tr_tr: Kimlik doğrulama servisi, kullanıcının bir kerelik bir parola belirteci veya X.509 sertifikası gibi bir şey üzerine kurulu bilgileri ve bir parola gibi bildikleri bir şeyi sağlamasını gerektirir.

source: The authentication service you use, such as Identity service (keystone) or TempAuth, will determine how you configure a different URL in the responses to end-point clients so they use your load balancer instead of an individual proxy node.
de: Der Authentifizierungsdienst, den Sie verwenden, wie z.B. Identity Service (Keystone) oder TempAuth, wird bestimmen, wie Sie eine andere URL in den Antworten auf Endpunktclients konfigurieren, damit sie Ihren Load Balancer anstelle eines einzelnen Proxyknotens verwenden.
id: Layanan otentikasi yang Anda gunakan, seperti layanan Identity (keystone) atau TempAuth, akan menentukan bagaimana Anda mengkonfigurasi URL yang berbeda dalam tanggapan ke klien end-point sehingga mereka menggunakan penyeimbang beban Anda daripada sebuah node proxy individual.
tr_tr: Kullandığınız kimlik doğrulama servisi (keystone) veya TempAuth gibi kimlik doğrulama servisi, bitiş noktası istemcilerine verilen yanıtlarda farklı bir URL'yi nasıl yapılandırdığınıza karar verecek; bu nedenle, tek bir vekil düğümü yerine yük dengeleyici kullanıyorlar.

source: The basics of logging: configuration, setting log level, location of the log files, and how to use and customize logs, as well as how to do centralized collections of logs is well covered in the `OpenStack Operations Guide <https://docs.openstack.org/ops/>`_.
de: Die Grundlagen der Protokollierung: Konfiguration, Einstellung der Log-Ebene, Speicherort der Protokolldateien und die Verwendung und Anpassung von Protokollen sowie die Erstellung zentraler Sammlungen von Protokollen ist im `OpenStack Operations Guide` gut abgedeckt <https://docs.openstack.org/ops/>`_.
id: Dasar logging: konfigurasi, pengaturan tingkat log, lokasi file log, dan bagaimana cara menggunakan dan menyesuaikan log, serta bagaimana melakukan koleksi log terpusat tercakup dalam `OpenStack Operations Guide <https://docs.openstack.org/ops/>`_.
tr_tr: Günlük kaydetme ile ilgili temel bilgiler: Yapılandırma, günlük düzeyini ayarlama, günlük dosyalarının konumu ve günlükleri nasıl kullanacağınıza ve özelleştireceğinize yanı sıra, günlüklerin merkezi koleksiyonlarını nasıl yapılacağı, `OpenStack Operasyon Kılavuzu <https://docs.openstack.org/ops/> `_ nda detaylıca işlenmiştir.

source: The best test of interoperability in the cloud is the ability to enable a user with one set of credentials in an IdP to access multiple cloud services. Organizations, each using its own IdP can easily allow their users to collaborate and quickly share the same cloud services.
de: Der beste Test der Interoperabilität in der Cloud ist die Fähigkeit, einen Benutzer mit einem Satz von Anmeldeinformationen in einem IdP zu aktivieren, um auf mehrere Cloud-Dienste zuzugreifen. Organisationen, die jeweils ihre eigenen IdP haben, können leicht ermöglichen, mit ihren Benutzern zu kooperieren und schnell die gleichen Cloud-Services zu teilen.
tr_tr: Buluttaki birlikte işlerliğin en iyi testi, bir kullanıcıyı birden fazla bulut servisine erişmek için bir IdP kimlik bilgileriyle etkinleştirmektir. Her biri kendi IdP'sini kullanan organizasyonlar, kullanıcılarının kolayca işbirliği yapmasına ve aynı bulut hizmetlerini hızlı bir şekilde paylaşmasına izin verebilir.

source: The choice of database server is an important consideration in the security of an OpenStack deployment. Multiple factors should be considered when deciding on a database server, however for the scope of this book only security considerations will be discussed. OpenStack supports a variety of database types. See the `OpenStack Administrator Guide <https://docs.openstack.org/admin-guide/>`_ for more information.
de: Die Wahl des Datenbankservers ist eine wichtige Überlegung in der Sicherheit einer OpenStack-Bereitstellung. Bei der Entscheidung über einen Datenbankserver sollten mehrere Faktoren berücksichtigt werden. Für den Umfang dieses Buches werden jedoch nur Sicherheitsüberlegungen diskutiert. OpenStack unterstützt eine Vielzahl von Datenbanktypen. Siehe `OpenStack Administrator Guide <https://docs.openstack.org/admin-guide/>`_ für weitere Informationen.
id: Pemilihan server database merupakan pertimbangan penting dalam keamanan pengerahan OpenStack. Beberapa faktor harus dipertimbangkan saat menentukan database server, namun untuk lingkup buku ini hanya pertimbangan keamanan yang akan dibahas. OpenStack mendukung berbagai jenis database. Lihat `OpenStack Administrator Guide <https://docs.openstack.org/admin-guide/>`_ untuk informasi lebih lanjut.
tr_tr: Veritabanı sunucusunun seçimi, bir OpenStack dağıtımının güvenliğinde önemli bir husustur. Veritabanı sunucusuna karar verirken çok sayıda faktör göz önüne alınmalıdır, ancak bu kitabın kapsamı için yalnızca güvenlik konuları ele alınacaktır. OpenStack, çeşitli veritabanı türlerini desteklemektedir. Daha fazla bilgi için `OpenStack Yönetici Kılavuzu <https://docs.openstack.org/admin-guide/>` na bakın.

source: The choice of technology to provide L2 isolation is dependent upon the scope and size of tenant networks that will be created in your deployment. If your environment has limited VLAN ID availability or will have a large number of L2 networks, it is our recommendation that you utilize tunneling.
de: Die Wahl der Technologie zur Bereitstellung von L2-Isolation hängt von dem Umfang und der Größe der Tenant-Netzwerke ab, die in Ihrem Einsatz erstellt werden. Wenn Ihre Umgebung begrenzte VLAN-ID-Verfügbarkeit hat oder eine große Anzahl von L2-Netzwerken haben wird, ist es unsere Empfehlung, dass Sie Tunneling nutzen.
id: Pilihan teknologi untuk memberikan isolasi L2 bergantung pada cakupan dan ukuran jaringan penyewa yang akan dibuat dalam penerapan Anda. Jika lingkungan Anda memiliki ketersediaan VLAN ID terbatas atau akan memiliki sejumlah besar jaringan L2, ini adalah rekomendasi kami untuk memanfaatkan tunneling.
tr_tr: L2 izolasyonu sağlayan teknoloji seçimi, dağıtımınızda yaratılacak kiracı ağların kapsamına ve boyutuna bağlıdır. Ortamınız sınırlı VLAN ID kullanılabilirliği veya çok sayıda L2 ağına sahipse, tünel açmayı kullanmanız önerilir.

source: The choice of tenant network isolation affects how the network security and control boundary is implemented for tenant services. The following additional network services are either available or currently under development to enhance the security posture of the OpenStack network architecture.
de: Die Wahl der Tenantnetz-Isolation beeinflusst, wie die Netzwerksicherheits- und Kontrollgrenze für Tenantdienste implementiert wird. Die folgenden zusätzlichen Netzwerkdienste sind entweder verfügbar oder derzeit in der Entwicklung, um die Sicherheitsposition der OpenStack-Netzwerkarchitektur zu verbessern.
id: Pilihan isolasi jaringan penyewa mempengaruhi bagaimana keamanan jaringan dan batas kontrol diterapkan untuk layanan penyewa. Layanan jaringan tambahan berikut tersedia atau sedang dalam pengembangan untuk meningkatkan postur keamanan dari arsitektur jaringan OpenStack.
tr_tr: Kiracı ağı izolasyonunun seçimi, kiracı servisleri için ağ güvenliği ve kontrol sınırının nasıl uygulandığını etkiler. OpenStack ağ mimarisinin güvenlik durumunu iyileştirmek için şu ek ağ servisleri mevcut veya şu an geliştirme aşamasındadır.

source: The client configuration data for authentication and authorization (AuthN/AuthZ) can be stored by ``security services``. LDAP, Kerberos, or Microsoft Active directory can be used by the Shared File Systems service if they are supported by used drivers and back ends. Authentication services can also be configured without the Shared File Systems service.
de: Die Client-Konfigurationsdaten für die Authentifizierung und Autorisierung (AuthN/AuthZ) können über ``Sicherheitsdienste` gespeichert werden. LDAP, Kerberos oder Microsoft Active Directory können vom Shared File Systems Service verwendet werden, wenn sie von benutzten Treibern und Backends unterstützt werden. Authentifizierungsdienste können auch ohne den Shared File Systems Service konfiguriert werden.
id: Data konfigurasi klien untuk otentikasi dan otorisasi (AuthN/AuthZ) dapat disimpan oleh ``security services``. Active Directory LDAP, Kerberos, atau Microsoft dapat digunakan oleh layanan Shared File Systems jika didukung oleh driver dan back end yang digunakan. Layanan otentikasi juga dapat dikonfigurasi tanpa layanan Shared File Systems.
tr_tr: Kimlik doğrulama ve yetkilendirme için müşteri yapılandırma verileri (AuthN / AuthZ) ``güvenlik servisleri`` tarafından saklanabilir. Kullanılmış sürücüler ve arka uçlar tarafından destekleniyorsa, Paylaşımlı Dosya Sistemleri servisi tarafından LDAP, Kerberos veya Microsoft Active Directory kullanılabilir. Kimlik Doğrulama servisi, Paylaşımlı Dosya Sistemleri servisi olmadan da yapılandırılabilir.

source: The cloud administrator should protect sensitive configuration files from unauthorized modification. This can be achieved with mandatory access control frameworks such as SELinux, including ``/etc/keystone/keystone.conf`` and X.509 certificates.
de: Der Cloud-Administrator sollte sensible Konfigurationsdateien vor unbefugter Modifikation schützen. Dies kann mit obligatorischen Zutrittskontrollgeräten wie SELinux, einschließlich ``/etc/keystone/ keystone.conf`` und X.509 Zertifikaten erreicht werden.
id: Administrator awan harus melindungi file konfigurasi sensitif dari modifikasi yang tidak sah. Hal ini dapat dicapai dengan kerangka kontrol akses wajib seperti SELinux, termasuk sertifikat ``/etc/keystone/keystone.conf`` dan X.509.
tr_tr: Bulut yöneticisi hassas yapılandırma dosyalarını yetkisiz değişikliklerden korumalıdır. Bu, ``/etc/keystone/keystone.conf`` ve X.509 sertifikaları da dahil olmak üzere SELinux gibi zorunlu erişim kontrol çatıları ile başarılabilir.

source: The components of Object Storage are grouped into the following primary groups:
de: Die Komponenten von Object Storage sind in folgende Primärgruppen unterteilt:
id: Komponen Object Storage dikelompokkan ke dalam kelompok primer berikut:
tr_tr: Nesne Depolama bileşenleri aşağıdaki birincil gruplara ayrılır:

source: The compute configuration, ``nova.conf``, has the following default parameters within the "[ephemeral_storage_encryption]" section
de: Die Compute-Konfiguration, ``nova.conf``, hat die folgenden Standardparameter im Abschnitt "[ephemeral_storage_encryption]"
id: Konfigurasi komputasi, ``nova.conf``, memiliki parameter default berikut di bagian "[ephemeral_storage_encryption]"
tr_tr: Hesaplama yapılandırması olan ``nova.conf``, "[ephemeral_storage_encryption]" bölümünde aşağıdaki varsayılan parametrelere sahiptir

source: The compute nodes are the least trusted of the services in OpenStack because they host tenant instances. The ``nova-conductor`` service has been introduced to serve as a database proxy, acting as an intermediary between the compute nodes and the database. We discuss its ramifications later in this chapter.
de: Die Compute-Knoten sind die am wenigsten vertrauenswürdigen Dienste in OpenStack, weil sie Tenant-Instanzen hosten. Der ``nova-conductor``Service wurde eingeführt, um als Datenbank-Proxy zu dienen, der als Vermittler zwischen den Compute-Knoten und der Datenbank fungiert. Wir diskutieren es später in diesem Kapitel.
id: Node komputasi adalah yang paling tidak dipercaya dari layanan di OpenStack karena mereka menghosting instance penyewa. Layanan ``nova-conductor`` telah diperkenalkan untuk dijadikan basis data proxy, bertindak sebagai perantara antara node dan database. Kami mendiskusikan ramalannya nanti di bab ini.
tr_tr: Hesaplama düğümleri, kiracı örneklerini barındırdığı için OpenStack'deki servislerinden en az güvenilen kişilerdir. ``Nova-conductor`` hizmeti, hesaplama düğümleri ve veritabanı arasında aracı olarak görev yapan bir veritabanı vekil kaynağı olarak tanıtıldı. Etkilerini bu bölümün ilerleyen bölümlerinde tartışacağız.

source: The configuration file ``policy.json`` may be placed anywhere. The path ``/etc/manila/policy.json`` is expected by default.
de: Die Konfigurationsdatei ``policy.json``kann überall platziert werden. Der Pfad ``/etc/manila/policy.json``wird standardmäßig erwartet.
id: File konfigurasi ``policy.json`` dapat ditempatkan dimana saja. Path ``/etc/manila/policy.json`` diharapkan secara default.
tr_tr: ``policy.json`` yapılandırma dosyası herhangi bir yerde olabilir. Öntanımlı yol ``/etc/manila/policy.json`` olarak belirlenmiştir.

source: The configuration files for the OpenStack services contain a number of passwords which are in plain text. These include, for instance, the passwords used by service users to authenticate to keystone to validate keystone tokens.
de: DIe Konfigurationsdateien von OpenStack beinhalten eine Nummer von Passwörtern in Klartext. Dies beinhaltet zum Beispiel Passwörter von Dienstekonten zur Authentifizierung bei Keystone zur Validierung von Keystone Token.
id: File konfigurasi untuk layanan OpenStack berisi sejumlah password yang ada dalam teks biasa. Ini termasuk, misalnya, password yang digunakan oleh pengguna layanan untuk melakukan otentikasi ke keystone untuk memvalidasi token keystone.

source: The configuration for manila-rootwrap in file ``rootwrap.conf`` and the manila-rootwrap command filters for share nodes in file ``rootwrap.d/share.filters`` should be owned by, and only-writeable by, the root user.
de: Die Konfiguration für manila-rootwrap in der Datei ``rootwrap.conf``und die manila-rootwrap-Befehlsfilter für Freigabeknoten in der Datei `` rootwrap.d/share.filters`` sollte im Besitz und nur schreibbar sein für root-Benutzer.
id: Konfigurasi untuk manila-rootwrap di file ``rootwrap.conf`` dan filter perintah manila-rootwrap untuk share node dalam file ``rootwrap.d/share.filters`` harus dimiliki oleh, dan hanya dapat ditulisi oleh, pengguna root
tr_tr: ``rootwrap.conf`` dosyasındaki manila-rootwrap için yapılandırma ve ``rootwrap.d/share.filters`` dosyasındaki paylaşım düğümleri için manila-rootwrap komut filtreleri için sahibi tarafından ve sadece root tarafından yazılabilir olmalıdır.

source: The configuration option in ``manila.conf`` that sets *share servers* mode or *no share servers* mode is the ``driver_handles_share_servers`` option. It indicates whether a driver handles share servers by itself or it expects the Shared File Systems service to do it.
de: Die Konfigurationsoption in ``manila.conf``, die *share servers* mode oder *no share servers* mode setzt, ist die `` driver_handles_share_servers``Option. Es gibt an, ob ein Treiber Share- Server selbst behandelt oder es erwartet, dass der Shared File Systems- Dienst es macht.
id: Pilihan konfigurasi pada ``manila.conf`` yang mengatur mode *share servers* atau mode *no share servers * adalah opsi ``driver_handles_share_servers``. Ini menunjukkan apakah driver menangani server berbagi dengan sendirinya atau mengharapkan layanan Shared File Systems untuk melakukannya.
tr_tr: ``manila.conf`` dosyasındaki **paylaşım sunucusu** ya da **paylaşım sunucusu yok** kipini ``driver_handles_share_servers`` seçeneği belirler. Bir sürücünün paylaşım sunucularını tek başına işleyip yönetmediğini veya Paylaşımlı Dosya Sistemleri servisinin bunu yapmasını beklediğini belirtir.

source: The dashboard can also be branded for service providers and other commercial vendors.
de: Das Dashboard kann auch für Dienstleister und andere kommerzielle Anbieter gebrandmarkt werden.
id: Dasbor juga bisa dicap (branded) untuk penyedia layanan dan vendor komersial lainnya.
tr_tr: Panel, servis sağlayıcılar ve diğer ticari satıcılar için de markalı olabilir.

source: The dashboard depends on a shared ``SECRET_KEY`` setting for some security functions. The secret key should be a randomly generated string at least 64 characters long, which must be shared across all active dashboard instances. Compromise of this key may allow a remote attacker to execute arbitrary code. Rotating this key invalidates existing user sessions and caching. Do not commit this key to public repositories.
de: Das Dashboard hängt von einer gemeinsamen ``SECRET_KEY``Einstellung für einige Sicherheitsfunktionen ab. Der geheime Schlüssel sollte eine zufällig generierte Zeichenfolge mit mindestens 64 Zeichen lang sein, die über alle aktiven Dashboard-Instanzen freigegeben werden muss. Kompromisse dieses Schlüssels können einem entfernten Angreifer erlauben, beliebigen Code auszuführen. Durch Drehen dieses Schlüssels werden bestehende Benutzersitzungen und das Zwischenspeichern ungültig. Diesen Schlüssel nicht an öffentliche Repositories weitergeben.
id: Dasbor tergantung pada pengaturan ``SECRET_KEY` yang dipakai bersama untuk beberapa fungsi keamanan. Kunci rahasia harus berupa string yang dihasilkan secara acak minimal 64 karakter, yang harus dibagi di semua instance dasbor aktif. Kompromi kunci ini memungkinkan penyerang remote untuk mengeksekusi kode secara acak. Memutar tombol ini akan membuat user session dan caching tidak valid. Jangan masukkan kunci ini ke public repository.
tr_tr: Panel bazı güvenlik işlevleri için paylaşılan bir ``SECRET_KEY`` ayarına bağlı. Gizli anahtar, en az 64 karakter uzunluğunda rasgele oluşturulmuş bir dize olmalıdır ve bu da tüm etkin gösterge tablosu örneklerinde paylaşılmalıdır. Bu anahtarın ele geçirilmesi, uzaktaki bir saldırganın rasgele kod yürütmesine izin verebilir. Bu anahtarı döndürmek mevcut kullanıcı oturumlarını ve önbelleğe almayı geçersiz kılar. Bu anahtarı genel depolar için taahhüt etmeyin.

source: The dashboard provides GUI support for routers and load-balancers. For example, the dashboard now implements all of the main Networking features.
de: Das Dashboard bietet GUI-Unterstützung für Router und Load-Balancer. Zum Beispiel implementiert das Dashboard jetzt alle wichtigen Netzwerkfunktionen.
id: Dasbor menyediakan dukungan GUI untuk router dan load-balancers. Misalnya, dasbor sekarang menerapkan semua fitur Networking utama.
tr_tr: Panel, yönlendiriciler ve yük dengeleyiciler için GUI desteği sağlar. Örneğin, panel artık tüm Ana Ağ özellikleri uyguluyor.

source: The dashboard provides tenant-users a self-service portal to provision their own resources within the limits set by administrators.
de: Das Dashboard stellt den Tenantnutzern ein Self-Service-Portal zur Verfügung, um ihre eigenen Ressourcen innerhalb der von Administratoren festgelegten Grenzen bereitzustellen.
id: Dasbor menyediakan portal layanan mandiri (self-service) bagi pengguna penyewa untuk menyediakan sumber daya mereka sendiri sesuai batasan yang ditetapkan oleh administrator.
tr_tr: Panel, kiracı kullanıcılara, kendi kaynaklarını, yöneticiler tarafından belirlenen sınırlar içinde tedarik etmek için kendi kendine bir servis portalı sağlar.

source: The dashboard requires cookies and JavaScript to be enabled in the web browser.
de: Das Dashboard benötigt Cookies und JavaScript, um im Webbrowser aktiviert zu werden.
id: Dasbor mengharuskan cookie dan JavaScript diaktifkan di browser web.
tr_tr: Panel, tarayıcıda çerezlerin ve JavaScript'in etkinleştirilmesini gerektirir.

source: The dashboard should be deployed as a Web Services Gateway Interface (WSGI) application behind an HTTPS proxy such as Apache or :term:`Nginx`. If Apache is not already in use, we recommend :term:`Nginx` since it is lightweight and easier to configure correctly.
de: Das Dashboard sollte als Web Services Gateway Interface (WSGI) Anwendung hinter einem HTTPS Proxy wie Apache oder :term:`Nginx` eingesetzt werden. Wenn Apache nicht bereits benutzt wird, empfehlen wir :term:`Nginx`, da es leicht und einfacher richtig zu konfigurieren ist.
id: Dasbor harus digunakan sebagai aplikasi Web Services Gateway Interface (WSGI) di belakang proxy HTTPS seperti Apache atau :term:`Nginx`. Jika Apache belum digunakan, kami sarankan :term:`Nginx` karena sudah ringan dan mudah dikonfigurasi dengan benar.
tr_tr: Panel, Apache veya :term:`Nginx` gibi bir HTTPS vekilinin arkasında bir Web Hizmetleri Ağ Geçidi Arabirimi (WSGI) uygulaması olarak yayına alınmalıdır. Apache kullanılmıyorsa, term:`Nginx` öneriyoruz:hafif ve doğru şekilde yapılandırılması daha kolaydır.
