Repository: openstack/security-doc
Catalog: security-guide/source/locale/*/LC_MESSAGES/security-guide.po
Languages: de, id, tr_tr

source: AppArmor profiles for OpenStack services do not currently exist, but the OpenStack-Ansible project handles this by `applying AppArmor profiles to each container`_ that runs an OpenStack service.
de: AppArmor-Profile für OpenStack-Dienste existieren derzeit nicht, aber das OpenStack-Ansible-Projekt verarbeitet dies durch `AppArmor-Profile für jeden Container`, der einen OpenStack-Dienst ausführt.
id: Profil AppArmor untuk layanan OpenStack saat ini tidak ada, namun proyek OpenStack-Ansible menangani hal ini dengan `applying AppArmor profiles to each container`_ yang menjalankan layanan OpenStack.
tr_tr: OpenStack servisleri için AppArmor profilleri henüz mevcut değildir, ancak OpenStack-Ansible projesi bunu bir 'OpenStack servisi çalıştıran `her kapsayıcıya AppArmor profilleri uygulayarak`_ gerçekleştirir.

source: AppArmor.net, AppArmor Main Page. 2011. `http://wiki.apparmor.net/index.php/Main_Page <http://wiki.apparmor.net/index.php/Main_Page>`_
de: AppArmor.net, AppArmor Hauptseite. 2011. `http://wiki.apparmor.net/index.php/Main_Page <http://wiki.apparmor.net/index.php/Main_Page>`_
tr_tr: AppArmor.net, AppArmor Ana Sayfa. 2011. `http://wiki.apparmor.net/index.php/Main_Page <http://wiki.apparmor.net/index.php/Main_Page>`_

source: Appendix
de: Anhang
id: Lampiran
tr_tr: Ek

source: Application events such as start or stop events that were unscheduled would also be events to monitor and examine for possible security implications.
de: Anwendungsereignisse wie Start- oder Stop-Events, die nicht geplant waren, wären auch Ereignisse zur Überwachung und Prüfung auf mögliche Sicherheitsimplikationen.
id: Event aplikasi seperti memulai atau menghentikan event yang tidak terjadwal juga merupakan event untuk memantau dan memeriksa kemungkinan implikasi keamanan.
tr_tr: Programlanmamış başlama veya durdurma olayları gibi uygulama olayları, muhtemel güvenlik etkilerini izlemek ve incelemek için de olaylar olurdu.

source: Applications store and retrieve data in Object Storage via an industry-standard HTTP RESTful API. Back end components of Object Storage follow the same RESTful model, although some APIs, such as those managing durability, are kept private to the cluster. For more details on the API see the `OpenStack Storage API <https://developer.openstack.org/api-ref/object-storage/>`_.
de: Anwendungen speichern Daten in Object Storage und rufen diese über eine branchenübliche HTTP RESTful API ab. Back-End-Komponenten von Object Storage folgen dem gleichen RESTful-Modell, obwohl einige APIs, wie jene, die die Haltbarkeit verwalten, privat zum Cluster gehalten werden. Weitere Informationen zur API finden Sie unter `OpenStack Storage API <https://developer.openstack.org/api-ref/object-storage/>`_.

source: Apply checks :ref:`check_shared_fs_01` and :ref:`check_shared_fs_02` from the checklist to verify that permissions are set properly.
de: Checks überprüfen :ref:`check_shared_fs_01` und :ref:`check_shared_fs_02` aus der Checkliste, um zu überprüfen, ob die Berechtigungen richtig eingestellt sind.
id: Terapkan cek :ref:`check_shared_fs_01` dan :ref:`check_shared_fs_02` dari checklist untuk memverifikasi bahwa izin ditetapkan dengan benar.
tr_tr: İzinlerin uygun bir şekilde ayarlandığından emin olmak için kontrol listesinden :ref:`check_shared_fs_01` ve :ref:`check_shared_fs_02` kontrollerini onaylayın.

source: Appropriate logging is implemented to monitor for unauthorized use, incident response and forensics. We highly recommend selected audit subsystems be Common Criteria certified, which provides non-attestable event records in most countries.
de: Eine angemessene Protokollierung wird durchgeführt, um auf unbefugte Benutzung, Auffallreaktion und Forensik zu überwachen. Wir empfehlen dringend, ausgewählte Audit-Subsysteme zu beurteilen. Common Criteria certified, die in den meisten Ländern nicht beschreibbare Event-Rekorde bietet.
id: Logging yang tepat diimplementasikan untuk memantau penggunaan yang tidak sah, respon kejadian dan forensik. Kami sangat merekomendasikan subsistem audit terpilih menjadi Common Criteria yang disertifikasi, yang menyediakan rekaman acara yang tidak dapat dikesampingkan (non-attestable) di sebagian besar negara.
tr_tr: Yetkisiz kullanımı, olay tepkisi ve adli tıpı izlemek için uygun günlük kaydı uygulanmaktadır. Çoğu ülkede onaylanmayan olay kayıtları sağlayan Common Criteria sertifikalı seçilmiş denetim alt sistemlerini öneriyoruz.

source: Architecture
de: Die Architektur
id: Arsitektur
tr_tr: Mimari

source: Architecture diagram
de: Architektur-Diagramm
id: Diagram arsitektur
tr_tr: Mimari diyagram

source: Architecture page guidance
de: Architektur Seitenführung
id: Panduan halaman arsitektur
tr_tr: Mimari sayfa yönlendirmesi

source: Artho, Yagi, Iijima, Kuniyasu Suzaki. Memory Deduplication as a Threat to the Guest OS. 2011. `https://staff.aist.go.jp/c.artho/papers/EuroSec2011-suzaki.pdf <https://staff.aist.go.jp/c.artho/papers/EuroSec2011-suzaki.pdf>`_
de: Artho, Yagi, Iijima, Kuniyasu Suzaki. Speicher-Deduplizierung als Bedrohung für das Gast-Betriebssystem. 2011. `https://staff.aist.go.jp/c.artho/papers/EuroSec2011-suzaki.pdf <https://staff.aist.go.jp/c.artho/papers/EuroSec2011-suzaki.pdf>`_
id: Artho, Yagi, Iijima, Kuniyasu Suzaki. Memory Deduplication sebagai Threat bagi Guest OS. 2011. `https://staff.aist.go.jp/c.artho/papers/EuroSec2011-suzaki.pdf <https://staff.aist.go.jp/c.artho/papers/EuroSec2011-suzaki.pdf>`_
tr_tr: Artho, Yagi, Iijima, Kuniyasu Suzaki. Konuk OS için Tehdit Olan Bellek Tekilleştirme. 2011. `https://staff.aist.go.jp/c.artho/papers/EuroSec2011-suzaki.pdf <https://staff.aist.go.jp/c.artho/papers/EuroSec2011-suzaki.pdf>`_

source: As OpenStack adoption continues to grow and the product matures, security has become a priority. The OpenStack Security Group has recognized the need for a comprehensive and authoritative security guide. The **OpenStack Security Guide** has been written to provide an overview of security best practices, guidelines, and recommendations for increasing the security of an OpenStack deployment. The authors bring their expertise from deploying and securing OpenStack in a variety of environments.
de: Als OpenStack Adoption weiter wächst und das Produkt reift, ist Sicherheit eine Priorität geworden. Die OpenStack Security Group hat die Notwendigkeit eines umfassenden und maßgeblichen Sicherheitsleitfadens erkannt. Der **OpenStack Security Guide** wurde geschrieben, um einen Überblick über Sicherheitsbestimmungen, Richtlinien und Empfehlungen zur Erhöhung der Sicherheit einer OpenStack-Bereitstellung zu geben. Die Autoren bringen ihre Expertise von der Bereitstellung und Sicherung von OpenStack in einer Vielzahl von Umgebungen.
id: Seiring adopsi OpenStack terus berkembang dan produknya akan matang, keamanan menjadi prioritas. Grup Keamanan OpenStack telah mengenali kebutuhan akan panduan keamanan komprehensif dan berwibawa. **OpenStack Security Guide** telah ditulis untuk memberikan gambaran umum tentang praktik terbaik keamanan, pedoman, dan rekomendasi untuk meningkatkan keamanan penerapan OpenStack. Penulis membawa keahlian mereka untuk menerapkan dan mengamankan OpenStack di berbagai lingkungan.
tr_tr: OpenStack benimseme süreci devam ettikçe ve ürün olgunlaşırken, güvenlik bir öncelik haline geldi. OpenStack Güvenlik Grubu, kapsamlı ve yetkili bir güvenlik rehberinin gerekliliğini kabul etti. **OpenStack Güvenlik Kılavuzu**, bir OpenStack dağıtımının güvenliğini artırmak için en iyi güvenlik uygulamaları, yönergeleri ve önerileri sağlamak üzere yazılmıştır. Yazarlar uzmanlıklarını, OpenStack'ı çeşitli ortamlarda dağıtıyormak ve güvenli hale getirmek ile sağlıyorlar.

source: As OpenStack is a popular open source project, much of the codebase and architecture has been scrutinized by individual contributors, organizations, and enterprises. This can be advantageous from a security perspective, however the need for security reviews is still a critical consideration for service providers, as deployments vary, and security is not always the primary concern for contributors. A comprehensive security review process may include architectural review, threat modeling, source code analysis and penetration testing. There are many techniques and recommendations for conducting security reviews that can be found publicly posted. A well-tested example is the `Microsoft SDL <http://www.microsoft.com/security/sdl/process/release.aspx>`_, created as part of the Microsoft Trustworthy Computing Initiative.
de: Weil OpenStack ein beliebtes Open-Source-Projekt ist, wurde ein Großteil der Codebasis und Architektur von einzelnen Mitwirkenden, Organisationen und Unternehmen geprüft. Dies kann aus Sicherheitsgründen vorteilhaft sein, aber die Notwendigkeit von Sicherheitsüberprüfungen ist nach wie vor eine kritische Betrachtung für Dienstleister, da die Einsätze variieren und die Sicherheit nicht immer das Hauptanliegen der Mitwirkenden ist. Ein umfassender Sicherheitsüberprüfungsprozess kann architektonische Überprüfung, Bedrohungsmodellierung, Quellcodeanalyse und Penetrationstest umfassen. Es gibt viele Techniken und Empfehlungen für die Durchführung von Sicherheits-Bewertungen, die öffentlich zugänglich gemacht werden können. Ein gut getestetes Beispiel ist die Microsoft SDL <http://www.microsoft.com/security/sdl/process/release.aspx>`_, erstellt als Teil der Microsoft Trustworthy Computing Initiative.
id: Karena OpenStack adalah proyek open source yang populer, sebagian besar basis kode dan arsitektur telah diteliti oleh kontributor, organisasi, dan perusahaan individual. Hal ini dapat menguntungkan dari perspektif keamanan, namun kebutuhan akan tinjauan keamanan masih merupakan pertimbangan penting bagi penyedia layanan, karena penerapannya berbeda-beda, dan keamanan tidak selalu menjadi perhatian utama kontributor. Proses tinjauan keamanan yang komprehensif dapat mencakup tinjauan arsitektural, pemodelan ancaman, analisis kode sumber dan pengujian penetrasi. Ada banyak teknik dan rekomendasi untuk melakukan tinjauan keamanan yang dapat ditemukan di publikasikan. Contoh yang teruji dengan baik adalah `Microsoft SDL <http://www.microsoft.com/security/sdl/process/release.aspx>` _, dibuat sebagai bagian dari Microsoft Trustworthy Computing Initiative.
tr_tr: OpenStack popüler bir açık kaynak projesi olduğu için, kod tabanı ve mimarinin büyük kısmı bireysel katılımcılar, kuruluşlar ve işletmeler tarafından incelenmiştir. Bu, bir güvenlik bakış açısından avantajlı olabilir; ancak, güvenlik incelemelerine duyulan ihtiyaç, servis sağlayıcılar için, dağıtımlar değiştiği ve güvenlik her zaman katkıda bulunanlar için birincil endişe olmadığı için kritik bir husustur. Kapsamlı bir güvenlik inceleme süreci mimari inceleme, tehdit modelleme, kaynak kodu analizi ve penetrasyon testi içerebilir. Kamuya açıklanabilecek güvenlik incelemeleri yapmak için birçok teknik ve tavsiyeler bulunmaktadır. İyi denenmiş bir örnek, Microsoft Güvenilir Bilgi İşlem Girişiminin bir parçası olarak oluşturulan `Microsoft SDL <http://www.microsoft.com/security/sdl/process/release.aspx>` _ 'dir.

source: As a cloud administrator, the dashboard provides an overall view of the size and state of your cloud. You can create users and tenants/projects, assign users to tenant/projects and set limits on the resources available for them.
de: Als ein Cloud-Administratoren bietet das Dashboard eine Gesamtansicht der Größe und des Zustands Ihrer Cloud. Sie können Benutzer und Tenants/Projekte erstellen, den Nutzern die Tenants/Projekte zuordnen und die für sie zur Verfügung stehenden Ressourcen beschränken.
id: Sebagai administrator awan, dasbor memberikan tampilan keseluruhan tentang ukuran dan keadaan awan Anda. Anda dapat membuat pengguna dan penyewa / proyek, menetapkan pengguna ke penyewa / proyek dan menetapkan batasan pada sumber daya yang tersedia untuk mereka.
tr_tr: Bir bulut yöneticisi olarak panel, bulutunuzun boyut ve durumunun genel bir görünümünü sağlar. Kullanıcılar ve kiracılar/projeler oluşturabilir, kullanıcıları kiracıya/projelere atayabilir ve onlar için mevcut kaynakları sınırlar koyabilirsiniz.

source: As a general practice, live migration traffic should be restricted to the management security domain, see :doc:`../introduction/security-boundaries-and-threats`. With live migration traffic, due to its plain text nature and the fact that you are transferring the contents of disk and memory of a running instance, it is recommended you further separate live migration traffic onto a dedicated network. Isolating the traffic to a dedicated network can reduce the risk of exposure.
de: Als allgemeine Praxis sollte der Live-Migrationsverkehr auf die Verwaltungssicherheitsdomäne beschränkt sein, siehe :doc:`../introduction/security-boundaries-and-threats`. Mit Live-Migrationsverkehr, aufgrund seiner Klartext-Natur und der Tatsache, dass Sie den Inhalt der Festplatte und Speicher einer laufenden Instanz übertragen, empfiehlt es sich, den Live-Migrationsverkehr weiter zu einem dedizierten Netzwerk zu trennen. Die Trennung des Verkehrs zu einem dedizierten Netzwerk kann das Risiko der Exposition verringern.
id: Sebagai praktik umum, lalu lintas migrasi langsung harus dibatasi pada domain keamanan manajemen, lihat :doc:`../introduction/security-boundaries-and-threats`. Dengan lalu lintas migrasi langsung, karena sifat teksnya yang biasa dan kenyataan bahwa Anda mentransfer isi disk dan memori instance yang berjalan, sebaiknya Anda memisahkan lalu lintas migrasi langsung ke jaringan dedicated. Mengisolasi lalu lintas ke jaringan dedicated dapat mengurangi risiko terkena exposure (pembukaan).
tr_tr: Genel bir uygulama olarak, canlı göç trafiği, yönetim güvenliği alanıyla sınırlanmalıdır, bkz. :doc:`../introduction/security-boundaries-and-threats`. Düz metin niteliğinden ve çalışan bir örneğin disk ve bellek içeriğini aktardığından canlı geçiş trafiği ile canlı geçiş trafiğini ayrılmış bir ağa daha da ayırmanız önerilir. Trafiği özel bir ağa ayırabilmek maruz kalma riskini azaltabilir.

source: As a web service, OpenStack API is susceptible to familiar web site attack vectors such as denial of service attacks.
de: Als Web-Service ist OpenStack API anfällig für vertraute Web-Angriffsvektoren wie Denial-of-Service-Angriffe.
id: Sebagai layanan web, API OpenStack rentan terhadap vektor serangan situs web yang familiar seperti serangan penolakan layanan (denial of service).
tr_tr: Bir web servisi olarak, OpenStack API, hizmet reddi saldırıları gibi tanıdık web sitesi saldırı vektörlerine karşı hassastır.

source: As an OpenStack virtual machine is a server image able to be replicated across hosts, best practice in logging applies similarly between physical and virtual hosts. Operating system-level and application-level events should be logged, including access events to hosts and data, user additions and removals, changes in privilege, and others as dictated by the environment. Ideally, you can configure these logs to export to a log aggregator that collects log events, correlates them for analysis, and stores them for reference or further action. One common tool to do this is an `ELK stack, or Elasticsearch, Logstash, and Kibana <https://www.elastic.co/>`_.
de: Als virtuelle Maschine von OpenStack ist ein Server-Abbild in der Lage, über Hosts repliziert zu werden, bewährte Praxis bei der Protokollierung gilt ähnlich zwischen physischen und virtuellen Hosts. Ereignisse auf Betriebssystemebene und auf Anwendungsebene sollten protokolliert werden, einschließlich Zugriffsereignisse für Hosts und Daten, Benutzerzugaben und Umzüge, Änderungen im Privileg und andere, wie sie von der Umgebung vorgegeben werden. Idealerweise können Sie diese Protokolle so konfigurieren, dass sie in einen Protokollaggregator exportieren, der Protokollereignisse sammelt, sie zur Analyse korreliert und sie als Referenz oder weitere Aktionen speichert. Ein gemeinsames Werkzeug, um dies zu tun ist ein `ELK Stack, oder Elasticsearch, Logstash und Kibana <https://www.elastic.co/>`_.
id: Sebagai mesin virtual OpenStack adalah image server yang dapat direplikasi di host, praktik terbaik dalam logging berlaku serupa antara host fisik dan virtual. Tingkat sistem operasi dan tingkat aplikasi harus dicatat, termasuk aktivitas akses ke host dan data, penambahan dan kepindahan pengguna, perubahan hak istimewa, dan lainnya seperti yang didikte oleh lingkungan. Idealnya, Anda dapat mengonfigurasi log ini untuk diekspor ke agregator log yang mengumpulkan peristiwa log, mengkorelasikannya untuk analisis, dan menyimpannya untuk referensi atau tindakan lebih lanjut. Salah satu alat yang umum dilakukan adalah `ELK stack, atau Elasticsearch, Logstash, dan Kibana <https://www.elastic.co/>` _.
tr_tr: Bir OpenStack sanal makinesi ana makinelerde çoğaltılabilen bir sunucu imajı olduğundan, günlükte en iyi uygulama fiziksel ve sanal ana makineler arasında benzer şekilde geçerlidir. Ana makinelere ve verilere erişim olayları, kullanıcı eklemeleri ve kaldırma işlemleri, ayrıcalık değişiklikleri ve çevre tarafından belirlenen diğer olaylar da dahil olmak üzere, işletim sistemi düzeyinde ve uygulama düzeyindeki olaylar günlüğe kaydedilmelidir. İdeal olarak, bu günlükleri, günlük olaylarını toplayan, bunları analiz için ilişkilendiren ve referans veya daha ileri eylemler için depolayan bir günlük toplayıcıya dışa aktaracak şekilde yapılandırabilirsiniz. Bunu yapmak için kullanılan ortak bir araç, `bir ELK yığını veya Elasticsearch, Logstash ve Kibana <https://www.elastic.co/>`_'dir.

source: As an administrator, you can connect through SSH to a host with ``10.254.0.3`` IP address, check the ``/etc/exports`` file on it and see that it is empty:
de: Als Administrator können Sie über SSH mit einem Host mit ``10.254.0.3``IP- Adresse verbinden, die ``/etc/exports``Datei darauf sehen und sehen, dass sie leer ist:
id: Sebagai administrator, Anda dapat terhubung melalui SSH ke host dengan alamat IP ``10.254.0.3``, periksa file ``/etc/exports`` di dalamnya dan lihat isinya kosong:
tr_tr: Yönetici olarak, SSH ile ``10.254.0.3`` IP adresine sahip bir makineye bağlanabilir, içindeki ``/etc/exports`` dosyasını kontrol edebilir ve bunun boş olduğunu görebilirsiniz:

source: As an administrator, you can create share types that enable the scheduler to filter back ends before you create a share. Share types have extra specifications that you can set for the scheduler to filter and weigh back ends so that an appropriate one is selected for a user that requests share creation. Shares and share types can be created as public or private. This level of visibility defines whether other tenants are able to see these objects and operate with them, or not. An administrator can add :ref:`access to the private share types <shared_fs_share_types_acl>` for specific users or tenants in the Identity service. Thus users which you have granted access can see available share types and create shares using them.
de: Als Administrator können Sie Freigabetypen erstellen, die es dem Scheduler ermöglichen, Backends zu filtern, bevor Sie eine Freigabe erstellen. Freigabetypen haben zusätzliche Spezifikationen, die Sie für den Scheduler festlegen können, um zu filtern und zu beenden, so dass eine geeignete für einen Benutzer ausgewählt wird, der die Freigabeerstellung anfordert. Aktien und Aktienarten können als öffentlich oder privat angelegt werden. Diese Sichtbarkeit legt fest, ob andere Tenant diese Objekte sehen und mit ihnen betreiben können oder nicht. Ein Administrator kann hinzufügen:ref:`Zugriff auf die privaten Freigabetypen <shared_fs_share_types_acl>`für bestimmte Benutzer oder Tenant im Identity Service. So können Benutzer, denen Sie Zugriff gewährt haben, verfügbare Freigabetypen anzeigen und mit ihnen Aktien erstellen.
id: Sebagai administrator, Anda dapat membuat jenis share yang memungkinkan penjadwal memfilter kembali sebelum Anda membuat share. Jenis share memiliki spesifikasi tambahan dimana Anda dapat menetapkan penjadwal penyaringan dan pembobotan back end sehingga share yang sesuai dipilih untuk pengguna yang meminta pembuatan share. Share dan tipe share bisa dibuat sebagai publik atau privat. Tingkat visibilitas ini mendefinisikan apakah penyewa lain dapat melihat object ini dan beroperasi dengan mereka, atau tidak. Administrator bisa menambahkan :ref:`access to the private share types <shared_fs_share_types_acl>` untuk pengguna atau penyewa tertentu dalam layanan Identity. Dengan demikian pengguna yang telah Anda berikan akses dapat melihat jenis share yang tersedia dan membuat share yang menggunakannya.
tr_tr: Bir yönetici olarak, bir paylaşım oluşturmadan önce zamanlayıcı tarafından bitiş noktalarını filtrelemenizi sağlayan paylaşım türleri oluşturabilirsiniz. Paylaşım türlerinin, paylaşım yaratma isteyen bir kullanıcı için uygun olanın seçilmesi için zamanlayıcıya arka uçları filtrelemek ve tartmak için ayarlayabileceğiniz ek özelliklere sahipsiniz. Paylaşımlar ve paylaşım türleri, herkese açık veya özel olarak oluşturulabilir. Bu görünürlük seviyesi, diğer kiracıların bu nesneleri görüp görmeyeceğini ve onlarla birlikte çalışıp çalışamayacaklarını belirtir. Bir yönetici, belirli kullanıcılar veya Kimlik servisindeki kiracılar için :ref:`özel paylaşım türlerine erişim <shared_fs_share_types_acl>` ekleyebilir. Böylece, erişim izni verdiğiniz kullanıcılar mevcut paylaşım türlerini görebilir ve bunları kullanarak paylaşımlar oluşturabilir.

source: As an alternative to VNC, OpenStack provides remote desktop access to guest virtual machines using the Simple Protocol for Independent Computing Environments (SPICE) protocol.
de: Als Alternative zu VNC bietet OpenStack den Remote-Desktop-Zugriff auf virtuelle Gastcomputer mit dem Protokoll "Simple Protocol for Independent Computing Environments" (SPICE).
id: Sebagai alternatif untuk VNC, OpenStack menyediakan akses remote desktop ke mesin virtual tamu menggunakan protokol Simple Protocol for Independent Computing Environments (SPICE).
tr_tr: VNC'ye alternatif olarak OpenStack, Bağımsız Hesaplama Ortamları için Basit Protokol (SPICE) protokolü kullanarak konuk sanal makinelere uzaktan masaüstü erişimi sağlar.

source: As an example, being an administrator user in admin tenant, you can create a private share type named ``my_type`` and see it in the list. In the console examples the logging in and out is omitted, and environment variables are provided to show the current logged in user.
de: Als Beispiel, als Administrator-Benutzer in Admin-Tenant können Sie einen privaten Freigabe-Typ namens ``my_type`` erstellen und in der Liste sehen. In den Konsolenbeispielen wird das Anmelden und Ausgeben weggelassen, und Umgebungsvariablen werden bereitgestellt, um den aktuell angemeldeten Benutzer anzuzeigen.
id: Sebagai contoh, sebagai pengguna administrator di penyewa admin, Anda dapat membuat jenis share privat bernama ``my_type`` dan melihatnya dalam daftar. Dalam contoh konsol, log in dan out dihilangkan, dan variabel lingkungan disediakan untuk menunjukkan pengguna yang masuk saat ini.
tr_tr: Örnek olarak, yönetici kiracısında yönetici bir kullanıcı olmak için, ``my_type`` adlı bir gizli paylaşım türü oluşturabilir ve listede görebilirsiniz. Konsol örneklerinde giriş ve çıkış işlemleri atlanmış ve geçerli oturum açmış kullanıcıyı göstermek için ortam değişkenleri sağlanmıştır.
