Repository: openstack/security-doc
Catalog: security-guide/source/locale/*/LC_MESSAGES/security-guide.po
Languages: de, id, tr_tr

source: Isolated migration network
de: Isoliertes Migrationsnetzwerk
id: Jaringan migrasi terisolasi
tr_tr: İzole göç ağı

source: It has become industry practice to use secure shell (SSH) access for the management of Linux and Unix systems. SSH uses secure cryptographic primitives for communication. With the scope and importance of SSH in typical OpenStack deployments, it is important to understand best practices for deploying SSH.
de: Es ist Industrie geworden, den sicheren Shell (SSH) Zugang für das Management von Linux- und Unix-Systemen zu nutzen. SSH verwendet sichere kryptographische Primitive für die Kommunikation. Mit dem Umfang und der Bedeutung von SSH in typischen OpenStack-Implementierungen ist es wichtig, Best Practices für den Einsatz von SSH zu verstehen.
id: Sudah menjadi praktik industri untuk menggunakan secure shell (SSH) akses untuk pengelolaan sistem Linux dan Unix. SSH menggunakan primitif kriptografi yang aman untuk komunikasi. Dengan cakupan dan pentingnya SSH dalam penerapan OpenStack yang tipikal, penting untuk memahami praktik terbaik untuk menerapkan SSH.
tr_tr: Linux ve Unix sistemlerinin yönetimi için güvenli kabuk (SSH) erişimini kullanma endüstrisi uygulaması haline gelmiştir. SSH iletişim için güvenli şifreleme ilkelleri kullanır. Tipik OpenStack dağıtımlarında SSH'nin kapsamı ve önemi ile SSH'yi dağıtmak için en iyi uygulamaların anlaşılması önemlidir.

source: It is a burden on the clients to deal with multiple tokens across multiple cloud service providers. Federated Identity provides single sign on to the user, who can use the credentials provided and maintained by the user's IdP to access many different services on the Internet.
de: Es ist eine Belastung für die Kunden, um mit mehreren Token über mehrere Cloud-Dienstleister umzugehen. Föderierte Identität bietet dem Benutzer ein einzelnes Anmeldeformular an, das die von der ID des Benutzers bereitgestellten und gepflegten Anmeldeinformationen nutzen kann, um auf viele verschiedene Dienste im Internet zuzugreifen.
tr_tr: Birden fazla bulut servis sağlayıcıda birden fazla belirteç ile uğraşmak, müşterilerin üzerinde bir yük oluşturuyor. Federe Kimlik, İnternet'te birçok farklı servise erişmek için kullanıcının IdP tarafından sağlanan ve bakımı yapılan kimlik bilgilerini kullanabilen kullanıcıya tekli oturum açma olanağı sunar.

source: It is also recommended the following ``Contact`` options are set.
de: Es wird auch empfohlen, die folgenden ``Contact``Optionen zu setzen.
tr_tr: Aşağıdaki ``Contact`` seçeneklerinin de ayarlanması önerilir.

source: It is an extensible :term:`Django` web application that allows easy plug-in of third-party products and services, such as billing, monitoring, and additional management tools.
de: Es ist eine erweiterbare :term:`Django` Web-Anwendung, die einfaches Plug-in von Drittanbieter-Produkten und -Dienstleistungen wie Abrechnung, Überwachung und zusätzliche Management-Tools ermöglicht.
id: Ini adalah aplikasi web :term:`Django` extensible yang memungkinkan kemudahan plug-in produk dan layanan pihak ketiga, seperti penagihan, pemantauan, dan alat manajemen tambahan.
tr_tr: Bu, faturalandırma, izleme ve ek yönetim araçları gibi üçüncü parti ürünlerin ve hizmetlerin kolayca eklenmesine izin veren genişletilebilir bir :term:`Django` web uygulamasıdır.

source: It is assumed that the ``keystone`` service is running on port ``5000``.
de: Es wird davon ausgegangen, dass der ``Keystone``Service auf Port ``5000`` läuft.
tr_tr: ``keystone`` servisinin ``5000`` portunda çalıştığı varsayılır.

source: It is generally accepted that it is best to encrypt sensitive data as early as possible and decrypt it as late as possible. Despite this best practice, it seems that it's common to use a SSL/TLS proxy in front of the OpenStack services and use clear communication afterwards as shown below:
de: Es ist allgemein anerkannt, dass es am besten ist, sensible Daten so früh wie möglich zu verschlüsseln und so spät wie möglich zu entschlüsseln. Trotz dieser bewährten Praxis scheint es, dass es üblich ist, einen SSL/TLS-Proxy vor den OpenStack-Diensten zu verwenden und nachher eine klare Kommunikation zu verwenden:
id: Umumnya diterima bahwa yang terbaik adalah mengenkripsi data sensitif sedini mungkin dan mendekripsinya selambat mungkin. Meskipun ada praktik terbaik ini, nampaknya umum menggunakan proxy SSL/TLS di depan layanan OpenStack dan menggunakan komunikasi yang jelas setelahnya seperti yang ditunjukkan di bawah ini:
tr_tr: Genel olarak, hassas veriyi olabildiğince erken şifrelemek ve olabildiğince geç şifresini çözmek en iyisidir. Bu en iyi uygulamaya rağmen, OpenStack servislerinin önünde bir SSL/TLS vekil kullanmanın ve daha sonra aşağıda gösterilen net iletişimin yaygın olduğu görünüyor:

source: It is highly recommended that OpenStack deployments have information similar to this on record. The table can be created from information derived from a CMDB or can be constructed manually.
de: Es wird dringend empfohlen, dass OpenStack-Bereitstellungen über ähnliche Informationen verfügen. Die Tabelle kann aus Informationen erstellt werden, die von einer CMDB abgeleitet sind, oder kann manuell erstellt werden.
id: Sangat disarankan agar pengerahan OpenStack memiliki informasi yang serupa dengan catatan ini. Tabel dapat dibuat dari informasi yang berasal dari CMDB atau dapat dibangun secara manual.

source: It is highly recommended to use HTTP Strict Transport Security (HSTS).
de: Es wird dringend empfohlen, HTTP Strict Transport Security (HSTS) zu verwenden.
id: Hal ini sangat dianjurkan untuk digunakan HTTP Strict Transport Security (HSTS).
tr_tr: HTTP Sıkı Taşıma Güvenliği (HSTS) kullanmanız şiddetle tavsiye edilir.

source: It is important to consider the placement of the Network IDS on the cloud (for example, adding it to the network boundary and/or around sensitive networks). The placement depends on your network environment but make sure to monitor the impact the IDS may have on your services depending on where you choose to add it. Encrypted traffic, such as TLS, cannot generally be inspected for content by a Network IDS. However, the Network IDS may still provide some benefit in identifying anomalous unencrypted traffic on the network.
de: Es ist wichtig, die Platzierung der Netzwerk-IDS auf der Cloud zu betrachten (z. B. Hinzufügen zur Netzwerkgrenze und/oder um sensible Netzwerke). Die Platzierung hängt von Ihrer Netzwerkumgebung ab, aber stellen Sie sicher, dass Sie die Auswirkungen der IDS auf Ihre Dienste überwachen können, je nachdem, wo Sie es hinzufügen möchten. Verschlüsselter Verkehr, wie TLS, kann im Allgemeinen nicht von einem Netzwerk-IDS auf Inhalte geprüft werden. Allerdings kann die Netzwerk-IDS noch einige Vorteile bei der Identifizierung von anomalen unverschlüsselten Verkehr auf dem Netzwerk.
id: Penting untuk mempertimbangkan penempatan Network IDS di atas awan (misalnya, menambahkannya ke batas jaringan dan / atau jaringan sensitif). Penempatan tergantung pada lingkungan jaringan Anda namun pastikan untuk memantau dampak IDS terhadap layanan Anda bergantung pada tempat Anda memilih untuk menambahkannya. Lalu lintas terenkripsi, seperti TLS, biasanya tidak dapat diperiksa untuk konten oleh Network IDS. Namun, Network IDS masih dapat memberikan beberapa keuntungan dalam mengidentifikasi lalu lintas anomali yang tidak terenkripsi pada jaringan.
tr_tr: Network IDS'in bulut üzerinde yerleştirilmesini göz önünde bulundurmak önemlidir (örneğin, ağ sınırına ve / veya hassas ağların çevresine eklenmesi). Yerleşim, ağ ortamınıza bağlıdır, ancak nerede eklemek istediğinize bağlı olarak IDS'nin servisleriniz üzerindeki etkisini izlediğinizden emin olun. TLS gibi şifreli trafik, genel olarak bir Ağ Kimliği tarafından içeriğe denetlenemez. Bununla birlikte, Network IDS, ağdaki anormal şifrelenmemiş trafiği tanımlamada yine de bir miktar fayda sağlayabilir.

source: It is important to include backup procedures and policies in the overall System Security Plan. For a good overview of OpenStack's Backup and Recovery capabilities and procedures, refer to the `OpenStack Operations Guide on backup and recovery <https://docs.openstack.org/openstack-ops/content/backup_and_recovery.html>`__.
de: Es ist wichtig, Sicherungsprozeduren und Richtlinien in den Gesamtsystem des System Security Plan einzubeziehen. Einen guten Überblick über die Backup- und Recovery-Fähigkeiten und -Verfahren von OpenStack finden Sie im `OpenStack Operations Guide zur Sicherung und Wiederherstellung <https://docs.openstack.org/openstack-ops/content/backup_and_recovery.html>`__.

source: It is important to note that use of the Xen memory balloon feature is likely to result in information disclosure. We strongly recommended to avoid use of this feature.
de: Es ist wichtig zu beachten, dass die Verwendung der Xen-Speicher-Ballon-Funktion wahrscheinlich zu Offenlegung von Informationen führen wird. Wir empfehlen dringend, diese Funktion zu vermeiden.
id: Penting untuk dicatat bahwa penggunaan fitur balon memori Xen cenderung menghasilkan keterbukaan informasi. Kami sangat disarankan untuk menghindari penggunaan fitur ini.
tr_tr: Xen hafıza balon özelliğinin kullanılması bilgilerin ifşa edilmesine yol açması muhtemel olduğunu belirtmek önemlidir. Bu özelliğin kesinlikle kullanılmamasını öneriyoruz.

source: It is important to protect the cloud deployment from being configured or manipulated by malicious entities. With many systems in a cloud employing compute and networking virtualization, there are distinct challenges applicable to OpenStack which must be addressed through integrity lifecycle management.
de: Es ist wichtig, die Cloud-Bereitstellung vor der Konfiguration oder Manipulation durch böswillige Entitäten zu schützen. Mit vielen Systemen in einer Cloud, die eine Compute- und Networking-Virtualisierung einsetzen, gibt es für OpenStack unterschiedliche Herausforderungen, die durch das Integrity Lifecycle Management angesprochen werden müssen.
id: Penting untuk melindungi pengerahan awan agar tidak dikonfigurasi atau dimanipulasi oleh entitas jahat. Dengan banyak sistem di awan yang menggunakan komputasi dan virtualisasi jaringan, ada tantangan yang berbeda yang berlaku untuk OpenStack yang harus ditangani melalui manajemen siklus hidup integritas.
tr_tr: Bulut dağıtımının kötü amaçlılar tarafından yapılandırılmasını veya yönlendirilmesini önlemek önemlidir. Hesaplama ve ağ sanallaştırma kullanılan bir bulutta birçok sistemde, OpenStack için uygulanabilir ve bütünlük ömrü yönetimi ile ele alınması gereken farklı zorluklar vardır.

source: It is important to recognize the difference between using Linux Containers (LXC) or bare metal systems versus using a hypervisor like KVM. Specifically, the focus of this security guide is largely based on having a hypervisor and virtualization platform. However, should your implementation require the use of a baremetal or LXC environment, you must pay attention to the particular differences in regard to deployment of that environment.
de: Es ist wichtig, den Unterschied zwischen der Verwendung von Linux-Containern (LXC) oder Bare-Metal-Systemen im Vergleich zu einem Hypervisor wie KVM zu erkennen. Im Einzelnen basiert der Schwerpunkt dieses Sicherheitsleitfadens weitgehend auf einer Hypervisor- und Virtualisierungsplattform. Wenn jedoch Ihre Implementierung die Verwendung einer Baremetal- oder LXC-Umgebung erfordert, müssen Sie auf die besonderen Unterschiede in Bezug auf den Einsatz dieser Umgebung achten.
id: Penting untuk mengenali perbedaan antara penggunaan Linux Containers (LXC) atau sistem baremetal versus menggunakan hypervisor seperti KVM. Secara khusus, fokus panduan keamanan ini sebagian besar didasarkan pada platform hypervisor dan virtualisasi. Namun, jika penerapan Anda memerlukan penggunaan lingkungan baremetal atau LXC, Anda harus memperhatikan perbedaan tertentu sehubungan dengan penyebaran lingkungan itu.
tr_tr: Linux Kapsayıcıları (LXC) veya düz sistemleri ile KVM gibi bir hipervizör kullanmak arasındaki farkı bilmek önemlidir. Özellikle, bu güvenlik kılavuzunun odak noktası büyük ölçüde bir hipervizör ve sanallaştırma platformuna sahip olmaya dayanmaktadır. Bununla birlikte, uygulamanız bir düz ortam veya LXC ortamı gerektirdiğinde, o ortamın kurulmasıyla ilgili belirli farklılıklara dikkat etmeniz gerekir.

source: It is important to review the default networking resource policy, as this policy can be modified to suit your security posture.
de: Es ist wichtig, die standardmäßige Netzwerkressourcenrichtlinie zu überprüfen, da diese Richtlinie für Ihre Sicherheitsanpassung geändert werden kann.
id: Penting untuk meninjau ulang kebijakan sumber daya jaringan default, karena kebijakan ini dapat diubah agar sesuai dengan postur keamanan Anda.
tr_tr: Varsayılan ağ kaynak ilkesini gözden geçirmeniz önemlidir, çünkü bu ilke güvenlik durumunuza göre değiştirilebilir.

source: It is important to take proactive steps to harden QEMU. We recommend three specific steps:
de: Es ist wichtig, proaktive Schritte zu unternehmen, um QEMU zu verhärten. Wir empfehlen drei spezifische Schritte:
id: Penting untuk mengambil langkah proaktif untuk mengeras QEMU. Kami merekomendasikan tiga langkah spesifik:
tr_tr: QEMU'nun sıkılaştırılması için proaktif adımlar atmanız önemlidir. Üç özel adım önermekteyiz:

source: It is important to understand that object storage differs from traditional file system storage. Object storage is best used for static data such as media files (MP3s, images, or videos), virtual machine images, and backup files.
de: Es ist wichtig zu verstehen, dass die Objektspeicherung vom traditionellen Dateisystemspeicher abweicht. Es wird am besten für statische Daten wie Mediendateien (MP3s, Bilder, Videos), virtuelle Maschinenabbilder und Backup-Dateien verwendet.
id: Penting untuk dipahami bahwa penyimpanan objek berbeda dari penyimpanan sistem file tradisional. Penyimpanan objek paling baik digunakan untuk data statis seperti file media (MP3, image, atau video), image mesin virtual, dan file cadangan.

source: It is key that the operator carefully plans and considers the individual performance needs of users and services within their OpenStack cloud when configuring and implementing any rate limiting functionality.
de: Es ist entscheidend, dass der Betreiber die individuellen Leistungsbedürfnisse von Nutzern und Diensten innerhalb ihrer OpenStack-Cloud sorgfältig plant und berücksichtigt, wenn er eine Geschwindigkeitsbegrenzungsfunktionalität konfiguriert und implementiert.
id: Adalah kunci bahwa operator dengan hati-hati merencanakan dan mempertimbangkan kebutuhan kinerja individual pengguna dan layanan di dalam awan OpenStack mereka saat mengkonfigurasi dan menerapkan fungsi rate limiting.
tr_tr: Operatör için, OpenStack bulut ortamında oran sınırlama özelliğini yapılandırırken ve gerçekleştirirken kullanıcı ve servislerin ihtiyaçlarına göre planlama yapma ve performanslarını değerlendirme çok önemlidir.

source: It is necessary for administrators to perform command and control over the cloud for various operational functions. It is important these command and control facilities are understood and secured.
de: Es ist notwendig für Administratoren, Befehl und Kontrolle über die Cloud für verschiedene operative Funktionen durchzuführen. Es ist wichtig, dass diese Befehls- und Kontrolleinrichtungen verstanden und gesichert sind.
id: Hal ini diperlukan agar administrator melakukan komando dan kontrol atas awan untuk berbagai fungsi operasional. Penting agar fasilitas komando dan kontrol ini dipahami dan dijamin.
tr_tr: Yöneticilerin çeşitli operasyonel işlevler için bulut üzerinde komuta ve denetim yapması gereklidir. Bu kumanda ve kontrol tesislerinin anlaşılması ve güvence altına alınması önemlidir.

source: It is now possible (though there are numerous deployment/security implications) to upload an image file directly from a user's hard disk to OpenStack Image service through the dashboard. For multi-gigabyte images it is still strongly recommended that the upload be done using the ``glance`` CLI.
de: Es ist jetzt möglich (obwohl es zahlreiche Implementierungs-/ Sicherheitsimplikationen gibt), um eine Abbilddatei direkt von der Festplatte eines Benutzers auf den OpenStack Image Service über das Dashboard hochzuladen. Für Multi-Gigabyte-Abbilder ist es immer noch dringend empfohlen, dass der Upload mit dem ``glance``CLI durchgeführt wird.
id: Sekarang mungkin (meskipun ada banyak penerapan / implikasi keamanan) untuk mengunggah file image langsung dari hard disk pengguna ke layanan OpenStack Image melalui dasbor. Untuk image multi-gigabyte masih sangat disarankan agar upload dilakukan dengan menggunakan CLI ``glance`.
tr_tr: Bir imaj dosyasını kullanıcının sabit diskinden doğrudan panel aracılığıyla OpenStack Image hizmetine yüklemek mümkün (çok sayıda dağıtım/güvenlik etkisi olmasına rağmen) mümkündür. Çok gigabayt imajlarda, yüklemenin ``glance`` CLI kullanılarak yapılması önerilir.

source: It is our recommendation to leverage per tenant L3 routing and Floating IPs for more granular connectivity of tenant VMs.
de: Es ist unsere Empfehlung, pro Tenant L3 Routing und Floating IPs für mehr granulare Konnektivität von Tenant VMs zu nutzen.
id: Ini adalah rekomendasi kami untuk memanfaatkan per tenant L3 routing dan Floating IP untuk konektivitas granular tenant VM yang lebih terperinci.
tr_tr: Kiracı VM'lerin daha ayrıntılı bağlantısı için kiracı L3 yönlendirmesi ve Yüzen IP'ler için kaldıracı kullanmamız önerilir.

source: It is possible to have separate drivers for different modes use the same hardware, if you want to have different configurations. Depending on which mode is chosen, an administrator may need to provide more configuration details through the configuration file.
de: Es ist möglich, separate Treiber für verschiedene Modi zu verwenden, die dieselbe Hardware verwenden, wenn man verschiedene Konfigurationen haben möchte. Abhängig davon, welcher Modus gewählt wird, muss ein Administrator möglicherweise mehr Konfigurationsdetails über die Konfigurationsdatei bereitstellen.
id: Hal ini dimungkinkan untuk memiliki driver terpisah untuk mode yang berbeda menggunakan perangkat keras yang sama, jika Anda ingin memiliki konfigurasi yang berbeda. Bergantung pada mode mana yang dipilih, administrator mungkin perlu memberikan rincian konfigurasi lebih banyak melalui file konfigurasi.
tr_tr: Farklı yapılandırmalara sahip olmak istiyorsanız, farklı modlar için ayrı sürücülerin aynı donanımı kullanması mümkündür. Hangi kip seçildiğine bağlı olarak, bir yönetici yapılandırma dosyası aracılığıyla daha fazla yapılandırma ayrıntısı sağlamalıdır.

source: It is recommended that the OpenStack cloud architect consider using separate PKI deployments for internal systems and customer facing services. This allows the cloud deployer to maintain control of their PKI infrastructure and among other things makes requesting, signing and deploying certificates for internal systems easier. Advanced configurations may use separate PKI deployments for different security domains. This allows deployers to maintain cryptographic separation of environments, ensuring that certificates issued to one are not recognized by another.
de: Es empfiehlt sich, dass der OpenStack Cloud Architekt die Verwendung von separaten PKI-Implementierungen für interne Systeme und Kundenbereitstellung berücksichtigt. Damit kann der Cloud-Deployer die Kontrolle über ihre PKI-Infrastruktur beibehalten und unter anderem das Anfordern, Signieren und Bereitstellen von Zertifikaten für interne Systeme erleichtern. Erweiterte Konfigurationen können separate PKI-Bereitstellungen für verschiedene Sicherheitsdomänen verwenden. Dies ermöglicht es den Mitarbeitern, eine kryptographische Trennung von Umgebungen aufrechtzuerhalten, um sicherzustellen, dass Zertifikate, die an eine Ausgabe ausgegeben werden, nicht von einem anderen erkannt werden.
id: Dianjurkan agar arsitek awan OpenStack mempertimbangkan untuk menggunakan penerapan PKI terpisah untuk sistem internal dan layanan yang dihadapi pelanggan. Hal ini memungkinkan deployer awan untuk mengendalikan infrastruktur PKI mereka dan antara lain membuat permintaan, penandatanganan dan penggelaran sertifikat untuk sistem internal menjadi lebih mudah. Konfigurasi lanjutan dapat menggunakan penerapan PKI yang terpisah untuk domain keamanan yang berbeda. Hal ini memungkinkan deployer untuk menjaga pemisahan kriptografi lingkungan, memastikan bahwa sertifikat yang dikeluarkan untuk satu tidak dikenali pihak lain.
tr_tr: OpenStack bulut mimarının dahili sistemler ve müşterilere yönelik servisler için ayrı PKI dağıtımları kullanmayı düşünmesi önerilir. Bu, bulut kurucusunun PKI altyapısının kontrolünü elinde tutmasına ve diğer şeylerin yanısıra dahili sistemler için sertifika talep etme, imzalama ve dağıtmayı kolaylaştırır. Gelişmiş yapılandırmalar, farklı güvenlik etki alanları için ayrı PKI dağıtımları kullanabilir. Bu, uygulayıcıların, birine verilen sertifikaların başka biri tarafından tanınmadığından emin olarak, ortamların kriptografik ayrımını sürdürebilmelerini sağlar.

source: It is recommended that the following ``Organization`` configuration options be setup.
de: Es wird empfohlen, die folgenden ``Organization`` Konfigurationsoptionen einzurichten.
tr_tr: Aşağıdaki ``Organization`` yapılandırma seçeneklerinin kurulması önerilir.

source: It is recommended that you configure the Shared File Systems service to run under a non-root service account, and change file permissions so that only the system administrator can modify them. The Shared File Systems service expects that only administrators can write to configuration files and services can only read them through their group membership in ``manila`` group. Others must not be able to read these files because the files contain admin passwords for different services.
de: Es wird empfohlen, dass Sie den Dienst Shared File Systems konfigurieren, um unter einem Nicht-Root-Dienstkonto ausgeführt zu werden, und ändern Sie Dateizugriffsrechte, sodass nur der Systemadministrator sie ändern kann. Der Shared File Systems Service erwartet, dass nur Administratoren in Konfigurationsdateien schreiben können und Dienste nur über ihre Gruppenmitgliedschaft in ``manila``Gruppe lesen können. Andere dürfen diese Dateien nicht lesen können, da die Dateien Admin-Passwörter für verschiedene Dienste enthalten.
id: Disarankan agar Anda mengkonfigurasi layanan Shared File Systems agar berjalan di bawah akun layanan non-root, dan mengubah perizinan file sehingga hanya administrator sistem yang dapat memodifikasinya. Layanan Shared File Systems mengharapkan bahwa hanya administrator yang dapat menulis ke file konfigurasi dan layanan hanya dapat membacanya melalui keanggotaan grup mereka di grup ``manila``. Yang lain tidak boleh bisa membaca file ini karena file tersebut mengandung kata sandi admin untuk berbagai layanan.
tr_tr: Paylaşımlı Dosya Sistemleri servisini root olmayan bir servis hesabı altında çalışacak şekilde yapılandırmanız ve dosya izinlerini yalnızca sistem yöneticisinin değiştirebilmesi için değiştirmeniz önerilir. Paylaşımlı Dosya Sistemleri servisi, yalnızca yöneticilerin yapılandırma dosyalarına yazabileceğini ve servislerin yalnızca grup üyeliği yoluyla bunları ``manila`` grubunda okuyabileceğini beklemektedir. Dosyalar, farklı servisler için yönetici parolalarını içerdiğinden diğerleri bu dosyaları okuyamamalıdır.
