Repository: openstack/security-doc
Catalog: security-guide/source/locale/*/LC_MESSAGES/security-guide.po
Languages: de, id, tr_tr

source: Most API endpoints and other HTTP services in OpenStack use the Python Paste Deploy library. From a security perspective, this library enables manipulation of the request filter pipeline through the application's configuration. Each element in this chain is referred to as *middleware*. Changing the order of filters in the pipeline or adding additional middleware might have unpredictable security impact.
de: Die meisten API-Endpunkte und andere HTTP-Dienste in OpenStack verwenden die Python-Paste-Bereitstellungsbibliothek. Aus Sicherheitsgründen ermöglicht diese Bibliothek die Manipulation der Anforderungsfilterpipeline durch die Konfiguration der Applikation. Jedes Element in dieser Kette wird als *Middleware* bezeichnet. Das Ändern der Reihenfolge der Filter in der Pipeline oder das Hinzufügen zusätzlicher Middleware kann unvorhersehbare Sicherheitsauswirkungen haben.
id: Sebagian besar endpoint API dan layanan HTTP lainnya di OpenStack menggunakan pustaka Python Paste Deploy. Dari perspektif keamanan, perpustakaan ini memungkinkan manipulasi aliran filter permintaan melalui konfigurasi aplikasi. Setiap elemen dalam rantai ini disebut sebagai *middleware *. Mengubah urutan filter dalam pipa atau menambahkan middleware tambahan mungkin memiliki dampak keamanan yang tidak dapat diprediksi.
tr_tr: OpenStack'teki çoğu API uç noktası ve diğer HTTP servisleri Python Paste Deploy kitaplığı kullanır. Güvenlik açısından, bu kitaplık uygulamanın yapılandırmasından istek filtre hattını değiştirmeyi etkinleştirir. Zincirdeki her bir öge *ara katman* olarak adlandırılır. Hattaki filtrelerin sırasını değiştirmek ya da ek ara katman eklemek beklenmeyen güvenlik sonuçlarına yol açabilir.

source: Most cloud deployments will not build software, such as QEMU, by hand. It is better to use packaging to ensure that the process is repeatable and to ensure that the end result can be easily deployed throughout the cloud. The references below provide some additional details on applying compiler hardening options to existing packages.
de: Die meisten Cloud-Implementierungen werden keine Software wie QEMU von Hand erstellen. Es ist besser, die Pakete zu verwenden, um sicherzustellen, dass der Prozess wiederholbar ist und um sicherzustellen, dass das Endergebnis in der ganzen Cloud leicht eingesetzt werden kann. Die nachfolgenden Referenzen geben einige zusätzliche Details zur Anwendung von Compiler-Härtungsoptionen auf bestehende Pakete.
id: Sebagian besar penyebaran awan tidak akan membangun perangkat lunak, seperti QEMU, dengan tangan. Lebih baik menggunakan kemasan untuk memastikan prosesnya berulang dan untuk memastikan bahwa hasil akhirnya dapat dengan mudah digunakan di seluruh awan. Referensi di bawah ini memberikan beberapa rincian tambahan tentang penerapan opsi pengerasan kompiler ke paket yang ada.
tr_tr: Çoğu bulut dağıtımı elle QEMU gibi bir yazılım oluşturmaz. İşlemin tekrarlanabilir olmasını sağlamak ve sonuçların bulut boyunca kolayca dağıtılmasını sağlamak için paket kullanmak daha iyidir. Aşağıdaki referanslar, mevcut paketlere derleyici sıkılaştırma seçeneklerinin uygulanmasıyla ilgili ek ayrıntılar sunmaktadır.

source: Most common operating systems include host-based firewalls for additional security. While we recommend that virtual machines run as few applications as possible (to the point of being single-purpose instances, if possible), all applications running on a virtual machine should be profiled to determine what system resources the application needs access to, the lowest level of privilege required for it to run, and what the expected network traffic is that will be going into and coming from the virtual machine. This expected traffic should be added to the host-based firewall as allowed traffic (or whitelisted), along with any necessary logging and management communication such as SSH or RDP. All other traffic should be explicitly denied in the firewall configuration.
de: Die meisten gängigen Betriebssysteme umfassen Host-basierte Firewalls für zusätzliche Sicherheit. Während wir empfehlen, dass virtuelle Maschinen so viele Anwendungen wie möglich ausführen (sobald es Einzelfallinstanzen sind), sollten alle Anwendungen, die auf einer virtuellen Maschine laufen, profiliert werden, um festzustellen, auf welche Systemressourcen die Anwendung Zugriff haben muss, die niedrigste Ebene der Privilegien, damit sie läuft, und was der erwartete Netzwerkverkehr zu und von der virtuellen Maschine ist. Dieser erwartete Verkehr sollte der Host-basierten Firewall hinzugefügt werden, den den Verkehr erlaubt (oder Whitelist), zusammen mit jeder notwendigen Protokollierung und Management-Kommunikation wie SSH oder RDP. Jeder andere Verkehr sollte explizit in der Firewall-Konfiguration verweigert werden.
id: Sistem operasi yang paling umum mencakup firewall berbasis host untuk keamanan tambahan. Meskipun kami menyarankan agar mesin virtual menjalankan aplikasi sesedikit mungkin (sampai pada titik tujuan tunggal, jika mungkin), semua aplikasi yang berjalan pada mesin virtual harus diprofilkan untuk menentukan sumber daya sistem yang dibutuhkan akses aplikasi, yang terendah tingkat hak istimewa yang dibutuhkan agar bisa berjalan, dan lalu lintas lalu lintas yang diharapkan akan masuk dan masuk dari mesin virtual. Lalu lintas yang diharapkan ini harus ditambahkan ke firewall berbasis host sebagai lalu lintas yang diizinkan (atau masuk whitelisted), bersamaan dengan komunikasi logging dan manajemen yang diperlukan seperti SSH atau RDP. Semua lalu lintas lainnya harus ditolak secara eksplisit dalam konfigurasi firewall.
tr_tr: En yaygın işletim sistemleri, ek güvenlik için sunucu tabanlı güvenlik duvarlarını içerir. Sanal makinelerin olabildiğince az sayıda uygulama (mümkünse tek amaçlı örnek olması açısından) çalıştırmamızı öneririz, ancak sanal makinede çalışan tüm uygulamalar, uygulamanın hangi sistem kaynaklarına erişmesi gerektiğini belirlemek için profillendirilmelidir; en düşük çalıştırılabilmesi için gereken ayrıcalık düzeyini ve sanal makineye giden ve gelen sanal trafik nedir. Bu beklenen trafik, SSH veya RDP gibi gerekli günlük kaydı ve yönetim iletişimiyle birlikte, izin verilen trafik (veya beyaz listeye eklenmiş olarak) olarak sunucu tabanlı güvenlik duvarına eklenmelidir. Tüm diğer trafik, güvenlik duvarı yapılandırmasında açıkça reddedilmelidir.

source: Most likely, the most important aspect in hypervisor selection is the expertise of your staff in managing and maintaining a particular hypervisor platform. The more familiar your team is with a given product, its configuration, and its eccentricities, the fewer the configuration mistakes. Additionally, having staff expertise spread across an organization on a given hypervisor increases availability of your systems, allows segregation of duties, and mitigates problems in the event that a team member is unavailable.
de: Wahrscheinlich ist der wichtigste Aspekt bei der Hypervisor-Auswahl das Fachwissen Ihrer Mitarbeiter bei der Verwaltung und Pflege einer bestimmten Hypervisor-Plattform. Je vertrauter Ihr Team mit einem gegebenen Produkt, seiner Konfiguration und seinen Exzentrizitäten ist, desto weniger Konfigurationsfehler. Darüber hinaus, mit Personal-Know-how verteilt über eine Organisation auf einem bestimmten Hypervisor erhöht die Verfügbarkeit Ihrer Systeme, ermöglicht die Trennung von Aufgaben und lindert Probleme für den Fall, dass ein Teammitglied nicht verfügbar ist.
id: Kemungkinan besar, aspek terpenting dalam pemilihan hypervisor adalah keahlian staf Anda dalam mengelola dan memelihara platform hypervisor tertentu. Semakin akrab tim Anda dengan produk tertentu, konfigurasinya, dan eksentrisitasnya, semakin sedikit kesalahan konfigurasi. Selain itu, memiliki keahlian staf yang tersebar di seluruh organisasi pada hypervisor tertentu meningkatkan ketersediaan sistem Anda, memungkinkan pemisahan tugas, dan mengurangi masalah jika anggota tim tidak tersedia.
tr_tr: Büyük olasılıkla, hipervizör seçiminde en önemli husus, personelinizin belirli bir hipervizör platformunu yönetme ve yönetme konusundaki uzmanlığıdır. Ekibinizin belli bir ürün, yapılandırma ve dışmerkezlikleri ile daha fazla tanıdıkça, yapılandırma hataları o kadar az olur. Ek olarak, belirli bir hipervizör üzerinde bir organizasyona yayılmış personel uzmanlığına sahip olmak, sistemlerinizin kullanılabilirliğini artırır, görevlerin ayrımlaşmasını sağlar ve bir ekip üyesinin kullanılamaması durumunda sorunları azaltır.

source: Most types of cloud deployment, public or private, are exposed to some form of attack. In this chapter we categorize attackers and summarize potential types of attacks in each security domain.
de: Die meisten Arten von Cloud-Bereitstellung, öffentlich oder privat, sind einer Form von Angriff ausgesetzt. In diesem Kapitel kategorisieren wir Angreifer und fassen mögliche Angriffsarten in jeder Sicherheitsdomäne zusammen.
id: Sebagian besar jenis penyebaran awan, publik atau private, terkena beberapa bentuk serangan. Dalam bab ini kami mengkategorikan penyerang dan meringkas jenis serangan potensial di setiap domain keamanan.
tr_tr: Birçok bulut yayına alma türü, genel veya özel, bazı saldırı şekillerine maruz kalır. Bu bölümde, saldırganları kategorize edecek ve her bir güvenlik alanındaki olası saldırı türlerini özetleyeceğiz.

source: Motivated individuals
de: Motivierte Personen
id: Individu termotivasi
tr_tr: Motive edilmiş kişiler

source: Multi-factor authentication
de: Multi-Faktor-Authentifizierung
id: Autentikasi mult-faktor
tr_tr: Çok etmenli kimlik doğrulama

source: Multiple filters can be applied at once, such as the ``ServerGroupAffinity`` filter to ensure an instance is created on a member of a specific set of hosts and ``ServerGroupAntiAffinity`` filter to ensure that same instance is not created on another specific set of hosts. These filters should be analyzed carefully to ensure they do not conflict with each other and result in rules that prevent the creation of instances.
de: Es können mehrere Filter gleichzeitig angewendet werden, z.B. den `` ServerGroupAffinity``-Filter, um sicherzustellen, dass eine Instanz auf einem Mitglied eines bestimmten Satzes von Hosts und `` ServerGroupAntiAffinity``-Filter erstellt wird, um sicherzustellen, dass dieselbe Instanz nicht auf einem anderen spezifisch Satz von Hosts erstellt wird. Diese Filter sollten sorgfältig analysiert werden, um sicherzustellen, dass sie nicht miteinander in Konflikt stehen und zu Regeln führen, die die Erstellung von Instanzen verhindern.
id: Beberapa filter dapat diterapkan sekaligus, seperti filter ``ServerGroupAffinity`` untuk memastikan sebuah instance dibuat pada anggota host tertentu dan filter `ServerGroupAntiAffinity`` untuk memastikan bahwa instance yang sama tidak dibuat pada set host spesifik yang lain. Filter ini harus dianalisis dengan seksama untuk memastikan mereka tidak saling bertentangan dan menghasilkan peraturan yang mencegah pembuatan instance.
tr_tr: Bir örneği belirli bir sunucu grubunun bir üyesinde oluşturulmasını sağlamak için ``ServerGroupAffinity`` süzgeci ve aynı örneği başka bir spesifik bir grupta yaratılmamasını sağlamak için ``ServerGroupAntiAffinity`` süzgeci gibi birden fazla filtre aynı anda uygulanabilir. Bu filtreler birbirleriyle çakışmamalarını ve örneklerin oluşturulmasını engelleyen kurallarla sonuçlanmasını sağlamak için dikkatli bir şekilde analiz edilmelidir.

source: MySQL SSL configuration
de: MySQL SSL Konfiguration
id: Konfigurasi SSL MySQL
tr_tr: MySQL SSL yapılandırması

source: MySQL database service
de: MySQL-Datenbankdienst
id: Layanan database MySQL
tr_tr: MySQL veritabanı servisi

source: MySQL has a large community, widespread adoption, and provides high availability options. MySQL also has the ability to provide enhanced client authentication by way of plug-in authentication mechanisms. Forked distributions in the MySQL community provide many options for consideration. It is important to choose a specific implementation of MySQL based on a thorough evaluation of the security posture and the level of support provided for the given distribution.
de: MySQL hat eine große Community, weit verbreitete Adoption und bietet Hochverfügbarkeitsoptionen. MySQL hat auch die Möglichkeit, eine verbesserte Client-Authentifizierung über Plug-In-Authentifizierungsmechanismen bereitzustellen. Forked Distributionen in der MySQL-Community bieten viele Optionen für die Betrachtung. Es ist wichtig, eine spezifische Implementierung von MySQL zu wählen, die auf einer gründlichen Bewertung der Sicherheitssituation und der Höhe der Unterstützung für die gegebene Distribution basiert.
id: MySQL memiliki komunitas besar, adopsi yang luas, dan menyediakan pilihan ketersediaan tinggi. MySQL juga memiliki kemampuan untuk menyediakan otentikasi klien yang disempurnakan dengan cara mekanisme otentikasi plug-in. Forked distribution di komunitas MySQL memberikan banyak pilihan untuk dipertimbangkan. Penting untuk memilih implementasi spesifik dari MySQL berdasarkan evaluasi menyeluruh terhadap postur keamanan dan tingkat dukungan yang diberikan untuk distribusi yang diberikan.
tr_tr: MySQL büyük bir topluluğa, yaygın bir şekilde benimsenmeye ve yüksek kullanılabilirlik seçeneklerine sahiptir. MySQL ayrıca, eklenti kimlik doğrulama mekanizmaları yoluyla geliştirilmiş istemci kimlik doğrulama olanağı da vardır. MySQL topluluğundaki çatallı dağıtımlar, dikkate alınması için birçok seçenek sunar. Güvenlik durumunun ve verilen dağıtım için sağlanan desteğin kapsamlı bir değerlendirmesine dayalı olarak belirli bir MySQL uygulaması seçmek önemlidir.

source: NIST defines a community cloud as one whose infrastructure is provisioned for the exclusive use by a specific community of consumers from organizations that have shared concerns (for example, mission, security requirements, policy, or compliance considerations). The cloud might be owned, managed, and operated by one or more of organizations in the community, a third-party, or some combination of them, and it may exist on or off premises.
de: NIST definiert eine Community-Cloud als eine Community, deren Infrastruktur für die ausschließliche Verwendung durch eine bestimmte Community von Kunden aus Organisationen bereitgestellt wird, die Bedenken geteilt haben (z. B. Mission, Sicherheitsanforderungen, Richtlinien oder Compliance-Überlegungen). Die Cloud kann im Besitz von einer oder mehreren Organisationen in der Community, einem Drittanbieter oder einer Kombination von ihnen sein, von ihnen verwaltet und betrieben werden, und sie kann in oder außerhalb von Geschäftsräumen existieren.
id: NIST mendefinisikan awan komunitas sebagai infrastruktur yang disediakan untuk penggunaan eksklusif oleh komunitas konsumen tertentu dari organisasi yang memiliki keprihatinan bersama (misalnya, pertimbangan misi, persyaratan keamanan, kebijakan, atau kepatuhan). Awan mungkin dimiliki, dikelola, dan dioperasikan oleh satu atau lebih organisasi di masyarakat, pihak ketiga, atau beberapa kombinasi dari keduanya, dan mungkin ada di dalam atau di luar lokasi.

source: Namespaces
de: Namensräume
id: Namespace
tr_tr: İsim uzayları

source: Nathanael Burton is a Computer Scientist at the National Security Agency. He has worked for the Agency for over 10 years working on distributed systems, large-scale hosting, open source initiatives, operating systems, security, storage, and virtualization technology. He has a B.S. in Computer Science from Virginia Tech.
de: Nathanael Burton ist ein Informatiker bei der National Security Agency. Er arbeitet seit über 10 Jahren für die Agentur an verteilten Systemen, großflächigen Hosting, Open Source Initiativen, Betriebssystemen, Sicherheit, Speicher und Virtualisierungstechnologie. Er hat einen BS in Informatik von Virginia Tech.
id: Nathanael Burton adalah seorang Ilmuwan Komputer di National Security Agency. Dia telah bekerja untuk Agency selama lebih dari 10 tahun bekerja pada sistem terdistribusi, hosting berskala besar, inisiatif open source, sistem operasi, keamanan, penyimpanan, dan teknologi virtualisasi. Dia memiliki B.S. di Ilmu Komputer dari Virginia Tech.
tr_tr: Nathanael Burton, Ulusal Güvenlik Ajansı'ndaki bir Bilgisayar Bilimcisi. Dağıtık sistemler, büyük ölçekli barındırma, açık kaynak girişimleri, işletim sistemleri, güvenlik, depolama ve sanallaştırma teknolojisi üzerinde çalışan Ajans için 10 yıldan fazla bir süre çalıştı. Virginia Tech'den Bilgisayar Bilimlerinde B.S. derecesi vardır.

source: National Information Assurance Partnership, National Security Telecommunications and Information Systems Security Policy. 2003. `http://www.niap-ccevs.org/cc-scheme/nstissp_11_revised_factsheet.pdf <http://www.niap-ccevs.org/cc-scheme/nstissp_11_revised_factsheet.pdf>`_
de: Nationale Informationssicherungspartnerschaft, Nationale Sicherheit Telekommunikation und Informationssysteme Sicherheitspolitik. 2003. `http://www.niap-ccevs.org/cc-scheme/nstissp_11_revised_factsheet.pdf <http://www.niap-ccevs.org/cc-scheme/nstissp_11_revised_factsheet.pdf>`_
id: National Information Assurance Partnership, National Security Telecommunications dan Information Systems Security Policy. 2003. `http://www.niap-ccevs.org/cc-scheme/nstissp_11_revised_factsheet.pdf <http://www.niap-ccevs.org/cc-scheme/nstissp_11_revised_factsheet.pdf>`_
tr_tr: Ulusal Bilgi Güvencesi Ortaklığı, Ulusal Güvenlik Telekomünikasyon ve Bilgi Sistemleri Güvenlik Politikası. 2003. `_ http://www.niap-ccevs.org/cc-scheme/nstissp_11_revised_factsheet.pdf <http://www.niap-ccevs.org/cc-scheme/nstissp_11_revised_factsheet.pdf>`_

source: Native SSL/TLS configuration is difficult (not well documented, tested, or consistent across services).
de: Native SSL/TLS-Konfiguration ist schwierig (nicht gut dokumentiert, getestet oder konsistent über Services).
id: Konfigurasi SSL/TLS native sulit (tidak terdokumentasi dengan baik, teruji, atau konsisten di seluruh layanan).
tr_tr: Yerli SSL/TLS yapılandırması zordur (iyi belgelendirilmemiştir, test edilmemiştir, servisler arası tutarlı değildir).

source: Native SSL/TLS in OpenStack services does not perform/scale as well as SSL proxies (particularly for Python implementations like Eventlet).
de: Native SSL/TLS in OpenStack-Diensten werden nicht ausgeführt oder skaliert sowie SSL-Proxies (insbesondere für Python-Implementierungen wie Eventlet).
id: SSL/TLS native di layanan OpenStack tidak melakukan/skala serta proxy SSL (terutama untuk implementasi Python seperti Eventlet).
tr_tr: OpenStack servislerindeki yerli SSL/TLS, SSL vekilleri kadar iyi çalışmaz/ölçeklenmez (özellikle de Eventlet gibi Python uygulamaları için).

source: Native SSL/TLS in OpenStack services not as well scrutinized/ audited as more proven solutions.
de: Native SSL/TLS in OpenStack-Diensten sind nicht so gut untersucht/geprüft als bewährte Lösungen.
id: SSL/TLS native di layanan OpenStack tidak dicermati/diaudit serta bukan solusi yang lebih terjamin.
tr_tr: OpenStack hizmetlerindeki yerli SSL / TLS daha fazla kanıtlanmış çözümler kadar iyi incelenmedi/denetlenmedi.

source: Network and security models
de: Netzwerk- und Sicherheitsmodelle
id: Model jaringan dan keamanan
tr_tr: Ağ ve güvenlik modelleri

source: Network connectivity of physical servers
de: Netzwerkkonnektivität von physischen Servern
id: Konektivitas jaringan server fisik
tr_tr: Fiziksel sunucuların ağ bağlantısı

source: Network data
de: Netzwerkdaten
tr_tr: Ağ verisi

source: Network intrusion detection tools complement the host-based tools. OpenStack doesn't have a specific network IDS built-in, but OpenStack Networking provides a plug-in mechanism to enable different technologies through the Networking API. This plug-in architecture will allow tenants to develop API extensions to insert and configure their own advanced networking services like a firewall, an intrusion detection system, or a VPN between the VMs.
de: Netzwerk-Intrusion Detection Tools ergänzen die Host-basierten Tools. OpenStack verfügt nicht über ein bestimmtes Netzwerk IDS integriert, aber OpenStack Networking bietet einen Plug-In-Mechanismus, um verschiedene Technologien über die Networking API zu aktivieren. Diese Plug-in-Architektur ermöglicht es den Tenants, API-Erweiterungen zu entwickeln, um ihre eigenen fortschrittlichen Netzwerkdienste wie eine Firewall, ein Intrusion Detection System oder ein VPN zwischen den VMs einzufügen und zu konfigurieren.
id: Alat deteksi intrusi jaringan melengkapi alat berbasis host. OpenStack tidak memiliki jaringan khusus IDS built-in, namun OpenStack Networking menyediakan mekanisme plug-in untuk mengaktifkan teknologi yang berbeda melalui Networking API. Arsitektur plug-in ini akan memungkinkan penyewa mengembangkan ekstensi API untuk memasukkan dan mengkonfigurasi layanan jaringan lanjutan mereka sendiri seperti firewall, sistem deteksi intrusi, atau VPN antara VM.
tr_tr: Ağ saldırı tespit araçları, sunucu tabanlı araçları tamamlar. OpenStack'in dahili olarak belirli bir IDS yapısı yoktur, ancak OpenStack Ağ, Ağ API'si aracılığıyla farklı teknolojileri etkinleştirmek için eklenti bir mekanizma sağlar. Bu eklenti mimarisi, kiracılar için bir güvenlik duvarı, saldırı tespit sistemi veya VM'ler arasında bir VPN gibi kendi gelişmiş ağ servislerini yerleştirmek ve yapılandırmak için API uzantıları geliştirmelerine izin verecek.

source: Network namespaces are highly recommended for all services running on OpenStack Compute Hypervisors. This will help prevent against the bridging of network traffic between VM guests and the management network.
de: Netzwerk-Namespaces werden für alle Dienste empfohlen, die auf OpenStack Compute Hypervisors ausgeführt werden. Dies wird dazu beitragen, die Überbrückung des Netzwerkverkehrs zwischen VM-Gästen und dem Management-Netzwerk zu verhindern.
id: Namespace jaringan sangat dianjurkan untuk semua layanan yang berjalan di OpenStack Compute Hypervisors. Ini akan membantu mencegah terjerembabnya lalu lintas jaringan antara VM guest dan jaringan manajemen.
tr_tr: Ağ ad alanları, OpenStack Hesaplama Hipervizörlerinde çalışan tüm servisler için şiddetle tavsiye edilir. Bu, VM konukları ve yönetim ağları arasındaki ağ trafiğinin köprülmesine karşı önlemeye yardımcı olur.

source: Network plug-ins
de: Netzwerk-Plug-ins
id: Plug-in jaringan
tr_tr: Ağ eklentileri
