Repository: openstack/security-doc
Catalog: security-guide/source/locale/*/LC_MESSAGES/security-guide.po
Languages: de, id, tr_tr

source: Authentication is an integral part of any real world OpenStack deployment and so careful thought should be given to this aspect of system design. A complete treatment of this topic is beyond the scope of this guide however some key topics are presented in the following sections.
de: Authentifizierung ist ein integraler Bestandteil jeder realen Welt OpenStack-Bereitstellung und so sorgfältiger Gedanke sollte diesem Aspekt des Systemdesigns gegeben werden. Eine vollständige Behandlung dieses Themas geht über den Rahmen dieses Leitfadens hinaus, aber einige Schlüsselthemen werden in den folgenden Abschnitten dargestellt.
id: Otentikasi adalah bagian integral dari pengerahan OpenStack dunia nyata dan pemikiran hati-hati harus diberikan pada aspek perancangan sistem ini. Perlakuan lengkap terhadap topik ini berada di luar cakupan panduan ini namun beberapa topik utama dipresentasikan pada bagian berikut.
tr_tr: Kimlik doğrulama, gerçek dünyadaki herhangi bir OpenStack dağıtımının ayrılmaz bir parçasıdır ve sistem tasarımının bu yönüne dikkatli düşünülmelidir. Bu konunun eksiksiz bir tedavisi bu rehberin kapsamı dışındadır, ancak bazı temel konular aşağıdaki bölümlerde sunulmaktadır.

source: Authentication methods
de: Authentifizierungsmethoden
id: Metode otentikasi
tr_tr: Kimlik doğrulama yöntemleri

source: Authentication service
de: Authentifizierungsdienst
id: Layanan Authentication
tr_tr: Kimlik doğrulama servisi

source: Authentication with X.509 certificates
de: Authentifizierung mit X.509 Zertifikaten
id: Otentikasi dengan sertifikat X.509
tr_tr: X.509 sertifikası ile kimlik doğrulama

source: Authentication, key exchange
de: Authentifizierung, Schlüsselaustausch
id: Otentikasi, pertukaran kunci
tr_tr: Kimlik doğrulama, anahtar değişimi

source: Authentication?
de: Authentifizierung?
id: Otentikasi?
tr_tr: Kimlik Doğrulama?

source: Authorization
de: Genehmigung
id: Otorisasi
tr_tr: Yetkilendirme

source: Automated vulnerability scanning/exploitation. Non-targeted attacks. Often only a nuisance, compromise by one of these actors presents a major risk to an organization's reputation.
de: Automatisierte Verwundbarkeit Scannen/Ausbeutung. Nicht gezielte Angriffe. Oft nur ein Ärgernis, Kompromiss eines dieser Akteure stellt ein großes Risiko für den Ruf einer Organisation dar.
id: Pemindaian/eksploitasi kerentanan otomatis. Serangan yang tidak ditargetkan. Seringkali hanya gangguan, kompromi oleh salah satu aktor ini menghadirkan risiko besar bagi reputasi sebuah organisasi.
tr_tr: Otomatik güvenlik açığı taraması/sömürüsü. Hedefsiz saldırılar. Bu aktörlerin birinden sıklıkla sadece bir sıkıntı, ödün verme, bir kurumun itibarına büyük bir risk getirir.

source: Availability Failure Impact: barbican could no longer create new secrets without access to the queue.
de: Availability Failure Impact: barbican konnte nicht mehr neue Geheimnisse ohne Zugriff auf die Warteschlange schaffen.
id: Availability Failure Impact: barbican tidak bisa lagi menciptakan rahasia baru tanpa akses ke antrian.
tr_tr: Kullanılabilirlik Başarısızlığı Etkisi: barbican sıraya erişmeksizin artık yeni gizli bilgi oluşturamaz.

source: Availability Failure Impact: barbican will not be able to validate user credentials and fail. DoS.
de: Availability Failure Impact: barbican wird nicht in der Lage sein, Benutzer-Anmeldeinformationen zu validieren und fehlschlagen. DOS.
id: Availability Failure Impact: barbican tidak akan bisa memvalidasi kredensial pengguna dan gagal. DoS.
tr_tr: Kullanılabilirlik Başarısızlığı Etkisi: barbican, kullanıcı kimlik bilgilerini doğrulayamaz ve başarısız olur. DoS.

source: Availability of expertise
de: Verfügbarkeit von Fachwissen
id: Ketersediaan keahlian
tr_tr: Uzmanlığın mevcutluğu

source: Backup and disaster recovery
de: Backup und Disaster Recovery
id: Backup dan pemulihan bencana
tr_tr: Yedekleme ve felaket kurtarma

source: Barbican Role Based Access Control
de: Barbican Rollenbasierte Zugriffskontroll

source: Barbican depends on the use of Hardware Security Module (HSM) appliance.
de: Barbican hängt von der Verwendung von Hardware Security Module (HSM) Gerät.
id: Barbican tergantung pada penggunaan alat Hardware Security Module (HSM).
tr_tr: Barbican, Donanım Güvenlik Modülü (HSM) kullanımına bağlı.

source: Barbican has a number of back-end plugins that can be used to securely store secrets in local databases or in HSMs.
de: Barbican verfügt über eine Reihe von Back-End-Plugins, die zur sicheren Speicherung von Geheimnissen in lokalen Datenbanken oder in HSMs verwendet werden können.
id: Barbican memiliki sejumlah plugin back-end yang dapat digunakan untuk menyimpan rahasia dengan aman di database lokal atau di HSM.

source: Barbican has multiple pluggable back-ends which can communicate with software and hardware based security modules using PKCS#11 or KMIP.
de: Barbican verfügt über mehrere steckbare Backends, die mithilfe von PKCS # 11 oder KMIP mit Soft- und Hardware-basierten Sicherheitsmodulen kommunizieren können.
id: Barbican memiliki beberapa pluggable back-ends yang dapat berkomunikasi dengan modul keamanan berbasis perangkat lunak dan perangkat keras menggunakan PKCS#11 atau KMIP.

source: Barbican is a REST API designed for the secure storage, provisioning and management of secrets such as passwords, encryption keys and X.509 certificates. It is aimed at being useful for all environments, including large ephemeral clouds.
de: Barbican ist eine REST-API für die sichere Speicherung, Bereitstellung und Verwaltung von Geheimnissen wie Passwörtern, Verschlüsselungsschlüsseln und X.509-Zertifikaten. Es ist darauf ausgerichtet, für alle Umgebungen, einschließlich großer ephemerer Cloud, nützlich zu sein.
id: Barbican adalah REST API yang dirancang untuk penyimpanan, penyediaan dan pengelolaan rahasia seperti password, kunci enkripsi dan sertifikat X.509. Hal ini bertujuan berguna untuk semua lingkungan, termasuk awan fana yang besar.

source: Barbican is an OpenStack service that is multi-tenant aware and that uses Keystone tokens for authentication. This means that access to secrets is controlled via OpenStack policies for tenants and RBAC roles.
de: Barbican ist ein OpenStack-Dienst, der mandantenfähig ist und Keystone-Token zur Authentifizierung verwendet. Dies bedeutet, dass der Zugriff auf Geheimnisse über OpenStack-Richtlinien für Tenants und RBAC-Rollen gesteuert wird.
id: Barbican adalah layanan OpenStack yang menjaga multi-tenant dan menggunakan token Keystone untuk otentikasi. Ini berarti bahwa akses terhadap rahasia dikendalikan melalui kebijakan OpenStack untuk tenant dan peran RBAC.

source: Barbican is integrated with several OpenStack features, either directly or as a back end of `Castellan <https://wiki.openstack.org/wiki/Castellan>`_.
de: Barbican ist mit verschiedenen OpenStack Funktionen integriert, auch direkt oder als Backend für `Castellan <https://wiki.openstack.org/wiki/Castellan>`_.
id: Barbican terintegrasi dengan beberapa fitur OpenStack, baik secara langsung maupun sebagai back end `Castellan <https://wiki.openstack.org/wiki/Castellan>`_.

source: Barbican is often used as a key management system to enable use cases such as Image signature verification, Volume encryption. These use cases are outlined in the :doc:`secrets-management-use-cases`
de: Barbican wird häufig als Schlüsselverwaltungssystem verwendet, um Anwendungsfälle wie die Signaturprüfung von Bildern oder die Volume-Verschlüsselung zu ermöglichen. Diese Anwendungsfälle sind im :doc:`secrets-management-use-cases`aufgeführt.
id: Barbican sering digunakan sebagai sistem manajemen kunci untuk memungkinkan penggunaan kasus seperti verifikasi tanda tangan Image, enkripsi Volume. Kasus penggunaan ini diuraikan di :doc:`secrets-management-use-cases`

source: Based upon system security category as defined in FIPS 199, an organization utilizes FIPS 200 to identify specific security control requirements for the information system. For example, if a system is categorized as "moderate" a requirement may be introduced to mandate "secure passwords".
de: Basierend auf der System-Security-Kategorie, wie in FIPS 199 definiert, nutzt eine Organisation FIPS 200, um spezifische Sicherheitssteuerungsanforderungen für das Informationssystem zu identifizieren. Zum Beispiel, wenn ein System als "moderate" kategorisiert wird, kann eine Anforderung eingeführt werden, um "sichere Passwörter" zu beauftragen.
id: Berdasarkan kategori keamanan sistem sebagaimana didefinisikan dalam FIPS 199, sebuah organisasi menggunakan FIPS 200 untuk mengidentifikasi persyaratan pengendalian keamanan spesifik untuk sistem informasi. Misalnya, jika sebuah sistem dikategorikan "moderate", sebuah persyaratan dapat dikenalkan untuk mengamanatkan "secure passwords".
tr_tr: FIPS 199'da tanımlanan sistem güvenlik kategorisine dayanarak, bir organizasyon bilgi sistemi için belirli güvenlik kontrol gereksinimlerini tanımlamak için FIPS 200'ü kullanmaktadır. Örneğin, bir sistem "orta" olarak kategorize edilirse, "güvenli parolalar" ı zorunlu kılmak için bir gereklilik getirilebilir.

source: Basic web server configuration
de: Grundlegende Web-Server-Konfiguration
id: Konfigurasi server web dasar
tr_tr: Temel web sunucusu yapılandırması

source: Because API endpoints typically bridge multiple security domains, you must pay particular attention to the compartmentalization of the API processes. See :ref:`Bridging_security_domains` for additional information in this area.
de: Da API-Endpunkte typischerweise mehrere Sicherheitsdomänen überbrücken, müssen Sie der Kompartimentierung der API-Prozesse besondere Aufmerksamkeit widmen. Siehe :ref:`Bridging_security_domains` für weitere Informationen in diesem Bereich.
id: Karena endpoint API biasanya menjembatani beberapa domain keamanan, Anda harus memberi perhatian khusus pada kompartementalisasi proses API. Lihat: ref: `Bridging_security_domains` untuk informasi tambahan di area ini.
tr_tr: API uç noktaları genellikle birden fazla güvenlik alanını köprülemektedir, API işlemlerinin bölümlendirilmesine özel dikkat göstermelisiniz. Bu bölgede ek bilgi için bkz .: ref: `Bridging_security_domains`.

source: Because most management commands flow through the message queuing system, message-queue security is a primary security concern for any OpenStack deployment, and is discussed in detail later in this guide.
de: Da die meisten Verwaltungsbefehle über das Nachrichtenwarteschlangensystem laufen, ist die Nachrichtenwarteschlangensicherheit ein primäres Sicherheitsproblem für jede OpenStack-Bereitstellung und wird später in diesem Handbuch ausführlich behandelt.
id: Karena sebagian besar perintah manajemen mengalir melalui sistem antrian pesan, keamanan message-queue merupakan masalah keamanan utama untuk penyebaran OpenStack, dan akan dibahas secara rinci nanti dalam panduan ini.

source: Before an instance is created, a host for the image instantiation must be selected. This selection is performed by the ``nova-scheduler`` which determines how to dispatch compute and volume requests.
de: Bevor eine Instanz erstellt wird, muss ein Host für die Abbildinstanzierung ausgewählt werden. Diese Auswahl erfolgt durch den ``Nova-Scheduler``, der bestimmt, wie man Rechen- und Volumenanforderungen abgibt.
id: Sebelum sebuah instance dibuat, host untuk image instantiation harus dipilih. Pilihan ini dilakukan oleh ``nova-scheduler`` yang menentukan bagaimana mengirim dan menghitung permintaan volume.
tr_tr: Bir örnek oluşturulmadan önce, imaj oluşturulması için bir ana makine seçilmelidir. Bu seçim, hesaplama ve hacim isteklerinin nasıl gönderileceğini belirleyen ``nova-scheduler`` tarafından gerçekleştirilir.

source: Before attempting to federate multiple Identity service deployments, you must setup certain configuration options in the ``keystone.conf`` file.
de: Bevor Sie versuchen, mehrere Identity Service-Bereitstellungen zusammenzuführen, müssen Sie bestimmte Konfigurationsoptionen in der `` keystone.conf``Datei einrichten.
tr_tr: Birden çok Kimlik servisi yayınını federe etmeden önce, ``keystone.conf`` dosyasında bazı yapılandırma seçeneklerini ayarlamanız gerekir.

source: Before deployment, consider the TLS libraries that the queuing servers use. Qpid uses Mozilla's NSS library, whereas RabbitMQ uses Erlang's TLS module which uses OpenSSL.
de: Stellen Sie vor der Bereitstellung die TLS-Bibliotheken in Betracht, die die Warteschlangenserver verwenden. Qpid nutzt die NSS-Bibliothek von Mozilla, während RabbitMQ das TLS-Modul von Erlang verwendet, das OpenSSL verwendet.
id: Sebelum diterapkan, pertimbangkan perpustakaan TLS yang digunakan oleh server antrian. Qpid menggunakan perpustakaan NSS milik Mozilla, sedangkan RabbitMQ menggunakan modul TLS Erlang yang menggunakan OpenSSL.
tr_tr: Yayına almadan önce, kuyruklama sunucularının kullandığı TLS kitaplıklarını göz önünde bulundurun. Qpid, Mozilla'nın NSS kitaplığını kullanırken, RabbitMQ, OpenSSL'yi kullanan Erlang'in TLS modülünü kullanıyor.

source: Before we delve into the configurations, we briefly discuss the ciphers' configuration element and its format. A more exhaustive treatment on available ciphers and the OpenSSL cipher list format can be found at: `ciphers <https://www.openssl.org/docs/apps/ciphers.html>`_.
de: Bevor wir uns in die Konfigurationen einlassen, diskutieren wir kurz das Konfigurations-Element der Ziffern und deren Format. Eine ausführlichere Behandlung der verfügbaren Ziffern und das OpenSSL-Chiffrierlistenformat finden Sie unter: `ciphers <https://www.openssl.org/docs/apps/ciphers.html> `_.
tr_tr: Yapılandırmaları incelemeden önce, şifrelere ait yapılandırma unsuru ve biçimini kısaca tartışıyoruz. Mevcut şifrelere ve OpenSSL şifre listesindeki daha kapsamlı bir işleme şu adreste bulunabilir: `şifreler <https://www.openssl.org/docs/apps/ciphers.html>`_.

source: Being able to detect the load on the OpenStack servers also enables responding by way of introducing additional servers for load balancing to ensure high availability.
de: Die Möglichkeit, die Belastung der OpenStack-Server zu erkennen, ermöglicht auch die Implementierung von zusätzlichen Servern zur Lastverteilung, um eine hohe Verfügbarkeit zu gewährleisten.
id: Mampu mendeteksi beban pada server OpenStack juga memungkinkan untuk merespons dengan cara menambahkan server tambahan untuk load balancing guna memastikan ketersediaan yang tinggi.
tr_tr: OpenStack sunucularındaki yükü tespit edebilmek, yüksek kullanılabilirlik sağlamak için yük dengeleme için ek sunucular tanıtılarak yanıt vermeyi de mümkün kılar.

source: Below is an example of an NFS share with the Generic driver. After the share was created it has export location ``10.254.0.3:/shares/share-b2874f8d-d428-4a5c-b056-e6af80a995de``. If you try to mount it on the host with ``10.254.0.4`` IP address, you'll get a *"Permission denied"* message.
de: Unten ist ein Beispiel für eine NFS-Freigabe mit dem generischen Treiber. Nachdem die Aktie erstellt wurde, hat sie den Exportort ``10.254.0.3:/ shares/share-b2874f8d-d428-4a5c-b056-e6af80a995de``. Wenn Sie versuchen, es auf dem Host mit ``10.254.0.4``IP-Adresse zu installieren, erhalten Sie eine * \"Permission denied\"* Nachricht.
id: Berikut adalah contoh pembagian NFS dengan driver Generik. Setelah share itu dibuat, ia memiliki lokasi ekspor ``10.254.0.3:/shares/share-b2874f8d-d428-4a5c-b056-e6af80a995de``. Jika Anda mencoba me-mountnya di host dengan alamat IP ``10.254.0.4``, Anda akan mendapatkan pesan *"Permission denied"*.
tr_tr: Aşağıda, Genel sürücü ile NFS paylaşımına bir örnek verilmiştir. Paylaşım oluşturulduktan sonra, ``10.254.0.3:/shares/share-b2874f8d-d428-4a5c-b056-e6af80a995de`` dışa aktarma konumuna sahiptir. ``10.254.0.4`` IP adresiyle sunucuya bağlamaya çalışırsanız, bir *"İzin reddedildi"* mesajı alırsınız.

source: Below we provide sample recommended configuration settings for enabling TLS in some of the more popular web servers/TLS terminators.
de: Im Folgenden stellen wir Ihnen die empfohlenen Konfigurationseinstellungen zur Verfügung, um TLS in einigen der beliebtesten Webserver/TLS-Terminatoren zu aktivieren.
id: Di bawah ini kami menyediakan contoh pengaturan konfigurasi yang direkomendasikan untuk mengaktifkan TLS di beberapa web servers/TLS terminators yang lebih populer.
tr_tr: Aşağıda, daha popüler web sunucularının/TLS sonlandırıcıların bazılarında TLS'yi etkinleştirmek için önerilen yapılandırma ayarlarının örneklerini sunuyoruz.

source: Ben de Bont is the CSO for HP Cloud Services. Prior to his current role Ben led the information security group at MySpace and the incident response team at MSN Security. Ben holds a master's degree in Computer Science from the Queensland University of Technology.
de: Ben de Bont ist der CSO für HP Cloud Services. Vor seiner aktuellen Rolle führte Ben die Informationssicherheitsgruppe bei MySpace und das Incident Response Team bei MSN Security. Ben hat einen Master-Abschluss in Informatik von der Queensland University of Technology.
id: Ben de Bont adalah CSO untuk HP Cloud Services. Sebelum perannya saat ini, Ben memimpin kelompok keamanan informasi di MySpace dan tim respons insiden di MSN Security. Ben meraih gelar master di bidang Ilmu Komputer dari Queensland University of Technology.
tr_tr: Ben de Bont, HP Bulut Servisleri için CSO'dur. Mevcut görevinden önce Ben, MySpace'deki bilgi güvenliği grubunu ve MSN Güvenlik'teki olayla mücadele ekibini yönetti. Queensland Teknoloji Üniversitesi'nden Bilgisayar Bilimleri alanında master derecesi bulunmaktadır.

source: Besides already described services you can see two other entities on the image: ``python-manilaclient`` and ``storage controller``.
de: Neben den bereits beschriebenen Diensten sehen Sie zwei weitere Entitäten auf dem Bild: ``python-manilaclient`` und ``storage controller``.
id: Selain sudah dijelaskan layanan Anda bisa melihat dua entitas lain pada image: ``python-manilaclient`` dan ``storage controller``.
tr_tr: Daha önce açıklanan servislerin yanı sıra, görselde iki varlık daha görebilirsiniz: ``python-manilaclient`` ve ``depolama denetleyicisi``.

source: Bibliography
de: Literaturverzeichnis
id: Bibliografi
tr_tr: Kaynakça

source: Bibliography:
de: Literaturverzeichnis:
id: Bibliografi:
tr_tr: Kaynakça:

source: Block Storage
de: Blockspeicher
tr_tr: Blok Depolama

source: Block Storage (optional)
de: Blockspeicher (optional)
tr_tr: Depolamayı Durdur (isteğe bağlı)

source: Block Storage performance and backends
de: Blockspeicherleistung und Backends
id: Performa Block Storage dan backend
tr_tr: Blok Depolama performansı ve arka uçlar

source: Block Storage volume data
de: Daten von Blockspeichermedien
id: Data volume Block Storage
tr_tr: Blok Depolama hacim verisi

source: Both RabbitMQ and Qpid are Advanced Message Queuing Protocol (AMQP) frameworks, which provide message queues for peer-to-peer communication. Queue implementations are typically deployed as a centralized or decentralized pool of queue servers. ZeroMQ provides direct peer-to-peer communication through TCP sockets.
de: Sowohl RabbitMQ als auch Qpid sind Advanced Message Queuing Protocol (AMQP) Frameworks, die Message Queues für Peer-to-Peer-Kommunikation zur Verfügung stellen. Warteschlangenimplementierungen werden typischerweise als zentraler oder dezentraler Pool von Warteschlangenservern bereitgestellt. ZeroMQ bietet eine direkte Peer-to-Peer-Kommunikation über TCP-Sockets.
id: RabbitMQ dan Qpid adalah kerangka protokol Advanced Message Queuing Protocol (AMQP), yang menyediakan antrian pesan untuk komunikasi peer-to-peer. Implementasi antrian biasanya digunakan sebagai server antrian terpusat atau terdesentralisasi. ZeroMQ menyediakan komunikasi peer-to-peer langsung melalui soket TCP.
tr_tr: RabbitMQ ve Qpid hem eşler arası iletişimi için ileti sıraları sağlayan Gelişmiş Message Queuing Protokolü (AMQP) çatılarıdır. Kuyruk uygulamaları genellikle kuyruk sunucularının merkezi veya merkezi olmayan havuzu olarak dağıtılır. ZeroMQ, TCP yuvaları aracılığıyla doğrudan eşler arası iletişimi sağlar.

source: Both approaches provide `Perfect Forward Secrecy (PFS) <https://en.wikipedia.org/wiki/Forward_secrecy>`_. See :ref:`secure-communication-perfect-forward-secrecy` for additional discussion on properly configuring PFS.
de: Beide Ansätze bieten `Perfect Forward Secrecy (PFS) <https://en.wikipedia.org/wiki/Forward_secrecy>`_. Siehe :ref:`secure-communication-perfect-forward-secrecy` für zusätzliche Diskussion über die ordnungsgemäße Konfiguration von PFS.
id: Kedua pendekatan itu memberikan `Perfect Forward Secrecy (PFS) <https://en.wikipedia.org/wiki/Forward_secrecy>`_. Lihat :ref:`secure-communication-perfect-forward-secrecy` untuk diskusi tambahan tentang konfigurasi PFS dengan benar.
tr_tr: Her iki yaklaşım da `Mükemmel İleri Gizliliği' (PFS) <https://en.wikipedia.org/wiki/Forward_secrecy>`_ sağlar. PFS'yi düzgün yapılandırma hakkında ek tartışma için bkz. :ref:`secure-communication-perfect-forward-secrecy`.

source: Both the horizon web service and the OpenStack API it uses to communicate with the back end are susceptible to web attack vectors such as denial of service and must be monitored.
de: Sowohl der Horizon-Web-Service als auch die OpenStack-API, die es verwendet, um mit dem Back-End zu kommunizieren, sind anfällig für Web-Angriffsvektoren wie die Denial-of-Service und müssen überwacht werden.
id: Baik layanan web cakrawala maupun API OpenStack yang digunakannya untuk berkomunikasi dengan back end rentan terhadap vektor serangan web seperti penolakan layanan (denial of service) dan harus dipantau.
tr_tr: Hem horizon web servisi hem de arka uçla iletişim kurmak için kullandığı OpenStack API'si, hizmet reddini gibi web saldırı vektörlerine açıktır ve izlenmesi gerekir.

source: Bridging security domains
de: Überbrückung von Sicherheitsdomänen
id: Menjembatani domain keamanan
tr_tr: Güvenlik alanlarını köprülemek
