Repository: openstack/security-doc
Catalog: security-guide/source/locale/*/LC_MESSAGES/security-guide.po
Languages: de, id, tr_tr

source: Dr. Bryan D. Payne is the Director of Security Research at Nebula and co-founder of the OpenStack Security Group (OSSG). Prior to joining Nebula, he worked at Sandia National Labs, the National Security Agency, BAE Systems, and IBM Research. He graduated with a Ph.D. in Computer Science from the Georgia Tech College of Computing, specializing in systems security. Bryan was the editor and lead for the OpenStack Security Guide, responsible for its continued growth for the two years after it was written.
de: Dr. Bryan D. Payne ist Direktor der Sicherheitsforschung bei Nebula und Mitbegründer der OpenStack Security Group (OSSG). Vor seinem Eintritt bei Nebula arbeitete er bei Sandia National Labs, der National Security Agency, BAE Systems und IBM Research. Er absolvierte ein Ph.D. in Informatik von der Georgia Tech College of Computing, spezialisiert auf Systemsicherheit. Bryan war Redakteur und leitete die Arbeit für den OpenStack Security Guide, und war verantwortlich für sein weiteres Wachstum für die zwei Jahre nach dem Schreiben.
id: Dr. Bryan D. Payne adalah Director of Security Research di Nebula dan salah satu pendiri OpenStack Security Group (OSSG). Sebelum bergabung dengan Nebula, dia bekerja di Sandia National Labs, National Security Agency, BAE Systems, dan IBM Research. Dia lulus dengan gelar Ph.D. dalam Ilmu Komputer dari Georgia Tech College of Computing, yang mengkhususkan diri dalam keamanan sistem. Bryan adalah editor dan memimpin untuk OpenStack Security Guide, bertanggung jawab atas pertumbuhannya yang terus berlanjut selama dua tahun setelah ditulis.
tr_tr: Dr. Bryan D. Payne, Nebula'da Güvenlik Araştırmaları Direktörü ve OpenStack Güvenlik Grubu (OSSG) 'nün kurucu ortaklarındandır. Nebula'ya katılmadan önce, Sandia National Labs, Ulusal Güvenlik Ajansı, BAE Systems ve IBM Research'te çalıştı. Doktora derecesi ile Sistem güvenliği konusunda uzmanlaşmış olan Georgia Tech Bilgisayar Koleji'nden Bilgisayar Bilimlerinden mezun oldu. Bryan, OpenStack Güvenlik Kılavuzu'nun yazarı ve başlığıydı ve yazdıktan iki yıl boyunca devam eden büyümesinden sorumluydu.

source: Drivers that support the GlusterFS protocol can be used with authentication via TLS certificates.
de: Treiber, die das GlusterFS-Protokoll unterstützen, können mit der Authentifizierung über TLS-Zertifikate verwendet werden.
id: Driver yang mendukung protokol GlusterFS dapat digunakan dengan otentikasi melalui sertifikat TLS.
tr_tr: GlusterFS protokolünü destekleyen sürücüler TLS sertifikaları ile kimlik doğrulaması ile kullanılabilir.

source: Due to the published vulnerabilities in the Secure Sockets Layer (SSL) protocols, we strongly recommend that TLS is used in preference to SSL, and that SSL is disabled in all cases, unless compatibility with obsolete browsers or libraries is required.
de: Aufgrund der veröffentlichten Sicherheitslücken in den SSL-Protokollen (Secure Sockets Layer) empfiehlt es sich dringend, dass TLS bevorzugt in SSL verwendet wird und dass SSL in allen Fällen deaktiviert ist, es sei denn, Kompatibilität mit veralteten Browsern oder Bibliotheken ist erforderlich.
id: Karena kerentanan yang dipublikasikan dalam protokol Secure Sockets Layer (SSL), kami sangat menyarankan agar TLS digunakan untuk preferensi SSL, dan SSL dinonaktifkan dalam semua kasus, kecuali kompatibilitas dengan browser usang atau perpustakaan diperlukan.
tr_tr: Güvenli Soket Katmanı (SSL) protokollerinde yayınlanan güvenlik açıklarından ötürü, TLS'in SSL'ye göre öncelikli olarak kullanılmasını ve eski tarayıcılara veya kitaplıklara uyumluluk gerekmedikçe SSL'nin her durumda devre dışı bırakılmasını şiddetle öneririz.

source: Due to the risk and complexities associated with PCI passthrough, it should be disabled by default. If enabled for a specific need, you will need to have appropriate processes in place to ensure the hardware is clean before re-issue.
de: Aufgrund des Risikos und der Komplexität, die mit dem PCI-Passthrough verbunden ist, sollte es standardmäßig deaktiviert werden. Wenn es für einen bestimmten Bedarf aktiviert ist, müssen Sie entsprechende Prozesse an Ort und Stelle haben, um sicherzustellen, dass die Hardware vor der Neuausgabe sauber ist.
id: Karena risiko dan kompleksitas yang terkait dengan PCI passthrough, harus dinonaktifkan secara default. Jika diaktifkan untuk kebutuhan tertentu, Anda harus memiliki proses yang sesuai untuk memastikan perangkat keras bersih sebelum diterbitkan ulang.
tr_tr: PCI passthrough ile ilgili risk ve karmaşıklıklar nedeniyle, varsayılan olarak devre dışı bırakılmalıdır. Belirli bir ihtiyaç için etkinleştirildiyse, yeniden çıkmadan önce donanımın temiz olduğundan emin olmak için uygun işlemleri yapmanız gerekir.

source: Due to the time constraints around a book sprint, the team chose to use KVM as the hypervisor in our example implementations and architectures.
de: Aufgrund der zeitlichen Einschränkungen des Buchsprints entschied sich das Team, KVM als Hypervisor in unseren Beispielimplementierungen und Architekturen zu nutzen.
id: Karena kendala waktu seputar sprint buku, tim memilih untuk menggunakan KVM sebagai hypervisor dalam implementasi dan arsitektur contoh kami.
tr_tr: Takım, bir kitap sprintindeki zaman kısıtlamaları nedeniyle, örnek uygulamalarımızda ve mimarilerde KVM'yi hipervizör olarak kullanmayı seçti.

source: During the design of an OpenStack Networking infrastructure it is important that you understand the current features and limitations of available network services. Understanding the boundaries of your virtual and physical networks will assist in adding required security controls in your environment.
de: Bei der Gestaltung einer OpenStack Networking-Infrastruktur ist es wichtig, dass Sie die aktuellen Funktionen und Einschränkungen der verfügbaren Netzwerkdienste verstehen. Das Verständnis der Grenzen Ihrer virtuellen und physischen Netzwerke wird dazu beitragen, die erforderlichen Sicherheitskontrollen in Ihrer Umgebung hinzuzufügen.
id: Selama perancangan infrastruktur OpenStack Networking, penting bagi Anda untuk memahami fitur dan keterbatasan layanan jaringan yang ada saat ini. Memahami batas jaringan virtual dan fisik Anda akan membantu menambahkan kontrol keamanan yang diperlukan di lingkungan Anda.
tr_tr: Bir OpenStack Ağ altyapısı tasarlanırken mevcut ağ servislerinin mevcut özelliklerini ve sınırlamalarını anlamanız önemlidir. Sanal ve fiziksel ağlarınızın sınırlarını anlamak, ortamınıza gerekli güvenlik kontrolleri eklemenize yardımcı olacaktır.

source: During the sprint we also had help from Anne Gentle, Warren Wang, Paul McMillan, Brian Schott and Lorin Hochstein.
de: Während des Sprints hatten wir auch Hilfe von Anne Gentle, Warren Wang, Paul McMillan, Brian Schott und Lorin Hochstein.
id: Selama sprint kami juga mendapat bantuan Anne Gentle, Warren Wang, Paul McMillan, Brian Schott dan Lorin Hochstein.
tr_tr: Sprint sırasında Anne Gentle, Warren Wang, Paul McMillan, Brian Schott ve Lorin Hochstein'ten de yardım aldık.

source: Each KVM-based virtual machine is a process which is labeled by SELinux, effectively establishing a security boundary around each virtual machine. This security boundary is monitored and enforced by the Linux kernel, restricting the virtual machine's access to resources outside of its boundary, such as host machine data files or other VMs.
de: Jede KVM-basierte virtuelle Maschine ist ein Prozess, der von SELinux gekennzeichnet ist und eine Sicherheitsgrenze um jede virtuelle Maschine effektiv etabliert. Diese Sicherheitsgrenze wird vom Linux-Kernel überwacht und erzwungen, wodurch der Zugriff der virtuellen Maschine auf Ressourcen außerhalb der Grenze, wie z. B. Host-Computer-Datendateien oder andere VMs, eingeschränkt wird.
id: Setiap mesin virtual berbasis KVM adalah proses yang diberi label oleh SELinux, yang secara efektif menetapkan batas keamanan di sekitar setiap mesin virtual. Batas keamanan ini dipantau dan diterapkan oleh kernel Linux, membatasi akses mesin virtual ke sumber daya di luar batasnya, seperti file data mesin host atau VM lainnya.
tr_tr: Her bir KVM tabanlı sanal makine, SELinux tarafından etiketlenen ve her sanal makinenin etrafında bir güvenlik sınırı oluşturan bir süreçtir. Bu güvenlik sınırı, Linux çekirdeği tarafından izlenir ve uygulanır ve sanal makinenin, ana makine veri dosyaları veya diğer VM'ler gibi kendi sınırlarının dışındaki kaynaklara erişimini kısıtlar.

source: Each OpenStack deployment embraces a wide variety of technologies, spanning Linux distributions, database systems, messaging queues, OpenStack components themselves, access control policies, logging services, security monitoring tools, and much more. It should come as no surprise that the security issues involved are equally diverse, and their in-depth analysis would require several guides. We strive to find a balance, providing enough context to understand OpenStack security issues and their handling, and provide external references for further information. The guide could be read from start to finish or used like a reference.
de: Jede OpenStack-Implementierung umfasst eine Vielzahl von Technologien, die sich über Linux-Distributionen, Datenbanksysteme, Messaging-Warteschlangen, OpenStack-Komponenten selbst, Zugriffskontrollrichtlinien, Protokollierungsdienste, Sicherheitsüberwachungsinstrumente und vieles mehr erstrecken. Es sollte nicht überraschen, dass die Sicherheitsfragen gleichermaßen unterschiedlich sind, und ihre eingehende Analyse würde mehrere Guides erfordern. Wir sind bestrebt, ein Gleichgewicht zu finden, das genügend Kontext bietet, um OpenStack Sicherheitsprobleme und deren Handhabung zu verstehen und externe Referenzen für weitere Informationen zur Verfügung zu stellen. Der Leidfaden kann von Anfang bis Ende gelesen werden, oder auszugsweise wie eine Referenz.
id: Setiap pengerahan OpenStack mencakup beragam teknologi, mencakup distribusi Linux, sistem database, antrian pesan, komponen OpenStack sendiri, kebijakan kontrol akses, layanan logging, alat pemantauan keamanan, dan banyak lagi. Tidak mengherankan jika masalah keamanan yang terlibat sama beragamnya, dan analisis mendalam mereka memerlukan beberapa panduan. Kami berusaha untuk menemukan keseimbangan, memberikan konteks yang cukup untuk memahami masalah keamanan OpenStack dan penanganannya, dan memberikan referensi eksternal untuk informasi lebih lanjut. Panduan bisa dibaca dari awal sampai akhir atau digunakan seperti referensi.

source: Each OpenStack service defines the access policies for its resources in an associated policy file. A resource, for example, could be API access, the ability to attach to a volume, or to fire up instances. The policy rules are specified in JSON format and the file is called ``policy.json``. The syntax and format of this file is discussed in the `Configuration Reference <https://docs.openstack.org/ocata/config-reference/policy-json-file.html>`__.
de: Jeder OpenStack-Dienst definiert die Zugriffsrichtlinien für seine Ressourcen in einer zugehörigen Richtliniendatei. Eine Ressource zum Beispiel könnte API-Zugriff sein, die Fähigkeit, an ein Volume anzubringen oder Instanzen auszulösen. Die Richtlinienregeln sind im JSON-Format angegeben und die Datei heißt ``policy.json``. Die Syntax und das Format dieser Datei werden im `Configuration Reference` diskutiert <https://docs.openstack.org/ocata/config-reference/policy-json-file.html> `__.
id: Setiap layanan OpenStack mendefinisikan kebijakan akses untuk sumber dayanya dalam file kebijakan terkait. Sumber daya, misalnya, bisa berupa akses API, kemampuan untuk mengkaitkan volume, atau untuk mengaktifkan instance. Aturan kebijakan ditentukan dalam format JSON dan file tersebut disebut ``policy.json``. Sintaks dan format file ini dibahas di `Configuration Reference <https://docs.openstack.org/ocata/config-reference/policy-json-file.html>`__.
tr_tr: Her OpenStack servisi, kaynaklarının erişim ilkelerini ilişkili bir ilke dosyasında tanımlar. Örneğin, bir kaynak API erişimi, birime bağlanma veya örnekleri başlatma becerisi olabilir. İlke kuralları JSON formatında belirtilmiş ve dosyaya ``policy.json`` denir. Bu dosyanın sözdizimi ve biçimi `Yapılandırma Referansı <https://docs.openstack.org/ocata/config-reference/policy-json-file.html>`__ belgesinde tartışılmıştır.

source: Each TPM has at least 24 PCRs. The TCG Generic Server Specification, v1.0, March 2005, defines the PCR assignments for boot-time integrity measurements. The table below shows a typical PCR configuration. The context indicates if the values are determined based on the node hardware (firmware) or the software provisioned onto the node. Some values are influenced by firmware versions, disk sizes, and other low-level information. Therefore, it is important to have good practices in place around configuration management to ensure that each system deployed is configured exactly as desired.
de: Jedes TPM hat mindestens 24 PCRs. Die TCG Generic Server Specification, v1.0, März 2005, definiert die PCR-Zuweisungen für Boot-Time Integrity Messungen. Die folgende Tabelle zeigt eine typische PCR-Konfiguration. Der Kontext gibt an, ob die Werte auf der Basis der Knotenhardware (Firmware) oder der auf dem Knoten bereitgestellten Software ermittelt werden. Einige Werte werden durch Firmware-Versionen, Plattengrößen und andere Low-Level-Informationen beeinflusst. Daher ist es wichtig, über das Konfigurationsmanagement gute Praktiken zu haben, um sicherzustellen, dass jedes verwendete System genau wie gewünscht konfiguriert ist.
id: Setiap TPM memiliki setidaknya 24 PCR. Spesifikasi Server Generik TCG, v1.0, Maret 2005, mendefinisikan tugas PCR untuk pengukuran integritas waktu booting. Tabel di bawah menunjukkan konfigurasi PCR yang khas. Konteksnya menunjukkan jika nilai ditentukan berdasarkan perangkat keras node (firmware) atau perangkat lunak yang ada pada node. Beberapa nilai dipengaruhi oleh versi firmware, ukuran disk, dan informasi tingkat rendah lainnya. Oleh karena itu, penting untuk memiliki praktik yang baik di tempat seputar pengelolaan konfigurasi untuk memastikan bahwa setiap sistem yang digunakan dikonfigurasi sesuai keinginan.
tr_tr: Her bir TPM'nin en az 24 PCR'si vardır. TCG Jenerik Sunucu Tanımlaması, v1.0, Mart 2005, önyükleme zamanı bütünlük ölçümleri için PCR atamalarını tanımlar. Aşağıdaki tabloda tipik bir PCR yapılandırması gösterilmektedir. Bağlam, değerlerin düğüm donanımına (ürün yazılımı) veya düğüme sağlanan yazılıma bağlı olarak belirlenip işaret edilmediğini gösterir. Bazı değerler, bellenim sürümlerine, disk boyutlarına ve diğer düşük seviyeli bilgilere göre değişir. Bu nedenle, konuşlandırılan her sistemin tam olarak istediğiniz şekilde yapılandırıldığından emin olmak için yapılandırma yönetimi etrafında iyi uygulamalara sahip olmak önemlidir.

source: Each manufacturer must provide the BIOS and firmware code for their servers. Different servers, hypervisors, and operating systems will choose to populate different PCRs. In most real world deployments, it will be impossible to validate every PCR against a known good quantity ("golden measurement"). Experience has shown that, even within a single vendor's product line, the measurement process for a given PCR may not be consistent. We recommend establishing a baseline for each server and monitoring the PCR values for unexpected changes. Third-party software may be available to assist in the TPM provisioning and monitoring process, depending upon your chosen hypervisor solution.
de: Jeder Hersteller muss das BIOS- und Firmware-Code für seine Server bereitstellen. Verschiedene Server, Hypervisor und Betriebssysteme sind wählbar, um verschiedene PCRs zu besetzen. In den meisten Einsätzen in derrealen Welt ist es unmöglich, jede PCR gegen eine bekannte gute Menge ("goldene Messung") zu validieren. Die Erfahrung hat gezeigt, dass der Messprozess für eine gegebene PCR auch innerhalb der Produktlinie eines einzelnen Herstellers nicht konsistent sein kann. Wir empfehlen, eine Baseline für jeden Server zu erstellen und die PCR-Werte für unerwartete Änderungen zu überwachen. Drittanbieter-Software steht zur Verfügung, um den TPM-Bereitstellungs- und Überwachungsprozess zu unterstützen, abhängig von Ihrer gewählten Hypervisor-Lösung.
id: Setiap pabrikan harus menyediakan kode BIOS dan firmware untuk server mereka. Server yang berbeda, hypervisor, dan sistem operasi akan memilih untuk mengisi PCR yang berbeda. Dalam kebanyakan penyebaran dunia nyata, tidak mungkin memvalidasi setiap PCR terhadap kuantitas yang diketahui ("golden measurement"). Pengalaman menunjukkan bahwa, bahkan dalam lini produk vendor tunggal, proses pengukuran untuk PCR tertentu mungkin tidak konsisten. Sebaiknya buat baseline untuk setiap server dan pantau nilai PCR untuk perubahan yang tidak diharapkan. Perangkat lunak pihak ketiga mungkin tersedia untuk membantu proses pengadaan dan pemantauan TPM, tergantung pada solusi hypervisor yang Anda pilih.
tr_tr: Her üreticinin sunucuları için BIOS ve üretici yazılımı kodunu sağlamaları gerekir. Farklı sunucular, denetleyiciler ve işletim sistemleri farklı PCR'leri yerleştirmeyi seçecektir. Çoğu gerçek dünya dağıtımında, her PCR'yi bilinen iyi bir miktara ("altın ölçüm") karşı doğrulamak olanaksızdır. Deneyimler, tek bir satıcının ürün hattında bile belirli bir PCR için ölçüm sürecinin tutarlı olmayabileceğini göstermiştir. Her sunucu için bir taban çizgisi oluşturmanızı ve beklenmedik değişiklikler için PCR değerlerini izlemenizi öneririz. Seçtiğiniz hypervisor çözümüne bağlı olarak, TPM hazırlama ve izleme sürecine yardımcı olmak için üçüncü parti yazılımlar mevcut olabilir.

source: Each of the core OpenStack services (Compute, Identity, Networking, Block Storage) store state and configuration information in databases. In this chapter, we discuss how databases are used currently in OpenStack. We also explore security concerns, and the security ramifications of database back end choices.
de: Jeder der Kern-OpenStack-Dienste (Compute, Identity, Networking, Block Storage) speichert Status- und Konfigurationsinformationen in Datenbanken. In diesem Kapitel wird diskutiert, wie Datenbanken derzeit in OpenStack verwendet werden. Wir erforschen auch Sicherheitsbedenken und die Sicherheitsverzweigungen der Datenbank-Back-End-Auswahl.
id: Masing-masing layanan OpenStack inti (Compute, Identity, Networking, Block Storage) menyimpan informasi keadaan dan konfigurasi di database. Pada bab ini, kita membahas bagaimana database digunakan saat ini di OpenStack. Kami juga mengeksplorasi masalah keamanan, dan konsekuensi keamanan dari pilihan back end database.
tr_tr: Çekirdek OpenStack servislerinin her biri (Hesaplama, Kimlik, Ağ Oluşturma, Blok Depolama) veritabanlarındaki durumu ve yapılandırma bilgilerini saklar. Bu bölümde, veritabanlarının şu an OpenStack'te nasıl kullanıldığını tartışıyoruz. Güvenlik endişelerini ve veritabanı arka uç seçeneklerinin güvenlik sonuçlarını keşfediyoruz.

source: Each project may present an inconsistent way of defining target API endpoints. Future releases of OpenStack seek to resolve these inconsistencies through consistent use of the Identity service catalog.
de: Jedes Projekt kann eine inkonsistente Möglichkeit zur Definition von Ziel-API-Endpunkten darstellen. Zukünftige Releases von OpenStack versuchen, diese Inkonsistenzen durch konsequente Nutzung des Identity Service Katalogs zu lösen.
id: Setiap proyek dapat menunjukkan cara yang tidak konsisten untuk menentukan endpoint API target. Rilis OpenStack di masa depan berusaha untuk mengatasi ketidakkonsistenan ini melalui penggunaan katalog layanan Identitas secara konsisten.
tr_tr: Her projenin kendi özel hedef API uç noktası tanımlama yöntemi olabilir. OpenStack'in gelecek sürümleri, bu tutarsızlığa, kimlik servis kataloğu ile bir çözüm bulmaya çalışacaktır.

source: Each project provides a number of services which send and consume messages. Each binary which sends a message is expected to consume messages, if only replies, from the queue.
de: Jedes Projekt bietet eine Reihe von Diensten, die Nachrichten senden und verbrauchen. Jede Binärdatei, die eine Nachricht sendet, wird erwartet, dass sie Nachrichten, wenn auch nur Antworten, aus der Warteschlange verbrauchen.
id: Setiap proyek menyediakan sejumlah layanan yang mengirim dan mengkonsumsi pesan. Setiap biner yang mengirimkan pesan diharapkan bisa mengkonsumsi pesan dari antrian, jika hanya menjawab.
tr_tr: Her proje, mesaj gönderip tüketen bir dizi servis sunmaktadır. Bir ileti gönderen her ikili, yalnızca yanıtlarsa iletileri sıradan tüketmesi beklenir.

source: Each share driver supports at least one of the possible driver modes:
de: Jeder Share-Treiber unterstützt mindestens einen der möglichen Treiber-Modi:
id: Setiap share driveri mendukung setidaknya satu dari mode driver yang mungkin:
tr_tr: Her paylaşım sürücüsü olası sürücü kiplerinden en az birini destekler:

source: Employ multi-factor authentication for network access to privileged user accounts. The Identity service supports external authentication services through the Apache web server that can provide this functionality. Servers may also enforce client-side authentication using certificates.
de: Verwenden Sie die Multi-Faktor-Authentifizierung für den Netzwerkzugriff auf privilegierte Benutzerkonten. Der Identity Service unterstützt externe Authentifizierungsdienste über den Apache Webserver, der diese Funktionalität bereitstellen kann. Server können auch die clientseitige Authentifizierung mit Zertifikaten durchsetzen.
id: Mempekerjakan otentikasi multi-faktor untuk akses jaringan ke akun pengguna istimewa. Layanan Identitas mendukung layanan otentikasi eksternal melalui server web Apache yang dapat menyediakan fungsionalitas ini. Server juga dapat menegakkan otentikasi sisi klien menggunakan sertifikat.
tr_tr: Ayrıcalıklı kullanıcı hesaplarına ağ erişimi için çok faktörlü kimlik doğrulama kullanın. Kimlik servisi, bu işlevselliği sağlayabilen Apache web sunucusu aracılığıyla harici kimlik doğrulama servislerini desteklemektedir. Sunucular ayrıca sertifika kullanarak istemci tarafında kimlik doğrulamasını zorlayabilir.

source: Enable TLS support. Install ``mod_nss`` according to your distribution, then apply the following patch and restart HTTPD:
de: TLS-Unterstützung aktivieren. Installieren Sie ``mod_nss`` entsprechend Ihrer Distribution, dann den folgende Patch anwenden und HTTPD neu starten:
tr_tr: TLS desteğini etkinleştirin. Dağıtımınıza göre ``mod_nss`` `i yükleyin, sonra aşağıdaki yamayı uygulayın ve HTTPD'yi yeniden başlatın:

source: Enable ``OS-FEDERATION`` extension:
de: Aktivieren Sie ``OS-FEDERATION``Erweiterung:
tr_tr: ``OS-FEDERATION`` uzantısını etkinleştirin:

source: Enable encryption and select parameters such as encryption algorithm and key size
de: Verschlüsselung aktivieren und Parameter wie Verschlüsselungsalgorithmus und Schlüsselgröße auswählen
id: Aktifkan enkripsi dan pilih parameter seperti algoritma enkripsi dan ukuran kunci
tr_tr: Şifrelemeyi etkinleştirin ve şifreleme algoritması ve anahtar boyutu gibi parametreleri seçin

source: Enable the Identity service virtual host:
de: Aktivieren Sie den virtuellen Host des Identity-Dienstes:
tr_tr: Sanal konuk Kimlik servisini etkinleştirin:

source: Enable the ``ssl`` and ``shib2`` modules:
de: Aktiviere die ``ssl``und ``shib2``Module:
tr_tr: ``ssl`` ve ``shib2`` modüllerini etkinleştirin:

source: Enabling Federation
de: Ermöglichung der Federation
tr_tr: Federasyonu Etkinleştirme

source: Encrypted live migration
de: Verschlüsselte Live-Migration
id: Migrasi langsung terenkripsi
tr_tr: Şifreli canlı göç

source: Encryption / decryption
de: Verschlüsselung/Entschlüsselung
id: Enkripsi / Dekripsi
tr_tr: Şifreleme / çözme
