Repository: openstack/security-doc
Catalog: security-guide/source/locale/*/LC_MESSAGES/security-guide.po
Languages: de, id, tr_tr

source: Provisioning new identities often incurs some security risk. It is difficult to secure credential storage and to deploy it with proper policies. A common identity store is useful as it can be set up properly once and used in multiple places. With Federated Identity, there is no longer a need to provision user entries in Identity service, since the user entries already exist in the IdP's databases.
de: Die Bereitstellung neuer Identitäten verursacht oft ein gewisses Sicherheitsrisiko. Es ist schwierig, die Berechtigungsspeicherung zu sichern und sie mit geeigneten Richtlinien zu implementieren. Ein gemeinsamer Identitätsspeicher ist nützlich, da er einmal richtig eingerichtet und an mehreren Stellen verwendet werden kann. Mit Federated Identity ist es nicht mehr nötig, Benutzereinträge im Identity Service bereitzustellen, da die Benutzereinträge bereits in den IDP-Datenbanken vorhanden sind.
tr_tr: Yeni kimliklerin sağlanması sıklıkla bazı güvenlik riskleri doğurur. Kimlik bilgisi deposunu güvence altına almak ve uygun politika ile dağıtmak zordur. Ortak bir kimlik deposu, bir kez düzgün bir şekilde kurulabildiği ve birden fazla yerde kullanıldığı için yararlıdır. Federe Kimlik ile artık Kullanıcı girdileri IdP'nin veritabanında mevcut olduğundan, Kimlik hizmetinde kullanıcı girdilerini oluşturmaya gerek yoktur.

source: Proxy domains
de: Proxy-Domänen
id: Domain proxy
tr_tr: Vekil alan adları

source: Proxy services
de: Proxy-Dienste
id: Layanan Proxy
tr_tr: Vekil servisleri

source: Public Key Infrastructure (PKI) is the framework for securing communication in a network. It consists of a set of systems and processes to ensure traffic can be sent securely while validating the identity of the parties. The PKI profile described here is the Internet Engineering Task Force (:term:`IETF`) Public Key Infrastructure (PKIX) profile developed by the PKIX working group. The core components of PKI are:
de: Public Key Infrastructure (PKI) ist der Rahmen für die Sicherung der Kommunikation in einem Netzwerk. Es besteht aus einer Reihe von Systemen und Prozessen, um sicherzustellen, dass der Verkehr sicher während der Validierung der Identität der Parteien gesendet werden kann. Das hier beschriebene PKI-Profil ist das von der PKIX-Arbeitsgruppe entwickelte Internet Engineering Task Force (:term:`IETF`) Public Key Infrastructure (PKIX) Profil. Die Kernkomponenten der PKI sind:
id: Public Key Infrastructure (PKI) adalah kerangka kerja untuk mengamankan komunikasi dalam jaringan. Ini terdiri dari seperangkat sistem dan proses untuk memastikan lalu lintas dapat dikirim dengan aman sambil memvalidasi identitas para pihak. Profil PKI yang dijelaskan di sini adalah Internet Engineering Task Force (:term:`IETF`) profil Public Key Infrastructure (PKIX) yang dikembangkan oleh kelompok kerja PKIX. Komponen inti PKI adalah:
tr_tr: Kamu Anahtar Altyapısı (PKI), bir ağdaki iletişimi sağlamak için kullanılan bir çatıdır. Tarafların kimliğini doğrularken trafiğin güvenli bir şekilde gönderilebilmesini sağlamak için bir dizi sistem ve işlemden oluşur. Burada açıklanan PKI profili PKIX çalışma grubu tarafından geliştirilen İnternet Mühendisliği Görev Gücü (:term:`IETF`) Ortak Anahtar Altyapısı (PKIX) profilidir. PKI'nın temel bileşenleri şunlardır:

source: Public and private cloud considerations
de: Öffentliche und private Cloud-Überlegungen
id: Pertimbangan awan publik dan private
tr_tr: Kamuya açık ve özel bulut hususları

source: Public and private cloud providers that do not have stringent controls on instance use or allow unrestricted internet access to VMs should consider this domain to be *untrusted*. Private cloud providers may want to consider this network as internal and *trusted* only if the proper controls are implemented to assert that the instances and all associated tenants are to be trusted.
de: Öffentliche und private Cloud-Anbieter, die keine strengen Kontrollen auf Instanz verwenden oder einen uneingeschränkten Internetzugriff auf VMs zulassen, sollten diese Domain als *nicht vertrauenswürdig* ansehen. Private Cloud-Provider können dieses Netzwerk als interne und *vertrauenswürdige* nur dann betrachten, wenn die richtigen Kontrollen implementiert sind, um zu behaupten, dass die Instanzen und alle damit verbundenen Tenants vertraut werden sollen.
id: Penyedia awan publik dan private yang tidak memiliki kontrol ketat saat menggunakan atau mengizinkan akses internet yang tidak terbatas ke VMs harus menganggap domain ini sebagai *untrusted*. Penyedia awan private mungkin ingin menganggap jaringan ini sebagai internal dan *trusted* hanya jika kontrol yang tepat diterapkan untuk memastikan bahwa instance dan semua penyewa yang terkait harus dipercaya.
tr_tr: Zorlu denetimlere sahip olmayan kamuya açık ve gizli bulut sağlayıcıları, VM'lere sınırsız İnternet erişimi sağlamak veya izin vermek için izin vermek, bu alanın *güvenilmez* olarak görülmesi gerekir. Özel bulut sağlayıcıları, bu ağın yalnızca dahili ve *güvenilir* olarak değerlendirilmesini isteyebilir; ancak, örneklerin ve ilgili tüm kiracıların güvenileceğini söylemek için uygun denetimler uygulanırsa.

source: Public keys for Compute access
de: Öffentliche Schlüssel für Compute-Zugriff
id: Public key untuk akses Compute
tr_tr: Hesaplama erişimi için genel anahtarlar

source: Purpose
de: Zweck
tr_tr: Amaç

source: PyKMIP library https://github.com/OpenKMIP/PyKMIP
de: PyKMIP-Bibliothek https://github.com/OpenKMIP/PyKMIP

source: Qpid server SSL configuration
de: Qpid Server SSL Konfiguration
id: Konfigurasi SSL server Qpid
tr_tr: Qpid sunucu SSL yapılandırması

source: Queue authentication and access control
de: Warteschlangenauthentifizierung und Zugriffskontrolle
id: Antrian otentikasi dan kontrol akses
tr_tr: Kuyruk kimlik doğrulaması ve erişim kontrolü

source: Queue servers should only accept connections from the management network. This applies to all implementations. This should be implemented through configuration of services and optionally enforced through global network policy.
de: Warteschlangenserver sollten nur Verbindungen vom Verwaltungsnetzwerk akzeptieren. Dies gilt für alle Implementierungen. Dies sollte durch die Konfiguration von Diensten implementiert und optional durch globale Netzwerkpolitik erzwungen werden.
id: Server antrian seharusnya hanya menerima koneksi dari jaringan manajemen. Ini berlaku untuk semua implementasi. Ini harus dilaksanakan melalui konfigurasi layanan dan secara opsional ditegakkan melalui kebijakan jaringan global.
tr_tr: Kuyruk sunucuları yalnızca yönetim ağından bağlantıları kabul etmelidir. Bu, tüm uygulamalar için de geçerlidir. Bu, servislerin yapılandırılması yoluyla uygulanmalı ve isteğe bağlı olarak küresel ağ ilkesi aracılığıyla uygulanmalıdır.

source: Quotas
de: Kontingente
id: Kuota-kuota
tr_tr: Kotalar

source: Quotas provide the ability to limit the number of network resources available to projects. You can enforce default quotas for all projects. The ``/etc/neutron/neutron.conf`` includes these options for quota:
de: Kontingente bieten die Möglichkeit, die Anzahl der für die Projekte verfügbaren Netzwerkressourcen zu begrenzen. Sie können Standardkontingente für alle Projekte erzwingen. Die ``/etc/neutron/neutron.conf``enthält diese Optionen für Kontingent:
id: Kuota memberikan kemampuan untuk membatasi jumlah sumber daya jaringan yang tersedia untuk proyek. Anda dapat menerapkan kuota default untuk semua proyek. The ``/etc/neutron/neutron.conf`` menyertakan opsi ini untuk kuota:
tr_tr: Kotalar, projeler için mevcut ağ kaynaklarının sayısını sınırlama olanağı sağlar. Tüm projeler için varsayılan kotaları zorlayabilirsiniz. ``/etc/neutron/neutron.conf``, kota için şu seçenekleri içerir:

source: RPM packages:
de: RPM-Pakete:
id: Paket RPM:
tr_tr: RPM paketleri:

source: RabbitMQ and Qpid offer authentication and access control mechanisms for controlling access to queues. ZeroMQ offers no such mechanisms.
de: RabbitMQ und Qpid bieten Authentifizierungs- und Zugriffssteuerungsmechanismen für den Zugriff auf Warteschlangen. ZeroMQ bietet keine solchen Mechanismen.
id: RabbitMQ dan Qpid menawarkan otentikasi dan mekanisme kontrol akses untuk mengendalikan akses ke antrian. ZeroMQ tidak menawarkan mekanisme semacam itu.
tr_tr: RabbitMQ ve Qpid, kuyruklara erişimi kontrol etmek için kimlik doğrulama ve erişim kontrol mekanizmaları sunar. ZeroMQ'da böyle bir mekanizma bulunmamaktadır.

source: RabbitMQ server SSL configuration
de: RabbitMQ Server SSL Konfiguration
id: Konfigurasi SSL server RabbitMQ
tr_tr: RabbitMQ sunucu SSL yapılandırması

source: Rate Limiting is a means to control the frequency of events received by a network based application. When robust rate limiting is not present, it can result in an application being susceptible to various denial of service attacks. This is especially true for APIs, which by their nature are designed to accept a high frequency of similar request types and operations.
de: Rate Limiting ist ein Mittel, um die Häufigkeit der Ereignisse zu kontrollieren, die von einer netzwerkbasierten Anwendung empfangen werden. Wenn eine robuste Ratenbegrenzung nicht vorhanden ist, kann dies dazu führen, dass eine Anwendung anfällig für verschiedene Denial-of-Service-Angriffe ist. Dies gilt insbesondere für APIs, die ihrer Natur nach eine hohe Frequenz ähnlicher Anforderungsarten und Operationen annehmen sollen.
id: Rate Limiting adalah sarana untuk mengontrol frekuensi kejadian yang diterima oleh aplikasi berbasis jaringan. Bila pembatas laju yang kuat tidak ada, hal itu dapat mengakibatkan aplikasi menjadi rentan terhadap berbagai penolakan serangan layanan. Hal ini terutama berlaku untuk API, yang menurut sifatnya dirancang untuk menerima frekuensi permintaan dan jenis permintaan yang sama.
tr_tr: Oran Sınırlama, bir ağ tabanlı uygulamadan gelen olay frekansını kontrol etmek demektir. Güçlü oran sınırlama mevcut değilse, bu uygulamanın hizmet kesintisi saldırılarına müsat olmasına yol açar. Bu özellikle doğası gereği yüksek frenkasta benzer istek türleri ve oprasyonu kabul eden API'ler için doğrudur.

source: Read-only file system
de: Nur-Lese-Dateisystem
id: Sistem file read-only
tr_tr: Salt okunur dosya sistemi

source: Recommendations given in this guide cannot effectively guard against known attacks if you deploy the dashboard in a domain that also hosts user-generated content, even when this content resides on a separate sub-domain. User-generated content can consist of scripts, images, or uploads of any type. Most major web presences, including googleusercontent.com, fbcdn.com, github.io, and twimg.co, use this approach to segregate user-generated content from cookies and security tokens.
de: Empfehlungen, die in diesem Leitfaden gegeben werden, können nicht wirksam gegen bekannte Angriffe schützen, wenn Sie das Dashboard in einer Domäne bereitstellen, die auch benutzergenerierte Inhalte hostet, auch wenn sich dieser Inhalt auf einer separaten Subdomain befindet. Benutzergenerierte Inhalte können aus Skripten, Abbildern oder Uploads jeglicher Art bestehen. Die meisten großen Web-Auftritte, einschließlich googleusercontent.com, fbcdn.com, github.io und twimg.co, verwenden Sie diesen Ansatz, um User-generated Content aus Cookies und Sicherheitstoken zu trennen.
id: Rekomendasi yang diberikan dalam panduan ini tidak dapat secara efektif mencegah serangan yang diketahui jika Anda memasang dasbor di domain yang juga menghosting konten buatan pengguna, meskipun konten ini berada pada sub-domain terpisah. Konten buatan pengguna dapat terdiri dari skrip, gambar, atau upload jenis apa pun. Sebagian besar kehadiran web utama, termasuk googleusercontent.com, fbcdn.com, github.io, dan twimg.co, gunakan pendekatan ini untuk memisahkan konten buatan pengguna dari cookie dan token keamanan.
tr_tr: Bu kılavuzda verilen öneriler, kullanıcı tarafından oluşturulan içeriği de barındıracak bir alanda, bu içerik ayrı bir alt etki alanında bulunsa bile gösterge tablosunu yerleştirirseniz, bilinen saldırılara karşı etkili bir şekilde koruma sağlayamaz. Kullanıcı tarafından oluşturulan içerik, komut dosyaları, resimler veya herhangi bir türden yüklemeler içerebilir. googleusercontent.com, fbcdn.com, github.io ve twimg.co dahil çoğu büyük web varlığı, kullanıcı tarafından oluşturulan içeriği çerezlerden ve güvenlik belirteçlerinden ayırmak için bu yaklaşımı kullanır.

source: Recommended in: :doc:`../compute`.
de: Empfohlen in:: doc:`../ compute`.
id: Direkomendasikan di: :doc:`../compute`.
tr_tr: Şurada önerilmiştir: :doc:`../compute`.

source: Recommended in: :doc:`../secure-communication`.
de: Empfohlen in: :doc:`../secure-communication`.
id: Direkomendasikan di: :doc:`../secure-communication`.
tr_tr: :doc:`../secure-communication` de önerildi.

source: Recommended in: :doc:`cookies`.
de: Empfohlen in:: doc: `cookies`.
id: Direkomendasikan di: :doc:`cookies`.
tr_tr: :doc:`cookies` de önerildi.

source: Recommended in: :doc:`https-hsts-xss-ssrf`.
de: Empfohlen in: :doc:`https-hsts-xss-ssrf`.
id: Direkomendasikan di: :doc:`https-hsts-xss-ssrf`.
tr_tr: :doc:`https-hsts-xss-ssrf` de önerildi.

source: Recommended in: :doc:`tokens`.
de: Empfohlen in: :doc:`tokens`.
id: Direkomendasikan di: :doc:`tokens`.
tr_tr: Şurada önerildi :doc:`tokens`

source: Recommended in: :ref:`internally-implemented-authentication-methods`.
de: Empfohlen in: :ref:`internally-implemented-authentication-methods`
id: Direkomendasikan di: :ref:`internally-implemented-authentication-methods`.
tr_tr: :ref:`internally-implemented-authentication-methods` belgesinde önerildi.

source: Red Hat Enterprise Linux-based KVM deployments utilize the following sVirt booleans:
de: Red Hat Enterprise Linux-basierte KVM-Implementierungen nutzen die folgenden sVirt booleans:
id: Pengerahan KVM berbasis Linux Red Hat Enterprise memanfaatkan boolean sVirt berikut:
tr_tr: Red Hat Kurumsal Linux tabanlı KVM dağıtımları aşağıdaki sVirt booleanlarını kullanır:

source: Redhat.com/solutions, Using SSL Encryption with OpenStack nova-novacproxy. 2014. `OpenStack nova-novncproxy SSL encryption <https://access.redhat.com/solutions/514143>`_
de: Redhat.com/solutions, mit SSL-Verschlüsselung mit OpenStack nova-novacproxy. 2014. `OpenStack nova-novncproxy SSL-Verschlüsselung <https://access.redhat.com/solutions/514143>`_
tr_tr: Redhat.com/solutions, OpenStack nova-novacproxy ile SSL Şifreleme kullanmak. 2014. `OpenStack nova-novncproxy SSL şifreleme <https://access.redhat.com/solutions/514143>`_

source: Register
de: Neu registrieren
tr_tr: Kayıt

source: Registration Authority (RA)
de: Registrierungsstelle (RA)
tr_tr: Kayıt Otoritesi (RA)

source: Related Openstack Projects
de: Verwandte Openstack-Projekte
id: Proyek Openstack Terkait

source: Relying party
de: Beteiligte Parteien
tr_tr: Güvenme partisi

source: Remove packages and stop services
de: Pakete entfernen und Dienste aufheben
id: Hapus paket dan stop service
tr_tr: Paketleri kaldırın ve servisleri durdurun

source: Removes a blocker to cloud brokering and multi-cloud workload management. There is no need to build additional authentication mechanisms to authenticate users, since the IdPs take care of authenticating their own users using whichever technologies they deem to be appropriate. In most organizations, multiple authentication technologies are already in use.
de: Entfernt einen Blocker zum Cloud-Brokering und Multi-Cloud-Workload-Management. Es besteht keine Notwendigkeit, zusätzliche Authentifizierungsmechanismen zu bauen, um Benutzer zu authentifizieren, da die IdPs sich um die Authentifizierung ihrer eigenen Benutzer kümmern, welche Technologien sie für angemessen halten. In den meisten Organisationen sind bereits mehrere Authentifizierungstechnologien im Einsatz.
tr_tr: Bulut aracılık ve çoklu bulut iş yükü yönetimine karşı bir engelleyici kaldırır. Kullanıcıları kimlik doğrulaması yapmak için ek kimlik doğrulama mekanizmaları kurmaya ihtiyaç yoktur, çünkü IdP'ler kendi kullanıcılarını uygun gördükleri teknolojileri kullanarak kimlik doğrulamasına özen gösterirler. Çoğu organizasyonda, çoklu kimlik doğrulama teknolojisi zaten kullanımdadır.

source: Replace RABBIT\_PASS with a suitable password.
de: Ersetzen Sie RABBIT\_PASS durch ein passendes Passwort.
id: Ganti RABBIT \ _PASS dengan password yang sesuai.
tr_tr: RABBIT\_PASS yerine uygun bir parola yazın.

source: Replace ``MANAGEMENT_IP`` with the management IP address of your controller node.
de: Ersetzen Sie ``MANAGEMENT_IP`` mit der Management-IP Adresse Ihres Controller Knotens.
id: Ganti `` MANAGEMENT_IP`` dengan alamat IP manajemen dari node controller Anda.
tr_tr: ``MANAGEMENT_IP`` yi denetleyici düğümünüzün yönetim IP adresi ile değiştirin.

source: Reported security bugs that are found to be the result of a misconfiguration, or are not strictly part of OpenStack are drafted into OpenStack Security Notes (OSSNs). These include configuration issues such as ensuring Identity provider mappings as well as non-OpenStack but critical issues such as the Bashbug/Ghost or Venom vulnerabilities that affect the platform OpenStack utilizes. The current set of OSSNs is in the Security Note wiki (`https://wiki.openstack.org/wiki/Security_Notes <https://wiki.openstack.org/wiki/Security_Notes>`_).
de: Berichtete Sicherheitsfehler, die das Ergebnis einer Fehlkonfiguration sind oder nicht strikt Teil von OpenStack sind, werden in OpenStack Security Notes (OSSNs) verfasst. Dazu gehören Konfigurationsprobleme wie die Gewährleistung von Identity Provider-Zuordnungen sowie Nicht-OpenStack aber kritische Probleme wie die Bashbug/Ghost- oder Venom-Schwachstellen, die die Plattform beeinflussen, die OpenStack nutzt. Der aktuelle Satz von OSSNs befindet sich im Security Note Wiki (`https://wiki.openstack.org/wiki/Security_Notes <https://wiki.openstack.org/wiki/Security_Notes>`_).

source: Reported security bugs that are found to be the result of a misconfiguration, or are not strictly part of OpenStack, are drafted into OpenStack Security Notes (OSSNs). These include configuration issues such as ensuring identity provider mappings as well as non-OpenStack, but critical, issues such as the Bashbug/Ghost or Venom vulnerabilities that affect the platform OpenStack utilizes. The current set of OSSNs is in the `Security Note wiki <https://wiki.openstack.org/wiki/Security_Notes>`_.
de: Berichtete Sicherheitsfehler, die das Ergebnis einer Fehlkonfiguration sind oder nicht strikt Teil von OpenStack sind, werden in OpenStack Security Notes (OSSNs) verfasst. Dazu gehören Konfigurationsprobleme wie die Gewährleistung von Identity Provider-Zuordnungen sowie Nicht-OpenStack, aber kritische Probleme wie die Bashbug/Ghost- oder Venom-Schwachstellen, die die Plattform beeinflussen, die OpenStack nutzt. Der aktuelle Satz von OSSNs befindet sich im `Security Note Wiki <https://wiki.openstack.org/wiki/Security_Notes>`_.
id: Bug keamanan yang dilaporkan yang ditemukan sebagai hasil misconfiguration, atau tidak secara ketat merupakan bagian dari OpenStack, dirancang ke dalam OpenStack Security Notes (OSSNs). Ini termasuk masalah konfigurasi seperti memastikan pemetaan penyedia identitas dan juga masalah non-OpenStack, namun kritis, seperti kerentanan Bashbug/Ghost atau Venom yang mempengaruhi platform yang digunakan OpenStack. Kumpulan OSSN saat ini ada di `Security Note wiki <https://wiki.openstack.org/wiki/Security_Notes>`_.
tr_tr: Bir hatalı yapılandırmadan kaynaklandığı veya açıkça OpenStack'in bir parçası olmadığı tespit edilen bildirilen güvenlik hataları OpenStack Güvenlik Notları'na (OSSN'ler) hazırlanır. Bunlar, OpenStack olmayan kimlik sağlayıcı eşleştirmelerinin sağlanması gibi yapılandırma sorunlarını içerir, ancak OpenStack'ın kullandığı platformu etkileyen Bashbug / Ghost veya Venom açıkları gibi kritik meselelerdir. OSSN'lerin mevcut kümesi `Güvenlik Notu wiki'sinde <https://wiki.openstack.org/wiki/Security_Notes>`_ yer alır.

source: Require user accounts to require SSL transport
de: Benötigte Benutzerkonten für SSL-Transport
id: Perlu akun pengguna untuk meminta transport SSL
tr_tr: Kullanıcı hesaplarının SSL taşımasını gerektir

source: Required for dynamic attestation services
de: Erforderlich für dynamische Bescheinigungsleistungen
id: Diperlukan untuk layanan pengesahan dinamis
tr_tr: Dinamik onaylama servisleri için gereklidir

source: Required for protecting PCI-passthrough
de: Erforderlich zum Schutz von PCI-Passthrough
id: Diperlukan untuk melindungi PCI-passthrough
tr_tr: PCI-geçişi korumak için gerekli

source: Required to allow secure sharing of PCI Express devices
de: Erforderlich für eine sichere Freigabe von PCI Express Geräten
id: Diperlukan untuk mengizinkan berbagi perangkat PCI Express yang aman
tr_tr: PCI Express cihazlarının güvenli paylaşımına izin vermek için gereklidir

source: Requires user passwords to conform to minimum standards for length, diversity of characters, expiration, or failed login attempts. In an external authentication scenario this would be the password policy on the original identity store.
de: Benötigt Benutzerpasswörter, um Mindeststandards für Länge, Vielfalt von Zeichen, Ablauf oder fehlgeschlagene Anmeldeversuche anzupassen. In einem externen Authentifizierungsszenario wäre dies die Kennwortrichtlinie auf dem ursprünglichen Identitätsspeicher.
id: Memerlukan password pengguna agar sesuai dengan standar panjang minimum, keragaman karakter, kekedaluwarsaan, atau usaha login yang gagal. Dalam skenario otentikasi eksternal, ini adalah kebijakan password pada identity store aslinya.
tr_tr: Uzunluk, karakter çeşitliliği, son kullanma tarihi veya başarısız oturum açma girişimleri için kullanıcı parolalarının asgari standartlara uymasını gerektirir. Harici kimlik doğrulama senaryosunda, bu özgün kimlik deposundaki parola politikası olacaktır.

source: Resource based filters
de: Ressourcenbasierte Filter
id: Filter berbasis sumber daya
tr_tr: Kaynak tabanlı filtreler

source: Resources
de: Ressourcen
id: Sumber daya
tr_tr: Kaynaklar

source: Responsible for managing Shared File Service devices, specifically the back-end devices.
de: Verantwortlich für die Verwaltung von Shared File Service Geräten, speziell die Back-End-Geräte.
id: Bertanggung jawab untuk mengelola perangkat Shared File Service, khususnya perangkat back-end.
tr_tr: Paylaşımlı Dosya Servisi cihazlarını, özellikle arka uç cihazlarını yönetmekle sorumludur.

source: Responsible for scheduling and routing requests to the appropriate ``manila-share`` service. It does that by picking one back-end while filtering all except one back-end.
de: Verantwortlich für die Planung und Weiterleitung von Anfragen an den entsprechenden ``Manila-Share``Service. Es tut das, indem Sie ein Back-End auswählen, während Sie alle außer einem Back-End filtern.
id: Bertanggung jawab atas penjadwalan dan permintaan routing ke layanan `manila-share` yang sesuai. Hal itu dilakukan dengan memilih satu back-end sambil menyaring semua kecuali satu back-end.
tr_tr: İstekleri uygun ``manila-share`` servisine planlamak ve yönlendirme yapmaktan sorumludur. Bunu, bir arka uç hariç tümü süzülmüşken bir arka uç seçerek yapar.

source: Restart Apache:
de: Neustart Apache:
tr_tr: Apache'yi yeniden başlatın

source: Restart the Shibboleth daemon:
de: Starten Sie den Shibboleth-Daemon neu:
tr_tr: Shibboleth servisini yeniden başlatın:

source: Restrict DB and RPC communication of the OpenStack Networking services
de: Beschränkung der DB- und RPC-Kommunikation der OpenStack Networking-Dienste
id: Batasi komunikasi DB dan RPC dari layanan OpenStack Networking
tr_tr: OpenStack Ağ servislerinin DB ve RPC iletişimini kısıtlama
