Repository: openstack/security-doc
Catalog: security-guide/source/locale/*/LC_MESSAGES/security-guide.po
Languages: de, id, tr_tr

source: Unless it is not explicitly changed in the ``policy.json``, either an administrator or the tenant that owns a share are able to manage :ref:`access to the shares <shared_fs_share_acl>`. Access management is done by creating access rules with authentication through IP address, user, group, or TLS certificates. Available authentication methods depend on which share driver and security service you configure and use.
de: Sofern es nicht ausdrücklich in der ``policy.json``geändert wird, kann entweder ein Administrator oder der Tenant, der eine Freigabe besitzt, mit :ref:`Zugriff auf die Freigabe <shared_fs_share_acl>` verwalten. Die Zugriffsverwaltung erfolgt durch die Erstellung von Zugriffsregeln mit Authentifizierung über IP-Adresse, Benutzer-, Gruppen- oder TLS-Zertifikate. Verfügbare Authentifizierungsmethoden hängen davon ab, welchen Share-Treiber und Sicherheitsdienst Sie konfigurieren und verwenden.
id: Unless it is not explicitly changed in the ``policy.json``, either an administrator or the tenant that owns a share are able to manage :ref:`access to the shares <shared_fs_share_acl>`. Manajemen akses dilakukan dengan membuat aturan akses dengan otentikasi melalui sertifikat IP address, user, group, atau TLS. Metode otentikasi yang tersedia bergantung pada pengandar berbagi dan layanan keamanan yang Anda konfigurasikan dan gunakan.
tr_tr: ``policy.json`` dosyasında açıkça değiştirilmediği sürece bir yönetici veya bir paylaşıma sahip olan kiracı :ref:`paylaşımlara erişim <shared_fs_share_acl>` sağlayabilir. Erişim yönetimi, IP adresi, kullanıcı, grup veya TLS sertifikaları aracılığıyla kimlik doğrulama ile erişim kuralları oluşturarak yapılır. Kullanılabilir kimlik doğrulama yöntemleri, yapılandırdığınız ve kullandığınız güvenlik ve paylaşım sürücüsüne bağlıdır.

source: Unlike *no share servers* mode, in *share servers* mode users have a share network and a share server that is created for each share network. Thus all users have separate CPU, amount of CPU time, network, capacity and throughput.
de: Im Gegensatz zu *no share servers* -Modus, in *share servers* Modus haben Benutzer ein Share-Netzwerk und einen Share-Server, der für jedes Share-Netzwerk erstellt wird. So haben alle Benutzer eine separate CPU, CPU-Zeit, Netzwerk, Kapazität und Durchsatz.
id: Tidak seperti mode *no share servers* , di mode *share server * pengguna memiliki jaringan berbagi dan server berbagi yang dibuat untuk setiap jaringan berbagi. Dengan demikian semua pengguna memiliki CPU terpisah, jumlah waktu CPU, jaringan, kapasitas dan throughput.
tr_tr: *paylaşım sunucusu yok* kipinden farklı olarak *paylaşım sunucusu* kipinde kullanıcılar bir paylaşım ağı ve her paylaşım ağı için oluşturulan bir paylaşım sunucusuna sahipler. Böylece tüm kullanıcılar ayrı CPU, CPU zamanı, ağ, kapasite ve verimlilik kapasitesine sahiptir.

source: Unlike UUID, PKI and PKIZ tokens, fernet tokens do not require persistence. The keystone token database no longer suffers bloat as a side effect of authentication. Pruning expired tokens from the token database is no longer required when using fernet tokens. Since fernet tokens are non-persistent, they do not have to be replicated. As long as each keystone node shares the same repository, fernet tokens can be created and validated instantly across nodes.
de: Im Gegensatz zu UUID-, PKI- und PKIZ-Token benötigen Fernet-Token keine Persistenz. Die Keystone-Token-Datenbank erleidet nicht mehr als Nebeneffekt der Authentifizierung. Das Beschneiden abgelaufener Token aus der Token-Datenbank ist bei der Verwendung von Fernet-Token nicht mehr erforderlich. Da Fernet-Token nicht persistent sind, müssen sie nicht repliziert werden. Solange jeder Keystone-Knoten das gleiche Repository teilt, können Fernet-Token sofort über Knoten erstellt und validiert werden.
tr_tr: UUID, PKI ve PKIZ belirteçlerinin aksine, fernet belirteçleri kalıcılık gerektirmez. Keystone belirteci veritabanı artık kimlik doğrulamanın bir yan etkisi olarak kabarıklık çekmiyor. Fernet belirteçlerini kullanırken, süresi dolmuş belirteçleri artık belirteç veritabanından kaldırmak gerekmiyor. Fernet belirteçleri kalıcı olmadığından, çoğaltılmaları gerekmez. Her keystone düğümü aynı deposuyu paylaştığı sürece, fernet belirteçleri düğümler arasında anında oluşturulabilir ve onaylanabilir.

source: Unlike many similar systems, the OpenStack dashboard allows the entire Unicode character set in most fields. This means developers have less latitude to make escaping mistakes that open attack vectors for cross-site scripting (XSS).
de: Im Gegensatz zu vielen ähnlichen Systemen erlaubt das OpenStack-Dashboard den gesamten Unicode-Zeichensatz in den meisten Feldern. Dies bedeutet, dass Entwickler weniger Spielraum haben, um Flüchtigkeitsfehler zu machen, die Angriffsvektoren für Cross-Site-Scripting (XSS) öffnen.
id: Tidak seperti banyak sistem serupa, dasbor OpenStack memungkinkan seluruh karakter Unicode diatur di sebagian besar bidang. Ini berarti pengembang memiliki garis lintang (latitude) yang lebih sedikit untuk membuat kesalahan melarikan diri (escaping mistake) yang membuka vektor serangan untuk cross-site scripting (XSS).
tr_tr: Birçok benzer sistemin aksine, OpenStack paneli çoğu alanda Unicode karakter setinin tamamını sağlar. Bu, geliştiricilerin siteler arası komut (XSS) için saldırı vektörlerini açan kaçak hatalar yapmak için daha az izin verdiği anlamına gelir.

source: Updates and patches
de: Updates und Patches
id: Pembaruan dan tambalan (patch)
tr_tr: Güncellemeler ve yamalar

source: Upload your Service Provider’s metadata file to your Identity Provider.
de: Laden Sie die Metadaten-Datei Ihres Dienstanbieters an Ihren Identity Provider.
tr_tr: Servis Sağlayıcınızın meta veri dosyasını Kimlik Sağlayıcıya yükleyin.

source: Use Cases
de: Anwendungsfälle
id: Gunakan Kasus

source: Use a dedicated and hardened backup servers. The logs for the backup server must be monitored daily and accessible by only few individuals.
de: Verwenden Sie einen dedizierten und gehärteten Backup-Server. Die Protokolle für den Backup-Server müssen täglich überwacht und nur wenigen Personen zugänglich sein.
id: Gunakan server backup dedicated dan hardened. Log untuk server backup harus dipantau setiap hari dan hanya dapat diakses oleh beberapa individu.
tr_tr: Özel ve sıkılaştırılmış yedekleme sunucuları kullanın. Yedekleme sunucusu günlükleri günlük olarak izlenmelidir ve yalnızca birkaç kişi tarafından erişilebilir olmalıdır.

source: Use a private (V)LAN network segment for your storage nodes in the data domain.
de: Verwenden Sie ein privates (V) LAN-Netzwerksegment für Ihre Speicherknoten im Datenbereich.
id: Gunakan segmen jaringan (V)LAN pribadi untuk node penyimpanan Anda di domain data.
tr_tr: Veri alanındaki depolama düğümleriniz için özel bir (V)LAN ağ segmenti kullanın.

source: Use a read-only file system where possible. Ensure that writeable file systems do not permit execution. This can be handled with the ``noexec``, ``nosuid``, and ``nodev`` mount options in ``/etc/fstab``.
de: Verwenden Sie ggf. ein schreibgeschütztes Dateisystem. Stellen Sie sicher, dass beschreibbare Dateisysteme keine Ausführung zulassen. Dies kann mit dem ``noexec``, ``nosuid``und ``nodev``mount Optionen in ``/etc/ fstab``behandelt werden.
id: Gunakan sistem file read-only jika memungkinkan. Pastikan sistem berkas yang dapat ditulis tidak mengizinkan eksekusi. Ini bisa ditangani dengan opsi mount ``noexec``, ``nosuid``, dan ``nodev`` di ``/etc/fstab``.
tr_tr: Mümkün olduğunda salt okunur bir dosya sistemi kullanın. Yazılabilir dosya sistemlerinin çalıştırmaya izin vermediğinden emin olun. Bu, ``/etc/fstab`` de ``noexec``, ``nosuid`` ve ``nodev`` mount seçenekleriyle işlenebilir.

source: Use both mandatory access controls (MACs) and discretionary access controls (DACs) to restrict the configuration for processes to only those processes. This restriction prevents these processes from being isolated from other processes that run on the same machine(s).
de: Verwenden Sie sowohl obligatorische Zugriffskontrollen (MACs) als auch diskretionäre Zugriffskontrollen (DACs), um die Konfiguration für Prozesse nur auf diese Prozesse zu beschränken. Diese Einschränkung verhindert, dass diese Prozesse von anderen Prozessen isoliert werden, die auf derselben Maschine laufen.
id: Gunakan kontrol akses wajib (mandatory access control / MACs) dan discretionary access controls (DAC) untuk membatasi konfigurasi proses hanya pada proses tersebut. Pembatasan ini mencegah proses ini terisolasi dari proses lain yang berjalan pada mesin yang sama.
tr_tr: İşlemlerin yapılandırmasını yalnızca bu işlemlere sınırlandırmak için zorunlu erişim kontrollerini (MAC'ler) ve isteğe bağlı erişim denetimlerini (DAC'ler) kullanın. Bu kısıtlama, bu işlemlerin aynı makinede (çalışanların) çalıştığı diğer süreçlerden izole edilmesini önler.

source: Use data encryption options for storage and transmission of backups.
de: Verwenden Sie Datenverschlüsselungsoptionen für die Speicherung und Übertragung von Backups.
id: Gunakan opsi enkripsi data untuk penyimpanan dan pengiriman backup.
tr_tr: Yedeklerin depolanması ve aktarılması için veri şifreleme seçeneklerini kullanın.

source: Use of the OpenStack volume encryption feature is highly encouraged. This is discussed below in the Data Encryption section under Volume Encryption. When this feature is used, destruction of data is accomplished by securely deleting the encryption key. The end user can select this feature while creating a volume, but note that an admin must perform a one-time set up of the volume encryption feature first. Instructions for this setup are in the block storage section of the `Configuration Reference <https://docs.openstack.org/ocata/config-reference/block-storage/volume-encryption.html>`__ , under volume encryption.
de: Die Verwendung der OpenStack-Volume-Verschlüsselungsfunktion ist sehr fortschrittlich. Dies wird im Abschnitt Datenverschlüsselung unter Volume Encryption beschrieben. Wenn diese Funktion verwendet wird, wird die Zerstörung von Daten durch sicheres Löschen des Verschlüsselungsschlüssels erreicht. Der Endbenutzer kann diese Funktion beim Erstellen eines Datenträgers auswählen, aber beachten Sie, dass ein Administrator eine einmalige Einrichtung der Volume-Verschlüsselungsfunktion zuerst durchführen muss. Anleitungen für dieses Setup befinden sich im Blockspeicherabschnitt der `Configuration Reference <https://docs.openstack.org/ocata/config-reference/block-storage/volume-encryption.html>`__, unter Volumenverschlüsselung.
id: Penggunaan fitur enkripsi volume OpenStack sangat dianjurkan. Ini dibahas di bawah ini di bagian Data Encryption di bawah Volume Encryption. Bila fitur ini digunakan, penghancuran data dilakukan dengan melepaskan kunci enkripsi secara aman. End user dapat memilih fitur ini saat membuat volume, namun perhatikan bahwa seorang admin harus melakukan pengaturan enkripsi volume satu kali terlebih dahulu. Petunjuk untuk penyiapan ini ada di bagian penyimpanan blok pada `Configuration Reference <https://docs.openstack.org/ocata/config-reference/block-storage/volume-encryption.html>`__ , di bawah enkripsi volume.
tr_tr: OpenStack hacim şifreleme özelliğinin kullanılması son derece teşvik edilir. Aşağıda, Hacim Şifrelemesi altındaki Veri Şifreleme bölümünde açıklanmıştır. Bu özellik kullanıldığında, verilerin tahrip edilmesi, şifreleme anahtarının güvenli bir şekilde silinmesi ile gerçekleştirilir. Son kullanıcı, bir hacim oluştururken bu özelliği seçebilir ancak bir yöneticinin önce bir kerede hacim şifreleme özelliğini kurması gerektiğini unutmayın. Bu kurulumla ilgili talimatlar, hacim şifrelemesi altında `Yapılandırma Referansında <https://docs.openstack.org/ocata/config-reference/block-storage/volume-encryption.html>`__ blok depolama bölümündedir.

source: Use strong passwords and safeguard them, or use client-side TLS authentication.
de: Verwenden Sie starke Passwörter und schützen Sie sie, oder verwenden Sie die clientseitige TLS-Authentifizierung.
id: Gunakan kata sandi yang kuat dan jaga mereka, atau gunakan otentikasi TLS sisi klien.
tr_tr: Güçlü parolalar kullanın ve bunları koruyun veya istemci tarafında TLS kimlik doğrulamasını kullanın.

source: Used by
de: Benutzt von
tr_tr: Kullanan

source: Used for VM data communication within the cloud deployment. The IP addressing requirements of this network depend on the OpenStack Networking plug-in in use and the network configuration choices of the virtual networks made by the tenant. This network is considered the Guest Security Domain.
de: Wird für die VM-Datenkommunikation innerhalb der Cloud-Bereitstellung verwendet. Die IP-Adressierungsanforderungen dieses Netzwerks hängen vom verwendeten Plug-In von OpenStack Networking und den Netzwerkkonfigurationsmöglichkeiten der virtuellen Netzwerke des Tenants ab. Dieses Netzwerk gilt als Guest Security Domain.
id: Digunakan untuk komunikasi data VM dalam penyebaran awan. Persyaratan pengalamatan IP dari jaringan ini bergantung pada plug-in OpenStack Networking yang digunakan dan pilihan konfigurasi jaringan dari jaringan virtual yang dibuat oleh penyewa. Jaringan ini dianggap sebagai Guest Security Domain.
tr_tr: Bulut dağıtımında VM veri iletişimi için kullanılır. Bu ağın IP adresleme gereksinimleri, kullanılan OpenStack Ağ eklentisine ve kiracının yaptığı sanal ağların ağ yapılandırma seçeneklerine bağlıdır. Bu ağ, Konuk Güvenlik Bölgesi olarak kabul edilir.

source: Used for internal communication between OpenStack Components. The IP addresses on this network should be reachable only within the data center and is considered the Management Security Domain.
de: Wird für die interne Kommunikation zwischen OpenStack-Komponenten verwendet. Die IP-Adressen in diesem Netzwerk sollten nur innerhalb des Rechenzentrums erreichbar sein und gelten als Management Security Domain.
id: Digunakan untuk komunikasi internal antara OpenStack Components. Alamat IP pada jaringan ini harus dapat dicapai hanya di dalam data center dan dianggap sebagai Management Security Domain.
tr_tr: OpenStack Bileşenleri arasındaki dahili iletişim için kullanılır. Bu ağdaki IP adresleri yalnızca veri merkezi içinde erişilebilir olmalıdır ve Yönetim Güvenlik Alanı olarak kabul edilir.

source: Used to provide VMs with Internet access in some deployment scenarios. The IP addresses on this network should be reachable by anyone on the Internet. This network is considered to be in the Public Security Domain.
de: Wird verwendet, um VMs mit Internetzugang in einigen Bereitstellungsszenarien zur Verfügung zu stellen. Die IP-Adressen in diesem Netzwerk sollten von jedermann im Internet erreichbar sein. Dieses Netzwerk gilt als in der Public Security Domain.
id: Digunakan untuk menyediakan VM dengan akses Internet dalam beberapa skenario penyebaran. Alamat IP pada jaringan ini harus dapat dijangkau oleh siapapun di Internet. Jaringan ini dianggap berada dalam Public Security Domain.
tr_tr: Bazı yayına alma senaryolarında VM'lere İnternet erişimi sağlamak için kullanılır. Bu ağdaki IP adreslerine, İnternet'teki herkes erişebilir olmalıdır. Bu ağın Ortak Güvenlik Alanında olduğu kabul edilir.

source: User access to resources
de: Benutzerzugriff auf Ressourcen
id: Akses pengguna ke sumber daya
tr_tr: Kullanıcıların kaynaklara erişimi

source: User's "Real Name"
de: Benutzer "Richtiger Name"
id: "Real Name" pengguna
tr_tr: Kullanıcının "Gerçek Adı"

source: User, process, or system that is the subject of a certificate. The end entity sends its certificate request to a Registration Authority (RA) for approval. If approved, the RA forwards the request to a Certification Authority (CA). The Certification Authority verifies the request and if the information is correct, a certificate is generated and signed. This signed certificate is then send to a Certificate Repository.
de: Benutzer, Prozess oder System, das Gegenstand eines Zertifikats ist. Die Endentität sendet ihre Zertifikatsanforderung an eine Registrierungsstelle (RA) zur Genehmigung. Wenn sie zugelassen ist, leitet die RA die Anfrage an eine Zertifizierungsstelle (CA) weiter. Die Zertifizierungsstelle prüft die Anfrage und wenn die Informationen korrekt sind, wird ein Zertifikat generiert und signiert. Dieses signierte Zertifikat wird dann an ein Zertifikats-Repository gesendet.
id: Pengguna, proses, atau sistem yang menjadi subjek sertifikat. Entitas akhir mengirimkan permintaan sertifikasinya ke Registration Authority (RA) untuk mendapatkan persetujuan. Jika disetujui, RA meneruskan permintaan ke Certification Authority (CA). Certification Authority memverifikasi permintaan dan jika informasinya benar, sertifikat dibuat dan ditandatangani. Sertifikat yang ditandatangani ini kemudian dikirim ke Certificate Repository.
tr_tr: Bir sertifikanın konusu olan kullanıcı, işlem veya sistem. Son taraf sertifika talebini onay için bir Kayıt Otoritesine (RA) gönderir. Onaylandığı takdirde, RA talebi bir Sertifika Otoritesine (CA) iletir. Sertifika Yetkilisi isteği doğrular ve eğer bilgi doğruysa, bir sertifika üretilir ve imzalanır. Bu imzalı sertifika daha sonra bir Sertifika Havuzuna gönderilir.

source: Users must be assigned to groups and roles that you refer to in your policies. This is done automatically by the service when user management commands are used.
de: Benutzer müssen Gruppen und Rollen zugewiesen werden, auf die Sie sich in Ihren Richtlinien beziehen. Dies geschieht automatisch durch den Dienst, wenn Benutzerverwaltungsbefehle verwendet werden.
id: Pengguna harus ditugaskan ke grup dan peran yang Anda lihat dalam kebijakan Anda. Hal ini dilakukan secara otomatis oleh layanan saat perintah manajemen pengguna digunakan.
tr_tr: Kullanıcıların, ilkelerinizde belirttiğiniz gruplara ve rollere atanmaları gerekir. Bu, kullanıcı yönetimi komutları kullanıldığında servis tarafından otomatik olarak yapılır.

source: Users or organizations that possess PHI must support HIPAA requirements and are HIPAA covered entities. If an entity intends to use a service, or in this case, an OpenStack cloud that might use, store or have access to that PHI, then a Business Associate Agreement (BAA) must be signed. The BAA is a contract between the HIPAA covered entity and the OpenStack service provider that requires the provider to handle that PHI in accordance with HIPAA requirements. If the service provider does not handle the PHI, such as with security controls and hardening, then they are subject to HIPAA fines and penalties.
de: Benutzer oder Organisationen, die PHI besitzen, müssen die HIPAA-Anforderungen unterstützen und sind HIPAA-abgedeckte Einheiten. Wenn ein Unternehmen beabsichtigt, einen Dienst zu verwenden, oder in diesem Fall eine OpenStack-Cloud, der den PHI verwendet, speichert oder Zugriff hat, dann muss eine Business Associate Agreement (BAA) unterschrieben werden. Das BAA ist ein Vertrag zwischen der HIPAA-abgedeckten Einheit und dem OpenStack-Dienstanbieter, der den Anbieter verpflichtet, diese PHI gemäß den HIPAA-Anforderungen zu bearbeiten. Wenn der Dienstanbieter das PHI nicht behandelt, wie z.B. mit Sicherheitskontrollen und Hardening, so unterliegt er HIPAA-Geldstrafen und Strafen.
id: Pengguna atau organisasi yang memiliki PHI harus mendukung persyaratan HIPAA dan entitas tertutup HIPAA. Jika suatu entitas bermaksud untuk menggunakan suatu layanan, atau dalam hal ini, sebuah awan OpenStack yang mungkin menggunakan, menyimpan atau memiliki akses ke PHI tersebut, maka Business Associate Agreement (BAA) harus ditandatangani. BAA adalah kontrak antara entitas tertutup HIPAA dan penyedia layanan OpenStack yang mengharuskan penyedia untuk menangani PHI tersebut sesuai dengan persyaratan HIPAA. Jika penyedia layanan tidak menangani PHI, seperti dengan kontrol keamanan dan pengerasan (hardening), maka mereka tunduk pada denda HIPAA dan denda.
tr_tr: PHI'ya sahip kullanıcılar veya kuruluşlar, HIPAA gereksinimlerini desteklemeli ve HIPAA kapsamında olan varlıklardır. Bir işletme bir hizmeti veya bu durumda bu PHI'yi kullanabilen, depolayan veya erişebilen bir OpenStack bulutu kullanmayı planlıyorsa, bir İş Ortağı Sözleşmesi (BAA) imzalanmalıdır. BAA, HIPAA kapsamındaki varlık ile OpenStack servis sağlayıcı arasında, tedarikçinin söz konusu PHI'yi HIPAA gereklerine uygun şekilde kullanmasını gerektiren bir sözleşmedir. Servis sağlayıcı, PHI'yı güvenlik kontrolleri ve sertleştirme gibi işleyemezse, HIPAA cezalarına ve cezalarına tabidir.

source: Users spend too much time logging in or going through 'Forget Password' workflows. Federated identity allows for single sign on, which is easier and faster for users and requires fewer password resets. The IdPs manage user identities and passwords so OpenStack does not have to.
de: Benutzer verbringen zu viel Zeit, sich einzuloggen oder durch den Ablauf 'Passwort vergessen' zu gehen. Föderierte Identität ermöglicht Single Sign On, die für Benutzer einfacher und schneller ist und weniger Passwort zurücksetzt. Die IdPs verwalten Benutzeridentitäten und Passwörter, so dass OpenStack das nicht nicht tun muss.
tr_tr: Kullanıcılar, giriş yapmak için ve 'Parolamı Unuttum' akışından devam etmek için çok fazla zaman harcıyorlar. Federe kimlik, tek oturum açma işlemine izin verir; kullanıcılar için daha kolay ve daha hızlıdır ve daha az parola sıfırlaması gerektirir. IdP'ler OpenStack'ın yapması zorunlu olmayan kullanıcı kimliklerini ve parolaları yönetir.

source: Using SQL, the Shared File Systems service is similar to other OpenStack services and can be used with any OpenStack deployment. For more details on the API, see the `OpenStack Shared File Systems API <https://developer.openstack.org/api-ref-share-v2.html>`_ description. For more details on the CLI usage and configuration, see `Shared File Systems Cloud Administrative Guide <https://docs.openstack.org/admin-guide/shared_file_systems.html>`_.
de: Mit SQL ist der Shared File Systems Service ähnlich wie bei anderen OpenStack-Diensten und kann mit jeder OpenStack-Bereitstellung verwendet werden. Weitere Informationen zur API finden Sie in der API der OpenStack Shared File Systems <https://developer.openstack.org/api-ref-share-v2.html> `_ Beschreibung. Weitere Informationen zur CLI-Nutzung und Konfiguration finden Sie unter `Shared File Systems Cloud Administrative Guide` <https://docs.openstack.org/admin-guide/shared_file_systems.html>`_.

source: Using compiler hardening.
de: Mit Compiler Hardening.
id: Menggunakan kompilator pengerasan.
tr_tr: Derleyici sıkılaştırması kullanmak.

source: Using mandatory access controls such as sVirt, SELinux, or AppArmor.
de: Verwenden Sie obligatorische Zugriffskontrollen wie sVirt, SELinux oder AppArmor.
id: Menggunakan kontrol akses wajib seperti sVirt, SELinux, atau AppArmor.
tr_tr: sVirt, SELinux ya da AppArmor gibi zorunlu erişim kontrolü kullanmak.

source: Using the API, users can create, update, view and delete a security service. Security Services are designed basing on the following assumptions:
de: Mit der API können Benutzer einen Sicherheitsdienst erstellen, aktualisieren, anzeigen und löschen. Security Services basieren auf folgenden Annahmen:
id: Dengan menggunakan API, pengguna dapat membuat, memperbarui, melihat dan menghapus layanan keamanan. Security Service dirancang berdasarkan asumsi berikut:
tr_tr: Kullanıcılar, API'yi kullanarak bir güvenlik servisini oluşturabilir, güncelleyebilir, görüntüleyebilir ve silebilir. Güvenlik Servisleri, aşağıdaki varsayımlara dayanarak tasarlanmıştır:
