Repository: openstack/security-doc
Catalog: security-guide/source/locale/*/LC_MESSAGES/security-guide.po
Languages: de, id, tr_tr

source: Test data recovery options regularly. One of the things that can be restored from secured backups is the images. In case of a compromise, the best practice would be to terminate running instances immediately and then relaunch the instances from the images in the secured backup repository.
de: Testen Sie Datenwiederherstellungsoptionen regelmäßig. Eines der Dinge, die aus gesicherten Backups wiederhergestellt werden können, sind die Abbilder. Im Falle eines Kompromisses wäre die beste Praxis, um laufende Instanzen sofort zu beenden und dann die Instanzen aus den Abbildern im gesicherten Backup-Repository neu zu starten.
id: Uji opsi pemulihan data secara teratur. Salah satu hal yang bisa dipulihkan dari backup yang aman adalah image nya. Jika terjadi bahaya, praktik terbaik adalah segera menghentikan instance yang sedang berjalan dan kemudian meluncurkan kembali instance dari image di repositori cadangan yang aman.
tr_tr: Veri kurtarma seçeneklerini düzenli olarak test edin. Güvenli yedeklemelerden geri yüklenebilecek şeylerden biri imajlardır. Bir taviz durumunda, en iyi uygulama, çalışan örnekleri hemen sonlandırmak ve ardından örnekleri güvenli yedekleme havuzundaki imajlarla tekrar başlatmak olacaktır.

source: Test sanitation equipment and procedures to verify proper performance.
de: Reagenz-Ausrüstung und Verfahren zur Überprüfung der ordnungsgemäßen Leistung.
id: Uji peralatan dan prosedur sanitasi untuk memverifikasi kinerja yang tepat.
tr_tr: Uygun performansı doğrulamak için temizleme donanımlarını ve prosedürlerini test edin.

source: Testing it all out
de: Testen Sie alles aus
tr_tr: Tümünü test etmek

source: Testing the updates
de: Testen der Updates
id: Menguji pembaruan
tr_tr: Güncelleştirmeleri test etmek

source: The "SECURE" cookie attribute instructs web browsers to only send the cookie through an encrypted HTTPS (SSL/TLS) connection. This session protection mechanism is mandatory to prevent the disclosure of the session ID through MitM (Man-in-the-Middle) attacks. It ensures that an attacker cannot simply capture the session ID from web browser traffic.
de: Das "SECURE" Cookie-Attribut weist Webbrowsern an, nur das Cookie über eine verschlüsselte HTTPS (SSL/TLS) Verbindung zu senden. Dieser Sitzungsschutzmechanismus ist zwingend erforderlich, um die Offenlegung der Sitzungs-ID durch MitM (Man-in-the-Middle)-Angriffe zu verhindern. Es sorgt dafür, dass ein Angreifer die Session-ID nicht einfach aus dem Webbrowser-Verkehr erfassen kann.
id: Atribut cookie "SECURE" menginstruksikan browser web untuk hanya mengirim cookie melalui sambungan HTTPS (SSL/TLS) terenkripsi. Mekanisme perlindungan sesi ini wajib untuk mencegah pengungkapan ID sesi melalui serangan MitM (Man-in-the-Middle). Ini memastikan bahwa penyerang tidak bisa begitu saja menangkap ID sesi dari lalu lintas browser web.
tr_tr: "GÜVENLİ" çerez özniteliği, web tarayıcılarına yalnızca çerezleri şifrelenmiş bir HTTPS (SSL/TLS) bağlantısı yoluyla göndermesini sağlar. Bu oturum koruma mekanizması, oturum kimliğinin MitM (Man-in-the-Middle) saldırılarla ifşasını önlemek için zorunludur. Bir saldırganın web tarayıcı trafiğinden oturum kimliğini kolayca yakalayamamasını sağlar.

source: The *ciphers* line can be tweaked based on your needs, however this is a reasonable starting place. The default configuration file is located in the ``/etc/stud`` directory. However, it is not provided by default.
de: Die *ciphers* Linie kann auf Ihre Bedürfnisse angepasst werden, aber das ist ein vernünftiger Ausgangspunkt. Die Standardkonfigurationsdatei befindet sich im Verzeichnis ``/etc/stud``. Es ist jedoch nicht standardmäßig vorgesehen.
id: Baris *ciphers * dapat di-tweak berdasarkan kebutuhan Anda, namun ini adalah tempat awal yang masuk akal. File konfigurasi default terletak di direktori ``/etc/stud``. Namun, itu tidak disediakan secara default.
tr_tr: *ciphers* satırı ihtiyaçlarınıza göre düzeltilebilir, ancak bu makul bir başlangıç noktasıdır. Varsayılan yapılandırma dosyası ``/etc/stud`` dizininde bulunur. Ancak, varsayılan olarak sağlanmamaktadır.

source: The *share servers* mode can be configured with flat network, or with segmented network. This depends on the network provider.
de: Der *share servers* mode kann mit flachem Netzwerk oder mit segmentiertem Netzwerk konfiguriert werden. Dies hängt vom Netzanbieter ab.
id: Mode *share server * dapat dikonfigurasi dengan jaringan datar, atau dengan jaringan tersegmentasi. Hal ini tergantung pada penyedia jaringan.
tr_tr: *paylaşım sunucuları* kipi, düz ağla veya segmentli ağ ile yapılandırılabilir. Bu, ağ sağlayıcısına bağlıdır.

source: The :ref:`security service part <shared_fs_security_services>` of share networks specify security requirements such as AD or LDAP domains or a Kerberos realm. The Shared File Systems service assumes that any hosts referred to in security service are reachable from a subnet where a share server is created, which limits the number of cases where this mode could be used.
de: Die :ref:`security service part <shared_fs_security_services>` von geteilten Netzwerken spezifizieren Sicherheitsanforderungen wie AD oder LDAP Domains oder ein Kerberos Realm. Der Shared File Systems Service geht davon aus, dass alle im Sicherheitsdienst erwähnten Hosts aus einem Subnetz erreichbar sind, in dem ein geteilter Server erstellt wird, der die Anzahl der Fälle begrenzt, in denen dieser Modus verwendet werden könnte.
id: The :ref:`security service part <shared_fs_security_services>` dari jaringan berbagi menentukan persyaratan keamanan seperti domain AD atau LDAP atau wilayah Kerberos. Layanan Shared File Systems mengasumsikan bahwa setiap host yang disebutkan dalam layanan keamanan dapat dijangkau dari subnet tempat server berbagi dibuat, yang membatasi jumlah kasus dimana mode ini dapat digunakan.
tr_tr: Paylaşım ağlarının :ref:`güvenlik servisi bölümü <shared_fs_security_services>`, AD veya LDAP etki alanları veya Kerberos alanı gibi güvenlik gereksinimlerini belirtir. Paylaşımlı Dosya Sistemleri servisi, güvenlik servisinde adı geçen tüm ana makinelere, paylaşım sunucusunun oluşturulduğu ve bu modun kullanılabileceği durumların sayısını sınırlayan bir alt ağa erişilebileceğini varsayar.

source: The :term:`Data Processing service (sahara)` provides a platform for the provisioning, management, and usage of clusters running popular processing frameworks.
de: Der :term:`Data Processing service (sahara)` bietet eine Plattform für die Bereitstellung, Verwaltung und Nutzung von Clustern, die populäre Verarbeitungs-Frameworks betreiben.
id: The :term:`Data Processing service (sahara)` menyediakan platform untuk penyediaan, pengelolaan, dan penggunaan cluster yang menjalankan kerangka pemrosesan populer.
tr_tr: :term:`Veri İşleme Servisi (Sahara)`, popüler işleme çatılarını çalıştıran kümelerin hazırlanması, yönetimi ve kullanımı için bir platform sağlar.

source: The :term:`Shared File Systems service (manila)` provides a set of services for managing shared file systems in a multi-tenant cloud environment, similar to how OpenStack provides for block-based storage management through the OpenStack Block Storage service project. With the Shared File Systems service, you can create a remote file system, mount the file system on your instances, and then read and write data from your instances to and from your file system.
de: Der :term:` Shared File Systems Service (Manila)` bietet eine Reihe von Diensten für das Management von gemeinsam genutzten Dateisystemen in einer Multi-Tenant-Cloud-Umgebung, ähnlich wie OpenStack für das blockbasierte Storage-Management über das OpenStack Block Storage Service-Projekt sorgt . Mit dem Dienst Shared File Systems können Sie ein Remote-Dateisystem erstellen, das Dateisystem auf Ihren Instanzen installieren und dann Daten von Ihren Instanzen zu und von Ihrem Dateisystem lesen und schreiben kann.
id: The :term:`Shared File Systems service (manila)` menyediakan seperangkat layanan untuk mengelola sistem file bersama di lingkungan awan multi-penyewa, serupa dengan bagaimana OpenStack menyediakan pengelolaan penyimpanan berbasis blok melalui proyek layanan OpenStack Block Storage. Dengan layanan Shared File Systems, Anda dapat membuat sistem file jauh, me-mount sistem file pada instance Anda, dan kemudian membaca dan menulis data dari instance Anda ke dan dari sistem file Anda.

source: The API provides a tenant interface for provisioning, managing, and accessing their resources.
de: Die API bietet eine Tenantschnittstelle für die Bereitstellung, Verwaltung und den Zugriff auf ihre Ressourcen.
id: API menyediakan antarmuka penyewa untuk penyediaan, pengelolaan, dan akses sumber daya mereka.
tr_tr: API, kaynaklarını sağlamak, yönetmek ve erişmek için bir kiracı arayüzü sağlar.

source: The API service should be configured for TLS to ensure data is encrypted.
de: Der API-Dienst sollte für TLS konfiguriert werden, um sicherzustellen, dass Daten verschlüsselt sind.
id: Layanan API harus dikonfigurasi untuk TLS untuk memastikan data dienkripsi.
tr_tr: Verilerin şifrelenmesini sağlamak için API hizmeti TLS için yapılandırılmalıdır.

source: The Apache Foundation has a messaging security guide for Qpid. See:
de: Die Apache-Stiftung hat einen Messaging-Sicherheitsleitfaden für Qpid. Sehen Sie:
id: Apache Foundation memiliki panduan keamanan olahpesan untuk Qpid. Lihat:
tr_tr: Apache Vakfı, Qpid için bir mesaj güvenlik rehberi sunmaktadır. Bkz:

source: The Apache Software Foundation, Apache Hive. 2016. `Hive <https://hive.apache.org>`__
de: Die Apache Software Foundation, Apache Hive. 2016. `Hive <https://hive.apache.org>`__
tr_tr: Apache Yazılım Vakfı, Apache Hive. 2016. `Hive <https://hive.apache.org>`__

source: The Apache Software Foundation, Apache Oozie Workflow Scheduler for Hadoop. 2016. `Oozie project <https://oozie.apache.org>`__
de: Die Apache Software Foundation, Apache Oozie Workflow Scheduler für Hadoop. 2016. `Oozie-Projekt <https://oozie.apache.org>`__
tr_tr: Apache Yazılım Vakfı, Apache Oozie, Hadoop için İşakışı Planlayıcı. 2016. `Oozie projesi <https://oozie.apache.org>`__

source: The Apache Software Foundation, Apache Storm. 2016. `Storm project <https://storm.apache.org>`__
de: Die Apache Software Foundation, Apache Storm. 2016. "Sturmprojekt <https://storm.apache.org>`__
tr_tr: Apache Yazılım Vakfı, Apache Storm. 2016. `Storm projesi <https://storm.apache.org>`__

source: The Apache Software Foundation, Apache Zookeeper. 2016. `Zookeeper project <https://zookeeper.apache.org>`__
de: Die Apache Software Foundation, Apache Zookeeper. 2016. `Zookeeper-Projekt <https://zookeeper.apache.org>`__
tr_tr: Apache Yazılım Vakfı, Apache Zookeeper. 2016. `Zookeeper projesi <https://zookeeper.apache.org>`__

source: The Apache Software Foundation, Cloudera Product Documentation. 2016. `Cloudera CDH documentation <https://www.cloudera.com/content/cloudera/en/documentation.html#CDH>`__
de: Die Apache Software Foundation, Cloudera Produktdokumentation. 2016. `Cloudera CDH Dokumentation <https://www.cloudera.com/content/cloudera/en/documentation.html#CDH>`__
tr_tr: Apache Yazılım Vakfı, Cloudera Ürün Belgelendirmesi. 2016. `Cloudera CDH belgelendirmesi <https://www.cloudera.com/content/cloudera/en/documentation.html#CDH>`__

source: The Apache Software Foundation, HDFS User Guide. 2016. `Hadoop HDFS documentation <https://hadoop.apache.org/docs/stable/hadoop-project-dist/hadoop-hdfs/HdfsUserGuide.html>`__
de: Die Apache Software Foundation, HDFS Benutzerhandbuch. 2016. `Hadoop HDFS Dokumentation <https://hadoop.apache.org/docs/stable/hadoop-project-dist/hadoop-hdfs/HdfsUserGuide.html>`__
tr_tr: Apache Yazılım Vakfı, HDFS Kullanıcı Kılavuzu. 2016. `Hadoop HDFS belgelendirmesi <https://hadoop.apache.org/docs/stable/hadoop-project-dist/hadoop-hdfs/HdfsUserGuide.html>`__

source: The Apache Software Foundation, Hadoop in Secure Mode. 2016. `Hadoop secure mode docs <https://hadoop.apache.org/docs/current/hadoop-project-dist/hadoop-common/SecureMode.html>`__
de: Die Apache Software Foundation, Hadoop im sicheren Modus. 2016. `Hadoop sichere Modus docs <https://hadoop.apache.org/docs/current/hadoop-project-dist/hadoop-common/SecureMode.html>`__
tr_tr: Apache Yazılım Vakfı, Güvenli Kipte Hadoop. 2016. `Hadoop güvenli kip belgelendirmesi <https://hadoop.apache.org/docs/current/hadoop-project-dist/hadoop-common/SecureMode.html>`__

source: The Apache Software Foundation, Spark Security. 2016. `Spark security documentation <https://spark.apache.org/docs/latest/security.html>`__
de: Die Apache Software Foundation, Spark Security. 2016. `Spark security Dokumentation <https://spark.apache.org/docs/latest/security.html>`__
tr_tr: Apache Yazılım Vakfı, Spark Güvenliği. 2016. `Spark güvenlik belgelendirmesi <https://spark.apache.org/docs/latest/security.html>`__

source: The Apache Software Foundation, Spark. 2016. `Spark project <https://spark.apache.org>`__
de: Die Apache Software Foundation, Spark. 2016. `Spark-Projekt <https://spark.apache.org>`__
tr_tr: Apache Yazılım Vakfı, Spark. 2016. `Spark projesi <https://spark.apache.org>`__

source: The Apache Software Foundation, Welcome to Apache Hadoop!. 2016. `Apache Hadoop project <https://hadoop.apache.org>`__
de: Die Apache Software Foundation, Willkommen bei Apache Hadoop!. 2016. `Apache Hadoop Projekt <https://hadoop.apache.org>`__
tr_tr: Apache Yazılım Vakfı, Apache Hadoop'a Hoşgeldiniz!. 2016. `Apache Hadoop projesi <https://hadoop.apache.org>`__

source: The Apache Software Foundation, Welcome to Apache Pig. 2016. `Pig <https://pig.apache.org>`__
de: Die Apache Software Foundation, Willkommen bei Apache Pig. 2016. `Pig <https://pig.apache.org>`__
tr_tr: Apache Yazılım Vakfı, Apache Pig'e Hoşgeldiniz. 2016. `Pig <https://pig.apache.org>`__

source: The Barbican team worked with the OpenStack Security Project to perform a security review of a best practise Barbican deployment. The objective of the security review is to identify weaknesses and defects in the design and architecture of services, and propose controls or fixes to resolve these issues.
de: Das Barbican-Team arbeitete mit dem OpenStack-Sicherheitsprojekt zusammen, um eine Sicherheitsüberprüfung einer Best-Practice-Barbican-Bereitstellung durchzuführen. Das Ziel der Sicherheitsüberprüfung ist es, Schwachstellen und Mängel in der Gestaltung und Architektur von Diensten zu identifizieren und Kontrollen oder Korrekturen vorzuschlagen, um diese Probleme zu lösen.
id: Tim Barbican bekerja dengan OpenStack Security Project untuk melakukan tinjauan keamanan terhadap penerapan barbecue praktik terbaik. Tujuan dari tinjauan keamanan adalah untuk mengidentifikasi kelemahan dan kekurangan dalam desain dan arsitektur layanan, dan mengusulkan kontrol atau perbaikan untuk menyelesaikan masalah ini.

source: The Barbican threat analysis identified eight security findings and two recommendations to improve the security of a barbican deployment. These results can be reviewed in the `security analysis repo <https://github.com/openstack/security-analysis/tree/master/doc/source/artifacts/barbican/newton>`_., along with the Barbican architecture diagram and architecture description page.
de: Die Barbican Threat-Analyse identifzierte acht Sicherheitslücken und zwei Empfehlungen zur Verbesserung der Sicherheit von Barbican Bereitstellungen. Diese Ergebnisse können nachgelesen werden im `security analysis repo <https://github.com/openstack/security-analysis/tree/master/doc/source/artifacts/barbican/newton>`_., zusammen mit dem Barbican Architekturdiagramm und Seite der Architekturbeschreibung.
id: Analisis ancaman Barbican mengidentifikasi delapan temuan keamanan dan dua rekomendasi untuk memperbaiki keamanan penyebaran barbican. Hasil ini dapat ditinjau ulang di `security analysis repo <https://github.com/openstack/security-analysis/tree/master/doc/source/artifacts/barbican/newton>`_., bersama dengan diagram arsitektur Barbican dan halaman deskripsi arsitektur.

source: The CSA CCM is specifically designed to provide fundamental security principles to guide cloud vendors and to assist prospective cloud customers in assessing the overall security risk of a cloud provider. The CSA CCM provides a controls framework that are aligned across 16 security domains. The foundation of the Cloud Controls Matrix rests on its customized relationship to other industry standards, regulations, and controls frameworks such as: ISO 27001:2013, COBIT 5.0, PCI:DSS v3, AICPA 2014 Trust Service Principles and Criteria and augments internal control direction for service organization control reports attestations.
de: Das CSA CCM wurde speziell entwickelt, um grundlegende Sicherheitsprinzipien zu liefern, um Cloud-Anbieter zu begleiten und potenzielle Cloud-Kunden bei der Beurteilung des gesamten Sicherheitsrisikos eines Cloud-Anbieters zu unterstützen. Das CSA CCM stellt ein Steuerungsrahmen zur Verfügung, der über 16 Sicherheitsdomänen ausgerichtet ist. Die Gründung der Cloud Controls Matrix beruht auf der maßgeschneiderten Beziehung zu anderen Industriestandards, Regelungen und Kontrollen, wie zB: ISO 27001: 2013, COBIT 5.0, PCI: DSS v3, AICPA 2014 Trust Service Principles and Criteria und ergänzt die interne Kontrollrichtung für Serviceorganisation Control Reports.
id: CSA CCM dirancang khusus untuk memberikan prinsip keamanan mendasar untuk membimbing vendor cloud dan untuk membantu pelanggan awan prospektif dalam menilai risiko keamanan keseluruhan dari penyedia awan. CSA CCM menyediakan kerangka kerja kontrol yang diselaraskan di 16 domain keamanan. Dasar dari Cloud Controls Matrix terletak pada hubungan yang disesuaikan dengan standar, peraturan, dan kerangka kerja industri lainnya, seperti: ISO 27001: 2013, COBIT 5.0, PCI: DSS v3, AICPA 2014 Trust Service Principles and Criteria dan menambah arahan pengendalian internal untuk pengendalian organisasi layanan melaporkan pengesahan.
tr_tr: CSA CCM, bulut satıcılarını yönlendirmek ve muhtemel bulut müşterilerine bir bulut sağlayıcının genel güvenlik riskini değerlendirmede yardımcı olmak için temel güvenlik ilkeleri sağlamak üzere özel olarak tasarlanmıştır. CSA CCM, 16 güvenlik bölgesi arasında hizalanan bir kontrol çerçevesi sağlar. Bulut Denetimleri Matrisinin temeli servis organizasyonu kontrol raporlarını tasdiklemek için, ISO 27001:2013, COBIT 5.0, PCI:DSS v3, AICPA 2014 Güven Hizmet İlkeleri ve Kriterleri ve iç kontrol yönünü artıran diğer endüstri standartları, yönetmelikleri ve kontrol çerçeveleri ile kişiselleştirilmiş ilişkisine dayanmaktadır.

source: The CSA CCM strengthens existing information security control environments by enabling the reduction of security threats and vulnerabilities in the cloud, provides standardized security and operational risk management, and seeks to normalize security expectations, cloud taxonomy and terminology, and security measures implemented in the cloud.
de: Das CSA CCM stärkt bestehende Informationssicherheits-Steuerungsumgebungen, indem es die Verringerung von Sicherheitsbedrohungen und Schwachstellen in der Cloud ermöglicht, ein standardisiertes Sicherheits- und operationelles Risikomanagement bietet und die Sicherheitserwartungen, die Cloud-Taxonomie und die Terminologie und die Sicherheitsmaßnahmen in der Cloud umsetzen will.
id: CSA CCM memperkuat lingkungan kontrol keamanan informasi yang ada dengan memungkinkan pengurangan ancaman keamanan dan kerentanan di awan, memberikan keamanan standar dan manajemen risiko operasional, dan berupaya menormalisasi ekspektasi keamanan, taksonomi awan dan terminologi, dan tindakan pengamanan yang diterapkan di awan.
tr_tr: CSA CCM buluttaki güvenlik tehdit ve zayıflıklarını azaltarak mevcut güvenlik bilgi kontrol ortamlarını güçlendirir, standartlaştırılmış güvenlik ve operasyonel risk yönetimi sağlar ve güvenlik beklentilerini, bulut taksonomisini ve terminolojiyi ve bulutta uygulanan güvenlik önlemlerini normalleştirmeyi amaçlar.

source: The Compute and Object Storage services can be configured to use the Identity service to store authentication information. Other options to store authentication information include the use of the "tempAuth" file, however this should not be deployed in a production environment as the password is displayed in plain text.
de: Die Berechnungs- und Objektspeicherdienste können so konfiguriert werden, dass sie den Identitätsdienst zum Speichern von Authentifizierungsinformationen verwenden. Weitere Optionen zum Speichern von Authentifizierungsinformationen sind die Verwendung der "tempAuth"-Datei, die jedoch nicht in einer Produktionsumgebung bereitgestellt werden soll, da das Passwort im Klartext angezeigt wird.
id: Layanan Compute and Object Storage dapat dikonfigurasi untuk menggunakan layanan Identity untuk menyimpan informasi otentikasi. Pilihan lain untuk menyimpan informasi otentikasi mencakup penggunaan file "tempAuth", namun hal ini tidak boleh digunakan di lingkungan produksi karena kata sandi ditampilkan dalam teks biasa.
tr_tr: Hesaplama ve Nesne Depolama hizmetleri Kimlik doğrulama bilgilerini depolamak için Kimlik hizmetini kullanacak şekilde yapılandırılabilir. Kimlik doğrulama bilgilerini depolamak için kullanılan diğer seçenekler arasında "tempAuth" dosyasının kullanımı yer alır; ancak bu, parola düz metin olarak gösterildiği için canlı ortamda yayına alınmamalıdır.

source: The Compute service facilitates this management through an abstraction layer that interfaces with supported hypervisors (we address this later on in more detail).
de: Der Compute-Dienst erleichtert diese Verwaltung durch eine Abstraktionsschicht, die mit unterstützten Hypervisoren verbunden ist (wir behandeln dies später ausführlicher).
id: Layanan Compute memfasilitasi pengelolaan ini melalui lapisan abstraksi yang berinteraksi dengan hypervisor yang didukung (kami akan membahasnya nanti secara lebih rinci).

source: The Dashboard (horizon) is the OpenStack dashboard that provides users a self-service portal to provision their own resources within the limits set by administrators. These include provisioning users, defining instance flavors, uploading virtual machine (VM) images, managing networks, setting up security groups, starting instances, and accessing the instances through a console.
de: Das Dashboard (Horizon) ist das OpenStack-Dashboard, das Benutzern ein Self-Service-Portal zur Verfügung stellt, um ihre eigenen Ressourcen innerhalb der von Administratoren festgelegten Grenzen bereitzustellen. Dazu gehören die Bereitstellung von Benutzern, die Definition von Instanz-Varianten, das Hochladen von virtuellen Maschinen (VM)-Abbilder, das Verwalten von Netzwerken, das Einrichten von Sicherheitsgruppen, das Starten von Instanzen und den Zugriff auf die Instanzen über eine Konsole.
id: Dasbor (horizon) adalah dasbor OpenStack yang memberi pengguna portal layanan mandiri untuk menyediakan sumber daya mereka sendiri sesuai batasan yang ditetapkan oleh administrator. Ini termasuk pengguna provisioning, mendefinisikan instance flavor, mengupload image mesin virtual (VM), mengelola jaringan, menyiapkan grup keamanan, memulai menjalankan instance, dan mengakses instance melalui konsol.
tr_tr: Panel (horizon), kullanıcılara kendi kaynaklarını, yöneticiler tarafından belirlenen sınırlar içinde tedarik etmek için bir kişisel-servis portalı sağlayan OpenStack panelidir. Bunlar arasında kullanıcıların sağlanması, örneklerin tanımlanması, sanal makine (VM) görüntülerinin yüklenmesi, ağların yönetimi, güvenlik gruplarının oluşturulması, örneklerin başlatılması ve örneklere bir konsol aracılığıyla erişilmesi dahildir.
