Repository: openstack/security-doc
Catalog: security-guide/source/locale/*/LC_MESSAGES/security-guide.po
Languages: de, id, tr_tr

source: A security domain comprises users, applications, servers or networks that share common trust requirements and expectations within a system. Typically they have the same :term:`authentication` and :term:`authorization` (AuthN/Z) requirements and users.
de: Eine Sicherheitsdomäne umfasst Benutzer, Anwendungen, Server oder Netzwerke, die gemeinsame Vertrauensanforderungen und Erwartungen innerhalb eines Systems teilen. In der Regel haben sie das gleiche :term:`authentication` und :term:`authorization` (AuthN/Z) Anforderungen und Benutzer.
id: Sebuah domain keamanan terdiri dari pengguna, aplikasi, server atau jaringan yang berbagi persyaratan dan harapan kepercayaan bersama dalam sebuah sistem. Biasanya mereka memiliki persyaratan yang sama :term: `authentication` dan :term:` authorization` (AuthN/Z) dan pengguna.
tr_tr: Bir güvenlik etki alanı, bir sistem içinde ortak güven gereksinimlerini ve beklentileri paylaşan kullanıcıları, uygulamaları, sunucuları veya ağları içerir. Genellikle aynı özelliklere sahiptirler :term:`kimlik doğrulama` ve :term:`yetkilendirme` (AuthN / Z) gereksinimleri ve kullanıcılar.

source: A security group is a container for security group rules. Security groups and their rules allow administrators and projects the ability to specify the type of traffic and direction (ingress/egress) that is allowed to pass through a virtual interface port. When a virtual interface port is created in OpenStack Networking it is associated with a security group. For further details on the default behavior of port security groups, reference the `Networking Security Group Behavior <https://wiki.openstack.org/wiki/Neutron/SecurityGroups#Behavior>`__ documentation. Rules can be added to the default security group in order to change the behavior on a per-deployment basis.
de: Eine Sicherheitsgruppe ist ein Container für Sicherheitsgruppenregeln. Sicherheitsgruppen und ihre Regeln erlauben Administratoren und Projekten die Möglichkeit, die Art des Verkehrs und der Richtung (Ingress/Egress) anzugeben, die durch einen virtuellen Schnittstellenport passieren darf. Wenn ein virtueller Schnittstellenanschluss in OpenStack Networking erstellt wird, ist er mit einer Sicherheitsgruppe verknüpft. Weitere Informationen zum Standardverhalten von Port-Sicherheitsgruppen finden Sie unter "Verhalten der Netzwerk-Sicherheitsgruppe" <https://wiki.openstack.org/wiki/Neutron/SecurityGroups#Behavior>`__ Dokumentation. Regeln können der Standard-Sicherheitsgruppe hinzugefügt werden, um das Verhalten auf einer Bereitstellungsbasis zu ändern.
id: Grup keamanan adalah wadah untuk aturan kelompok keamanan. Grup keamanan dan peraturan mereka mengizinkan administrator dan memproyeksikan kemampuan untuk menentukan jenis lalu lintas dan arah (ingress/egress) yang diizinkan melewati port antarmuka virtual. Bila port antarmuka virtual dibuat di OpenStack Networking, ini terkait dengan grup keamanan. Untuk rincian lebih lanjut tentang perilaku grup keamanan port default, rujuk dokumentasi `Networking Security Group Behavior <https://wiki.openstack.org/wiki/Neutron/SecurityGroups#Behavior>`__. Aturan dapat ditambahkan ke grup keamanan default untuk mengubah perilaku berdasarkan per-penyebaran.
tr_tr: Güvenlik grubu, güvenlik grubu kuralları için bir kapsayıcıdır. Güvenlik grupları ve kuralları, yöneticilere ve projelere sanal bir arabirim bağlantı noktasından geçmesine izin verilen trafik ve yön türünü (giriş/çıkış) belirtme olanağı sağlar. OpenStack Ağında bir sanal arabirim bağlantı noktası oluşturulduğunda, bir güvenlik grubu ile ilişkilendirilir. Port güvenlik gruplarının varsayılan davranışları hakkında daha ayrıntılı bilgi için, `Ağ Güvenlik Grubu Davranışı <https://wiki.openstack.org/wiki/Neutron/SecurityGroups#Behavior>`__ belgelerine bakın. Davranışları bir dağıtım temelinde değiştirmek için kurallar varsayılan güvenlik grubuna eklenebilir.

source: A separate database administrator (DBA) account should be created and protected that has full privileges to create/drop databases, create user accounts, and update user privileges. This simple means of separation of responsibility helps prevent accidental misconfiguration, lowers risk and lowers scope of compromise.
de: Es sollte ein separates Datenbankadministrator (DBA) -Konto erstellt und geschützt werden, das über volle Berechtigungen zum Erstellen/Löschen von Datenbanken, zum Erstellen von Benutzerkonten und zum Aktualisieren von Benutzerberechtigungen verfügt. Dieses einfache Mittel der Trennung der Verantwortung hilft, versehentliche Fehlkonfiguration zu verhindern, senkt das Risiko und verringert den Kompromiss.
id: database administrator (DBA) terpisah harus dibuat dan dilindungi yang memiliki hak penuh untuk create/drop databases, create user accounts, dan update user privileges. Cara pemisahan tanggung jawab yang sederhana ini membantu mencegah kesalahan konfigurasi yang tidak disengaja, mengurangi risiko dan menurunkan cakupan bahaya (compromise).
tr_tr: Veritabanları oluşturmak/silmek, kullanıcı hesapları oluşturmak ve kullanıcı ayrıcalıklarını güncellemek için ayrıcalıklara sahip olan ayrı bir veritabanı yöneticisi (DBA) hesabı oluşturulmalı ve korunmalıdır. Sorumluluğun bu şekilde basitçe ayrılması, yanlış yapılandırmanın önlenmesine yardımcı olur, riski düşürür ve tehlikenin kapsamını düşürür.

source: A share can be *public* or *private*. This is a level of visibility for the share that defines whether other tenants can or cannot see the share. By default, all shares are created as private. While creating a share, use key ``--public`` to make your share public for other tenants to see it in a list of shares and see its detailed information.
de: Eine Freigabe kann *public* oder *private* sein. Dies ist ein Maß an Sichtbarkeit für die Freigabe, die festlegt, ob andere Tenants die Freigabe sehen können oder nicht. Standardmäßig werden alle Freigaben als private angelegt. Beim Erstellen einer Freigabe verwenden Sie den Schlüssel `` --public``, um Ihre Freigabe für andere Tenants public zu machen, um sie in einer Liste von Freigaben zu sehen und ihre detaillierten Informationen zu sehen.
id: Share bisa *public* atau *private*. Ini adalah tingkat visibilitas untuk share yang menentukan apakah penyewa lain dapat atau tidak dapat melihat share nya. Secara default, semua share dibuat sebagai private. Sambil menciptakan share, gunakan key ``--public``untuk membuat share public Anda untuk penyewa lain melihatnya dalam daftar share dan melihat informasi rincinya.
tr_tr: Bir paylaşım *genel* veya *özel* olabilir. Bu, diğer kiracıların paylaşımı görebileceklerini veya göremediklerini belirleyen paylaşım için bir görünürlük düzeyidir. Varsayılan olarak, tüm paylaşımlar özel olarak oluşturulur. Bir paylaşım oluştururken paylaşımı diğer kiracılar için herkese açık hale getirmek için ``--public`` anahtarını kullanarak bir paylaşım listesinde görünmeyi ve ayrıntılı bilgilerini görebilmeyi sağlarsınız.

source: A share driver in the Shared File Systems service is a Python class that can be set for the back end and run in it to manage share operations, some of which are vendor-specific. The back end is an instance of manila-share service. There are a big number of share drivers created by different vendors in the Shared File Systems service. Each share driver supports one or more back end modes: *share servers* and *no share servers*. An administrator chooses which mode is used by specifying it in ``manila.conf`` configuration file. An option ``driver_handles_share_servers`` is used for it.
de: Ein Share-Treiber im Shared File Systems-Dienst ist eine Python-Klasse, die für das Backend gesetzt werden kann und darin ausgeführt wird, um Share- Operationen zu verwalten, von denen einige herstellerspezifisch sind. Das hintere Ende ist eine Instanz von Manila-Share-Service. Es gibt eine große Anzahl von Freigabe-Treiber, die von verschiedenen Anbietern im Shared File Systems Service erstellt wurden. Jeder Share-Treiber unterstützt einen oder mehrere Back-End-Modi: *share servers* und *no share servers*. Ein Administrator wählt, welcher Modus verwendet wird, indem er ihn in der `manila.conf`` Konfigurationsdatei spezifiziert. Hier wird eine Option `` driver_handles_share_servers``verwendet.
id: Share driver dalam layanan Shared File Systems adalah kelas Python yang dapat diatur untuk back end dan berjalan di dalamnya untuk mengelola operasi share, beberapa di antaranya vendor-specific. Back end adalah instance dari layanan manila-share. Ada sejumlah besar share driver yang dibuat oleh vendor yang berbeda dalam layanan Shared File Systems. Setiap share driveri mendukung satu atau beberapa mode back end: *share servers* dan *no share servers *. Administrator memilih mode mana yang digunakan dengan menentukannya di file konfigurasi ``manila.conf```. Pilihan ``driver_handles_share_servers`` digunakan untuk itu.
tr_tr: Paylaşımlı Dosya Sistemleri servisindeki paylaşım sürücüsü, arka uç olarak ayarlanabilen ve paylaşım işlemlerini yönetmek için çalıştırılabilen, bazıları satıcısına özgü olan bir Python sınıfıdır. Arka uç, manila paylaşım servisinin bir örneğidir. Paylaşımlı Dosya Sistemleri servisinde farklı sağlayıcılar tarafından oluşturulan çok sayıda paylaşım sürücüsü vardır. Her paylaşım sürücüsü bir veya daha fazla arka uç modunu desteklemektedir: *paylaşım sunucuları* ve *paylaşım sunucuları yok*. Bir yönetici hangi modun kullanıldığını ``manila.conf`` yapılandırma dosyasında belirterek seçer. Bunun için ``driver_handles_share_servers`` seçeneği kullanılır.

source: A share is a remote, mountable file system. You can mount a share to and access a share from several hosts by several users at a time.
de: Eine Freigabe ist ein entferntes, einbaufähiges Dateisystem. Sie können eine Freigabe einhängen und Freigabe von mehreren Hosts von mehreren Benutzern zu einem Zeitpunkt teilen.
id: Share adalah sistem berkas yang dapat di mount dan jauh. Anda dapat me-mount share dan mengakses share dari beberapa host oleh beberapa pengguna sekaligus.
tr_tr: Paylaşım, uzaktan bağlanabilen bir dosya sistemidir. Aynı anda birkaç kullanıcı tarafından birkaç ana bilgisayardan bir paylaşım yükleyebilir ve bir paylaşıma erişebilirsiniz.

source: A share type is an administrator-defined "type of service", comprised of a tenant visible description, and a list of non-tenant-visible key-value pairs - extra specifications. The manila-scheduler uses extra specifications to make scheduling decisions, and drivers control the share creation.
de: Ein Freigabetyp ist ein vom Administrator definierter "Diensttyp", der aus einer sichtbaren Anzeige des Tenants besteht und eine Liste von Nicht-Tenant-sichtbaren Schlüsselwertpaaren - zusätzliche Spezifikationen enthält. Der Manila-Scheduler verwendet zusätzliche Spezifikationen, um Terminierungsentscheidungen zu treffen, und Treiber steuern die Freigabeerstellung.
id: Jenis share adalah "type of service" yang administrator-defined, terdiri dari deskripsi yang terlihat oleh penyewa, dan daftar non-tenant-visible key-value pairs - extra specifications. Manila-scheduler menggunakan spesifikasi tambahan untuk membuat keputusan penjadwalan, dan driver mengendalikan penciptaan share.
tr_tr: Paylaşım türü, yönetici tanımlı bir "servis türü" olup, kiracı görünür açıklama ve kiracı olmayanlara görünen anahtar/değer çifti listeleri içerir - ek tanımlamalar. manila-scheduler, zamanlama kararları almak için ek özellikler kullanır ve sürücüler paylaşım oluşturma işlemini denetler.

source: A standard OpenStack Networking setup has up to four distinct physical data center networks:
de: Ein Standard-OpenStack Networking-Setup hat bis zu vier verschiedene physikalische Rechenzentrumsnetze:
id: Penyiapan OpenStack Networking standar memiliki hingga empat jaringan data center fisik yang berbeda:
tr_tr: Standart bir OpenStack Ağ kurulumu dört farklı fiziksel veri merkezi ağına sahiptir:

source: A system entity that provides services to principals or other system entities, in this case, OpenStack Identity is the Service Provider.
de: Eine Systementität, die Dienste für Principals oder andere Systementitäten bereitstellt, in diesem Fall ist OpenStack Identity der Service Provider.
id: Entitas sistem yang memberikan layanan kepada prinsipal atau entitas sistem lainnya, dalam hal ini, OpenStack Identity adalah Service Provider.
tr_tr: Yöneticilere veya diğer sistem varlıklarına (bu durumda OpenStack Kimlik) hizmet sunan bir sistem varlığı Servis Sağlayıcıdır.

source: A table example is provided below:
de: In Folgenden finden Sie ein Beispieltabelle:
id: Contoh tabel disediakan di bawah ini:

source: A third non supported method is Fixed/Hardcoded keys. It is known that some OpenStack services have the option to specify keys in their configuration files. This is the least secure way to operate and we do not recommend this for any sort of production environment.
de: Eine dritte nicht unterstützte Methode sind feste / fest codierte Schlüssel. Es ist bekannt, dass einige OpenStack-Dienste die Möglichkeit haben, Schlüssel in ihren Konfigurationsdateien anzugeben. Dies ist der am wenigsten sichere Weg zu arbeiten, und wir empfehlen dies nicht für jede Art von Produktionsumgebung.
id: Metode ketiga yang tidak didukung adalah kunci Fixed/Hardcoded. Diketahui bahwa beberapa layanan OpenStack memiliki pilihan untuk menentukan kunci pada file konfigurasi mereka. Ini adalah cara yang paling aman untuk dioperasikan dan kami tidak merekomendasikan hal ini untuk lingkungan produksi apapun.

source: A threat actor is an abstract way to refer to a class of adversary that you may attempt to defend against. The more capable the actor, the more expensive the security controls that are required for successful attack mitigation and prevention. Security is a tradeoff between cost, usability and defense. In some cases it will not be possible to secure a cloud deployment against all of the threat actors we describe here. Those deploying an OpenStack cloud will have to decide where the balance lies for their deployment/usage.
de: Ein Bedrohungsakteuer ist ein abstrakter Weg, um auf eine Klasse von Gegnern zu verweisen, gegen die Sie versuchen können, sich zu verteidigen. Je leistungsfähiger der Akteur, desto teurer sind die Sicherheitskontrollen, die für eine erfolgreiche Angriffsminderung und Prävention erforderlich sind. Sicherheit ist ein Kompromiss zwischen Kosten, Usability und Verteidigung. In manchen Fällen wird es nicht möglich sein, eine Cloud-Implementierung gegen alle von uns hier beschriebenen Bedrohungsakteure zu sichern. Diejenigen, die eine OpenStack-Cloud einsetzen, müssen entscheiden, wo die Balance für ihre Bereitstellung/Nutzung liegt.
id: Aktor ancaman adalah cara abstrak untuk merujuk pada kelas musuh yang mungkin Anda coba pertahankan. Aktor yang lebih mumpuni, semakin mahal kontrol keamanan yang dibutuhkan untuk keberhasilan mitigasi dan pencegahan serangan. Keamanan adalah tradeoff antara biaya, kegunaan dan pertahanan. Dalam beberapa kasus, tidak mungkin untuk mengamankan penyebaran awan terhadap semua aktor ancaman yang kami jelaskan di sini. Mereka yang mengerahkan awan OpenStack harus membuat keputusan di mana keseimbangannya terletak pada penerapan/penggunaannya (deployment/usage).
tr_tr: Bir tehdit aktörü, karşı savunma girişiminde bulunabileceğiniz bir düşman sınıfına atıf yapmak için soyut bir yöntemdir. Aktör ne kadar yetenekli olursa, başarılı bir saldırı azaltma ve önleme için gerekli olan güvenlik denetimleri o kadar pahalıdır. Güvenlik, maliyet, kullanışlılık ve savunma arasında bir zıtlıktır. Bazı durumlarda burada açıkladığımız tüm tehdit aktörlerine karşı bir bulut dağıtımının sağlanması mümkün olmayacaktır. Bir OpenStack bulutunu kullananlar dengenin yayına alma/kullanım için nerede yattığı konusunda karar vermek zorunda kalacaklardır.

source: A user or group name that is used by a tenant.
de: Ein Benutzer oder Gruppenname, der von einem Tenant verwendet wird.
id: Nama pengguna atau grup yang digunakan oleh penyewa.
tr_tr: Kiracı tarafından kullanılan bir kullanıcı ya da grup ismi.

source: A volume encryption feature in OpenStack supports privacy on a per-tenant basis. As of the Kilo release, the following features are supported:
de: Eine Volume-Verschlüsselungsfunktion in OpenStack unterstützt die Privatsphäre auf der Basis von Mandanten. Seit der Kilo-Version werden folgende Features unterstützt:
id: Fitur enkripsi volume di OpenStack mendukung privasi secara per-penyewa. Pada rilis Kilo, fitur berikut didukung:
tr_tr: OpenStack'daki bir birim şifreleme özelliği, kiracı başına kişisel gizliliği destekler. Kilo sürümünden itibaren aşağıdaki özellikler desteklenmektedir:

source: AMQP based solutions (Qpid and RabbitMQ) support transport-level security using TLS. ZeroMQ messaging does not natively support TLS, but transport-level security is possible using labelled IPsec or CIPSO network labels.
de: AMQP-basierte Lösungen (Qpid und RabbitMQ) unterstützen die Sicherheit auf der Sicherheitsebene mit TLS. ZeroMQ Messaging unterstützt nicht nativ TLS, aber Transport-Level-Sicherheit ist möglich mit markierten IPsec- oder CIPSO-Netzwerk-Labels.
id: Solusi berbasis AMQP (Qpid and RabbitMQ) mendukung keamanan tingkat transportasi menggunakan TLS. Pesan ZeroMQ tidak mendukung TLS, namun keamanan tingkat transportasi dimungkinkan menggunakan label jaringan CIPSO atau labelled IPsec.
tr_tr: AMQP tabanlı çözümler (Qpid ve RabbitMQ), TLS'yi kullanarak taşıma seviyesinde güvenliği desteklemektedir. ZeroMQ mesajlaşma doğal olarak TLS'yi desteklemez; ancak etiketli IPsec veya CIPSO ağ etiketleri kullanılarak taşıma seviyesinde güvenlik mümkündür.

source: AMQP message service
de: AMQP-Nachrichtendienst
tr_tr: AMQP mesaj servisi

source: API endpoint configuration recommendations
de: API-Endpunkt-Konfigurationsempfehlungen
id: Rekomendasi konfigurasi API endpoint
tr_tr: API uç noktası yapılandırma önerileri

source: API endpoint process isolation and policy
de: API Endpunkt Prozess Isolation und Policy
id: Isolasi dan kebijakan proses endpoint API
tr_tr: API uç nokta süreç izolasyonu ve kuralı

source: API endpoint rate-limiting
de: API-Endpunkt-Ratenbegrenzung
tr_tr: API uç noktası oran-sınırlama

source: API endpoints
de: API-Endpunkte
tr_tr: API uç noktaları

source: API network
de: API Netzwerk
id: Jaringan API
tr_tr: API ağı

source: Abstract
de: Abstrakt
id: Abstrak
tr_tr: Özet

source: Access and log reviews
de: Zugriff und Log-Auswertungen
id: Akses dan tinjauan log
tr_tr: İncelemelere erişim ve günlükleme

source: Access control lists
de: Zugriffskontrolllisten
id: Daftar kontrol akses (access control list)
tr_tr: Erişim kontrol listeleri

source: Access to keystone credentials or plaintext secrets is considered a total security failure of the system - this interface must have robust confidentiality and integrity controls.
de: Der Zugriff auf Keystone-Anmeldeinformationen oder Plaintext-Geheimnisse gilt als totaler Security-Ausfall des Systems - diese Schnittstelle muss über eine robuste Vertraulichkeit und Integritätskontrolle verfügen.
id: Akses ke kredensial keystone atau rahasia plaintext dianggap sebagai kegagalan keamanan total sistem - antarmuka ini harus memiliki kontrol kerahasiaan dan integritas yang kuat.
tr_tr: Keystone kimlik belgelerine veya düz metin gizli bilgilere erişim, sistemin toplam güvenlik başarısızlığı olarak düşünülür - bu arayüz sağlam gizlilik ve bütünlük kontrollerine sahip olmalıdır.

source: According to NIST, a public cloud is one in which the infrastructure is open to the general public for consumption. OpenStack public clouds are typically run by a :term:`service provider` and can be consumed by individuals, corporations, or any paying customer. A public-cloud provider might expose a full set of features such as software-defined networking or block storage, in addition to multiple instance types.
de: Nach NIST ist eine public Cloud eine, in der die Infrastruktur für die Öffentlichkeit für den Konsum offen ist. OpenStack Public Clouds werden in der Regel von einem :term:`service provider` betrieben und können von Einzelpersonen, Unternehmen oder einem zahlenden Kunden verbraucht werden. Ein öffentlicher Cloud-Provider kann neben mehreren Instanztypen einen vollständigen Satz von Features wie Software-definierten Netzwerken, Blockspeicher, anbieten.
id: Menurut NIST, awan publik adalah infrastruktur yang terbuka bagi masyarakat umum untuk dikonsumsi. Awan publik OpenStack biasanya dijalankan oleh :term:`service provider` dan dapat dikonsumsi oleh individu, perusahaan, atau pelanggan yang membayar. Penyedia awan publik mungkin mengekspos serangkaian fitur lengkap seperti jaringan yang didefinisikan perangkat lunak atau penyimpanan blok, dan juga beberapa jenis instance.

source: According to a :ref:`policy.json <shared_fs_policies>` file, an administrator and the users as share owners can manage access to shares by means of creating access rules. Using :command:`manila access-allow`, :command:`manila access-deny` and :command:`manila access-list` commands, you can grant, deny and list access to a specified share correspondingly.
de: Nach :ref:`policy.json <shared_fs_policies>`file, können ein Administrator und die Benutzer als Share-Besitzer den Zugriff auf Freigaben durch die Erstellung von Zugriffsregeln verwalten. Mit :command:`manila access-allow`, :command:` manila access-deny` und :command:`manila access-list` Befehle, können Sie den Zugriff auf eine angegebene Freigabe entsprechend gewähren, verweigern und auflisten.
id: Menurut file :ref:`policy.json <shared_fs_policies>`, administrator dan pengguna sebagai pemilik share dapat mengelola akses ke share dengan cara membuat aturan akses. Menggunakan perintah :command:`manila access-allow`, :command:`manila access-deny` dan :command:`manila access-list`, Anda dapat memberi, menolak, dan mendaftar akses ke share tertentu.
tr_tr: :ref:`policy.json <shared_fs_policies>` dosyasına göre, bir yönetici ve paylaşım sahipleri olarak kullanıcılar erişim kuralları oluşturarak paylaşımlara erişimi yönetebilirler. :command:`manila access-allow`, :command:`manila access-deny` ve :command:`manila access-list` komutlarını kullanarak, belirtilen bir paylaşıma uygun şekilde erişim izni verebilir, reddedebilir ve listeleyebilirsiniz.

source: Account and container custom user metadata values
de: Konto- und Container-benutzerdefinierte Benutzer-Metadatenwerte
id: Account dan container custom user metadata values
tr_tr: Hesap ve kapsayıcı özel kullanıcı metaveri değerleri

source: Account service
de: Kontodienst
id: Layanan Account
tr_tr: Hesap servisi

source: Account, container, and object names
de: Konto-, Container- und Objektnamen
id: Account, container, dan object names
tr_tr: Hesap, kapsayıcı, ve nesne isimleri

source: Acknowledgements
de: Danksagungen
id: Ucapan Terima Kasih
tr_tr: Teşekkür

source: Act as a reference for auditors when evaluating OpenStack deployments.
de: Als Referenz für Auditoren bei der Auswertung von OpenStack-Implementierungen handeln.
id: Bertindak sebagai referensi bagi auditor saat mengevaluasi penerapan OpenStack.
tr_tr: OpenStack dağıtımlarını değerlendirirken denetçiler için referans olarak hareket edin.
