Repository: openstack/security-doc
Catalog: security-guide/source/locale/*/LC_MESSAGES/security-guide.po
Languages: de, id, tr_tr

source: **Fail:** If value of parameter ``auth_protocol`` under ``[keystone_authtoken]`` section in ``manila.conf`` is set to ``http``, or if value of parameter ``identity_uri`` under ``[keystone_authtoken]`` section in ``manila.conf`` is not set to Identity API endpoint starting with ``https://`` or value of parameter ``insecure`` under the same ``[keystone_authtoken]`` section in the same ``manila.conf`` is set to ``True``.
de: **Fail:** Wenn der Wert des Parameters ``auth_protocol``unter `` [keystone_authtoken]``Abschnitt in ``manila.conf`` auf ``http``gesetzt ist oder wenn Wert des Parameters ``identity_uri`` unter ` `[keystone_authtoken]``Abschnitt in ``manila.conf`` nicht auf Identity API Endpunkt ``https://`` oder Wert des Parameters ``insecure`` unter dem gleichen ``[ keystone_authtoken]``Abschnitt in der gleichen `` manila.conf`` auf ``True``gesetzt ist.
id: **Fail:** Jika nilai parameter ``auth_protocol`` dibawah bagian ``[keystone_authtoken]`` dalam ``manila.conf`` diatur ke ``http``, atau jika nilai parameter ``identity_uri`` dibawah bagian ``[keystone_authtoken]`` dalam ``manila.conf`` tidak disetel ke titik akhir API Identitas yang dimulai dengan ``https://`` atau nilai parameter ``insecure`` dibawah bagian ``[keystone_authtoken]`` yang sama dalam ``manila.conf`` yang sama diatur ke ``True``.
tr_tr: **Başarısız:** ``manila.conf`` dosyasında ``[keystone_authtoken]`` bölümündeki ``auth_protocol`` parametresinin değeri ``http`` ise ya da ``manila.conf`` dosyasında ``[keystone_authtoken]`` bölümündeki ``identity_uri`` paramtresinin değeri ``https://`` ile başlayan bir Kimlik API'ye ayarlı değilse ya da ``manila.conf`` dosyasında ``[keystone_authtoken]`` bölümündeki ``insecure`` parametresinin değeri ``True`` ise.

source: **Fail:** If value of parameter ``auth_strategy`` under ``[DEFAULT]`` section in ``/etc/glance/glance-api.conf`` is set to ``noauth`` or value of parameter ``auth_strategy`` under ``[DEFAULT]`` section in ``/etc/glance/glance- registry.conf`` is set to ``noauth``.
de: **Fail:** Wenn der Wert des Parameters ``auth_strategy``unter `` [DEFAULT] ``Abschnitt in ``/etc/glance/glance-api.conf``auf `` noauth`` gesetzt ist oder Wert von Parameter ``auth_strategy``unter `` [DEFAULT]`` Abschnitt in ``/etc/glance/glance-registry.conf``ist auf ``noauth`` gesetzt.
id: **Fail:** Jika nilai parameter ``auth_strategy`` dibawah bagian ``[DEFAULT]`` di ``/etc/glance/glance-api.conf`` dieter ke ``noauth`` atau nilai parameter ``auth_strategy`` dibawah bagian ``[DEFAULT]`` di ``/etc/glance/glance- registry.conf`` diatur ke ``noauth``.
tr_tr: **Başarısız:** Eğer ``/etc/glance/glance-api.conf`` dosyasındaki ``[DEFAULT]`` sekmesindeki ``auth_strategy`` parametresinin değeri ``noauth`` ise veya ``/etc/glance /glance-registry.conf`` dosyasındaki ``[DEFAULT]`` sekmesindeki ``auth_strategy`` parametresinin değeri ``noauth`` ise.

source: **Fail:** If value of parameter ``auth_strategy`` under ``[DEFAULT]`` section is set to ``noauth`` or ``noauth2``.
de: **Fail:** Wenn der Wert des Parameters ``auth_strategy``unter `` [DEFAULT] ``Abschnitt auf ``noauth``oder ``noauth2``gesetzt ist.
id: **Fail:** Jika nilai parameter ``auth_strategy`` di bawah bagian ``[DEFAULT] `` diatur ke ``noauth`` atau ``noauth2``.
tr_tr: **Başarısız:** Eğer ``/etc/nova/nova.conf`` dosyasındaki ``[DEFAULT]`` bölümündeki ``auth_strategy`` değeri ``noauth`` ya da ``noauth2`` ise.

source: **Fail:** If value of parameter ``auth_strategy`` under ``[DEFAULT]`` section is set to ``noauth``.
de: **Fail:** Wenn der Wert des Parameters ``auth_strategy`` in der ``[DEFAULT]`` Sektion auf ``noauth`` gesetzt ist.
id: **Fail:** Jika nilai parameter ``auth_strategy`` di bawah bagian `` [DEFAULT] `` diatur ke ``noauth``.
tr_tr: **Başarısız:** Eğer ``/etc/cinder/cinder.conf`` altında ``[DEFAULT]`` bölümünde ``auth_strategy`` değeri ``noauth`` ise.

source: **Fail:** If value of parameter ``auth_uri`` under ``[keystone_authtoken]`` section in ``/etc/cinder/cinder.conf`` is not set to Identity API endpoint starting with ``https://`` or value of parameter ``insecure`` under the same ``[keystone_authtoken]`` section in the same ``/etc/cinder/cinder.conf`` is set to ``True``.
de: **Fail:** Wenn der Wert des Parameter ``auth_uri`` im ``[keystone_authtoken]`` Abschnitt in ``/etc/cinder/cinder.conf`` nicht gesetzt ist zum Identity API Endpunkt startend mit ``https://`` und der Wert des Parameter ``insecure`` im selben ``[keystone_authtoken]`` Abschnitt in der selben ``/etc/cinder/cinder.conf`` auf ``True`` gesetzt ist.

source: **Fail:** If value of parameter ``auth_uri`` under ``[keystone_authtoken]`` section in ``/etc/glance/glance-api.conf`` is not set to Identity API endpoint starting with ``https://``, or value of parameter ``insecure`` under the same ``[keystone_authtoken]`` section in the same ``/etc/glance/glance-api.conf`` is set to ``True``.
de: **Fail:** Wenn der Wert des Parameters ``auth_uri`` unter `` [keystone_authtoken]`` Abschnitt in ``/etc/glance/glance-api.conf`` nicht auf Identity API Endpunkt gesetzt ist, der mit ``https://`` beginnt oder Wert des Parameters ``insecure`` unter demselben `` [keystone_authtoken] ``Abschnitt in der gleichen ``/etc/glance/ glance-api.conf`` ist auf ``True gesetzt ``.

source: **Fail:** If value of parameter ``auth_uri`` under ``[keystone_authtoken]`` section in ``/etc/neutron/neutron.conf`` is not set to Identity API endpoint starting with ``https://`` or value of parameter ``insecure`` under the same ``[keystone_authtoken]`` section in the same ``/etc/neutron/neutron.conf`` is set to ``True``.
de: **Fail:** Wenn der Wert des Parameters ``auth_uri``unter `` [keystone_authtoken]``Abschnitt in ``/etc/neutron/neutron.conf`` nicht auf Identity API Endpoint gesetzt ist, nicht mit ``https:// `` beginnt oder Wert des Parameters ``insecure`` unter demselben `` [keystone_authtoken]``Abschnitt in der gleichen ``/etc/neutron/ neutron.conf`` auf ``True``gesetzt ist.

source: **Fail:** If value of parameter ``auth_uri`` under ``[keystone_authtoken]`` section in ``/etc/nova/nova.conf`` is not set to Identity API endpoint starting with ``https://`` or value of parameter ``insecure`` under the same ``[keystone_authtoken]`` section in the same ``/etc/nova/nova.conf`` is set to ``True``.
de: **Fail:** Wenn der Wert des Parameters ``auth_uri``unter dem `` [keystone_authtoken]`` Abschnitt in ``/etc/nova/nova.conf`` nicht auf Identity API Endpunkt gesetzt ist, mit ``https://`` beginnt oder der Wert des Parameters ``insecure`` unter demselben ``[keystone_authtoken] `` Abschnitt in der gleichen ``/etc/nova/nova.conf`` auf ``True`` gesetzt ist.

source: **Fail:** If value of parameter ``cinder_api_insecure`` under ``[DEFAULT]`` section in ``manila.conf`` is set to ``True``.
de: **Fail:** Wenn der Wert des Parameters ``cinder_api_insecure`` unter `` [DEFAULT]``Abschnitt in ``manila.conf`` auf ``True`` gesetzt ist.
id: **Fail:** Jika nilai parameter ``cinder_api_insecure`` di bawah bagian ``[DEFAULT] `` di ``manila.conf`` diatur ke ``True``.
tr_tr: **Başarısız:** ``manila.conf`` dosyasında ``[DEFAULT]`` bölümündeki ``cinder_api_insecure`` parametresinin değeri ``True`` ise.

source: **Fail:** If value of parameter ``glance_api_insecure`` under ``[DEFAULT]`` section in ``/etc/cinder/cinder.conf`` is set to ``True`` or the value of parameter ``glance_api_servers`` is set to a value that does not start with ``https://``.
de: **Fail:** Wenn der Wert des Parameter ``glance_api_insecure`` im ``[DEFAULT]`` Abschnitt in der ``/etc/cinder/cinder.conf`` auf ``True`` gesetzt ist und der Wert des Parameter ``glance_api_servers`` ist nicht auf einen Wert startend mit ``https://`` gesetzt.
id: **Fail:** Jika nilai parameter ``glance_api_insecure`` di bawah bagian ``[DEFAULT] `` di ``/etc/cinder/cinder.conf`` disetel ke ``True`` atau nilai parameter ``glance_api_servers`` adalah disetel ke nilai yang tidak dimulai dengan ``https:// ``.
tr_tr: **Başarısız:** Eğer``/etc/cinder/cinder.conf`` altında ``[DEFAULT]`` bölümünde ``glance_api_insecure`` değeri ``True`` ise ya da ``glance_api_servers`` değeri ``https://`` ile başlamıyorsa.

source: **Fail:** If value of parameter ``hash_algorithm`` under ``[token]``\ section is set to MD5.
de: **Fail:** Wenn der Wert des Parameters ``hash_algorithm``unter `` [token]``Abschnitt auf MD5 gesetzt ist.
id: **Fail:** Jika nilai parameter ``hash_algorithm`` di bawah bagian ``[token] ``\ diatur ke MD5.
tr_tr: **Başarısız:** ``[token]``\ bölümünün altındaki ``hash_algorithm`` parametresinin değeri MD5 ise.

source: **Fail:** If value of parameter ``max_request_body_size`` is not set.
de: **Fail:** Wenn der Wert des Parameters ``max_request_body_size``nicht gesetzt ist.
id: **Fail:** Jika nilai parameter ``max_request_body_size`` tidak disetel.
tr_tr: **Başarısız:** ``max_request_body_size`` parametresinin değeri ayarlanmamışsa.

source: **Fail:** If value of parameter ``max_request_body_size`` under ``[oslo_middleware]`` section in ``manila.conf`` is not set to ``114688``, or if value of parameter ``osapi_max_request_body_size`` under ``[DEFAULT]`` section in ``manila.conf`` is not set to ``114688``.
de: **Fail:** Wenn der Wert des Parameters ``max_request_body_size`` unter `` [oslo_middleware]``Abschnitt in ``manila.conf`` nicht auf ``114688`` gesetzt ist oder wenn Wert des Parameters ``osapi_max_request_body_size ist ``unter ``[DEFAULT]``Abschnitt in ``manila.conf`` ist nicht auf `` 114688`` gesetzt.
id: **Fail:** Jika nilai parameter ``max_request_body_size`` di bawah bagian ``[oslo_middleware] `` di ``manila.conf`` tidak diatur ke ``114688``, atau jika nilai parameter ``osapi_max_request_body_size`` di bawah ``[ DEFAULT] `` di ``manila.conf`` tidak diatur ke ``114688``.
tr_tr: **Başarısız:** ``manila.conf`` dosyasında ``[oslo_middleware]`` bölümündeki ``max_request_body_size`` parametresinin değeri ``114688`` değil ise ya da ``manila.conf`` dosyasında ``[oslo_middleware]`` bölümündeki ``osapi_max_request_body_size`` parametresinin değeri ``114688`` değil ise.

source: **Fail:** If value of parameter ``nas_secure_file_permissions`` under ``[DEFAULT]`` section in ``/etc/cinder/cinder.conf`` is set to ``False`` and if value of parameter ``nas_secure_file_operations`` under ``[DEFAULT]`` section in ``/etc/cinder/cinder.conf`` is set to ``False``.
de: **Fail:** Wenn der Wert des Parameter ``nas_secure_file_permissions`` im ``[DEFAULT]`` Abschnitt in der ``/etc/cinder/cinder.conf`` ist auf ``False`` gesetzt und wenn der Wert des Parameter ``nas_secure_file_operations`` im ``[DEFAULT]`` Abschnitt in der ``/etc/cinder/cinder.conf`` ist auf ``False`` gesetzt.
id: **Fail:** Jika nilai parameter ``nas_secure_file_permissions`` di bawah bagian ``[DEFAULT] `` di ``/etc/cinder/cinder.conf`` diatur ke `` False`` dan jika nilai parameter ``nas_secure_file_operations`` di bawah bagian ``[DEFAULT]`` di ``/etc/cinder/cinder.conf`` diatur ke ``False``.
tr_tr: ** Başarısız: ** ``/etc/cinder/cinder.conf`` içindeki ``[DEFAULT]`` bölümündeki ``nas_secure_file_permissions`` parametresinin değeri ``False`` olarak ayarlanmışsa ve eğer parametrenin değeri ``/etc/cinder/cinder.conf`` daki ``[DEFAULT]`` bölümündeki ``nas_secure_file_operations`` ayarı ``False`` olarak ayarlanmıştır.

source: **Fail:** If value of parameter ``neutron_api_insecure`` under ``[DEFAULT]`` section in ``manila.conf`` is set to ``True``.
de: **Fail:** Wenn der Wert des Parameters ``neutron_api_insecure`` unter `` [DEFAULT]``Abschnitt in ``manila.conf`` auf ``True`` gesetzt ist.
id: **Fail:** Jika nilai parameter ``neutron_api_insecure`` di bawah bagian ``[DEFAULT] `` di ``manila.conf`` diatur ke ``True``.
tr_tr: **Başarısız:** ``manila.conf`` dosyasında ``[DEFAULT]`` bölümündeki ``neutron_api_insecure`` parametresinin değeri ``True`` ise.

source: **Fail:** If value of parameter ``nova_api_insecure`` under ``[DEFAULT]`` section in ``/etc/cinder/cinder.conf`` is set to ``True``.
de: **Fail:** Der Wert des Parameters ``nova_api_insecure`` in der ``[DEFAULT]`` Sektion in ``/etc/cinder/cinder.conf`` ist auf ``True`` gesetzt.
id: **Fail:** Jika nilai parameter ``nova_api_insecure`` di bawah bagian ``[DEFAULT] `` di ``/etc/cinder/cinder.conf`` disetel ke ``True``.
tr_tr: **Başarılı:** ``/etc/cinder/cinder.conf`` içindeki ``[DEFAULT]`` bölümündeki ``nova_api_insecure`` parametresinin değeri ``True`` ise.

source: **Fail:** If value of parameter ``nova_api_insecure`` under ``[DEFAULT]`` section in ``manila.conf`` is set to ``True``.
de: **Fail:** Wenn der Wert des Parameters ``nova_api_insecure``unter `` [DEFAULT]``Abschnitt in ``manila.conf`` auf ``True``gesetzt ist.
id: **Fail:** Jika nilai parameter ``nova_api_insecure`` di bawah bagian `` DEFAULT] `` di ``manila.conf`` disetel ke ``True``.
tr_tr: **Başarısız:** ``manila.conf`` dosyasında ``[DEFAULT]`` bölümündeki ``nova_api_insecure`` parametresinin değeri ``True`` ise.

source: **Fail:** If value of parameter ``osapi_max_request_body_size`` under ``[DEFAULT]`` section in ``/etc/cinder/cinder.conf`` is not set to ``114688`` or if value of parameter ``max_request_body_size`` under ``[oslo_middleware]`` section in ``/etc/cinder/cinder.conf`` is not set to ``114688``.
de: **Fail:** Wenn der Wer des Parameter ``osapi_max_request_body_size`` im ``[DEFAULT]`` Abschnitt in der ``/etc/cinder/cinder.conf`` nicht auf ``114688`` gesetzt ist oder wenn der Wert des Parameter ``max_request_body_size`` unter dem ``[oslo_middleware]`` Abschnitt in der ``/etc/cinder/cinder.conf`` ist nicht auf ``114688`` gesetzt.
id: **Fail:** Jika nilai parameter ``osapi_max_request_body_size`` di bawah bagian ``[DEFAULT]`` di ``/etc/cinder/cinder.conf`` tidak diatur ke ``114688`` atau jika nilai parameter ``max_request_body_size`` di bawah bagian ``[oslo_middleware]`` di ``/etc/cinder/cinder.conf`` tidak diatur ke ``114688``.
tr_tr: **Başarısız:** ``/etc/cinder/cinder.conf`` içindeki ``[DEFAULT]`` bölümündeki ``osapi_max_request_body_size`` parametresinin değeri ``114688`` olarak ayarlanmadıysa veya ``/etc/cinder/cinder.conf`` içindeki ``[oslo_middleware]`` bölümündeki ``max_request_body_size`` parametresi ``114688`` olarak ayarlanmadıysa.

source: **Fail:** If value of parameter ``provider`` under ``[token]`` section is set to uuid.
de: **Fail:** Wenn der Wert des Parameter ``provider`` unter ``[token]`` Sektion auf uuid gesetzt ist.
id: **Fail:** Jika nilai parameter ``provider`` di bawah bagian ``[token] `` diatur ke uuid.

source: **Fail:** If value of parameter ``use_ssl`` under ``[DEFAULT]`` section in ``/etc/neutron/neutron.conf`` is set to ``False``.
de: **Fail:** Wenn der Wert des Parameters ``use_ssl``unter ``[DEFAULT] `` Abschnitt in ``/etc/neutron/neutron.conf``auf ``False``gesetzt ist.
id: **Fail:** Jika nilai parameter ``use_ssl`` di bawah bagian ``[DEFAULT]`` di ``/etc/neutron/neutron.conf`` diatur ke ``False``.
tr_tr: **Başarılı:** ``/etc/neutron/neutron.conf`` dosyasında ``[DEFAULT]`` bölümündeki ``use_ssl`` parametresinin değeri ``False`` ise.

source: **Flat network in share servers back-end mode**
de: ** Flat-Netzwerk im share-servers-Back-End-Modus **
tr_tr: **paylaşım sunucusu arka uç kipinde düz ağ**

source: **Gregg Tally**, Johns Hopkins University Applied Physics Laboratory
de: ** Gregg Tally **, Johns Hopkins Universität Angewandte Physik Labor
tr_tr: **Gregg Tally**, Johns Hopkins Üniversitesi Uygulamalı Fizik Laboratuarı

source: **Pass:** If TLS is enabled on the HTTP server.
de: **Pass:** Wenn TLS auf dem HTTP Server aktiviert ist.
id: **Pass:** Jika TLS diaktifkan pada server HTTP.
tr_tr: **Başarılı:** HTTP sunucunuzda TLS etkin ise.

source: **Pass:** If ``insecure_debug`` under ``[DEFAULT]`` section in ``/etc/keystone/keystone.conf`` is false.
de: **Pass:** Wenn ``insecure_debug``unter ``[DEFAULT] ``Abschnitt in ``/ etc/keystone/keystone.conf`` false ist.
id: **Pass:**Jika ``insecure_debug`` di bawah bagian `` [DEFAULT] `` di ```/etc/keystone/keystone.conf`` adalah salah.
tr_tr: **Başarılı:** Eğer ``/etc/keystone/keystone.conf`` dosyasındaki ``[DEFAULT]`` bölümündeki ``insecure_debug`` false ise.

source: **Pass:** If permissions are set to 640 or stricter.
de: **Pass:** Wenn die Berechtigungen auf 640 oder strenger eingestellt sind.

source: **Pass:** If permissions are set to 640 or stricter. The permissions of 640 translates into owner r/w, group r, and no rights to others i.e. "u=rw,g=r,o=". Note that with :ref:`check_block_01` and permissions set to 640, root has read/write access and cinder has read access to these configuration files. The access rights can also be validated using the following command. This command will only be available on your system if it supports ACLs.
de: **Pass:** Wenn die Berechtigungen auf 640 oder strenger eingestellt sind. Die Berechtigungen von 640 übersetzen in den Besitzer r/w, Gruppe r und keine Rechte an anderen z.B. "u = rw, g = r, o =". Beachten Sie, wennmit :ref:`check_block_01` und Berechtigungen 640 gesetzt sind, root Lese-/Schreibzugriff und cinder Lesezugriff auf diese Konfigurationsdateien hat. Die Zugriffsrechte können auch mit dem folgenden Befehl validiert werden. Dieser Befehl ist nur auf Ihrem System verfügbar, wenn er ACLs unterstützt.

source: **Pass:** If permissions are set to 640 or stricter. The permissions of 640 translates into owner r/w, group r, and no rights to others i.e. "u=rw,g=r,o=". Note that with :ref:`check_dashboard_01` and permissions set to 640, root has read/write access and horizon has read access to these configuration files. The access rights can also be validated using the following command. This command will only be available on your system if it supports ACLs.
de: **Pass:** Wenn die Berechtigungen auf 640 oder strenger eingestellt sind. Die Berechtigungen von 640 übersetzen in den Besitzer r/w, Gruppe r und keine Rechte an anderen dh "u=rw, g=r, o=". Beachten Sie, dass mit :ref:`check_dashboard_01` und Berechtigungen auf 640 gesetzt ist, hat root Lese-/Schreibzugriff und horizon hat Lesezugriff auf diese Konfigurationsdateien. Die Zugriffsrechte können auch mit dem folgenden Befehl validiert werden. Dieser Befehl ist nur auf Ihrem System verfügbar, wenn er ACLs unterstützt.
id: **Pass:** Jika izin diatur ke 640 atau lebih ketat. Perizinan 640 diterjemahkan menjadi owner r/w, group r, dan tidak ada hak kepada orang lain yaitu "u=rw,g=r,o=". Perhatikan bahwa dengan :ref: `check_dashboard_01` dan izin diset ke 640, root telah membaca/menulis akses dan horizon telah membaca akses ke file konfigurasi ini. Hak akses juga dapat divalidasi dengan menggunakan perintah berikut. Perintah ini hanya akan tersedia di sistem Anda jika mendukung ACL.
tr_tr: **Başarılı:** Eğer izinler 640 ya da daha sıkı ise. İzinlerin 640 olması demek, sahip o/y, grup o ve diğerlerine hiç yetki yok demektir. Örneğin "u=rw,g=r,o=". :ref:`check_dashboard_01` ile ve izinler 640 ise, bu yapılandırma dosyalarına root'un okuma/yazma yetkisi ve horizon'un okuma yetkisi vardır. Erişim izinleri aşağıdaki komut ile doğrulanabilir. Bu komut sadece sistem ACL destekliyorsa kullanılabilirdir.

source: **Pass:** If permissions are set to 640 or stricter. The permissions of 640 translates into owner r/w, group r, and no rights to others i.e. "u=rw,g=r,o=". Note that with :ref:`check_neutron_01` and permissions set to 640, root has read/write access and neutron has read access to these configuration files. The access rights can also be validated using the following command. This command will only be available on your system if it supports ACLs.
de: **Pass:** Wenn die Berechtigungen auf 640 oder strenger eingestellt sind. Die Berechtigungen von 640 übersetzen in den Besitzer r/w, Gruppe r und keine Rechte an anderen d.h. "u=rw,g=r,o=". Beachten Sie, dass mit :ref:`check_neutron_01` und Berechtigungen auf 640 gesetzt ist, hat root Lese-/Schreibzugriff und neutron hat Lesezugriff auf diese Konfigurationsdateien. Die Zugriffsrechte können auch mit dem folgenden Befehl validiert werden. Dieser Befehl ist nur auf Ihrem System verfügbar, wenn er ACLs unterstützt.

source: **Pass:** If permissions are set to 640 or stricter. The permissions of 640 translates into owner r/w, group r, and no rights to others i.e. "u=rw,g=r,o=". Note that with :ref:`check_shared_fs_01` and permissions set to 640, root has read/write access and manila has read access to these configuration files. The access rights can also be validated using the following command. This command will only be available on your system if it supports ACLs.
de: **Pass:** Wenn die Berechtigungen auf 640 oder strenger eingestellt sind. Die Berechtigungen von 640 übersetzen in den Besitzer r/w, Gruppe r und keine Rechte an anderen dh "u=rw,g=r,o=". Beachten Sie, dass mit :ref:`check_shared_fs_01` und Berechtigungen auf 640 gesetzt, root Lese-/Schreibzugriff und manila Lesezugriff auf diese Konfigurationsdateien hat. Die Zugriffsrechte können auch mit dem folgenden Befehl validiert werden. Dieser Befehl ist nur auf Ihrem System verfügbar, wenn er ACLs unterstützt.

source: **Pass:** If permissions are set to 640 or stricter. The permissions of 640 translates into owner r/w, group r, and no rights to others, for example "u=rw,g=r,o=".
de: ** Pass: ** Wenn die Berechtigungen auf 640 oder strenger eingestellt sind. Die Berechtigungen von 640 werden in Eigentümer r/w, Gruppe r und keine Rechte an andere übersetzt, zum Beispiel "u=rw, g=r, o =".

source: **Pass:** If permissions are set to 640 or stricter. The permissions of 640 translates into owner r/w, group r, and no rights to others. For example, "u=rw,g=r,o=".
de: **Pass:** Wenn die Berechtigungen auf 640 oder strenger eingestellt sind. Die Berechtigungen von 640 übersetzen in Besitzer r/w, Gruppe r und keine Rechte an andere. Zum Beispiel "u = rw, g = r, o =".

source: **Pass:** If permissions are set to 640 or stricter. The permissions of 640 translates into owner r/w, group r, and no rights to others. For example, ``u=rw,g=r,o=``.
de: **Pass:** Wenn die Berechtigungen auf 640 oder strenger eingestellt sind. Die Berechtigungen von 640 übersetzen in Besitzer r/w, Gruppe r und keine Rechte an andere. Zum Beispiel, ``u=rw, g=r, o=``.

source: **Pass:** If the parameter ``authtoken`` is listed under the ``pipeline:barbican-api-keystone`` section in ``barbican-api-paste.ini``.
de: **Pass:** Wenn der Parameter ``authtoken`` unter der ``pipeline:barbican-api-keystone`` Sektion in ``barbican-api-paste.ini`` gelistet ist.
id: **Pass:** Jika parameternya ``authtoken`` terdaftar di bawah bagian ``pipeline:barbican-api-keystone`` dalam ``barbican-api-paste.ini``.

source: **Pass:** If user and group ownership of all these config files is set to ``root`` and ``nova`` respectively. The above commands show output of ``root nova``.
de: **Pass:** Wenn Benutzer- und Gruppenbesitz aller dieser Konfigurationsdateien auf ``root``und ``nova``gesetzt ist. Die obigen Befehle zeigen die Ausgabe von ``root nova``.
id: **Pass:** Jika kepemilikan pengguna dan grup dari semua file konfigurasi ini diset masing-masing ke ``root`` dan ``nova``. Perintah di atas menunjukkan output dari ``root nova``.
tr_tr: **Başarılı:** Tüm bu yapılandırma dosyalarının kullanıcı ve grup sahipliği sırasıyla ``root`` ve ``nova`` olarak ayarlanırsa. Yukarıdaki komutlar ``root nova`` nın çıktısını göstermektedir.
