Repository: openstack/security-doc
Catalog: security-guide/source/locale/*/LC_MESSAGES/security-guide.po
Languages: de, id, tr_tr

source: For services that are deployed on management networks, the threats aren't so clear due to the bridging of security domains with network security. There is always the chance that an administrator with access to the management network decides to do something malicious. SSL/TLS isn't going to help in this situation if the attacker is allowed to access the private key. Not everyone on the management network would be allowed to access the private key of course, so there is still value in using SSL/TLS to protect yourself from internal attackers. Even if everyone that is allowed to access your management network is 100% trusted, there is still a threat that an unauthorized user gains access to your internal network by exploiting a misconfiguration or software vulnerability. One must keep in mind that you have users running their own code on instances in the OpenStack Compute nodes, which are deployed on the management network. If a vulnerability allows them to break out of the hypervisor, they will have access to your management network. Using SSL/TLS on the management network can minimize the damage that an attacker can cause.
de: Für Dienste, die in Verwaltungsnetzwerken eingesetzt werden, sind die Bedrohungen aufgrund der Überbrückung von Sicherheitsdomänen mit Netzwerksicherheit nicht so klar. Es besteht immer die Chance, dass ein Administrator mit Zugang zum Management-Netzwerk entscheidet, etwas Bösartiges zu tun. SSL/TLS wird in dieser Situation nicht helfen, wenn der Angreifer auf den privaten Schlüssel zugreifen darf. Nicht jeder auf dem Management-Netzwerk wäre erlaubt, auf den privaten Schlüssel natürlich zuzugreifen, also gibt es immer noch Wert bei der Verwendung von SSL/TLS, um sich vor internen Angreifern zu schützen. Auch wenn jeder, der auf Ihr Management-Netzwerk zugreifen darf, 100% vertraut ist, besteht immer noch die Bedrohung, dass ein nicht autorisierter Benutzer Zugriff auf Ihr internes Netzwerk erhält, indem er eine Fehlkonfiguration oder Software-Schwachstelle ausnutzt. Man muss bedenken, dass Sie Benutzer haben, die ihren eigenen Code auf Instanzen in den OpenStack Compute-Knoten ausführen, die im Management-Netzwerk bereitgestellt werden. Wenn eine Sicherheitsanfälligkeit es ihnen ermöglicht, aus den Hypervisor auszubrechen, haben sie Zugriff auf Ihr Management-Netzwerk. Mit SSL/TLS auf dem Management-Netzwerk kann der Schaden minimiert werden, den ein Angreifer verursachen kann.
id: Untuk layanan yang dikerahkan di jaringan manajemen, ancamannya tidak begitu jelas karena menjembatani domain keamanan dengan keamanan jaringan. Selalu ada kemungkinan administrator dengan akses ke jaringan manajemen memutuskan untuk melakukan sesuatu yang jahat. SSL/TLS tidak akan membantu dalam situasi ini jika penyerang diizinkan untuk mengakses kunci privat. Tidak semua orang di jaringan manajemen akan diizinkan untuk mengakses kunci privat tentunya, jadi masih ada nilai dalam menggunakan SSL/TLS untuk melindungi diri dari penyerang internal. Bahkan jika setiap orang yang diizinkan mengakses jaringan manajemen Anda 100% dipercaya, masih ada ancaman bahwa pengguna yang tidak berwenang mendapatkan akses ke jaringan internal Anda dengan memanfaatkan kerentanan misconfiguration atau perangkat lunak. Kita harus ingat bahwa Anda memiliki pengguna yang menjalankan kode mereka sendiri pada instance di node OpenStack Compute, yang digunakan pada jaringan manajemen. Jika kerentanan memungkinkan mereka keluar dari hypervisor, mereka akan memiliki akses ke jaringan manajemen Anda. Menggunakan SSL/TLS pada jaringan manajemen dapat meminimalkan kerusakan yang dapat menyebabkan penyerang.
tr_tr: Yönetim ağlarında konuşlandırılan servisler için, güvenlik alanlarının ağ güvenliği ile köprülemesi nedeniyle tehditler o kadar açık değildir. Yönetim şebekesine erişimi olan bir yöneticinin kötü niyetli bir şeyler yapmaya karar verme ihtimali her zaman vardır. Saldırganın özel anahtara erişmesine izin verilirse SSL/TLS bu durumda yardımcı olmaz. Yönetim ağındaki herkesin tabii ki özel anahtara erişmesine izin verilmez, bu nedenle kendinizi dahili saldırganlardan korumak için SSL/TLS kullanmaya değer. Yönetim ağınıza erişmesine izin verilen herkes % 100 güvenilir olsa dahi, yetkisiz bir kullanıcının yanlış yapılandırma veya yazılım açıklarından yararlanarak dahili ağınıza erişmesi için hala bir tehlike söz konusudur. Kullanıcıların, yönetim ağında konuşlandırılan OpenStack Hesaplama düğümlerinde bulunan örneklerde kendi kodlarını çalıştırdıklarını unutmamalısınız. Bir güvenlik açığı hipervizörden ayrılmalarına izin verirse, yönetim ağına erişebilirler. Yönetim ağında SSL/TLS kullanmak, bir saldırganın neden olabileceği zararı en aza indirebilir.

source: For situations where the fixed and floating IP addresses do not provide the functionality required the controller can provide access through two alternate methods: custom network topologies and indirect access. The custom network topologies feature allows the controller to access the instances through a supplied shell command in the configuration file. Indirect access is used to specify instances that can be used as proxy gateways by the user during cluster provisioning. These options are discussed with examples of usage in :doc:`configuration-and-hardening`.
de: Für Situationen, in denen die festen und Floating-IP-Adressen nicht die erforderliche Funktionalität bereitstellen, kann der Controller durch zwei alternative Methoden Zugriff gewähren: benutzerdefinierte Netzwerktopologien und indirekten Zugriff. Die benutzerdefinierte Netzwerk-Topologien-Funktion ermöglicht es dem Controller, über einen bereitgestellten Shell-Befehl in die Konfigurationsdatei auf die Instanzen zuzugreifen. Indirekter Zugriff wird verwendet, um Instanzen anzugeben, die als Proxy-Gateways vom Benutzer während der Cluster-Bereitstellung verwendet werden können. Diese Optionen werden mit Anwendungsbeispielen in :doc:`configuration-and-hardening` diskutiert.
id: Untuk situasi di mana alamat IP tetap dan mengambang tidak menyediakan fungsionalitas yang dibutuhkan, controller dapat menyediakan akses melalui dua metode alternatif: topologi jaringan custom dan akses tidak langsung. Fitur topologi jaringan custom memungkinkan controller mengakses instance melalui perintah shell yang disediakan pada file konfigurasi. Akses tidak langsung digunakan untuk menentukan instance yang dapat digunakan sebagai gateway proxy oleh pengguna selama pemberian klaster. Pilihan ini dibahas dengan contoh penggunaan di :doc:`configuration-and-hardening`.
tr_tr: Sabit ve değişen IP adreslerinin gerekli işlevselliği sağlamadığı durumlarda, denetleyici iki farklı yöntemle erişim sağlayabilir: özel ağ topolojileri ve dolaylı erişim. Özel ağ topolojileri özelliği, denetleyicinin yapılandırma dosyasındaki sağlanan bir kabuk komutu aracılığıyla örneklere erişmesini sağlar. Dolaylı erişim, kullanıcı tarafından küme hazırlığı sırasında proxy geçitleri olarak kullanılabilen örnekleri belirtmek için kullanılır. Bu seçenekler kullanım örnekleri ile tartışılmıştır :doc:`configuration-and-hardening`.

source: For storage of secrets, it's strongly recommended to a Hardware Security Modules (HSMs). HSMs can come in multiple forms. The traditional device is a rack mounted appliance such as the one `shown in the following blog post <https://vakwetu.wordpress.com/2015/11/30/barbican-and-dogtagipa/>`_.
de: Für die Speicherung von Geheimnissen wird dringend ein Hardware Security Module (HSM) empfohlen. HSMs können in verschiedenen Formen vorliegen. Das traditionelle Gerät ist ein rackmontiertes Gerät, wie es im folgenden Blogpost <https://vakwetu.wordpress.com/2015/11/30/barbican-and-dogtagipa/> `_ angezeigt wird.
id: Untuk penyimpanan rahasia, sangat disarankan ke Hardware Security Modules (HSMs). HSM bisa datang dalam berbagai bentuk. Perangkat tradisional adalah alat yang dipasang rak seperti yang ditunjukkan pada entri blog berikut <https://vakwetu.wordpress.com/2015/11/30/barbican-and-dogtagipa/> `_.

source: For these and other hypervisors, we recommend referring to hypervisor-specific documentation.
de: Für diese und andere Hypervisoren empfehlen wir, auf hypervisor-spezifische Dokumentation zu verweisen.
id: Untuk hypervisor ini dan lainnya, sebaiknya rujuk ke dokumentasi khusus hypervisor.
tr_tr: Bu ve diğer hipervizör'ler için, hipervizör'e özgü belgeleri referans almanızı öneririz.

source: Forensics and incident response
de: Forensik und Vorfallreaktion
id: Respon forensik dan insiden
tr_tr: Hukuki ve olay cevabı

source: Fortunately, a cloud architect may address these issues by providing a high quality source of entropy to the cloud instances. This can be done by having enough hardware random number generators (HRNG) in the cloud to support the instances. In this case, "enough" is somewhat domain specific. For everyday operations, a modern HRNG is likely to produce enough entropy to support 50-100 compute nodes. High bandwidth HRNGs, such as the RdRand instruction available with Intel Ivy Bridge and newer processors could potentially handle more nodes. For a given cloud, an architect needs to understand the application requirements to ensure that sufficient entropy is available.
de: Glücklicherweise kann ein Cloud-Architekt diese Probleme ansprechen, indem er eine qualitativ hochwertige Entropiequelle für die Cloud-Instanzen bereitstellt. Dies kann getan werden, indem genügend Hardware-Zufallszahlengeneratoren (HRNG) in der Cloud vorhanden sind, um die Instanzen zu unterstützen. In diesem Fall ist "genug" etwas domänenspezifisch. Für den alltäglichen Betrieb wird eine moderne HRNG wahrscheinlich genug Entropie produzieren, um 50-100 Compute-Knoten zu unterstützen. HRNGs mit hoher Bandbreite, wie z. B. die RDRand-Anweisung, die mit Intel Ivy Bridge und neueren Prozessoren verfügbar ist, könnte möglicherweise mehr Knoten verarbeiten. Für eine gegebene Cloud muss ein Architekt die Anwendungsanforderungen verstehen, um sicherzustellen, dass eine ausreichende Entropie verfügbar ist.
id: Untungnya, seorang arsitek awan dapat mengatasi masalah ini dengan menyediakan sumber entropi berkualitas tinggi ke awan. Hal ini dapat dilakukan dengan memiliki cukup banyak hardware random number generator (HRNG) di awan untuk mendukung kejadian tersebut. Dalam hal ini, "enough" agak spesifik domain. Untuk operasi sehari-hari, HRNG modern kemungkinan menghasilkan entropi yang cukup untuk menopang 50-100 node. HRNG dengan bandwidth tinggi, seperti instruksi RdRand yang tersedia dengan Intel Ivy Bridge dan prosesor yang lebih baru berpotensi menangani lebih banyak node. Untuk awan yang ada, seorang arsitek perlu memahami persyaratan aplikasi untuk memastikan entropi yang memadai tersedia.
tr_tr: Neyse ki, bir bulut mimarı bulut örneklerine yüksek kaliteli bir entropi kaynağı sağlayarak bu sorunları çözebilir. Bu, örnekleri desteklemek için bulutta yeterli donanım rastgele sayı üreticileri (HRNG) bulundurarak yapılabilir. Bu durumda, "yeterli" alanı belirli bir alana özgüdür. Günlük operasyonlar için, modern bir HRNG'nin 50-100 hesaplama düğümünü destekleyecek yeterli entropi üretmesi muhtemeldir. Intel Ivy Bridge ve daha yeni işlemcilerle kullanılabilen RdRand yönergesi gibi yüksek bant genişliğili HRNG'ler potansiyel olarak daha fazla düğüm işleyebilir. Belirli bir bulut için, bir mimar yeterli entropinin mevcut olduğundan emin olmak için uygulama gereksinimlerini anlamalıdır.

source: Frequently Asked Questions
de: Häufig gestellte Fragen
id: Pertanyaan yang Sering Diajukan

source: From the Kilo release onward the data processing controller allows direct TLS connections, which we recommend. Enabling this behavior requires some small adjustments to the controller configuration file.
de: Vom Kilo-Release aus steuert der Datenverarbeitungscontroller direkte TLS-Verbindungen, die wir empfehlen. Das Aktivieren dieses Verhaltens erfordert einige kleine Anpassungen an die Controller-Konfigurationsdatei.
id: Dari pelepasan Kilo dan pengontrol pengolah data memungkinkan koneksi TLS langsung, yang kami rekomendasikan. Mengaktifkan perilaku ini memerlukan sedikit penyesuaian pada file konfigurasi controller.
tr_tr: Kilo sürümünden itibaren veri işleme denetleyicisi, doğrudan TLS bağlantılarına izin veriyor, öneriyoruz. Bu davranışın etkinleştirilmesi, denetleyici yapılandırma dosyasında küçük ayarlamalar gerektirir.

source: From->To *[Transport]*:
de: Von->An *[Transport]*:
tr_tr: Kimden->Kime *[Transport]*:

source: Front-end caching and session back end
de: Front-End-Caching und Session Back End
id: Caching front-end dan sesi back end
tr_tr: Ön yüz önbellekleme ve oturum arka ucu

source: Fully hardening a system is a challenging process and it may require a substantial amount of changes to some systems. Some of these changes could impact production workloads. If a system cannot be fully hardened, the following two changes are highly recommended to increase security without large disruptions:
de: Eine vollständige Härtung eines Systems ist ein anspruchsvoller Prozess und es kann eine beträchtliche Menge an Änderungen an einigen Systemen erfordern. Einige dieser Änderungen könnten die Produktionsbelastung beeinträchtigen. Wenn ein System nicht vollständig gehärtet werden kann, sind die folgenden zwei Änderungen dringend empfohlen, um die Sicherheit ohne große Störungen zu erhöhen:
id: Pengerasan sistem secara keseluruhan adalah proses yang menantang dan mungkin memerlukan sejumlah besar perubahan pada beberapa sistem. Beberapa perubahan ini bisa berdampak pada beban kerja produksi. Jika sistem tidak dapat sepenuhnya dikeraskan, dua perubahan berikut sangat dianjurkan untuk meningkatkan keamanan tanpa gangguan besar:
tr_tr: Bir sistemi tamamen sıkılaştırmak zor bir süreçtir ve bazı sistemlerde büyük miktarda değişiklikler gerektirebilir. Bu değişikliklerden bazıları üretim iş yüklerini etkileyebilir. Bir sistem tam olarak sıkılaştırılamıyorsa, büyük bozulmalara gerek duymadan güvenliği artırmak için aşağıdaki iki değişiklik önerilir:

source: Further, the quality of community, as it surrounds an open source hypervisor like KVM or Xen, has a direct impact on the timeliness of bug fixes and security updates. When investigating both commercial and open source hypervisors, you must look into their release and support cycles as well as the time delta between the announcement of a bug or security issue and a patch or response. Lastly, the supported capabilities of OpenStack compute vary depending on the hypervisor chosen. See the `OpenStack Hypervisor Support Matrix <https://wiki.openstack.org/wiki/HypervisorSupportMatrix>`_ for OpenStack compute feature support by hypervisor.
de: Darüber hinaus hat die Qualität der Community, da sie einen Open-Source-Hypervisor wie KVM oder Xen umgibt, einen direkten Einfluss auf die Aktualität von Bugfixes und Sicherheitsupdates. Bei der Untersuchung von kommerziellen und Open-Source-Hypervisoren, müssen Sie in ihre Release-und Support-Zyklen sowie den Zeitraum zwischen der Ankündigung eines Bugs oder Sicherheitsproblem und ein Patch oder Antwort beachten. Schließlich variieren die unterstützten Fähigkeiten der OpenStack-Compute je nach dem gewählten Hypervisor. Siehe die `OpenStack Hypervisor Support Matrix <https://wiki.openstack.org/wiki/HypervisorSupportMatrix>`_ für OpenStack Compute Feature Unterstützung durch Hypervisor.
id: Selanjutnya, kualitas komunitas, karena ia mengelilingi hypervisor open source seperti KVM atau Xen, memiliki dampak langsung pada ketepatan waktu perbaikan bug dan pembaruan keamanan. Saat menyelidiki hypervisors komersial dan open source, Anda harus melihat siklus rilis dan dukungan serta delta waktu antara pengumuman bug atau masalah keamanan dan patch atau respons. Terakhir, kemampuan OpenStack yang didukung bervariasi tergantung pada hypervisor yang dipilih. Lihat `OpenStack Hypervisor Support Matrix <https://wiki.openstack.org/wiki/HypervisorSupportMatrix>`_ untuk dukungan fitur komputasi OpenStack dengan hypervisor.
tr_tr: Dahası, topluluğun kalitesi, KVM veya Xen gibi açık kaynak kodlu bir üst düzey denetleyiciyi çevrelediğinden, hata düzeltmelerinin ve güvenlik güncellemelerinin geçerliliğini doğrudan etkilemektedir. Hem ticari hem de açık kaynaklı üst düzey denetleyicileri araştırırken, bir hata bildirimi veya güvenlik sorunu ile bir düzeltme eki veya yanıt arasındaki zaman deltasının yanı sıra sürüm ve destek döngülerine de bakmanız gerekir. Son olarak, OpenStack hesaplamasının desteklenen özellikleri, seçilen üst yöneticiye bağlı olarak değişir. Hipervizör tarafından OpenStack hesaplama özelliği desteği için `OpenStack Hipervizör Destek Matrisi'ne <https://wiki.openstack.org/wiki/HypervisorSupportMatrix>` _ bakın.

source: Futher information can be found in the `Django documentation <https://docs.djangoproject.com/en/1.8/ref/settings/#secure-proxy-ssl-header/>`_.
de: Weitere Informationen finden Sie in der `Django Dokumentation <https://docs.djangoproject.com/en/1.8/ref/settings/#secure-proxy-ssl-header/>`_.
id: Informasi lebih lanjut dapat ditemukan di `Django documentation <https://docs.djangoproject.com/en/1.8/ref/settings/#secure-proxy-ssl-header/>`_.
tr_tr: Daha fazla bilgi `Django belgelendirmesinde <https://docs.djangoproject.com/en/1.8/ref/settings/#secure-proxy-ssl-header/>`_ mevcut.

source: Future
de: Zukunft
tr_tr: Gelecek

source: General data disposal and sanitization guidelines as adopted from NIST recommended security controls. Cloud operators should:
de: Allgemeine Daten Entsorgung und Sanierung Richtlinien, wie von NIST empfohlenen Sicherheitskontrollen verwendet. Cloud-Betreiber sollten:
id: Petunjuk pembuangan dan sanitasi data umum yang diadopsi dari kontrol keamanan NIST yang direkomendasikan. Operator awan harus:
tr_tr: Genel veri elden çıkarma ve temizleme kuralları, NIST tarafından önerilen güvenlik kontrolleri tarafından kabul edilmiştir. Bulut operatörleri şunları yapmalıdır:

source: General security information
de: Allgemeine Sicherheitsinformationen
id: Informasi keamanan umum
tr_tr: Genel güvenlik bilgisi

source: General service security
de: Allgemeine Service-Sicherheit
id: Keamanan layanan umum
tr_tr: Genel servis güvenliği

source: Generate metadata
de: Metadaten erzeugen
tr_tr: Metaveri üretin

source: Get a scoped token.
de: Holen Sie sich einen Scoped-Token.
tr_tr: Kapsamlı belirteç almak.

source: Given the complexity of the OpenStack components and the number of deployment possibilities, you must take care to ensure that each component gets the appropriate configuration of TLS certificates, keys, and CAs. Subsequent sections discuss the following services:
de: Angesichts der Komplexität der OpenStack-Komponenten und der Anzahl der Bereitstellungsmöglichkeiten müssen Sie darauf achten, dass jede Komponente die entsprechende Konfiguration von TLS-Zertifikaten, Schlüsseln und CAs erhält. Nachfolgende Abschnitte behandeln folgende Leistungen:
id: Mengingat kompleksitas komponen OpenStack dan jumlah kemungkinan penyebaran, Anda harus berhati-hati untuk memastikan bahwa setiap komponen mendapatkan konfigurasi TLS certificates, keys, and CAs yang sesuai. Bagian selanjutnya membahas layanan berikut:
tr_tr: OpenStack bileşenlerinin karmaşıklığı ve dağıtım olasılıkları göz önüne alındığında, her bileşenin TLS sertifikalarının, anahtarlarının ve CA'ların uygun yapılandırmasını almasını sağlamanız gerekir. Sonraki bölümlerde aşağıdaki servisler tartışılmaktadır:

source: Given the risks around access to the database, we strongly recommend that unique database user accounts be created per node needing access to the database. Doing this facilitates better analysis and auditing for ensuring compliance or in the event of a compromise of a node allows you to isolate the compromised host by removing access for that node to the database upon detection. When creating these per service endpoint database user accounts, care should be taken to ensure that they are configured to require TLS. Alternatively, for increased security it is recommended that the database accounts be configured using X.509 certificate authentication in addition to user names and passwords.
de: Angesichts der Risiken rund um den Zugriff auf die Datenbank, empfehlen wir dringend, dass einzelne Datenbank-Benutzerkonten pro Knoten erstellt werden, die Zugriff auf die Datenbank benötigen. Dies erleichtert eine bessere Analyse und Auditierung, um die Einhaltung zu gewährleisten, oder im Falle eines Kompromisses eines Knotens können Sie den kompromittierten Host isolieren, indem Sie den Zugriff für diesen Knoten auf die Datenbank bei der Erkennung entfernen. Bei der Erstellung dieser pro Service-Endpunkt-Datenbank-Benutzerkonten sollte darauf geachtet werden, dass sie so konfiguriert sind, dass sie TLS benötigen. Alternativ wird für erhöhte Sicherheit empfohlen, dass die Datenbankkonten zusätzlich zu Benutzernamen und Passwörtern unter Verwendung der X.509-Zertifikat-Authentifizierung konfiguriert werden.
id: Mengingat risiko seputar akses ke database, kami sangat menyarankan agar akun pengguna database unik dibuat per node yang memerlukan akses ke database. Melakukan hal ini memudahkan analisis dan audit yang lebih baik untuk memastikan kepatuhan atau jika kompromi sebuah node memungkinkan Anda untuk mengisolasi host yang dikompromikan dengan menghapus akses node tersebut ke database pada saat deteksi. Saat membuat akun pengguna database endpoint per layanan ini, perhatian harus dilakukan untuk memastikan bahwa mereka dikonfigurasi untuk mewajibkan TLS. Sebagai alternatif, untuk keamanan yang meningkat, disarankan agar akun database dikonfigurasi menggunakan otentikasi sertifikat X.509 selain nama pengguna dan kata sandi.
tr_tr: Veritabanına erişimle ilgili riskler göz önünde bulundurulduğunda, veritabanına erişmesi gereken düğüm başına benzersiz veritabanı kullanıcı hesaplarının oluşturulmasını kuvvetle öneririz. Bunu yapmak, uyumluluğu sağlamak için daha iyi analiz ve denetim sağlamanıza ya da bir düğümün ele geçirilmesi durumunda, ele geçirildiğinde o düğümün veritabanına erişimi kaldırarak saldırıya uğramış sunucuyu ayırmanıza izin verir. Hizmet başına bitiş noktası veritabanı kullanıcı hesaplarını oluştururken bunların TLS'yi gerektirdiği şekilde yapılandırılmasına özen gösterilmelidir. Alternatif olarak, artan güvenlik için veritabanı hesaplarının kullanıcı adlarına ve parolalara ek olarak X.509 sertifika kimlik doğrulaması kullanılarak yapılandırılması önerilir.

source: Granular access control
de: Granulare Zutrittskontrolle
id: Kontrol akses Granular
tr_tr: Ayrıntılı erişim kontrolü

source: Gregg Tally is the Chief Engineer at JHU/APL's Cyber Systems Group within the Asymmetric Operations Department. He works primarily in systems security engineering. Previously, he has worked at SPARTA, McAfee, and Trusted Information Systems where he was involved in cyber security research projects.
de: Gregg Tally ist der Chefingenieur bei der Cyber Systems Group von JHU/APL im Bereich der asymmetrischen Operationen. Er arbeitet hauptsächlich in der Systemtechnik. Zuvor arbeitete er bei SPARTA, McAfee und Trusted Information Systems, wo er in Cyber Security Research Projekte involviert war.
id: Gregg Tally adalah Chief Engineer di JHU/APL's Cyber Systems Group di dalam Asymmetric Operations Department. Dia bekerja terutama dalam rekayasa keamanan sistem. Sebelumnya, dia pernah bekerja di SPARTA, McAfee, dan Trusted Information Systems dimana dia terlibat dalam proyek penelitian keamanan cyber.
tr_tr: Gregg Tally, Asimetrik İşlemler Departmanı içindeki JHU / APL'nin Cyber Systems Group'daki Baş Mühendisdir. Öncelikli olarak güvenlik mühendisliği sistemlerinde çalışıyor. Daha önce SPARTA, McAfee ve Güvenilir Bilgi Sistemleri'nde çalışmış ve burada siber güvenlik araştırma projelerinde yer almıştır.
