Repository: openstack/security-doc
Catalog: security-guide/source/locale/*/LC_MESSAGES/security-guide.po
Languages: de, id, tr_tr

source: When using the Object Storage service in conjunction with data processing it is necessary to add credentials for the store access. With proxy domains the Data processing service can instead use a delegated trust from the Identity service to allow store access via a temporary user created in the domain. For this delegation mechanism to work the Data processing service must be configured to use proxy domains and the operator must configure an identity domain for the proxy users.
de: Bei der Verwendung des Objektspeicherdienstes in Verbindung mit der Datenverarbeitung ist es notwendig, Anmeldeinformationen für den Speicherzugriff hinzuzufügen. Bei Proxy-Domains kann der Datenverarbeitungsdienst stattdessen eine delegierte Vertrauensstellung aus dem Identity-Dienst verwenden, um den Speicherzugriff über einen in der Domäne erstellten temporären Benutzer zu ermöglichen. Für diesen Delegierungsmechanismus muss der Datenverarbeitungsdienst konfiguriert sein, um Proxydomänen zu verwenden, und der Operator muss eine Identitätsdomäne für die Proxybenutzer konfigurieren.
id: Saat menggunakan layanan Object Storage bersamaan dengan pemrosesan data, perlu menambahkan kredensial untuk akses store. Dengan domain proxy, layanan pemrosesan Data dapat menggunakan kepercayaan yang didelegasikan dari layanan Identitas untuk memungkinkan akses store melalui pengguna sementara yang dibuat di domain. Untuk mekanisme pendelegasian ini bekerja layanan, pengolah data harus dikonfigurasi menggunakan domain proxy dan operator harus mengkonfigurasi domain identitas untuk pengguna proxy.
tr_tr: Nesne Depolama servisini veri işleme ile birlikte kullanırken, depo erişimi için kimlik bilgilerini eklemek gereklidir. Vekil etki alanları ile Veri işleme servisi, etki alanında oluşturulan geçici bir kullanıcı aracılığıyla depo erişimine izin vermek için Kimlik servisinden temsil edilen bir güven kullanabilir. Bu temsilci mekanizmasının çalışması için, Veri işleme servisi vekil alan adlarını kullanacak şekilde yapılandırılmalı ve operatör, vekil kullanıcıları için bir kimlik alanını yapılandırmalıdır.

source: When using the OpenStack Compute API to modify security groups, the updated security group applies to all virtual interface ports on an instance. This is due to the OpenStack Compute security group APIs being instance-based rather than port-based, as found in OpenStack Networking.
de: Wenn Sie die OpenStack Compute API verwenden, um Sicherheitsgruppen zu ändern, gilt die aktualisierte Sicherheitsgruppe für alle virtuellen Schnittstellenports auf einer Instanz. Dies ist darauf zurückzuführen, dass die OpenStack Compute-Sicherheitsgruppen-APIs auf Instanzbasierten und nicht auf Port-basierten Instanzen basieren, wie sie in OpenStack Networking gefunden wurden.
id: Saat menggunakan OpenStack Compute API untuk memodifikasi grup keamanan, grup keamanan yang diperbarui berlaku untuk semua port antarmuka virtual pada sebuah instance. Hal ini disebabkan API grup keamanan OpenStack Compute yang berbasis instance daripada berbasis port, seperti yang ditemukan di OpenStack Networking.
tr_tr: Güvenlik gruplarını değiştirmek için OpenStack Hesaplama API'yi kullanırken, güncellenmiş güvenlik grubu, bir örnekteki tüm sanal arabirim portlarına uygulanır. Bunun nedeni, OpenStack Ağında bulunan OpenStack Hesaplama güvenlik grubu API'larının port tabanlı değil örnek tabanlı olmasıdır.

source: When you are using TLS 1.2 and control both the clients and the server, the cipher suite should be limited to ``ECDHE-ECDSA-AES256-GCM-SHA384``. In circumstances where you do not control both endpoints and are using TLS 1.1 or 1.2 the more general ``HIGH:!aNULL:!eNULL:!DES:!3DES:!SSLv3:!TLSv1:!CAMELLIA`` is a reasonable cipher selection.
de: Wenn Sie TLS 1.2 verwenden und sowohl die Clients als auch den Server steuern, sollte die Verschlüsselungssuite auf "ECDHE-ECDSA-AES256-GCM-SHA384" beschränkt sein. In Situationen, in denen Sie beide Endpunkte nicht kontrollieren und TLS 1.1 oder 1.2 verwenden, ist die allgemeinere `` HIGH:! ANULL:! ENULL:! DES:! 3DES:! SSLv3:! TLSv1:! CAMELLIA`` eine vernünftige Verschlüsselungsauswahl .
id: Bila Anda menggunakan TLS 1.2 dan mengendalikan klien dan server, suite cipher harus dibatasi pada ``ECDHE-ECDSA-AES256-GCM-SHA384``. Dalam keadaan di mana Anda tidak mengendalikan kedua endpoint dan menggunakan TLS 1.1 atau 1.2, ``HIGH:!aNULL:!eNULL:!DES:!3DES:!SSLv3:!TLSv1:!CAMELLIA`` yang lebih umm adalah pilihan cipher yang masuk akal. .
tr_tr: TLS 1.2 kullanırken hem istemcileri hem de sunucuyu denetlediğinizde şifre paketi ``ECDHE-ECDSA-AES256-GCM-SHA384`` ile sınırlı olmalıdır. Her iki sonlandırma notasını da kontrol etmediğiniz ve TLS 1.1 veya 1.2'yi kullanmadığınız durumlarda, daha genel makul bir şifreleme seçimi olarak ``HIGH:!aNULL:!eNULL:!DES:!3DES:!SSLv3:!TLSv1:!CAMELLIA`` kullanabilirsiniz.

source: When you evaluate a hypervisor platform, consider the supportability of the hardware on which the hypervisor will run. Additionally, consider the additional features available in the hardware and how those features are supported by the hypervisor you chose as part of the OpenStack deployment. To that end, hypervisors each have their own hardware compatibility lists (HCLs). When selecting compatible hardware it is important to know in advance which hardware-based virtualization technologies are important from a security perspective.
de: Wenn Sie eine Hypervisor-Plattform auswerten, sollten Sie die Supportfähigkeit der Hardware berücksichtigen, auf der der Hypervisor ausgeführt wird. Darüber hinaus betrachten die zusätzlichen Funktionen in der Hardware und wie diese Features von dem Hypervisor unterstützt werden, die Sie als Teil der OpenStack-Bereitstellung gewählt haben. Zu diesem Zweck haben Hypervisoren jeweils eigene Hardware-Kompatibilitätslisten (HCLs). Bei der Auswahl kompatibler Hardware ist es wichtig, im Voraus zu wissen, welche hardwarebasierten Virtualisierungstechnologien aus Sicherheitsgründen wichtig sind.
id: Saat Anda mengevaluasi platform hypervisor, pertimbangkan dukungan perangkat keras yang digunakan hypervisor. Selain itu, pertimbangkan fitur tambahan yang tersedia di perangkat keras dan bagaimana fitur tersebut didukung oleh hypervisor yang Anda pilih sebagai bagian dari pengerahan OpenStack. Untuk itu, hypervisors masing-masing memiliki hardware compatibility lists (HCLs) mereka sendiri. Saat memilih perangkat keras yang kompatibel, penting untuk mengetahui terlebih dahulu teknologi virtualisasi hardware-based menjadi penting dari perspektif keamanan.
tr_tr: Bir hipervizör platformunu değerlendirirken, üzerinde hipervizörün çalışacağı donanımın desteklenebilirliğini düşünün. Ayrıca, donanımda bulunan ek özellikleri ve bu özelliklerin OpenStack dağıtımının bir parçası olarak seçtiğiniz hipervizör tarafından nasıl desteklendiğini göz önünde bulundurun. Bu amaçla, her biri kendi donanım uyumluluğu listelerine (HCL'lere) sahip olan denetleyicilerin her biri vardır. Uyumlu donanım seçerken hangi güvenlik açısından donanım tabanlı sanallaştırma teknolojilerinin önemli olduğunu bilmek önemlidir.

source: When you use a user name and password to authenticate, Identity does not enforce policies on password strength, expiration, or failed authentication attempts as recommended by NIST Special Publication 800-118 (draft). Organizations that desire to enforce stronger password policies should consider using Identity extensions or external authentication services.
de: Wenn Sie einen Benutzernamen und ein Kennwort zur Authentifizierung verwenden, erzwingt Identity keine Richtlinien für Kennwortstärke, Verfall oder fehlgeschlagene Authentifizierungsversuche, wie von NIST Special Publication 800-118 (Entwurf) empfohlen. Organisationen, die es wünschen, stärkere Kennwortrichtlinien zu erzwingen, sollten die Verwendung von Identitätserweiterungen oder externen Authentifizierungsdiensten in Erwägung ziehen.
id: Bila Anda menggunakan nama pengguna dan kata sandi untuk diautentikasi, Identitas tidak memberlakukan kebijakan tentang kekuatan kata sandi, kedaluwarsa, atau upaya otentikasi yang gagal seperti yang direkomendasikan oleh NIST Special Publication 800-118 (draf). Organisasi yang ingin menerapkan kebijakan kata sandi yang lebih kuat harus mempertimbangkan untuk menggunakan ekstensi Identitas atau layanan otentikasi eksternal.
tr_tr: Kimliği doğrulamak için bir kullanıcı adı ve parola kullandığınızda Kimlik, NIST Özel Yayın 800-118 (taslak) tarafından önerilen parola dayanıklılığı, son kullanma tarihi veya başarısız kimlik doğrulama girişimleri üzerine ilkeleri zorlamaz. Daha güçlü parola politikaları uygulamak isteyen organizasyonlar, kimlik uzantılarını veya harici kimlik doğrulama servislerini kullanmayı düşünmelidir.

source: Whenever a policy or configuration management is changed, it is good practice to log the activity, and backup a copy of the new set. Often, such policies and configurations are stored in a version controlled repository such as Git.
de: Immer wenn ein Richtlinien- oder Konfigurationsmanagement geändert wird, ist es gut, die Aktivität zu protokollieren und eine Kopie des neuen Satzes zu sichern. Oft werden solche Richtlinien und Konfigurationen in einem versiongesteuerten Repository wie Git gespeichert.
id: Kapan pun kebijakan atau manajemen konfigurasi diubah, ada baiknya melakukan log aktivitas, dan membuat cadangan salinan dari kumpulan yang baru. Seringkali, kebijakan dan konfigurasi seperti itu disimpan dalam repositori yang dikendalikan oleh versi seperti Git.
tr_tr: Bir politika veya yapılandırma yönetimi her değiştirildiğinde, etkinliği kaydetmek ve yeni grubun bir kopyasını yedeklemek iyi bir uygulamadır. Çoğu zaman, bu gibi ilkeler ve yapılandırmalar Git gibi sürüm kontrollü bir depoda depolanır.

source: Whenever an API call to the Shared File Systems service is made, the policy engine uses the appropriate policy definitions to determine if the call can be accepted.
de: Immer wenn ein API-Aufruf zum Shared File Systems-Dienst erfolgt, verwendet die Policy Engine die entsprechenden Richtliniendefinitionen, um festzustellen, ob der Anruf akzeptiert werden kann.
id: Setiap kali API memanggil layanan Shared File Systems, mesin kebijakan menggunakan definisi kebijakan yang tepat untuk menentukan apakah panggilan tersebut dapat diterima.
tr_tr: Paylaşımlı Dosya Sistemleri servisine yapılan bir API çağrısı ne zaman yapılırsa, ilke altyapısı çağrının kabul edilip edilemeyeceğini belirlemek için uygun ilke tanımlarını kullanır.

source: Where a rule may specify access to only admin users and users belonging to the tenant, the mapping may be trivial. In other scenarios the cloud administrator may need to approve the mapping routines per tenant.
de: Wenn eine Regel den Zugang zu nur Admin-Nutzern und Nutzern des Tenants spezifiziert, kann die Zuordnung trivial sein. In anderen Szenarien muss der Cloud-Administrator die Mapping-Routinen pro Tenant genehmigen.
id: Bila suatu aturan menentukan akses hanya kepada pengguna admin dan pengguna milik tenant, pemetaan mungkin sepele. Dalam skenario lain, administrator awan mungkin perlu menyetujui rutinitas pemetaan per tenant.
tr_tr: Bir kural, yalnızca yönetici kullanıcılarına ve kiracıya ait kullanıcılara erişimi belirtebilirse, eşleştirme önemsiz olabilir. Diğer senaryolarda, bulut yöneticisinin kiracı başına eşleştirme rutini onaylaması gerekebilir.

source: Where data is persisted
de: Wo Daten bestehen bleiben
id: Dimana data terus berlanjut
tr_tr: Verinin nerede kalıcı olarak saklandığı

source: Where the end entity certificates and certificate revocation lists are stored and looked up - sometimes referred to as the *certificate bundle*.
de: Hier werden die endgültigen Zertifikate und Zertifikatssperrlisten gespeichert und nachgeschlagen - manchmal auch als *certificate bundle* bezeichnet.
id: Dimana sertifikat entitas akhir dan daftar pencabutan sertifikat disimpan dan diperbaiki (looked up) - kadang-kadang disebut sebagai *certificate bundle*.
tr_tr: Son varlık belgelerinin ve sertifika iptal listelerinin depolandığı ve bakıldığı - bazen *sertifika paketi* olarak da anılır.

source: Whether OpenStack is deployed within private data centers or as a public cloud service, the underlying virtualization technology provides enterprise-level capabilities in the realms of scalability, resource efficiency, and uptime. While such high-level benefits are generally available across many OpenStack-supported hypervisor technologies, there are significant differences in the security architecture and features for each hypervisor, particularly when considering the security threat vectors which are unique to elastic OpenStack environments. As applications consolidate into single :term:`Infrastructure-as-a-Service (IaaS)` platforms, instance isolation at the hypervisor level becomes paramount. The requirement for secure isolation holds true across commercial, government, and military communities.
de: Ob OpenStack in privaten Rechenzentren oder als Public Cloud Service eingesetzt wird, die zugrunde liegende Virtualisierungstechnologie bietet Enterprise-Level-Fähigkeiten im Bereich Skalierbarkeit, Ressourceneffizienz und Uptime. Während solche High-Level-Vorteile in der Regel über viele OpenStack-unterstützte Hypervisor-Technologien zur Verfügung stehen, gibt es erhebliche Unterschiede in der Sicherheitsarchitektur und Funktionen für jeden Hypervisor, insbesondere bei der Betrachtung der Sicherheitsbedrohungsvektoren, die für elastische OpenStack-Umgebungen einzigartig sind. Da sich die Applikationen auf Single :term:Infrastructure-as-a-Service (IaaS)" Plattformen konzentrieren, wird die Instanz auf der Hypervisor-Ebene vorrangig. Die Forderung nach sicherer Isolation gilt für Handels-, Regierungs- und Militärgemeinschaften.
id: Apakah OpenStack ditempatkan di dalam pusat data pribadi atau sebagai layanan awan publik, teknologi virtualisasi yang mendasarinya memberikan kemampuan tingkat perusahaan di ranah skalabilitas, efisiensi sumber daya, dan waktu operasional. Meskipun manfaat tingkat tinggi seperti itu umumnya tersedia di banyak teknologi hypervisor yang didukung OpenStack, ada perbedaan signifikan dalam arsitektur keamanan dan fitur untuk setiap hypervisor, terutama saat mempertimbangkan vektor ancaman keamanan yang unik untuk lingkungan OpenStack elastis. Sebagai aplikasi mengkonsolidasikan menjadi single platform :term: `Infrastructure-as-a-Service (IaaS)`, isolasi instance pada tingkat hypervisor menjadi yang terpenting. Persyaratan untuk isolasi yang aman berlaku di komunitas komersial, pemerintah, dan militer.
tr_tr: OpenStack, ister özel veri merkezlerinde, isterse bir genel bulut hizmeti olarak dağıtılan olsun, temel sanallaştırma teknolojisi ölçeklenebilirlik, kaynak verimliliği ve çalışma süresi alanlarında kurumsal düzeyde yetenekler sunar. Bu tür üst düzey faydalar genelde birçok OpenStack destekli hipervizör teknolojisinde bulunurken, özellikle de esnek OpenStack ortamlarına özgü güvenlik tehdit vektörleri göz önüne alındığında, her bir üst düzey yönetici için güvenlik mimarisinde ve özelliklerinde önemli farklılıklar vardır. Uygulamalar tek bir dönem halinde birleştirildiğinde: "Hizmet Olarak Altyapı (IaaS)" platformları, hipervizör seviyesindeki örnek izolasyonu çok önemli hale gelir. Güvenli tecrit şartı ticari, hükümet ve askeri topluluklarda geçerlidir.

source: While OpenStack has a bare metal project, a discussion of the particular security implications of running bare metal is beyond the scope of this book.
de: Während OpenStack ein Bare-Metal-Projekt hat, geht eine Diskussion über die besonderen Sicherheitsimplikationen des Bare-Metal-Dienstes über den Rahmen dieses Buches hinaus.
id: Sementara OpenStack memiliki proyek bare metal, sebuah diskusi tentang implikasi keamanan tertentu dari menjalankan bare metal berada di luar cakupan buku ini.
tr_tr: OpenStack saf bir projeye sahipken, saf çalıştırmanın belirli güvenlik etkileri üzerine bir tartışma bu kitabın kapsamı dışındadır.

source: While creating a security service, you can select one of these authentication services:
de: Beim Erstellen eines Sicherheitsdienstes können Sie einen dieser Authentifizierungsdienste auswählen:
id: Saat membuat layanan keamanan, Anda dapat memilih salah satu dari layanan otentikasi ini:
tr_tr: Güvenlik servisi oluştururken, bu kimlik doğrulama servislerinden birini seçebilirsiniz:

source: While in operation, the kernel software and data are protected by the hardware memory protection mechanisms. The memory and process management components of the kernel ensure a user process cannot access kernel storage or storage belonging to other processes. Non-kernel TSF software and data are protected by DAC and process isolation mechanisms. In the evaluated configuration, the reserved user ID root owns the directories and files that define the TSF configuration. In general, files and directories containing internal TSF data, such as configuration files and batch job queues, are also protected from reading by DAC permissions. The system and the hardware and firmware components are required to be physically protected from unauthorized access. The system kernel mediates all access to the hardware mechanisms themselves, other than program visible CPU instruction functions. In addition, mechanisms for protection against stack overflow attacks are provided.
de: Während des Betriebs werden die Kernel-Software und die Daten durch die Hardware-Speicherschutzmechanismen geschützt. Die Speicher- und Prozessmanagementkomponenten des Kernels sorgen dafür, dass ein Benutzerprozess nicht auf Kernspeicher oder Speicherplatz zu anderen Prozessen zugreifen kann. Nicht-Kernel-TSF-Software und Daten werden durch DAC- und Prozessisolationsmechanismen geschützt. In der ausgewerteten Konfiguration besitzt die reservierte Benutzer-ID root die Verzeichnisse und Dateien, die die TSF-Konfiguration definieren. Im Allgemeinen sind Dateien und Verzeichnisse, die interne TSF-Daten enthalten, wie Konfigurationsdateien und Batch-Job-Warteschlangen, auch vor dem Lesen durch DAC-Berechtigungen geschützt. Das System und die Hardware- und Firmwarekomponenten müssen physisch vor unbefugtem Zugriff geschützt werden. Der Systemkernel vermittelt den Zugriff auf die Hardware-Mechanismen selbst, außer dem Programm sichtbare CPU-Befehlsfunktionen. Darüber hinaus sind Mechanismen zum Schutz gegen Stapelüberlaufangriffe vorgesehen.
id: Saat beroperasi, perangkat lunak dan data kernel dilindungi oleh mekanisme proteksi memori perangkat keras. Komponen manajemen memori dan proses dari kernel memastikan proses pengguna tidak dapat mengakses penyimpanan atau penyimpanan kernel yang termasuk dalam proses lainnya. Perangkat lunak dan data non-kernel TSF dilindungi oleh DAC dan mekanisme isolasi proses. Dalam konfigurasi yang dievaluasi, reserved user ID root memiliki direktori dan file yang menentukan konfigurasi TSF. Secara umum, file dan direktori yang berisi data TSF internal, seperti file konfigurasi dan batch job queues, juga dilindungi dari pembacaan oleh izin DAC. Sistem dan komponen perangkat keras dan firmware diharuskan dilindungi secara fisik dari akses yang tidak sah. Kernel sistem memediasi semua akses ke mekanisme perangkat keras itu sendiri, selain fungsi instruksi CPU yang terlihat. Selain itu, mekanisme perlindungan terhadap serangan stack overflow disediakan.
tr_tr: Operasyon sırasında, çekirdek yazılımı ve verileri donanım belleği koruma mekanizmaları tarafından korunmaktadır. Çekirdeğin bellek ve süreç yönetimi bileşenleri, bir kullanıcı işleminin çekirdek depolama birimine veya diğer işlemlere ait depolama alanına erişememesini sağlar. Çekirdeksiz TSF yazılımı ve verileri, DAC ve süreç yalıtım mekanizmaları tarafından korunmaktadır. Değerlendirilen yapılandırmada, ayrılmış kullanıcı kimliği kökü, TSF yapılandırmasını tanımlayan dizinleri ve dosyaları bulundurur. Genel olarak, yapılandırma dosyaları ve toplu iş kuyrukları gibi dahili TSF verilerini içeren dosyalar ve dizinler, DAC izinleri tarafından okunmaya karşı korunmaktadır. Sistem ve donanım ve bellenim bileşenleri, yetkisiz erişimden fiziksel olarak korunmalıdır. Sistem çekirdeği, programın görülebilen CPU yönerge işlevleri dışındaki tüm donanım mekanizmalarına kendilerinin erişimine aracılık eder. Buna ek olarak, yığın taşma saldırılarına karşı koruma mekanizmaları sağlanmaktadır.

source: While many hypervisor vendors, such as Red Hat, Microsoft, and VMware have achieved Common Criteria Certification their underlying certified feature set differs, we recommend evaluating vendor claims to ensure they minimally satisfy the following requirements:
de: Während viele Hypervisor-Anbieter wie Red Hat, Microsoft und VMware eine Common Criteria Certification erreicht haben, deren zugrunde liegendes zertifiziertes Feature-Set unterschiedlich ist, empfehlen wir die Bewertung von Lieferantenansprüchen, um sicherzustellen, dass sie die folgenden Anforderungen minimal erfüllen:
id: Sementara banyak vendor hypervisor, seperti Red Hat, Microsoft, dan VMware telah mencapai Common Criteria Certification, rangkaian penilaian tersertifikasi yang mendasarinya berbeda, kami merekomendasikan untuk mengevaluasi klaim vendor untuk memastikan mereka memenuhi persyaratan sebagai berikut:
tr_tr: Red Hat, Microsoft ve VMware gibi birçok üst düzey yönetici satıcısı, Yaygın Kriter Sertifikasını elde ettiyse de, altta bulunan sertifikalı özellik kümesi farklıdır; Satıcı taleplerini, aşağıdaki gereksinimleri en azından karşılamak için değerlendirmelerini öneririz:

source: While utilizing TLS during the PXE boot process is somewhat more challenging, common PXE firmware projects, such as iPXE, provide this support. Typically this involves building the PXE firmware with knowledge of the allowed TLS certificate chain(s) so that it can properly validate the server certificate. This raises the bar for an attacker by limiting the number of insecure, plain text network operations.
de: Die Nutzung von TLS während der PXE-Boot-Prozess ist etwas schwieriger, gemeinsame PXE-Firmware-Projekte, wie iPXE, bieten diese Unterstützung. In der Regel handelt es sich dabei um den Aufbau der PXE-Firmware mit Kenntnis der zulässigen TLS-Zertifikatskette, so dass sie das Serverzertifikat ordnungsgemäß validieren kann. Dies hält die Stange für einen Angreifer höher, indem sie die Anzahl der unsicheren, einfachen Textnetzwerke begrenzt.
id: Saat menggunakan TLS selama proses boot PXE agak lebih menantang, proyek firmware PXE yang umum, seperti iPXE, memberikan dukungan ini. Biasanya ini melibatkan pembuatan firmware PXE dengan pengetahuan tentang rantai sertifikat TLS yang diizinkan sehingga dapat memvalidasi sertifikat server dengan benar. Ini memunculkan halangan untuk penyerang dengan membatasi jumlah operasi jaringan teks biasa yang tidak aman.
tr_tr: PXE önyükleme işlemi sırasında TLS'yi kullanmanın biraz zor olduğu halde, iPXE gibi yaygın PXE ürün yazılımı projeleri bu desteği sağlar. Tipik olarak, bu, sunucu sertifikasını düzgün şekilde doğrulayabilmesi için izin verilen TLS sertifika zincir(ler)inin bilgisi olan PXE bellenimini oluşturmayı içerir. Bu, güvensiz, düz metin ağ operasyonlarının sayısını sınırlandırarak bir saldırganın barını yükseltir.
