Repository: openstack/security-doc
Catalog: security-guide/source/locale/*/LC_MESSAGES/security-guide.po
Languages: de, id, tr_tr

source: We recommend documenting all the data flows and bridging points between these services and the data processing controller. See :doc:`../documentation`.
de: Wir empfehlen Ihnen, alle Datenströme und Brückenpunkte zwischen diesen Diensten und dem Datenverarbeitungscontroller zu dokumentieren. Siehe :doc:`../documentation`.
id: Kami merekomendasikan untuk mendokumentasikan semua data flow dan bridging point antara layanan ini dan data processing controller. Lihat :doc:`../documentation`.
tr_tr: Tüm veri akışlarını belgelemek ve bu servisler ile veri işleme denetleyicisi arasındaki noktaları birbirine bağlamanızı öneririz. Bakınız :doc:`../documentation`.

source: We recommend keeping up to date on security issues and advisories as they are published. The OpenStack Security Portal (`https://security.openstack.org <https://security.openstack.org>`_) is the central portal where advisories, notices, meetings, and processes can be coordinated. Additionally, the OpenStack Vulnerability Management Team (VMT) portal (`https://security.openstack.org/#openstack-vulnerability-management-team <https://security.openstack.org/#openstack-vulnerability-management-team>`_) coordinates remediation within the OpenStack project, as well as the process of investigating reported bugs which are responsibly disclosed (privately) to the VMT, by marking the bug as 'This bug is a security vulnerability'. Further detail is outlined in the VMT process page (`https://security.openstack.org/vmt-process.html#process <https://security.openstack.org/vmt-process.html#process>`_) and results in an OpenStack Security Advisory (OSSA). This OSSA outlines the issue and the fix, as well as linking to both the original bug, and the location where the where the patch is hosted.
de: Wir empfehlen Ihnen, sich über Sicherheitsfragen und Advisorien zu informieren, sobald sie veröffentlicht werden. Das OpenStack Security Portal (`https://security.openstack.org <https://security.openstack.org>`_) ist das zentrale Portal, in dem Advisories, Notizen, Meetings und Prozesse koordiniert werden können. Darüber hinaus koordiniert das OpenStack Vulnerability Management Team (VMT) Portal (`https://security.openstack.org/#openstack-vulnerability-management-team <https://security.openstack.org/#openstack-vulnerability-management-team>`_) die Sanierung im Rahmen des OpenStack-Projekts sowie den Prozess der Untersuchung von gemeldeten Bugs, die verantwortungsvoll (privat) an die VMT weitergegeben werden, indem sie den Bug als 'This bug is a security vulnerability' markiert. Weitere Details werden in der VMT-Prozessseite (`https://security.openstack.org/vmt-process.html#process) <https://security.openstack.org/vmt-process.html#process>`_) skizziert und führt zu einem OpenStack Security Advisory (OSSA). Diese OSSA skizziert das Problem und das Update, sowie die Verknüpfung sowohl mit dem ursprünglichen Fehler als auch mit dem Ort, an dem der Patch gehostet wird.

source: We recommend keeping up to date on security issues and advisories as they are published. The `OpenStack Security Portal <https://security.openstack.org/>`_ is the central portal where advisories, notices, meetings, and processes can be coordinated. Additionally, the `OpenStack Vulnerability Management Team (VMT) portal <https://security.openstack.org/#vulnerability-management>`_ coordinates remediation within OpenStack, as well as the process of investigating reported bugs which are responsibly disclosed (privately) to the VMT, by marking the bug as 'This bug is a security vulnerability'. Further detail is outlined in the `VMT process page <https://security.openstack.org/vmt-process.html#process>`_ and results in an OpenStack Security Advisory (OSSA). This OSSA outlines the issue and the fix, as well as linking to both the original bug, and the location where the where the patch is hosted.
de: Wir empfehlen Ihnen, sich über Sicherheitsfragen und Advisorien zu informieren, sobald sie veröffentlicht werden. Das OpenStack Security Portal <https://security.openstack.org/>`_ ist das zentrale Portal, in dem Advisories, Notizen, Meetings und Prozesse koordiniert werden können. Darüber hinaus koordiniert das OpenStack Vulnerability Management Team (VMT) Portal <https://security.openstack.org/#vulnerability-management>`_ die Sanierung innerhalb von OpenStack sowie den Prozess der Untersuchung von gemeldeten Bugs, die verantwortungsvoll (privat) an die VMT offenbart werden, indem sie den Bug als 'This bug is a security vulnerability' markiert. Weitere Details werden in der `VMT-Prozessseite beschrieben <https://security.openstack.org/vmt-process.html#process>`_ und führt zu einem OpenStack Security Advisory (OSSA). Diese OSSA skizziert das Problem und das Update, sowie die Verknüpfung sowohl mit dem ursprünglichen Fehler als auch mit dem Ort, an dem der Patch gehostet wird.
id: Sebaiknya tetap up to date mengenai masalah keamanan dan nasihat saat diterbitkan. The `OpenStack Security Portal <https://security.openstack.org/> `_ adalah portal utama dimana saran, pemberitahuan, rapat, dan proses dapat dikoordinasikan. Selain itu, portal `OpenStack Vulnerability Management Team (VMT) <https://security.openstack.org/#vulnerability-management>` _ mengkoordinasikan remediasi di dalam OpenStack, serta proses menyelidiki bug yang dilaporkan yang bertanggung jawab diungkapkan (secara pribadi ) ke VMT, dengan menandai bug sebagai 'This bug is a security vulnerability'. Detail lebih lanjut diuraikan di halaman proses `VMT <https://security.openstack.org/vmt-process.html#process>` _ dan hasilnya di OpenStack Security Advisory (OSSA). OSSA ini menguraikan masalah dan perbaikannya, serta menghubungkan ke bug asli, dan lokasi tempat penyimpanan patch.
tr_tr: Güvenlikle ilgili konularda ve uyarılarda takipte olmanızı öneririz. `OpenStack Güvenlik Portalı <https://security.openstack.org/>`_, danışma, bildirim, toplantı ve süreçlerin koordine edilebileceği merkezi bir portaldır. Ek olarak, `OpenStack Güvenlik Açığı Yönetim Ekibi (VMT) portalı <https://security.openstack.org/#vulnerability-management> `_, OpenStack içindeki iyileştirmeyi ve ayrıca sorumlu olarak açıklanan (özel olarak bildirilen) hataların araştırılması sürecini koordine eder ), hatayı 'Bu hata bir güvenlik açığı' olarak işaretleyerek VMT'ye bildirir. Daha ayrıntılı bilgi `VMT işlem sayfası <https://security.openstack.org/vmt-process.html#process>` _'de özetlenmiş ve bir OpenStack Güvenlik Danışma Belgesi (OSSA) ile sonuçlanmıştır. Bu OSSA sorunu hem düzeltmeyi hem de hem özgün hatayı hem de yamanın barındığı yeri ilişkilendirerek özetliyor.

source: We recommend minimizing the QEMU code base by removing unused components from the system. QEMU provides support for many different virtual hardware devices, however only a small number of devices are needed for a given instance. The most common hardware devices are the virtio devices. Some legacy instances will need access to specific hardware, which can be specified using glance metadata:
de: Wir empfehlen, die QEMU-Codebasis zu minimieren, indem wir unbenutzte Komponenten aus dem System entfernen. QEMU bietet Unterstützung für viele verschiedene virtuelle Hardware-Geräte, aber nur eine kleine Anzahl von Geräten werden für eine gegebene Instanz benötigt. Die gängigsten Hardwaregeräte sind die virtio Geräte. Einige Legacy-Instanzen benötigen Zugriff auf spezifische Hardware, die mit Glance-Metadaten angegeben werden kann:
id: Kami merekomendasikan untuk meminimalkan basis kode QEMU dengan melepaskan komponen yang tidak terpakai dari sistem. QEMU menyediakan dukungan untuk berbagai perangkat perangkat keras virtual yang berbeda, namun hanya sejumlah kecil perangkat yang dibutuhkan untuk instance tertentu. Perangkat perangkat keras yang paling umum adalah perangkat virtio. Beberapa instance lawas memerlukan akses ke perangkat keras tertentu, yang dapat ditentukan dengan menggunakan metadata sekilas:
tr_tr: Kullanılmayan bileşenleri sistemden kaldırarak QEMU kod tabanını küçültmenizi etmenizi öneririz. QEMU, birçok farklı sanal donanım aygıtı için destek sağlar, ancak belirli bir örnek için yalnızca ufak sayıda aygıt gereklidir. En yaygın donanım aygıtları Virtio aygıtlarıdır. Bazı eski örneklerin, bakış meta verileri kullanılarak belirlenebilen belirli donanıma erişimi olması gerekir:

source: We recommend testing your QEMU executable file after it is compiled to ensure that the compiler hardening worked properly.
de: Wir empfehlen, Ihre QEMU ausführbare Datei zu testen, nachdem sie kompiliert wurde, um sicherzustellen, dass das Compiler-Hardening ordnungsgemäß funktioniert.
id: Kami merekomendasikan untuk menguji file eksekusi QEMU Anda setelah dikompilasi untuk memastikan bahwa pengerasan kompilator bekerja dengan benar.
tr_tr: Derleyici sıkılaştırmasının düzgün şekilde çalıştığından emin olmak için QEMU çalıştırılabilri dosyanızı, derledikten sonra test etmenizi öneririz.

source: We recommend that admin users authenticate using Identity service and an external authentication service that supports 2-factor authentication, such as a certificate. This reduces the risk from passwords that may be compromised. This recommendation is in compliance with NIST 800-53 IA-2(1) guidance in the use of multi-factor authentication for network access to privileged accounts.
de: Wir empfehlen, dass Admin-Benutzer authentifizieren werden mit dem Identity-Dienst und einen externen Authentifizierungsdienst, der eine 2-Faktor-Authentifizierung unterstützt, z. B. ein Zertifikat. Dies verringert das Risiko der Komprimittierung von Passwörtern. Diese Empfehlung entspricht der NIST 800-53 IA-2 (1) Anleitung bei der Verwendung von Multifaktor-Authentifizierung für den Netzwerkzugriff auf privilegierte Konten.
id: Sebaiknya pengguna admin mengautentikasi menggunakan layanan Identitas dan layanan autentikasi eksternal yang mendukung autentikasi 2 faktor, seperti sertifikat. Hal ini mengurangi risiko dari password yang mungkin dikompromikan. Rekomendasi ini sesuai dengan panduan NIST 800-53 IA-2 (1) dalam penggunaan autentikasi multi-faktor untuk akses jaringan ke akun istimewa.
tr_tr: Yönetici kullanıcılarının Kimlik servisini ve bir sertifika gibi 2 faktörlü kimlik doğrulamayı destekleyen bir harici kimlik doğrulama servisi kullanarak kimlik doğrulamasını önermenizi öneririz. Bu, tehlikeye atılmış olabilecek parola riskini azaltır. Bu öneri, ayrıcalıklı hesaplara ağ erişimi için çok faktörlü kimlik doğrulamasının kullanılması konusunda NIST 800-53 IA-2 (1) kılavuzuna uygundur.

source: We recommend that all production deployments use HTTP strict transport security (HSTS). This header prevents browsers from making insecure connections after they have made a single secure one. If you have deployed your HTTP services on a public or an untrusted domain, HSTS is especially important. To enable HSTS, configure your web server to send a header like this with all requests:
de: Wir empfehlen, dass alle Produktions-Deployments HTTP strict transport security (HSTS) verwenden. Dieser Header verhindert, dass Browser unsichere Verbindungen herstellen, nachdem sie eine einzige sichere gemacht haben. Wenn Sie Ihre HTTP-Dienste auf einer öffentlichen oder einer nicht vertrauenswürdigen Domain bereitgestellt haben, ist HSTS besonders wichtig. Um HSTS zu aktivieren, konfigurieren Sie Ihren Webserver, um einen Header wie folgt mit allen Anfragen zu senden:
id: Sebaiknya semua penerapan produksi menggunakan keamanan transportasi ketat HTTP (HSTS). Header ini mencegah browser membuat koneksi yang tidak aman setelah mereka membuat suatu single secure. Jika Anda telah menyebarkan layanan HTTP Anda di domain publik atau yang tidak tepercaya, HSTS sangat penting. Untuk mengaktifkan HSTS, konfigurasikan server web Anda untuk mengirim header seperti ini dengan semua permintaan:
tr_tr: Tüm canlı dağıtımlarında HTTP sıkı taşıma güvenliği (HSTS) kullanılmasını öneriyoruz. Bu başlık, tarayıcıların tek bir güvenli hale getirdikten sonra güvensiz bağlantı kurmalarını engeller. HTTP hizmetlerini genel veya güvenilmeyen bir alana yerleştirdiyseniz, HSTS özellikle önemlidir. HSTS'yi etkinleştirmek için, web sunucunuzu, tüm isteklerle bu gibi bir başlık gönderecek şekilde yapılandırın:

source: We recommend that implementers `disable HORIZON_IMAGES_ALLOW_UPLOAD <https://docs.openstack.org/horizon/latest/user/manage-images.html#upload-an-image>`_ unless they have implemented a plan to prevent resource exhaustion and denial of service.
de: Wir empfehlen, dass die Implementierer `HORIZON_IMAGES_ALLOW_UPLOAD` deaktivieren <https://docs.openstack.org/horizon/latest/user/manage-images.html#upload-an-image>`_ es sei denn, sie haben einen Plan zur Vermeidung von Ressource Erschöpfung und Denial-of-Service umgesetzt.
id: Kami merekomendasikan pelaksana `disable HORIZON_IMAGES_ALLOW_UPLOAD <https://docs.openstack.org/horizon/latest/user/manage-images.html#upload-an-image>`_ kecuali mereka telah menerapkan rencana untuk mencegah kelelahan dan penolakan layanan.

source: We recommend that only TLS 1.2 is used. Other versions such as TLS 1.0 and 1.1 are vulnerable to multiple attacks. TLS 1.0 should be disabled in your environment. TLS 1.1 may be used for broad client compatibility, however exercise caution when enabling this protocol. Only enable TLS version 1.1 if there is a mandatory compatibility requirement and you are aware of the risks involved. All versions of SSL, the predecessor to TLS, must not be used due to multiple public vulnerabilities.
de: Wir empfehlen, nur TLS 1.2 zu verwenden. Andere Versionen wie TLS 1.0 und 1.1 sind anfällig für mehrere Angriffe. TLS 1.0 sollte in Ihrer Umgebung deaktiviert sein. TLS 1.1 kann für eine breite Client-Kompatibilität verwendet werden, jedoch Vorsicht bei der Aktivierung dieses Protokolls. Nur die TLS-Version 1.1 aktivieren, wenn es eine obligatorische Kompatibilitätsanforderung gibt und Sie sich der damit verbundenen Risiken bewusst sind. Alle Versionen von SSL, der Vorgänger von TLS, dürfen aufgrund mehrerer öffentlicher Schwachstellen nicht verwendet werden.

source: We recommend that the ``DEBUG`` setting is set to ``False`` in production environments. If ``DEBUG`` is set to True, Django will display stack traces and sensitive web server state information when exceptions are thrown.
de: Wir empfehlen, dass die ``DEBUG``Einstellung auf `` False``in Produktionsumgebungen eingestellt ist. Wenn ``DEBUG``auf True gesetzt ist, zeigt Django Stack-Traces und sensible Webserver-Statusinformationen an, wenn Ausnahmen ausgelöst werden.
id: Kami merekomendasikan agar pengaturan ``DEBUG``` disetel ke ``False`` di lingkungan produksi. Jika ``DEBUG`` disetel ke True, Django akan menampilkan jejak stack dan informasi server web sensitif saat pengecualian dilepas.
tr_tr: Canlı ortmlarda ``DEBUG`` ayarının ``False`` olarak ayarlanmasını öneriyoruz. ``DEBUG``, True olarak ayarlanırsa, istisnalar atıldığında Django yığın izleri ve hassas web sunucusu durumu bilgilerini görüntüler.

source: We recommend that you configure the Object Storage service to run under a non-root (UID 0) service account. One recommendation is the user name ``swift`` with the primary group ``swift``. Object Storage services include, for example, ``proxy-server``, ``container-server``, ``account-server``. Detailed steps for setup and configuration can be found in the `Add Object Storage chapter <https://docs.openstack.org/project-install-guide/object-storage/ocata/>`_ of the Installation Guide in the `OpenStack Documentation index <https://docs.openstack.org>`_.
de: Wir empfehlen Ihnen, den Objektspeicherdienst zu konfigurieren, der unter einem Nicht-Root-(UID 0) Dienstkonto ausgeführt wird. Eine Empfehlung ist der Benutzername ``swift`` mit der primären Gruppe ``swift``. Objektspeicherdienste umfassen beispielsweise ``proxy-server``, `` container-server``, ``account-server``. Detaillierte Schritte für Setup und Konfiguration finden Sie im Kapitel `Add Object Storage <https://docs.openstack.org/project-install-guide/object-storage/ocata/>`_ der Installationsanleitung im` OpenStack Dokumentationsindex <https://docs.openstack.org>`_.
id: Sebaiknya konfigurasikan layanan Object Storage untuk berjalan di bawah akun layanan non-root (UID 0). Satu rekomendasi adalah nama pengguna ``swift`` dengan grup utama ``swift``. Layanan Object Storage meliputi, misalnya, ``proxy-server``, ``container-server``, ``account-server``. Langkah-langkah rinci untuk setup dan konfigurasi dapat ditemukan di `Add Object Storage chapter <https://docs.openstack.org/project-install-guide/object-storage/ocata/>`_ dari Installation Guide di `OpenStack Documentation index <https://docs.openstack.org>`_.
tr_tr: Nesne Depolama servisini root (UID 0) servis hesabı altında çalışacak şekilde yapılandırmanızı öneririz. Bir öneri, ``swift`` birincil grubu olan ``swift`` kullanıcı adınızdır. Nesne Depolama servisleri arasında, örneğin, ``proxy-server``, ``container-server``, ``account-server`` bulunur. Kurulum ve yapılandırma için ayrıntılı adımlar `OpenStack'teki Kurulum Kılavuzundaki `OpenStack Belgelendirme endeksinde <https://docs.openstack.org>`_ yer alan `Nesne Depolama Ekleme bölümünde <https://docs.openstack.org/project-install-guide/object-storage/ocata/>`_ bulunabilir.

source: We recommend that you use client authentication with TLS for the authentication of services to the Identity service.
de: Wir empfehlen Ihnen, die Client-Authentifizierung mit TLS für die Authentifizierung von Diensten für den Identity-Service zu verwenden.
id: Sebaiknya gunakan otentikasi klien dengan TLS untuk otentikasi layanan ke layanan Identitas.
tr_tr: Kimlik hizmetlerine yönelik hizmetlerin kimlik doğrulamasında TLS ile istemci kimlik doğrulamasını kullanmanızı öneririz.

source: We recommend the use of memcached instead of local-memory cache because it is fast, retains data for a longer duration, is multi-process safe and has the ability to share cache over multiple servers, but still treats it as a single cache.
de: Wir empfehlen die Verwendung von memcached anstelle von Local-Memory-Cache, weil er schnell ist, Daten für eine längere Dauer behält, Multi-Prozess sicher ist und die Möglichkeit hat, Cache über mehrere Server zu teilen, aber immer noch so behandelt als wäre es ein einziger Cache.
id: Sebaiknya gunakan Memcached bukan cache memori lokal karena cepat, mempertahankan data untuk durasi yang lebih lama, aman dalam proses multi-proses dan memiliki kemampuan untuk berbagi cache melalui beberapa server, namun tetap memperlakukannya sebagai cache tunggal.
tr_tr: Yerel bellek önbellek yerine memcached kullanmanızı öneririz çünkü hızlıdır, verileri daha uzun süre korur, çoklu işlem güvenlidir ve önbelleklerini birden fazla sunucu üzerinde paylaşma yeteneğine sahiptir ancak yine de tek bir önbellek gibi davranır.

source: We recommend using SSL/TLS on both public networks and management networks in :doc:`tls-proxies-and-http-services`. However, if actually deploying SSL/TLS everywhere is too difficult, we recommend evaluating your OpenStack SSL/TLS needs and following one of the architectures discussed here.
de: Wir empfehlen die Verwendung von SSL/TLS in öffentlichen Netzwerken und Management-Netzwerken in :doc:`tls-proxies-and-http-services`. Allerdings, wenn die Bereitstellung von SSL/TLS überall zu schwierig ist, empfehlen wir Ihnen, Ihre OpenStack SSL/TLS-Anforderungen zu bewerten und einer der hier besprochenen Architekturen zu folgen.
id: Sebaiknya gunakan SSL/TLS di jaringan publik ataupun jaringan manajemen di :doc:`tls-proxies-and-http-services`. Namun, jika benar-benar menerapkan SSL/TLS di mana saja terlalu sulit, sebaiknya Anda mengevaluasi kebutuhan OpenStack SSL/TLS dan mengikuti salah satu arsitektur yang dibahas di sini.
tr_tr: Hem kamu ağlarında hem de yönetim ağlarında SSL/TLS kullanmanızı öneririz bkz. :doc:`tls-proxies-and-http-services`. Bununla birlikte, gerçekte her yerde SSL/TLS dağıtmak çok zorsa, OpenStack SSL/TLS ihtiyaçlarınızı değerlendirmenizi ve burada tartışılan mimarilerden birini izlemenizi öneririz.

source: We recommend using a separate, isolated network within the management security domain for provisioning. This network will handle all PXE traffic, along with the subsequent boot stage downloads depicted above. Note that the node boot process begins with two insecure operations: DHCP and TFTP. Then the boot process uses TLS to download the remaining information required to deploy the node. This may be an operating system installer, a basic install managed by `Chef <https://www.chef.io/chef/>`__ or `Puppet <https://puppetlabs.com/>`__, or even a complete file system image that is written directly to disk.
de: Wir empfehlen, ein separates, isoliertes Netzwerk innerhalb der Verwaltungssicherheitsdomäne für die Bereitstellung zu verwenden. Dieses Netzwerk verarbeitet alle PXE-Traffic, zusammen mit den nachfolgenden Bootstudien-Downloads, die oben dargestellt sind. Beachten Sie, dass der Knoten-Bootvorgang mit zwei unsicheren Operationen beginnt: DHCP und TFTP. Dann verwendet der Boot-Prozess TLS, um die restlichen Informationen herunterzuladen, die für die Bereitstellung des Knotens erforderlich sind. Dies kann ein Betriebssystem-Installationsprogramm sein, eine grundlegende Installation, die von `Chef verwaltet wird <https://www.chef.io/chef/>`__ oder` Puppet <https://puppetlabs.com/>`__, oder sogar ein komplettes Dateisystembild, das direkt auf die Festplatte geschrieben wird.
id: Sebaiknya gunakan jaringan terpisah yang terisolasi dalam domain keamanan manajemen untuk penyediaan. Jaringan ini akan menangani semua lalu lintas PXE, bersamaan dengan unduhan tahap boot berikutnya yang digambarkan di atas. Perhatikan bahwa proses boot node dimulai dengan dua operasi tidak aman: DHCP dan TFTP. Kemudian proses booting menggunakan TLS untuk mendownload sisa informasi yang dibutuhkan untuk menyebarkan node. Ini mungkin sebuah installer sistem operasi, sebuah instalasi dasar yang dikelola oleh `Chef <https://www.chef.io/chef/>`__ atau `Puppet <https://puppetlabs.com/>`__, atau bahkan image sistem file lengkap yang ditulis langsung ke disk.
tr_tr: Sağlama için yönetim güvenliği alanında ayrı bir izole edilmiş ağ kullanmanızı öneririz. Bu ağ, yukarıda tasvir edilen daha sonraki önyükleme aşaması yüklemeleri ile birlikte tüm PXE trafiğini işleyecektir. Düğüm önyükleme işleminin iki güvensiz işlemle başladığını unutmayın: DHCP ve TFTP. Daha sonra önyükleme işlemi, düğümü dağıtmak için gereken kalan bilgileri indirmek için TLS kullanır. Bu bir işletim sistemi yükleyicisi, `Chef <https://www.chef.io/chef/>`__ veya `Puppet <https://puppetlabs.com/>`__ tarafından yönetilen temel bir kurulum veya doğrudan diske yazılan eksiksiz bir dosya sistemi imajı olabilir.

source: We recommend you disable filters that parse things that are provided by users or are able to be manipulated such as metadata.
de: Wir empfehlen Ihnen, Filter zu deaktivieren, die Dinge, die von Benutzern bereitgestellt werden, analysieren oder manipuliert werden können, wie z.B. Metadaten.
id: Sebaiknya Anda menonaktifkan filter yang mengurai hal-hal yang disediakan oleh pengguna atau dapat dimanipulasi seperti metadata.
tr_tr: Kullanıcıların sağladığı veya metaveri gibi manipüle edilebilen şeyleri ayrıştıran filtreleri devre dışı bırakmanızı öneririz.
