Repository: openstack/security-doc
Catalog: security-guide/source/locale/*/LC_MESSAGES/security-guide.po
Languages: de, id, tr_tr

source: We selected these security domains because they can be mapped independently or combined to represent the majority of the possible areas of trust within a given OpenStack deployment. For example, some deployment topologies may consist of a combination of guest and data domains onto one physical network while other topologies have these domains separated. In each case, the cloud operator should be aware of the appropriate security concerns. Security domains should be mapped out against your specific OpenStack deployment topology. The domains and their trust requirements depend upon whether the cloud instance is public, private, or hybrid.
de: Wir haben diese Sicherheitsdomänen ausgewählt, weil sie unabhängig voneinander zugeordnet oder kombiniert werden können, um die Mehrheit der möglichen Vertrauensbereiche innerhalb einer gegebenen OpenStack-Bereitstellung darzustellen. Zum Beispiel können einige Bereitstellungstopologien aus einer Kombination von Gast- und Datendomänen auf einem physischen Netzwerk bestehen, während andere Topologien diese Domänen getrennt haben. In jedem Fall sollte der Cloud-Betreiber sich der entsprechenden Sicherheitsbedenken bewusst sein. Sicherheitsdomänen sollten auf Ihre spezifische OpenStack-Bereitstellungstopologie abgebildet werden. Die Domänen und ihre Vertrauensanforderungen hängen davon ab, ob die Cloud-Instanz öffentlich, privat oder hybride ist.
id: Kami memilih domain keamanan ini karena dapat dipetakan secara independen atau digabungkan untuk mewakili sebagian besar wilayah kepercayaan yang mungkin ada dalam penerapan OpenStack yang diberikan. Misalnya, beberapa topologi penerapan mungkin terdiri dari kombinasi domain tamu dan data ke satu jaringan fisik sementara topologi lain memisahkan domain ini. Dalam setiap kasus, operator awan harus menyadari masalah keamanan yang sesuai. Domain keamanan harus dipetakan berdasarkan topologi penyebaran OpenStack spesifik Anda. Domain dan persyaratan kepercayaan mereka bergantung pada apakah instance awan bersifat publik, pribadi, atau hibrida.
tr_tr: Bu güvenlik alanlarını seçtik çünkü bağımsız olarak eşleştirilebilir veya belirli bir OpenStack dağıtımında muhtemel alanların çoğunu temsil etmek üzere birleştirilebilirler. Örneğin, bazı dağıtım topolojileri, konuk alanının ve veri alanlarının bir fiziksel ağa birleşiminden oluşabilirken, diğer topolojilerin bu alanlar ayrılmış halde olmasını sağlayabilirsiniz. Her durumda, bulut operatörü uygun güvenlik kaygılarından haberdar olmalıdır. Güvenlik etki alanları, belirli OpenStack dağıtım topolojisine karşı eşleştirilmelidir. Alanlar ve bunların güven gereksinimleri, bulut örneğinin kamu, özel veya karma olup olmadığına bağlıdır.

source: We strongly recommend deploying dashboard to a *second-level domain*, such as ``https://example.com``, rather than deploying dashboard on a *shared subdomain* of any level, for example ``https://openstack.example.org`` or ``https://horizon.openstack.example.org``. We also advise against deploying to bare internal domains like ``https://horizon/``. These recommendations are based on the limitations of browser same-origin-policy.
de: Wir empfehlen dringend, das Dashboard auf eine * Second-Level-Domain * zu installieren, z. B. ``https://example.com``, anstatt das Dashboard auf einer * gemeinsamen Subdomain * auf jeder Ebene zu implementieren, z.B. `` https://openstack.example.org``oder ``https:// horizon.openstack.example.org``. Wir raten auch beim Einsatz auf nackten internen Domains wie ``https://horizon/``. Diese Empfehlungen basieren auf den Einschränkungen der Browser same-origin-policy.
id: Kami sangat menyarankan untuk menerapkan dasbor ke *second-level domain*, seperti ``https://example.com``, daripada menerapkan dasbor di *shared subdomain* dari tingkat mana pun, misalnya ``https://openstack.example.org`` atau ``https://horizon.openstack.example.org``. Kami juga menyarankan untuk tidak menerapkan domain internal yang kosong seperti ``https://horizon/``. Rekomendasi ini didasarkan pada keterbatasan browser same-origin-policy.
tr_tr: Herhangi bir seviyenin *paylaşılan bir alt alanına*, örneğin ``https://example.com`` gibi bir panel yerleştirmek yerine, panelin *ikinci düzey bir alana*, örneğin ``https://openstack.example.org`` veya ``https://horizon.openstack.example.org`` gibi bir alanda yayına alınmasını şiddetle öneririz. Ayrıca, ``https://horizon/`` gibi çıplak iç alanlara yayına alınmasına da karşıyız. Bu öneriler tarayıcıların aynı menşei politikasının kısıtlamalarına dayanmaktadır.

source: We strongly recommend:
de: Wir empfehlen dringend:
id: Kami sangat menyarankan:
tr_tr: Kesinlikle öneriyoruz:

source: We suggest that cloud administrators use this table as a model to help define which actions to take for the various security levels. For example, a critical-level security update might require the cloud to be upgraded quickly whereas a low-level update might take longer to be completed.
de: Wir schlagen vor, dass Cloud-Administratoren diese Tabelle als Modell verwenden, um zu definieren, welche Aktionen für die verschiedenen Sicherheitsstufen zu ergreifen sind. Beispielsweise kann ein Sicherheitsupdates auf kritischer Ebene erfordern, dass die Cloud schnell aktualisiert wird, während ein Low-Level-Update länger dauern kann, um abgeschlossen zu werden.
id: Kami menyarankan agar administrator awan menggunakan tabel ini sebagai model untuk membantu menentukan tindakan mana yang harus dilakukan untuk berbagai tingkat keamanan. Misalnya, pembaruan keamanan tingkat kritis mungkin memerlukan awan untuk ditingkatkan dengan cepat sedangkan pembaruan tingkat rendah mungkin memerlukan waktu lebih lama untuk diselesaikan.
tr_tr: Bulut yöneticileri, çeşitli güvenlik düzeyleri için hangi eylemlerin gerçekleştirileceğini tanımlamanıza yardımcı olması için bu tabloyu bir model olarak kullanmanızı öneririz. Örneğin, kritik düzeyde bir güvenlik güncelleştirmesi, bulutun hızla yükseltilmesine ihtiyaç duyabilirken düşük seviyeli bir güncelleme tamamlanması daha uzun sürebilir.

source: What about high availability or load balanced deployments that need to inspect traffic? The previous deployment model (:ref:`secure-communication-proxy-on-same-physical-hosts-as-api-endpoints`) would not allow for deep packet inspection since the traffic is encrypted. If the traffic only needs to be inspected for basic routing purposes, it might not be necessary for the load balancer to have access to the unencrypted traffic. HAProxy has the ability to extract the SSL/TLS session ID during the handshake, which can then be used to achieve session affinity ( `session ID configuration details here <http://blog.exceliance.fr/2011/07/04/maintain-affinity-based-on-ssl-session-id/>`_ ). HAProxy can also use the TLS Server Name Indication (SNI) extension to determine where traffic should be routed to ( `SNI configuration details here <http://blog.exceliance.fr/2012/04/13/enhanced-ssl-load-balancing-with-server-name-indication-sni-tls-extension/>`_ ). These features likely cover some of the most common load balancer needs. HAProxy would be able to just pass the HTTPS traffic straight through to the API endpoint systems in this case:
de: Was ist mit Hochverfügbarkeit oder Lastausgleich, die den Verkehr kontrollieren müssen? Das vorherige Bereitstellungsmodell (:ref:`secure-communication-proxy-on-same-physical-hosts-as-api-endpunkte`) würde keine tiefe Paketprüfung ermöglichen, da der Verkehr verschlüsselt ist. Wenn der Verkehr nur für grundlegende Routingzwecke überprüft werden muss, ist es möglicherweise nicht erforderlich, dass der Load Balancer Zugriff auf den unverschlüsselten Verkehr hat. HAProxy hat die Fähigkeit, die SSL/TLS-Sitzungs-ID während des Handshakes zu extrahieren, die dann verwendet werden kann, um Sitzungs-Affinität zu erreichen (`Session ID-Konfigurationsdetails hier <http://blog.exceliance.fr/2011/07/04/maintain-affinity-based-on-ssl-session-id/>`_). HAProxy kann auch die TLS Server Name Indication (SNI) Erweiterung verwenden, um festzustellen, wo der Verkehr weitergeleitet werden soll (`SNI Konfigurationsdetails hier <http://blog.exceliance.fr/2012/04/13/enhanced-ssl-load-balancing-with-server-name-indication-sni-tls-extension/>`_). Diese Merkmale decken wahrscheinlich einige der häufigsten Lastenausgleicherbedürfnisse ab. HAProxy wäre in der Lage, den HTTPS-Verkehr direkt in die API-Endpunktsysteme zu übergeben:
id: Bagaimana dengan ketersediaan tinggi atau penerapan seimbang yang perlu untuk memeriksa lalu lintas? Model penyebaran sebelumnya (:ref: `secure-communication-proxy-on-same-physical-hosts-as-api-endpoints`) tidak akan mengizinkan pemeriksaan paket dalam karena lalu lintas dienkripsi. Jika lalu lintas hanya perlu diperiksa untuk keperluan perutean dasar, mungkin tidak perlu penyeimbang beban untuk mendapatkan akses ke lalu lintas yang tidak dienkripsi. HAProxy memiliki kemampuan untuk mengekstrakSSL/TLS session ID selama handshake, yang kemudian dapat digunakan untuk mencapai afinitas (`session ID configuration details here <http://blog.exceliance.fr/2011/07/04/maintain -affinity-based-on-ssl-session-id /> `_). HAProxy juga dapat menggunakan ekstensi TLS Server Name Indication (SNI) untuk menentukan lalu lintas yang harus diarahkan ke ( `SNI configuration details here <http://blog.exceliance.fr/2012/04/13/enhanced-ssl-load- menyeimbangkan-dengan-server-name-indication-sni-tls-extension /> `_). Fitur ini kemungkinan mencakup beberapa penyeimbang beban yang paling umum. HAProxy hanya bisa melewati lalu lintas HTTPS langsung ke sistem endpoint API dalam kasus ini:
tr_tr: Trafiği kontrol etmeniz gereken yüksek kullanılabilirlik veya yük dengeli dağıtımlar ne olacak? Önceki dağıtım modeli (:ref:`secure-communication-proxy-on-same-physical-hosts-as-api-endpoints`) trafik şifrelendiği için derin iletişim paketi incelemesine izin vermez. Trafiğin temel yönlendirme amaçlarıyla incelenmesi gerekiyorsa, yük dengeleyicisinin şifrelenmemiş trafiğe erişmesi gerekli olmayabilir. HAProxy, el sıkışma sırasında SSL/TLS oturum kimliğini ayıklama yeteneğine sahiptir ve bu, daha sonra oturum yakınlığına erişmek için kullanılabilir (`oturum ID yapılandırma ayrıntıları burada <http://blog.exceliance.fr/2011/07/04/maintain -affinity tabanlı-on-ssl-session-id />`_). HAProxy, trafiğin yönlendirileceği yeri belirlemek için TLS Sunucu Adı Gösterimi (SNI) uzantısını da kullanabilir (burada `SNI yapılandırma ayrıntıları <http://blog.exceliance.fr/2012/04/13/enhanced-ssl-load- server-name-indication-sni-tls-uzantısı /> `_ ile dengeleme). Bu özellikler muhtemelen en yaygın yük dengeleyici ihtiyaçlarını karşılar. HAProxy, bu durumda HTTPS trafiğini doğrudan API son nokta sistemlerine geçirebilir:

source: What assets are at risk
de: Welche Vermögenswerte sind gefährdet
id: Aset apa yang berisiko
tr_tr: Hangi varlıkların risk altında olduğu

source: What if I don't want to use Barbican?
de: Was, wenn ich Barbican nicht benutzen möchte?
id: Bagaimana jika saya tidak ingin menggunakan Barbican?

source: What if you want cryptographic separation of your external and internal environments? A public cloud provider would likely want their public facing services (or proxies) to use certificates that are issued by a CA that chains up to a trusted Root CA that is distributed in popular web browser software for SSL/TLS. For the internal services, one might want to instead use their own PKI to issue certificates for SSL/TLS. This cryptographic separation can be accomplished by terminating SSL at the network boundary, then re-encrypting using the internally issued certificates. The traffic will be unencrypted for a brief period on the public facing SSL/TLS proxy, but it will never be transmitted over the network in the clear. The same re-encryption approach that is used to achieve cryptographic separation can also be used if deep packet inspection is really needed on a load balancer. Here is what this deployment model would look like:
de: Was ist, wenn Sie eine kryptografische Trennung Ihrer externen und internen Umgebungen wünschen? Ein öffentlicher Cloud-Provider würde wahrscheinlich wollen, dass ihre Public-Face-Dienste (oder Proxies) Zertifikate verwenden, die von einer CA ausgegeben werden, die bis zu einer vertrauenswürdigen Root-CA, die in der beliebten Webbrowser-Software für SSL/TLS verteilt ist. Für die internen Dienste möchte man stattdessen seine eigene PKI verwenden, um Zertifikate für SSL/TLS auszustellen. Diese kryptographische Trennung kann durch Beenden von SSL an der Netzwerkgrenze erreicht und dann mit den intern ausgegebenen Zertifikaten neu verschlüsselt werden. Der Verkehr wird für eine kurze Zeit auf der Öffentlichkeit mit SSL/TLS-Proxy unverschlüsselt, aber es wird nie über das Netzwerk im klaren übertragen werden. Der gleiche Re-Verschlüsselungsansatz, der verwendet wird, um eine kryptographische Trennung zu erreichen, kann auch verwendet werden, wenn eine tiefe Paketinspektion wirklich auf einem Loadbalaner erforderlich ist. Hier ist, wie dieses Einsatzmodell aussehen würde:
id: Bagaimana jika Anda ingin pemisahan kriptografi lingkungan eksternal dan internal Anda? Penyedia awan publik mungkin menginginkan agar publik mereka menghadapi layanan (atau proxy) untuk menggunakan sertifikat yang dikeluarkan oleh CA yang mengarah ke Root CA tepercaya yang didistribusikan di perangkat lunak browser web populer untuk SSL/TLS. Untuk layanan internal, orang mungkin ingin menggunakan PKI mereka sendiri untuk menerbitkan sertifikat SSL/TLS. Pemisahan kriptografi ini dapat dilakukan dengan menghentikan SSL pada batas jaringan, kemudian mengenkripsi ulang menggunakan sertifikat yang dikeluarkan secara internal. Lalu lintas tidak akan dienkripsi untuk periode singkat di hadapan publik yang menghadap proxy SSL/TLS, namun tidak akan pernah ditransmisikan melalui jaringan secara jelas. Pendekatan enkripsi ulang yang sama yang digunakan untuk mencapai pemisahan kriptografi juga dapat digunakan jika inspeksi paket dalam benar-benar dibutuhkan pada penyeimbang beban. Inilah model penggelaran ini yang akan terlihat:
tr_tr: Harici ve dahili ortamlarınızı kriptografik olarak ayırmak isterseniz ne olur? Genel bir bulut sağlayıcısı, halka açık servisleri (veya vekilleri), SSL / TLS için popüler web tarayıcı yazılımında dağıtılan güvenilir bir Kök CA'ya kadar zincirlenen bir CA tarafından verilen sertifikaları kullanmak isteyebilir. Dahili servisler için bunun yerine kendi PKI'sini kullanarak SSL/TLS için sertifika vermek isteyebilirsiniz. Bu şifreleme ayrımı, SSL'yi ağ sınırında sonlandırıp, dahili olarak verilen sertifikaları kullanarak yeniden şifreleyerek başarılabilir. Trafik, kamuya bakan SSL/TLS vekilinin kısa bir süre için şifrelenmemiş olacak, ancak hiçbir zaman net bir şekilde ağ üzerinden iletilemez. Bir yük dengeleyici üzerinde derin paket incelemesine gerçekten ihtiyaç duyuluyorsa, kriptografik ayrımı yapmak için kullanılan aynı yeniden şifreleme yaklaşımı da kullanılabilir. İşte bu dağıtım modeli nasıl görünür:

source: What is measured
de: Was wird gemessen
tr_tr: Ne ölçülür

source: What is the recommended way to securely store secrets in OpenStack?
de: Was ist der empfohlene Weg, um Geheimnisse in OpenStack sicher zu speichern?
id: Apa cara yang disarankan untuk menyimpan rahasia di OpenStack secara aman?

source: When a share is just created there are no default access rules associated with it and permission to mount it. This could be seen in mounting config for export protocol in use. For example, there is an NFS command ``exportfs`` or ``/etc/exports`` file on the storage which controls each remote share and defines hosts that can access it. It is empty if nobody can mount a share. For a remote CIFS server there is ``net conf list`` command which shows the configuration. ``hosts deny`` parameter should be set by the share driver to ``0.0.0.0/0`` which means that any host is denied to mount the share.
de: Wenn eine Freigabe gerade erstellt wird, gibt es keine Standardzugriffsregeln, die mit ihr verknüpft sind, und die Berechtigung, sie zu installieren. Dies konnte bei der Montagekonfiguration für das Exportprotokoll gesehen werden. Zum Beispiel gibt es einen NFS-Befehl `` exportfs`` oder ``/etc/exports`` Datei auf dem Speicher, der jede entfernte Freigabe steuert und Hosts definiert, die darauf zugreifen können. Sie ist leer, wenn niemand eine Freigabe einhängen kann. Für einen entfernten CIFS-Server gibt es ``net conf list``Befehl, der die Konfiguration zeigt. ``hosts deny``Parameter sollte vom Share-Treiber auf ``0.0.0.0/0` gesetzt werden, was bedeutet, dass jedem Host die Freigabe der Freigabe verweigert wird.
id: Saat share dibuat, tidak ada aturan akses default yang terkait dengannya dan izin untuk mounting. Ini bisa dilihat pada konfigurasi mounting untuk protokol ekspor yang digunakan. Misalnya, ada file perintah NFS ``exportfs`` atau ``/etc/exports`` pada penyimpanan yang mengontrol setiap remote share dan mendefinisikan host yang dapat mengaksesnya. Ini kosong jika tidak ada yang bisa me-mount share. Untuk server CIFS remote terdapat perintah ``net conf list`` yang menunjukkan konfigurasi. Parameter ``hosts deny`` harus ditetapkan oleh share driver ke ``0.0.0.0/0`` yang berarti bahwa setiap host ditolak untuk me-mount share.
tr_tr: Bir paylaşım yeni oluşturulduğunda, paylaşılan varsayılan erişim kuralları ve onu bağlama izni yoktur. Bu, kullanımdaki dışa aktarma protokolünün bağlama yapılandırmasında görülebilir. Örneğin, her uzak paylaşımı kontrol eden ve ona erişebilen ana makineleri tanımlayan bir ``exportfs`` veya ``/etc/exports`` dosyası olan bir NFS komutu var. Kimse bir paylaşımı bağlayamazsa boştur. Uzak CIFS sunucusu için yapılandırmayı gösteren ``net conf list`` komutu var. ``hosts deny`` parametresi, paylaşım sürücüsü tarafından ``0.0.0.0/0`` olarak ayarlanmalıdır; bu, herhangi bir makinenin paylaşımı bağlamasının reddedildiği anlamına gelir.

source: When addressing compliance, you can increase efficiency and reduce work effort by identifying common areas and criteria that apply across multiple certifications. Much of the audit principles and guidelines discussed in this book will assist in identifying these controls, additionally a number of external entities provide comprehensive lists. The following are some examples:
de: Bei der Einhaltung der Compliance können Sie die Effizienz steigern und den Arbeitsaufwand reduzieren, indem Sie gemeinsame Bereiche und Kriterien festlegen, die über mehrere Zertifizierungen hinweg gelten. Ein Großteil der in diesem Buch erörterten Prüfungsgrundsätze und -leitlinien wird bei der Ermittlung dieser Kontrollen helfen, zusätzlich eine Reihe von externen Stellen bieten umfassende Listen. Im Folgenden finden Sie einige Beispiele:
id: Saat menangani kepatuhan, Anda dapat meningkatkan efisiensi dan mengurangi upaya kerja dengan mengidentifikasi area umum dan kriteria yang berlaku di beberapa sertifikasi. Sebagian besar prinsip dan pedoman audit yang dibahas dalam buku ini akan membantu mengidentifikasi kontrol ini, dan tambahan sejumlah entitas eksternal menyediakan daftar komprehensif. Berikut adalah beberapa contohnya:
tr_tr: Uyum söz konusuyken, birden çok sertifikada geçerli olan ortak alanları ve ölçütleri belirleyerek etkinliği artırabilir ve iş emeğini azaltabilirsiniz. Bu kitapta tartışılan denetim ilkeleri ve yönergelerinin çoğu, bu denetimlerin tanımlanmasına yardımcı olur, buna ek olarak bir takım dış öğeler kapsamlı listeler sağlar. Aşağıda bazı örnekler verilmiştir:

source: When auditing an OpenStack cloud it is important to appreciate the multi-tenant environment inherent in the OpenStack architecture. Some critical areas for concern include data disposal, hypervisor security, node hardening, and authentication mechanisms.
de: Bei der Auditierung einer OpenStack-Cloud ist es wichtig, die in der OpenStack-Architektur enthaltene Multi-Tenant-Umgebung zu verstehen. Einige kritische Bereiche betreffen die Datenentsorgung, die Hypervisor-Sicherheit, die Knotenhärtung und die Authentifizierungsmechanismen.
id: Saat mengaudit awan OpenStack, penting untuk menghargai lingkungan multi-tenant yang melekat dalam arsitektur OpenStack. Beberapa area penting yang perlu diperhatikan meliputi pembuangan data, keamanan hypervisor, pengerasan simpul (node hardening), dan mekanisme otentikasi.
tr_tr: Bir OpenStack bulutunu denetlerken, OpenStack mimarisindeki çok kiracı çevreyi takdir etmek önemlidir. Endişe konusu olan bazı kritik alanlar, veri elden çıkarma, hipervizör güvenliği, düğüm sıkılaştırması ve kimlik doğrulama mekanizmalarıdır.

source: When building an OpenStack cloud it is strongly recommended to approach your design and implementation with a configuration management tool or framework in mind. Configuration management allows you to avoid the many pitfalls inherent in building, managing, and maintaining an infrastructure as complex as OpenStack. By producing the manifests, cookbooks, or templates required for a configuration management utility, you are able to satisfy a number of documentation and regulatory reporting requirements. Further, configuration management can also function as part of your business continuity plan (BCP) and data recovery (DR) plans wherein you can rebuild a node or service back to a known state in a DR event or given a compromise.
de: Beim Aufbau einer OpenStack-Cloud wird dringend empfohlen, sich Ihrem Design und der Implementierung mit einem Konfigurationsmanagement-Tool oder Framework vorzustellen. Das Konfigurationsmanagement ermöglicht es Ihnen, die vielen Fallstricke zu vermeiden, die dem Aufbau, der Verwaltung und der Pflege einer so komplexen Infrastruktur wie OpenStack innewohnen. Durch die Herstellung der Manifeste, Kochbücher oder Vorlagen, die für ein Konfigurationsmanagement-Dienstprogramm erforderlich sind, können Sie eine Reihe von Dokumentations- und Regulierungsberichtsanforderungen erfüllen. Weiterhin kann das Konfigurationsmanagement auch als Teil Ihres Business Continuity Plans (BCP) und Datenrettung (DR) Pläne dienen, in denen Sie einen Knoten oder einen Dienst wieder in einen bekannten Zustand in einem DR-Ereignis umbauen oder einen Kompromiss erhalten können.
id: Saat membangun awan OpenStack, sangat disarankan untuk mendekati desain dan implementasi Anda dengan alat manajemen konfigurasi atau kerangka kerja. Manajemen konfigurasi memungkinkan Anda menghindari banyak jebakan yang melekat dalam membangun, mengelola, dan memelihara infrastruktur sekompleks OpenStack. Dengan memproduksi manifes, buku masak, atau templat yang diperlukan untuk utilitas pengelolaan konfigurasi, Anda dapat memenuhi sejumlah persyaratan pelaporan dokumentasi dan peraturan. Selanjutnya, manajemen konfigurasi juga dapat berfungsi sebagai bagian dari business continuity plan (BCP) dan perencanaan data recovery (DR) Anda di mana Anda dapat membangun kembali node atau layanan mundur (service back) ke keadaan yang sudah diketahui dalam kejadian DR atau bahaya yang ada.
tr_tr: Bir OpenStack bulutu oluştururken tasarım ve uygulamanızın bir yapılandırma yönetimi aracı veya çerçevesi göz önünde bulundurulması önemle tavsiye edilir. Yapılandırma yönetimi, bir altyapıyı OpenStack kadar karmaşık hale getirmede, yönetmede ve korumada doğuran pek çok tuzaktan kaçınmanıza izin verir. Bir yapılandırma yönetimi yardımcı programı için gereken tezahürleri, hazırlık kitaplarını veya şablonları üreten bir dizi belge ve yasal raporlama gereksinimlerini yerine getirebilirsiniz. Ayrıca, yapılandırma yönetimi, iş akış süreci planında (BCP) ve veri kurtarma (DR) planlarının bir parçası olarak işlev görebilir ve burada bir düğümü veya hizmeti bir DR olayında bilinen bir duruma geri yükleyebilir veya bir açık vermeye sahipsiniz.
