Repository: openstack/security-doc
Catalog: security-guide/source/locale/*/LC_MESSAGES/security-guide.po
Languages: de, id, tr_tr

source: In general, there are two different strategies for verifying the boot process. Traditional *secure boot* will validate the code run at each step in the process, and stop the boot if code is incorrect. *Boot attestation* will record which code is run at each step, and provide this information to another machine as proof that the boot process completed as expected. In both cases, the first step is to measure each piece of code before it is run. In this context, a measurement is effectively a SHA-1 hash of the code, taken before it is executed. The hash is stored in a platform configuration register (PCR) in the TPM.
de: Im Allgemeinen gibt es zwei verschiedene Strategien für die Überprüfung des Boot-Prozesses. Traditionelles *sicheres Booten* validiert den Code, der bei jedem Schritt des Prozesses ausgeführt wird, und stoppt den Boot, wenn Code falsch ist. *Boot-Bescheinigung* wird aufzeichnen, welcher Code bei jedem Schritt ausgeführt wird, und diese Informationen an eine andere Maschine als Beweis liefern, dass der Boot-Prozess wie erwartet abgeschlossen ist. In beiden Fällen ist der erste Schritt, um jedes Stück Code zu messen, bevor es ausgeführt wird. In diesem Zusammenhang ist eine Messung effektiv ein SHA-1-Hash des Codes, der vor der Ausführung durchgeführt wird. Der Hash wird in einem Plattform-Konfigurationsregister (PCR) im TPM gespeichert.
id: Secara umum, ada dua strategi yang berbeda untuk memverifikasi proses booting. *secure boot* akan memvalidasi kode yang dijalankan pada setiap langkah dalam proses, dan menghentikan boot jika kode salah. *Boot attestation * akan mencatat kode mana yang dijalankan pada setiap langkah, dan berikan informasi ini ke mesin lain sebagai bukti bahwa proses boot selesai seperti yang diharapkan. Dalam kedua kasus tersebut, langkah pertama adalah mengukur setiap potongan kode sebelum dijalankan. Dalam konteks ini, pengukuran secara efektif merupakan hash kode SHA-1, yang diambil sebelum dijalankan. Hash disimpan dalam platform configuration register (PCR) di TPM.
tr_tr: Genel olarak, önyükleme işlemini doğrulamak için iki farklı strateji vardır. Geleneksel *güvenli önyükleme*, işlemin her adımında çalıştırılan kodu doğrulayacak ve kod doğru değilse önyüklemeyi durduracaktır. *Önyükleme doğrulaması* hangi adımda hangi kodun çalıştırılacağını kaydeder ve bu bilgileri önyükleme işleminin beklendiği gibi tamamlandığının kanıtı olarak başka bir makineye sunar. Her iki durumda da, ilk adım, çalıştırılmadan önce her bir kod parçasını ölçmektir. Bu bağlamda, bir ölçüm, yürürlüğe girmeden önce alınan kodun etkili bir SHA-1 özetidir. Özet, TPM'de bir platform yapılandırma kaydı (PCR) içinde saklanır.

source: In most deployments this domain is considered *trusted*. However, when considering an OpenStack deployment, there are many systems that bridge this domain with others, potentially reducing the level of trust you can place on this domain. See :ref:`Bridging_security_domains` for more information.
de: In den meisten Bereitstellungen gilt diese Domain als * vertrauenswürdig *. Allerdings, wenn man eine OpenStack-Bereitstellung betrachtet, gibt es viele Systeme, die diese Domain mit anderen überbrücken und möglicherweise das Vertrauensniveau reduzieren, das Sie auf dieser Domain platzieren können. Siehe :ref:`Bridging_security_domains` für weitere Informationen.
id: Dalam kebanyakan penyebaran domain ini dianggap *trusted*. Namun, ketika mempertimbangkan penyebaran OpenStack, ada banyak sistem yang menjembatani domain ini dengan orang lain, yang berpotensi mengurangi tingkat kepercayaan yang dapat Anda tempatkan pada domain ini. Lihat :ref: `Bridging_security_domains` untuk informasi lebih lanjut.
tr_tr: Çoğu dağıtımda bu alan adı *güvenilir* olarak kabul edilir. Bununla birlikte, bir OpenStack dağıtımını düşündüğünüzde, bu alan adını diğerleriyle köprü kuran birçok sistem var ve potansiyel olarak bu alana yerleştirebileceğiniz güven düzeyini düşürüyor. Daha fazla bilgi için bkz :ref:`Bridging_security_domains`.

source: In older OpenStack releases, ``lvm_type=default`` was used to signify a wipe. While this method still works, ``lvm_type=default`` is not recommended for setting secure delete.
de: In alten OpenStack Versionen, war ``lvm_type=default`` benutzt zum Andeuten des Löschens. Diese Methode funktioniert immer noch, ``lvm_type=default`` wird nicht empfohlen zum sicheren Löschen.
id: Pada rilis OpenStack yang lebih lawas, ``lvm_type = default`` digunakan untuk menandakan penghapusan. Meskipun metode ini masih bekerja, ``lvm_type = default`` tidak disarankan untuk menyetel hapus aman.
tr_tr: Eski OpenStack yayınlarında, ``lvm_type=default`` silmeyi belirtmek için kullanılıyordu. Hala bu yöntem çalışsa da, ``lvm_type=default`` güvenli silme ayarlama için önerilmez.

source: In order to create a trust between the Identity Provider and the Service Provider, metadata must be exchanged. To create metadata for your Identity service, run the :command:`keystone-manage` command and pipe the output to a file. For example:
de: Um ein Vertrauen zwischen dem Identity Provider und dem Service Provider zu schaffen, müssen Metadaten ausgetauscht werden. Um Metadaten für Ihren Identitätsdienst zu erstellen, führen Sie den Befehl :command:`keystone-manage` aus und führen die Ausgabe in eine Datei. Beispielsweise:
tr_tr: Kimlik Sağlayıcısı ile Servis Sağlayıcı arasında bir güven oluşturmak için metaveriler değiştirilmelidir. Kimlik servisiniz için metaveri oluşturmak için :command:`keystone-manage` komutunu çalıştırın ve çıktıyı bir dosyaya yönlendirin. Örneğin:

source: In order to select the best supporting software, consider these factors:
de: Um die beste unterstützende Software auszuwählen, betrachten wir diese Faktoren:
id: Untuk memilih perangkat lunak pendukung terbaik, pertimbangkan faktor-faktor berikut:
tr_tr: En iyi destekleyici yazılımı seçmek için aşağıdaki faktörleri göz önünde bulundurun:

source: In some cases deployers may want to consider securing a bridge to a higher standard than any of the domains in which it resides. Given the above example of an API endpoint, an adversary could potentially target the API endpoint from the public domain, leveraging it in the hopes of compromising or gaining access to the management domain.
de: In manchen Fällen können sich die Deployer in Erwägung ziehen, eine Brücke zu einem höheren Standard zu sichern als irgendeine der Domänen, in denen sie sich befindet. Angesichts des obigen Beispiels eines API-Endpunkts könnte ein Gegner potenziell auf den API-Endpunkt aus der Public Domain zielen und ihn in die Hoffnung auf Kompromittierung oder Zugang zu der Management-Domain nutzen.
id: Dalam beberapa kasus, pelaksana mungkin ingin mempertimbangkan untuk mengamankan jembatan dengan standar yang lebih tinggi daripada domain mana pun tempat tinggalnya. Dengan contoh API endpoint di atas, musuh berpotensi menargetkan API endpoint dari domain publik, memanfaatkannya dengan harapan mengorbankan atau mendapatkan akses ke domain manajemen.
tr_tr: Bazı durumlarda, yayına alanlar, içinde bulunduğu herhangi bir alandan daha yüksek bir standarda köprü sağlamayı düşünmek isteyebilir. Yukarıdaki bir API uç noktası örneği göz önüne alındığında, bir düşman potansiyel olarak API alan noktasını genel alan adından hedefleyebilir ve bu API alanını ödün verme veya yönetim alanına erişim kazanma umuduyla yararlanabilir.

source: In some cases, it is required to explicitly specify one of the security services, for example, NetApp, EMC and Windows drivers require Active Directory for the creation of shares with the CIFS protocol.
de: In einigen Fällen ist es erforderlich, explizit einen der Sicherheitsdienste anzugeben, z. B. benötigen NetApp-, EMC- und Windows-Treiber Active Directory für die Erstellung von Freigaben mit dem CIFS-Protokoll.
id: Dalam beberapa kasus, diperlukan untuk menentukan secara eksplisit salah satu layanan keamanan, misalnya, driver NetApp, EMC dan Windows memerlukan Active Directory untuk pembuatan share dengan protokol CIFS.
tr_tr: Bazı durumlarda, güvenlik servislerinden birini açıkça belirtmeniz gerekir; örneğin, NetApp, EMC ve Windows sürücüleri, CIFS protokolüyle paylaşımların oluşturulması için Active Directory'e ihtiyaç duyar.

source: In some deployments it may be required to add host-based IDS on sensitive components on security domain bridges. A host-based IDS may detect anomalous activity by compromised or unauthorized processes on the component. The IDS should transmit alert and log information on the Management network.
de: In einigen Bereitstellungen kann es erforderlich sein, Host-basierte IDS auf sensible Komponenten auf Sicherheitsbereichsbrücken hinzuzufügen. Eine Host-basierte IDS kann anomale Aktivität durch kompromittierte oder nicht autorisierte Prozesse auf der Komponente erkennen. Das IDS sollte Warn- und Protokollinformationen über das Management-Netzwerk übertragen.
id: Dalam beberapa penerapan, mungkin diperlukan penambahan IDS berbasis host pada komponen sensitif pada jembatan domain keamanan. IDS berbasis host dapat mendeteksi aktivitas anomali dengan proses yang membahayakan atau tidak sah pada komponen. IDS harus mengirimkan informasi waspada dan log pada jaringan Management.
tr_tr: Bazı dağıtımlarda, güvenlik etki köprüleri üzerindeki hassas bileşenlere sunucu tabanlı IDS eklenmesi gerekebilir. Bir sunucu tabanlı IDS, bileşendeki tehlikeye veya yetkisiz işlemler yoluyla anormal bir etkinlik tespit edebilir. IDS, Yönetim ağı üzerinde uyarı ve günlük bilgisi göndermelidir.

source: In the *no share servers* mode a share driver does not handle storage life cycle. An administrator is expected to handle the storage, network interfaces, and other host configurations. In this mode an administrator can set storage as a host which exports shares. The main characteristic of this mode is that the storage is not handled by the Shared File Systems service. Users in a tenant share common network, host, processor, and network pipe. They can hinder each other if there is no correct balancing adjustment on the storage configured by admin or proxy before it. In public clouds it is possible that all network capacity is used by one client, so an administrator should care for this not to happen. Balancing adjustment can be done by any means, not necessarily with OpenStack tools.
de: Im Modus *no share servers* verarbeitet ein Freigabe-Treiber den Speicherlebenszyklus nicht. Es wird erwartet, dass ein Administrator die Speicher-, Netzwerkschnittstellen und andere Host-Konfigurationen verarbeiten soll. In diesem Modus kann ein Administrator Speicher als Host setzen, der Freigaben exportiert. Das Hauptmerkmal dieses Modus ist, dass die Speicherung nicht durch den Shared File Systems Service behandelt wird. Benutzer in einem Tenant teilen gemeinsame Netzwerk-, Host-, Prozessor-und Netzwerk-Pipe. Sie können sich gegenseitig behindern, wenn es keine korrekte Ausgleichseinstellung auf dem von admin oder Proxy konfigurierten Speicherplatz gibt. In öffentlichen Clouds ist es möglich, dass alle Netzwerkkapazitäten von einem Client genutzt werden, so dass ein Administrator darauf achten sollte, dass dies nicht passiert. Die Ausgleichsanpassung kann mit allen Mitteln erfolgen, nicht unbedingt mit OpenStack-Werkzeugen.
id: Dalam mode *no share servers* , driver share tidak menangani siklus hidup penyimpanan. Administrator diharapkan menangani penyimpanan, antarmuka jaringan, dan konfigurasi host lainnya. Dalam mode ini, administrator dapat mengatur penyimpanan sebagai host yang mengekspor share. Karakteristik utama dari mode ini adalah penyimpanan tidak ditangani oleh layanan Shared File Systems. Pengguna di jaringan penyewa berbagi jaringan umum, host, prosesor, dan jaringan pipa. Mereka dapat saling menghalangi jika tidak ada penyesuaian penyeimbang yang benar pada penyimpanan yang dikonfigurasi oleh admin atau proxy sebelum itu. Di awan publik ada kemungkinan bahwa semua kapasitas jaringan digunakan oleh satu klien, jadi administrator harus memperhatikan hal ini agar tidak terjadi. Penyesuaian balancing bisa dilakukan dengan cara apapun, belum tentu dengan alat OpenStack.
tr_tr: *paylaşım sunucusu yok* kipinde bir paylaşım sürücüsü depolama ömrü süresini ele almaz. Bir yöneticinin depolama alanını, ağ arabirimlerini ve diğer ana bilgisayar yapılandırmalarını ele alması beklenir. Bu kipte bir yönetici, saklamayı, paylaşımları dışa aktaran bir sunucu olarak ayarlayabilir. Bu modun temel özelliği, depolama alanının Paylaşımlı Dosya Sistemleri servisi tarafından ele alınmamasıdır. Bir kiracıdaki kullanıcılar ortak ağ, sunucu, işlemci ve ağ borusunu paylaşır. Önceden yönetici veya vekil tarafından yapılandırılmış depolama alanında doğru dengeleme ayarı yoksa, birbirlerini engelleyebilirler. Genel bulutlarda, tüm ağ kapasitesinin bir istemci tarafından kullanılması olasıdır, bu nedenle bir yönetici bunun olmamasına dikkat etmelidir. Dengeleme ayarı, OpenStack araçlarıyla değil, herhangi bir yolla yapılabilir.

source: In the United States, the National Institute of Science and Technology (NIST) certifies cryptographic algorithms through a process known the Cryptographic Module Validation Program. NIST certifies algorithms for conformance against Federal Information Processing Standard 140-2 (FIPS 140-2), which ensures...:
de: In den Vereinigten Staaten zertifiziert das Nationale Institut für Wissenschaft und Technologie (NIST) kryptographische Algorithmen durch einen Prozess, der das Cryptographic Module Validation Program bekannt ist. NIST bescheinigt Algorithmen zur Konformität mit dem Federal Information Processing Standard 140-2 (FIPS 140-2), die ...:
id: Di Amerika Serikat, National Institute of Science and Technology (NIST) mengesahkan algoritma kriptografi melalui sebuah proses yang dikenal dengan Cryptographic Module Validation Program. NIST mengesahkan algoritma untuk kesesuaian terhadap Federal Information Processing Standard 140-2 (FIPS 140-2), yang memastikan ...:
tr_tr: Amerika Birleşik Devletleri'nde, Ulusal Bilim ve Teknoloji Enstitüsü (NIST), Kriptografik Modül Doğrulama Programı ile bilinen bir süreç aracılığıyla şifreleme algoritmalarını onaylamaktadır. NIST, Federal Bilgi İşlem Standardı 140-2'ye (FIPS 140-2) karşı uygunluk algoritmalarını onaylar ve aşağıdakileri sağlar...:

source: In the ``/etc/manila/`` directory you can find several configuration files:
de: Im ``/etc/manila/`` Verzeichnis finden Sie mehrere Konfigurationsdateien:
id: Di direktori ``/etc/manila/`` Anda dapat menemukan beberapa file konfigurasi:
tr_tr: ``/etc/manila/`` dizininde birkaç yapılandırma dosyası bulabilirsiniz:

source: In the beginning of this chapter we discuss the use of both physical and virtual hardware by instances, the associated security risks, and some recommendations for mitigating those risks. We conclude the chapter with a discussion of sVirt, an open source project for integrating SELinux mandatory access controls with the virtualization components.
de: Am Anfang dieses Kapitels diskutieren wir die Verwendung von physischen und virtuellen Hardware durch Instanzen, die damit verbundenen Sicherheitsrisiken und einige Empfehlungen zur Minderung dieser Risiken. Wir schließen das Kapitel mit einer Diskussion über sVirt, ein Open-Source-Projekt zur Integration von SELinux obligatorischen Zugangskontrollen mit den Virtualisierungskomponenten.
tr_tr: Bu bölümün başında hem fiziksel hem de sanal donanımın örneklerle, ilişkili güvenlik riskleriyle ve bu riskleri azaltmaya yönelik bazı önerilerle tartışmayı ele alıyoruz. Bu bölümde, SELinux zorunlu erişim kontrollerini sanallaştırma bileşenleri ile bütünleştirmek için açık kaynaklı bir proje olan sVirt'in bir tartışmasıyla sonuçlandırıyoruz.

source: In the case of an OpenStack cloud instance, we need to monitor the hardware, the OpenStack services, and the cloud resource usage. The latter stems from wanting to be elastic, to scale to the dynamic needs of the users.
de: Im Falle einer OpenStack Cloud-Instanz müssen wir die Hardware, die OpenStack-Services und die Cloud-Ressourcennutzung überwachen. Letzteres stammt aus dem Wunsch, elastisch zu sein, um die dynamischen Bedürfnisse der Nutzer zu skalieren.
id: Dalam kasus instance awan OpenStack, kita perlu memantau perangkat keras, layanan OpenStack, dan penggunaan sumber daya awan. Yang terakhir ini berasal dari keinginan untuk menjadi elastis, untuk disesuaikan dengan kebutuhan dinamis pengguna.
tr_tr: Bir OpenStack bulut örneği olması durumunda, donanımı, OpenStack servislerini ve bulut kaynağı kullanımını izlememiz gerekir. Sonuncusu, kullanıcıların dinamik ihtiyaçlarına göre esnek olmak istemekten kaynaklanmaktadır.

source: In the case of failure, systems should be configured to fail into a closed secure state. For example, TLS certificate verification should fail closed by severing the network connection if the CNAME does not match the server's DNS name. Software often fails open in this situation, allowing the connection to proceed without a CNAME match, which is less secure and not recommended.
de: Im Falle eines Ausfalls sollten die Systeme so konfiguriert werden, dass sie in einen geschlossenen sicheren Zustand versagen. Beispielsweise sollte die Überprüfung des TLS-Zertifikats fehlgeschlagen sein, indem die Netzwerkverbindung getrennt wird, wenn das CNAME nicht mit dem DNS-Namen des Servers übereinstimmt. Die Software schlägt in dieser Situation oft nicht fehl, so dass die Verbindung ohne CNAME-Übereinstimmung erfolgen kann, was weniger sicher ist und nicht empfohlen wird.
id: Jika terjadi kegagalan, sistem harus dikonfigurasi untuk gagal dalam keadaan aman tertutup. Misalnya, verifikasi sertifikat TLS gagal ditutup dengan memutuskan sambungan jaringan jika CNAME tidak sesuai dengan nama DNS server. Perangkat lunak sering gagal terbuka dalam situasi ini, memungkinkan koneksi berlanjut tanpa kecocokan CNAME, yang kurang aman dan tidak disarankan.
tr_tr: Başarısızlık durumunda, sistemler kapalı güvenli bir durumda başarısız olacak şekilde yapılandırılmalıdır. Örneğin, CNAME sunucunun DNS adıyla eşleşmezse, TLS sertifika doğrulaması ağ bağlantısını keserek başarısız olmalı. Bu durumda otomatik olarak yazılım başarısız olur ve bağlantı, CNAME ile eşleşmeden devam edebilir ve bu da daha az güvenlidir ve önerilmez.

source: In the file ``pg_hba.conf``:
de: In der Datei ``pg_hba.conf``:
id: Dalam file ``pg_hba.conf``:
tr_tr: ``pg_hba.conf`` dosyasında:

source: In the initial architectural phases of designing your OpenStack Network infrastructure it is important to ensure appropriate expertise is available to assist with the design of the physical networking infrastructure, to identify proper security controls and auditing mechanisms.
de: In den anfänglichen architektonischen Phasen der Gestaltung Ihrer OpenStack Netzwerkinfrastruktur ist es wichtig, dass ein angemessenes Fachwissen zur Verfügung steht, um bei der Gestaltung der physischen Netzwerkinfrastruktur zu helfen, um die ordnungsgemäße Sicherheitskontrolle und die Prüfungsmechanismen zu identifizieren.
id: Pada tahap arsitektur awal untuk merancang infrastruktur OpenStack Network Anda, penting untuk memastikan keahlian yang sesuai tersedia untuk membantu perancangan infrastruktur jaringan fisik, untuk mengidentifikasi mekanisme kontrol keamanan dan audit yang tepat.
tr_tr: OpenStack Ağ altyapınızı tasarlarken ilk mimari aşamalarda, uygun güvenlik kontrollerini ve denetim mekanizmalarını belirlemek için fiziksel ağ altyapısının tasarımına yardımcı olacak uygun uzmanlığın bulunmasının sağlanması önemlidir.

source: In the returned unscoped token, a list of Identity service groups the user belongs to will be included.
de: In dem zurückgegebenen nicht kopierten Token wird eine Liste der Identitätsdienstgruppen, zu denen der Benutzer gehört, aufgenommen.
tr_tr: Dönen kapsamsız belirteçte, kullanıcının ait olduğu Kimlik servisi gruplarının bir listesi eklenecektir.

source: In this chapter we discuss how to assess the needs of data processing users with respect to their applications, the data that they use, and their expected capabilities within a project. We will also demonstrate a number of hardening techniques for the service controller and its clusters, and provide examples of various controller configurations and user management approaches to ensure an adequate level of security and privacy.
de: In diesem Kapitel diskutieren wir, wie wir die Bedürfnisse der Datenverarbeitungsbenutzer hinsichtlich ihrer Anwendungen, der von ihnen verwendeten Daten und ihrer erwarteten Fähigkeiten innerhalb eines Projekts beurteilen können. Wir werden auch eine Reihe von Härtungstechniken für den Service-Controller und seine Cluster vorstellen und Beispiele für verschiedene Controller-Konfigurationen und Benutzerverwaltungsansätze bieten, um ein angemessenes Maß an Sicherheit und Privatsphäre zu gewährleisten.
id: Dalam bab ini kita membahas bagaimana menilai kebutuhan pengguna pengolahan data sehubungan dengan aplikasinya, data yang mereka gunakan, dan kemampuan yang diharapkan dalam suatu proyek. Kami juga akan menunjukkan sejumlah teknik pengerasan untuk pengendali layanan dan clusternya, dan memberikan contoh berbagai konfigurasi controller dan pendekatan manajemen pengguna untuk memastikan tingkat keamanan dan privasi yang memadai.
tr_tr: Bu bölümde, veri işleme kullanıcılarının uygulamalarına, ihtiyaç duydukları verilere ve projedeki beklenen yeteneklerine göre ihtiyaçlarının nasıl değerlendirileceğini tartışacağız. Servis denetleyicisi ve kümeleri için bir dizi sıkılaştırma tekniği de göstereceğiz ve yeterli güvenlik ve gizlilik düzeyini sağlamak için çeşitli denetleyici yapılandırmaları ve kullanıcı yönetimi yaklaşımlarına örnekler sunacağız.

source: In this chapter we explore these technologies and describe the situations where they can be used to enhance security for instances or underlying instances. We also seek to highlight where privacy concerns may exist. These include data pass through, introspection, or providing a source of entropy. In this section we highlight the following additional security services:
de: In diesem Kapitel erforschen wir diese Technologien und beschreiben die Situationen, in denen sie verwendet werden können, um die Sicherheit für Instanzen oder zugrunde liegende Instanzen zu erhöhen. Wir wollen auch darauf hinweisen, wo wegen Privatsphäre Bedenken bestehen können. Dazu gehören Datendurchlauf, Introspektion oder Bereitstellung einer Entropiequelle. In diesem Abschnitt werden folgende zusätzliche Sicherheitsdienste hervorgehoben:
id: Dalam bab ini, kita mengeksplorasi teknologi ini dan menggambarkan situasi di mana mereka dapat digunakan untuk meningkatkan keamanan untuk instance atau instance yang mendasarinya. Kami juga berusaha untuk menyoroti di mana masalah privasi mungkin ada. Ini termasuk data yang lewat, introspeksi, atau penyediaan sumber entropi. Pada bagian ini kami menyoroti layanan keamanan tambahan berikut ini:
tr_tr: Bu bölümde, bu teknolojileri keşfediyoruz ve örneklerin veya temel örneklerin güvenliğini artırmak için kullanılabilecekleri durumları açıklıyoruz. Ayrıca gizlilik kaygılarının nerede olduğunu vurgulamaya çalışıyoruz. Bunlar arasında veri geçişi, içgözlemi veya entropi kaynağı sağlayan veriler bulunur. Bu bölümde, aşağıdaki ek güvenlik servislerini vurguluyoruz:
