Repository: openstack/security-doc
Catalog: security-guide/source/locale/*/LC_MESSAGES/security-guide.po
Languages: de, id, tr_tr

source: Restrict bind address of the API server: neutron-server
de: Beschränken Sie die Bindungsadresse des API-Servers: Neutron-Server
id: Batasi alamat pengikat dari server API: neutron-server
tr_tr: API sunucusunun bağlama adresini sınırla: neutron-server

source: Restricting bind address for MySQL
de: Beschränkung der Bindungsadresse für MySQL
id: Membatasi alamat pengikat untuk MySQL
tr_tr: MySQL için bağlama adresini sınırlama

source: Restricting listen address for PostgreSQL
de: Die Listener-Adresse für PostgreSQL einschränken
id: Membatasi alamat mendengarkan PostgreSQL
tr_tr: PostgreSQL için dinleme adresini kısıtlama

source: Review by OpenStack Security Project
de: Überprüfung durch OpenStack Security Project
id: Review oleh OpenStack Security Project
tr_tr: OpenStack Güvenlik Projesi tarafından İncelenmek

source: Review by a third party review body, with validation from the OpenStack Security Project
de: Überprüfung durch eine Drittanbieter-Überprüfung, mit Validierung aus dem OpenStack Security Project
id: Review oleh badan review pihak ketiga, dengan pengesahan dari OpenStack Security Project
tr_tr: OpenStack Güvenlik Projesi'nden doğrulama ile üçüncü parti inceleme organı tarafından incelenmesi

source: Review common security principles.
de: Überprüfen Sie die gemeinsamen Sicherheitsgrundsätze.
id: Tinjau kembali prinsip keamanan bersama.
tr_tr: Yaygın güvenlik prensiplerini gözden geçirmek.

source: Risk assessment
de: Risikoabschätzung
id: Penilaian Risiko
tr_tr: Risk değerlendirmesi

source: Robert Clark is the Lead Security Architect for HP Cloud Services and co-founder of the OpenStack Security Group (OSSG). Prior to being recruited by HP, he worked in the UK Intelligence Community. Robert has a strong background in threat modeling, security architecture and virtualization technology. Robert has a master's degree in Software Engineering from the University of Wales.
de: Robert Clark ist der Lead Security Architect für HP Cloud Services und Mitbegründer der OpenStack Security Group (OSSG). Bevor er von HP rekrutiert wurde, arbeitete er in der britischen Intelligence Community. Robert hat einen starken Hintergrund in der Bedrohungsmodellierung, Sicherheitsarchitektur und Virtualisierungstechnologie. Robert hat einen Master-Abschluss in Software Engineering von der University of Wales.
id: Robert Clark adalah Lead Security Architect untuk HP Cloud Services dan salah satu pendiri OpenStack Security Group (OSSG). Sebelum direkrut oleh HP, dia bekerja di UK Intelligence Community. Robert memiliki latar belakang yang kuat dalam pemodelan ancaman, arsitektur keamanan dan teknologi virtualisasi. Robert memiliki gelar master di bidang Software Engineering dari University of Wales.
tr_tr: Robert Clark, HP Bulut Hizmetleri için Ana Güvenlik Mimarı ve OpenStack Güvenlik Grubu'nun (OSSG) kurucularından biridir. HP tarafından işe alınmadan önce İngiltere İstihbarat Topluluğu'nda çalıştı. Robert, tehdit modelleme, güvenlik mimarisi ve sanallaştırma teknolojisinde güçlü bir geçmişe sahiptir. Robert Üniversitesi'nden Yazılım Mühendisliği alanında master derecesi bulunmaktadır.

source: Role-based access control (RBAC) allows separation of roles to eliminate the need for an all-powerful system administrator.
de: Role-Based Access Control (RBAC) ermöglicht die Trennung von Rollen, um die Notwendigkeit eines leistungsstarken Systemadministrators zu vermeiden.
id: Role-based access control (RBAC) memungkinkan pemisahan peran untuk menghilangkan kebutuhan akan administrator sistem yang hebat.
tr_tr: Rol tabanlı erişim kontrolü (RBAC), güçlü bir sistem yöneticisine olan ihtiyacı ortadan kaldırmak için rollerin ayrılmasına izin verir.

source: Role-based access control policies
de: Rollenbasierte Zugriffskontrollrichtlinien
id: Kebijakan kontrol akses berbasis peran
tr_tr: Rol tabanlı erişim kontrolü ilkeleri

source: Run services as non-root user
de: Führen Sie Dienste als Nicht-Root-Benutzer aus
id: Jalankan layanan sebagai pengguna non-root
tr_tr: Servisleri root olmayan bir kullanıcı ile çalıştırın

source: Run the Identity service under Apache, instead of using ``keystone-all``.
de: Führen Sie den Identitätsdienst unter Apache aus, anstatt ``keystone-all``zu verwenden.
tr_tr: Kimlik servisini ``keystone-all` yerine Apache altında çalıştırın.

source: Run the cloud related services such as the OpenStack Identity service, the message queuing service, storage, networking, and other services required to support the operation of the cloud.
de: Die Knoten, die die Cloud-bezogenen Dienste wie den OpenStack Identity-Dienst, den Nachrichtenwarteschlangendienst, Speicher, Netzwerk und andere Dienste ausführen, die erforderlich sind, um den Betrieb der Cloud zu unterstützen.
id: Jalankan layanan terkait awan seperti layanan OpenStack Identity, layanan antrean pesan, penyimpanan, jaringan, dan layanan lainnya yang diperlukan untuk mendukung pengoperasian awan.

source: Run the following commands:
de: Führen Sie die folgenden Befehle aus:
id: Jalankan perintah berikut:
tr_tr: Aşağıdaki komutları çalıştırın:

source: Runs on each compute node to manage local virtual switch (vswitch) configuration. The plug-in that you use determine which agents run. This service requires message queue access and depends on the plugin used. *Some plugins like OpenDaylight(ODL) and Open Virtual Network (OVN) do not require any python agents on compute nodes.*
de: Läuft auf jedem Rechenknoten, um die Konfiguration des lokalen virtuellen Switches (vswitch) zu verwalten. Das Plug-In, das Sie verwenden, bestimmt, welche Agenten ausgeführt werden. Dieser Dienst erfordert einen Warteschlangenzugriff und hängt vom verwendeten Plugin ab. *Einige Plugins wie OpenDaylight (ODL) und Open Virtual Network (OVN) benötigen keine Python-Agenten auf Compute-Knoten.*
id: Jalankan pada setiap node untuk mengelola konfigurasi virtual switch (vswitch) lokal. Plug-in yang Anda gunakan menentukan agen mana yang dijalankan. Layanan ini membutuhkan akses antrian pesan dan tergantung pada plugin yang digunakan. *Some plugins like OpenDaylight(ODL) and Open Virtual Network (OVN) do not require any python agents on compute nodes.*
tr_tr: Yerel sanal anahtar (vswitch) yapılandırmasını yönetmek için her hesap düğümünde çalışır. Kullandığınız eklenti hangi aracı çalıştırdığını belirler. Bu servis, ileti kuyruğu erişimini gerektirir ve kullanılan eklentiye bağlıdır. *OpenDaylight (ODL) ve Açık Sanal Ağ (OVN) gibi bazı eklentiler, hesaplama düğümlerinde herhangi bir python aracı gerektirmez.*

source: Runtime verification
de: Runtime Verifizierung
id: Verifikasi runtime
tr_tr: Çalışma zamanı doğrulama

source: SANS Technology Institute, InfoSec Handlers Diary Blog. 2012. `Hacking servers that are turned off <https://isc.sans.edu/diary/IPMI%3A+Hacking+servers+that+are+turned+%22off%22/13399>`__
de: SANS Technology Institute, InfoSec Handler Tagebuch Blog. 2012. `Hacking Server, die ausgeschaltet sind <https://isc.sans.edu/diary/IPMI%3A+Hacking+servers+that+are+turned+%22off%22/13399> `__
tr_tr: SANS Teknoloji Enstitüsü, InfoSec İşleyicileri Günlüğü Bloğu. 2012. `Kapatılmış sunucuları ele geçirmek <https://isc.sans.edu/diary/IPMI%3A+Hacking+servers+that+are+turned+%22off%22/13399>`__

source: SDN services node: Management, guest and possibly public depending upon product used.
de: SDN-Dienste Knoten: Management, Gast und möglicherweise public je nach Produkt verwendet.
id: SDN services node: Management, guest dan mungkin publik tergantung produk yang digunakan.
tr_tr: SDN servisleri düğümü: Yönetim, konuk ve kullanılan ürüne bağlı olarak muhtemelen kamu.

source: SELinux Project, SVirt. 2011. `http://selinuxproject.org/page/SVirt <http://selinuxproject.org/page/SVirt>`_
de: SELinux-Projekt, SVirt. 2011. `http://selinuxproject.org/page/SVirt <http://selinuxproject.org/page/SVirt>`_
tr_tr: SELinux Projesi, SVirt. 2011. `http://selinuxproject.org/page/SVirt <http://selinuxproject.org/page/SVirt>`_

source: SELinux manages user roles. These can be viewed through the ``-Z`` flag, or with the :command:`semanage` command. On the hypervisor, only administrators should be able to access the system, and should have an appropriate context around both the administrative users and any other users that are on the system. For more information, see the `SELinux users documentation <http://selinuxproject.org/page/BasicConcepts#Users>`_.
de: SELinux verwaltet Benutzerrollen. Diese können durch das ``-Z``-Flag angezeigt werden, oder mit dem Befehl :command:`semanage`. Auf dem Hypervisor sollten nur Administratoren in der Lage sein, auf das System zuzugreifen und sollten einen geeigneten Kontext sowohl für die administrativen Benutzer als auch für alle anderen Benutzer haben, die sich auf dem System befinden. Weitere Informationen finden Sie in der `SELinux Benutzerdokumentation <http://selinuxproject.org/page/BasicConcepts#Users>
id: SELinux mengelola peran pengguna. Ini dapat dilihat melalui flag ``-Z``, atau dengan perintah :command: `semanage`. Pada hypervisor, hanya administrator yang harus dapat mengakses sistem, dan harus memiliki konteks yang sesuai di seputar pengguna administratif dan pengguna lain yang berada di sistem. Untuk informasi lebih lanjut, lihat `SELinux users documentation <http://selinuxproject.org/page/BasicConcepts#Users> `_.
tr_tr: SELinux kullanıcı rollerini yönetir. Bunlar ``-Z`` bayrağı veya :command:`semanage` komutu ile görülebilir. Hipervizörde, yalnızca yöneticiler sisteme erişebilir olmalı ve hem yönetici kullanıcılar hem de sistemdeki diğer kullanıcılar için uygun bir bağlam içermelidir. Daha fazla bilgi için, `SELinux kullanıcı belgelerine bakın. <http://selinuxproject.org/page/BasicConcepts#Users>`_.

source: SELinux users and roles
de: SELinux Benutzer und Rollen
id: Pengguna dan peran SELinux
tr_tr: SELinux kullanıcılar ve roller

source: SHA-1 is used here because this is what the TPM chips support.
de: SHA-1 wird hier verwendet, denn das ist es, was die TPM-Chips unterstützen.
id: SHA-1 digunakan disini karena ini adalah apa yang didukung oleh chip TPM.
tr_tr: SHA-1 burada kullanılır, çünkü TPM çipleri bunu destekliyor.

source: SHA-2 (224, 256, 384, or 512 bits)
de: SHA-2 (224, 256, 384 oder 512 Bits)
id: SHA-2 (224, 256, 384, atau 512 bits)
tr_tr: SHA-2 (224, 256, 384, ya da 512 bit)

source: SPICE is supported by the OpenStack Dashboard (horizon) directly on the instance web page. This requires the ``nova-spicehtml5proxy`` service.
de: SPICE wird vom OpenStack Dashboard (Horizont) direkt auf der Instanzwebseite unterstützt. Dies erfordert den ``nova-spicehtml5proxy``Service.
id: SPICE didukung oleh OpenStack Dashboard (horizon) langsung pada halaman web instance. Ini membutuhkan layanan ``nova-spicehtml5proxy``.
tr_tr: SPICE, örnek web sayfasında doğrudan OpenStack Panel (horizon) tarafından desteklenir. Bu, ``nova-spicehtml5proxy`` servisini gerektirir.

source: SSL/TLS on same physical hosts as API endpoints
de: SSL/TLS auf denselben physischen Hosts wie API-Endpunkte
id: SSL/TLS pada host fisik yang sama dengan endpoint API
tr_tr: API uç noktaları ile aynı fiziksel ana makinelerde SSL/TLS

source: SSL/TLS over load balancer
de: SSL/TLS über Loadbalancer
tr_tr: yük dengeleyici üzerinden SSL/TLS

source: SSL/TLS proxy in front
de: SSL/TLS-Proxy vorne
id: Proxy SSL/TLS di depan
tr_tr: Ön taraftaki SSL/TLS vekili

source: Sahara generates and stores several passwords during the course of operation. To harden sahara’s usage of passwords it can be instructed to use an external key manager for storage and retrieval of these secrets. To enable this feature, there must first be an OpenStack Key Manager service deployed within the stack.
de: Sahara erzeugt und speichert während des Betriebs mehrere Passwörter. Um die Verwendung von Passwörtern durch sahara auszuschließen, kann ein externer Schlüsselmanager für das Speichern und Abrufen dieser Geheimnisse verwendet werden. Um diese Funktion zu aktivieren, muss zunächst ein OpenStack Key Manager-Dienst im Stack bereitgestellt werden.
id: Sahara membuat dan menyimpan beberapa password selama operasi berlangsung. Untuk mengeras penggunaan password sahara, hal itu dapat diinstruksikan untuk menggunakan manajer kunci eksternal untuk penyimpanan dan pengambilan kembali rahasia ini. Untuk mengaktifkan fitur ini, pertama-tama harus ada layanan OpenStack Key Manager yang ditempatkan di dalam stack.

source: Sanitize portable, removable storage devices prior to connecting such devices to the cloud infrastructure.
de: Reinigung tragbarer, herausnehmbarer Speichergeräte vor dem Verbinden solcher Geräte mit der Cloud-Infrastruktur.
id: Sanitasi portabel, perangkat penyimpanan yang dapat dilepas sebelum menghubungkan perangkat tersebut ke infrastruktur awan.
tr_tr: Bu tür aygıtları bulut altyapısına bağlamadan önce taşınabilir, çıkarılabilir depolama aygıtlarını temizleyin.

source: Scheduling instances to nodes
de: Planen von Instanzen auf Knoten
id: Penjadwalan instance ke node
tr_tr: Örnekleri düğümlere planlamak

source: Scope reduction helps ensure OpenStack architects establish high quality security controls which are tailored to a particular deployment, however it is paramount to ensure these practices do not omit areas or features from security hardening. A common example is applicable to PCI-DSS guidelines, where payment related infrastructure may be scrutinized for security issues, but supporting services are left ignored, and vulnerable to attack.
de: Die Scope-Reduzierung sorgt dafür, dass OpenStack-Architekten qualitativ hochwertige Sicherheitskontrollen einsetzen, die auf einen bestimmten Einsatz zugeschnitten sind. Allerdings ist es wichtig, dass diese Praktiken keine Bereiche oder Funktionen aus der Security Hardening auslassen. Ein gemeinsames Beispiel gilt für PCI-DSS-Richtlinien, bei denen die Zahlungsverkehrsinfrastruktur für Sicherheitsfragen geprüft werden kann, aber unterstützende Dienste ignoriert und anfällig für Angriffe sind.
id: Pengurangan ruang lingkup membantu memastikan arsitek OpenStack membentuk kontrol keamanan berkualitas tinggi yang disesuaikan dengan penerapan tertentu, namun sangat penting untuk memastikan praktik ini tidak menghilangkan area atau fitur dari pengerasan keamanan. Contoh umum berlaku untuk pedoman PCI-DSS, di mana infrastruktur terkait pembayaran dapat diteliti untuk masalah keamanan, namun layanan pendukung tidak diperhatikan, dan rentan diserang.
tr_tr: Kapsam azaltma, OpenStack mimarlarının belirli bir dağıtıma özel yüksek kaliteli güvenlik denetimleri oluşturmalarını sağlamaya yardımcı olur, ancak bu uygulamaların güvenlik zorlamasından alanlar veya özellikleri ihmal etmemesini sağlamak için önceliklidir. Güvenlikle ilgili konularda ödeme ile ilgili altyapının incelenebileceği, ancak destekleyici hizmetlerin göz ardı edildiği ve saldırıya açık olduğu PCI-DSS yönergelerine genel bir örnek uygulanabilir.

source: Script kiddies
de: Skript Kiddies
tr_tr: Betik bebesi

source: Secret key
de: Geheimer Schlüssel
id: Kunci rahasia (secret key)
tr_tr: Gizli anahtar

source: Secret store back ends
de: Sichere Speicher-Backends

source: Secret store plugins interface with secure storage systems to store the secrets within those systems. There are two types of secret store plugins: the KMIP plugin and the Dogtag plugin.
de: Secret Store-Plugins verbinden sich mit sicheren Speichersystemen, um die Geheimnisse innerhalb dieser Systeme zu speichern. Es gibt zwei Arten von Secret Store Plugins: das KMIP Plugin und das Dogtag Plugin.
id: Plugin penyimpanan rahasia terhubung dengan sistem penyimpanan yang aman untuk menyimpan rahasia di dalam sistem tersebut. Ada dua jenis plugin penyimpanan rahasia: plugin KMIP dan plugin Dogtag.

source: Secrets Management
de: Geheimnisverwaltung
id: Secrets Management (manajemen rahasia)

source: Secrets Management describes a group of technologies that are designed to protect key materials within a software system. Traditionally, key management involves deployment of `Hardware Security Modules (HSM) <https://en.wikipedia.org/wiki/Hardware_security_module/>`_. These devices have been physically hardened against tampering.
de: Geheimnisverwaltet beschreibt eine Gruppe von Technologien, die zum Schutz von Schlüsselmateral innerhalb eines Softwaresystms designt sind. Traditionell ist an der Schlüsselverwaltung die Bereitstellung von `Hardware Security Modules (HSM) <https://en.wikipedia.org/wiki/Hardware_security_module/>`_ beteiligt. Diese Geräte sind gegen Missbrauch physikalisch gehärtet.

source: Secrets that do not require keystone authentication can be stored in any secret store that implements the simple key storage API that is exposed through Castellan. This also includes Barbican.
de: Geheimnisse, die keine Keystone-Authentifizierung erfordern, können in jedem geheimen Speicher gespeichert werden, das die einfache Schlüssel-Speicher-API implementiert, die durch Castellan verfügbar gemacht wird. Dazu gehört auch Barbican.
id: Rahasia yang tidak memerlukan otentikasi keystone dapat disimpan di penyimpanan rahasia manapun yang menerapkan API penyimpanan kunci sederhana yang terpapar melalui Castellan. Ini juga termasuk Barbican.

source: Secrets that require a keystone token should be stored using Barbican.
de: Geheimnisse, die ein Keystone-Token erfordern, sollten mit Barbican gespeichert werden.
id: Rahasia yang membutuhkan keystone token harus disimpan menggunakan Barbican.

source: Secure backup and recovery
de: Sicheres Backup und Wiederherstellung
id: Amankan backup dan recovery
tr_tr: Güvenli yedekleme ve kurtarma

source: Secure bootstrapping
de: Sicheres Bootstrapping
id: Amankan bootstrapping
tr_tr: Güvenli önyükleme

source: Secure communication
de: Sichere Kommunikation
id: Komunikasi yang aman
tr_tr: Güvenli iletişim

source: Secure data erasure
de: Sichere Datenlöschung
id: Mengamankan penghapusan data
tr_tr: Güvenli veri silme

source: Secure reference architectures
de: Sichere Referenzarchitekturen
id: Arsitektur referensi yang aman
tr_tr: Güvenli referans mimarileri

source: Securing OpenStack networking services
de: Sicherung von OpenStack-Netzwerkdiensten
id: Mengamankan layanan jaringan OpenStack
tr_tr: OpenStack ağ servislerini güvenli hale getirmek

source: Securing communications using TLS
de: Sicherung der Kommunikation mit TLS
id: Mengamankan komunikasi dengan menggunakan TLS
tr_tr: İletişimi, TLS ile güvenli hale getirmek

source: Securing proxy services
de: Sicherung von Proxy-Diensten
id: Mengamankan layanan proxy
tr_tr: Vekil servislerini korumak

source: Securing storage services
de: Sicherheitsspeicherdienste
id: Mengamankan layanan penyimpanan
tr_tr: Depolama servislerini korumak

source: Securing the Object Storage service begins with securing the networking component. If you skipped the networking chapter, return to :doc:`networking`.
de: Sichern des Objektspeicherdienstes beginnt mit der Sicherung der Netzwerkkomponente. Wenn Sie das Netzwerk-Kapitel übersprungen haben, kehren Sie zu :doc:`networking` zurück.
id: Mengamankan layanan bject Storage dimulai dengan mengamankan komponen jaringan. Jika Anda melewatkan bab jaringan, kembali ke :doc:`networking`.
tr_tr: Nesne Depolama servisinin güvenliğini sağlamak, ağ bileşenini güvence altına almakla başlar. Ağ bölümünü atladıysanız, şu adrese gidin :doc:`networking`.

source: Security Checklist
de: Sicherheits-Checkliste
id: Daftar periksa keamanan
tr_tr: Güvenlik Kontrol Listesi

source: Security auditing tools
de: Sicherheits-Auditing-Tools
id: Alat audit keamanan
tr_tr: Güvenlik denetim araçları

source: Security auditing tools can complement the configuration management tools. Security auditing tools automate the process of verifying that a large number of security controls are satisfied for a given system configuration. These tools help to bridge the gap from security configuration guidance documentation (for example, the STIG and NSA Guides) to a specific system installation. For example, `SCAP <https://fedorahosted.org/scap-security-guide/>`__ can compare a running system to a pre-defined profile. SCAP outputs a report detailing which controls in the profile were satisfied, which ones failed, and which ones were not checked.
de: Sicherheits-Auditing-Tools können die Konfigurations-Management-Tools ergänzen. Security Auditing-Tools automatisieren den Prozess der Überprüfung, dass eine große Anzahl von Sicherheitskontrollen für eine gegebene Systemkonfiguration erfüllt sind. Diese Werkzeuge helfen, die Lücke von der Sicherheitskonfigurationsanleitung (z. B. die STIG und NSA Guides) zu einer bestimmten Systeminstallation zu überbrücken. Zum Beispiel, `SCAP <https://fedorahosted.org/scap-security-guide/>`__ kann ein laufendes System mit einem vordefinierten Profil vergleichen. SCAP gibt einen Bericht aus, der angibt, welche Kontrollen im Profil erfüllt sind, welche ausgefallen sind und welche nicht überprüft wurden.
id: Alat audit keamanan dapat melengkapi alat manajemen konfigurasi. Alat audit keamanan mengotomatisasi proses verifikasi bahwa sejumlah besar kontrol keamanan terpenuhi untuk konfigurasi sistem yang diberikan. Alat ini membantu menjembatani kesenjangan dari dokumentasi panduan konfigurasi keamanan (misalnya, the STIG and NSA Guides) ke instalasi sistem tertentu. Misalnya, `SCAP <https://fedorahosted.org/scap-security-guide/>`__ dapat membandingkan sistem yang berjalan dengan profil yang telah ditentukan sebelumnya. SCAP mengeluarkan sebuah laporan yang merinci kontrol mana dalam profil yang terpenuhi, mana yang gagal, dan mana yang tidak diperiksa.
tr_tr: Güvenlik denetim araçları yapılandırma yönetim araçlarını tamamlayabilir. Güvenlik denetim araçları, belirli bir sistem yapılandırması için çok sayıda güvenlik denetiminin uygulanmasını doğrulama işlemini otomatikleştirir. Bu araçlar, güvenlik yapılandırma yönergeleri belgelerine (örneğin, STIG ve NSA Kılavuzları) olan boşluğu belirli bir sistem kurulumuna bağlamaya yardımcı olur. Örneğin, `SCAP <https://fedorahosted.org/scap-security-guide/>`__ çalışan bir sistemi önceden tanımlanmış bir profille karşılaştırabilir. SCAP, profildeki hangi kontrollerin, hangilerinin başarısız olduğunu ve hangilerinin kontrol edilmediğini ayrıntılandıran bir rapor çıkarır.

source: Security boundaries and threats
de: Sicherheitsgrenzen und Bedrohungen
id: Batas dan ancaman keamanan
tr_tr: Güvenlik sınırları ve tehditler

source: Security concerns with the Identity service include trust in authentication, the management of authorization tokens, and secure communication.
de: Sicherheitsbedenken mit dem Identity-Dienst umfassen das Vertrauen in die Authentifizierung, die Verwaltung von Autorisierungstoken und die sichere Kommunikation.
id: Masalah keamanan dengan layanan Identity meliputi kepercayaan dalam otentikasi, pengelolaan token otorisasi, dan komunikasi yang aman.

source: Security considerations
de: Sicherheitsüberlegungen
id: Pertimbangan keamanan
tr_tr: Güvenlik hususları

source: Security considerations for block storage are similar to that of object storage.
de: Sicherheitsüberlegungen für Blockspeicher ähneln denen des Objektspeichers.
id: Pertimbangan keamanan untuk penyimpanan blok sama dengan penyimpanan objek.
tr_tr: Blok saklama için güvenlik konuları, nesne depolama alanına benzer.
