Repository: openstack/security-doc
Catalog: security-guide/source/locale/*/LC_MESSAGES/security-guide.po
Languages: de, id, tr_tr

source: Images come from the Image service to the Compute service on a node. This transfer should be protected by running over TLS. Once the image is on the node, it is verified with a basic checksum and then its disk is expanded based on the size of the instance being launched. If, at a later time, the same image is launched with the same instance size on this node, it is launched from the same expanded image. Since this expanded image is not re-verified by default before launching, it is possible that it has undergone tampering. The user would not be aware of tampering, unless a manual inspection of the files is performed in the resulting image.
de: Abbilder kommen vom Image-Service zum Compute-Service auf einem Knoten. Diese Übertragung sollte durch den Betrieb über TLS geschützt werden. Sobald das Abbild auf dem Knoten ist, wird es mit einer grundlegenden Prüfsumme überprüft und dann wird seine Festplatte basierend auf der Größe der Instanz, die gestartet wird, erweitert. Wenn zu einem späteren Zeitpunkt das gleiche Abbild mit der gleichen Instanzgröße auf diesem Knoten gestartet wird, wird es aus dem gleichen erweiterten Abbild gestartet. Da dieses erweiterte Abbild vor dem Start nicht standardmäßig neu verifiziert wird, ist es möglich, dass es sich einer Manipulation unterzogen hat. Der Benutzer würde sich nicht bewusst sein, sich zu manipulieren, es sei denn, eine manuelle Inspektion der Dateien wird in dem resultierenden Abbild durchgeführt.
id: Image berasal dari layanan Image ke layanan Compute pada sebuah simpul. Transfer ini harus dilindungi dengan menjalankan lebih dari TLS. Begitu image ada di simpul, maka diverifikasi dengan checksum dasar dan kemudian disk diperluas berdasarkan ukuran instance yang diluncurkan. Jika, di lain waktu, image yang sama diluncurkan dengan ukuran instance yang sama pada simpul ini, diluncurkan dari image yang sama. Karena image yang diperluas ini tidak diverifikasi ulang secara default sebelum diluncurkan, mungkin saja telah mengalami gangguan. Pengguna tidak akan menyadari adanya gangguan, kecuali jika dilakukan pemeriksaan manual terhadap file yang dihasilkan pada image yang dihasilkan.
tr_tr: İmajlar, imaj servisinden bir düğümdeki Hesaplama servisine gelir. Bu aktarım, TLS üzerinden çalıştırılarak korunmalıdır. İmaj düğümde olduğunda, temel bir sağlama toplamı ile doğrulanır ve ardından diski başlatılacak örnek boyutuna dayalı olarak genişletilir. Daha sonra, aynı görüntü bu düğümde aynı örnek boyutu ile başlatılırsa, aynı genişletilmiş imajdan başlatılır. Bu genişletilmiş imaj başlatılmadan önce varsayılan olarak yeniden doğrulanmadığından, kurcalamaya maruz kalması mümkündür. Elde edilen imajda dosyaların elle incelenmesi yapılmadığı sürece, kullanıcı kurcalamanın farkında değildir.

source: Implementation and operation of security controls
de: Umsetzung und Betrieb von Sicherheitskontrollen
id: Implementasi dan pengoperasian kontrol keamanan
tr_tr: Güvenlik kontrollerinin uygulanması ve çalıştırılması

source: Implementation standard
de: Implementierungsstandard
id: Implementation Standard (standar implementasi)
tr_tr: Uygulama standartı

source: Improves performance of network I/O on hypervisors
de: Verbessert die Leistung von Netzwerk-I/O auf Hypervisoren
id: Meningkatkan kinerja jaringan I/O pada hypervisors
tr_tr: Hipervizörlerdeki ağ G/Ç performansını iyileştirir

source: In *no share servers mode* the Shared File Systems service will assume that the network interfaces through which any shares are exported are already reachable by all tenants.
de: In *no share servers mode* wird der Shared File Systems Service davon ausgehen, dass die Netzwerkschnittstellen, durch die alle Freigaben exportiert werden, bereits von allen Tenants erreichbar sind.
id: Dalam *no share servers mode* layanan Shared File Systems akan mengasumsikan bahwa antarmuka jaringan dimana share yang diekspor sudah dapat dijangkau oleh semua penyewa.
tr_tr: *paylaşım sunucusu yok kipinde* Paylaşımlı Dosya Sistemleri servisi, paylaşımların verildiği ağ arabirimlerinin tüm kiracılar tarafından zaten erişilebilir olduğunu varsayacaktır.

source: In :ref:`share servers <share-servers-vs-no-share-servers>` back-end mode a share driver creates and manages a share server for each share network. This mode can be divided in two variations:
de: In :ref:`share servers <share-servers-vs-no-share-servers>`Back-End-Modus ein Share-Treiber erstellt und verwaltet einen Share-Server für jedes Share-Netzwerk. Dieser Modus kann in zwei Varianten aufgeteilt werden:
id: Di :ref:`share servers <share-servers-vs-no-share-servers>` mode back-end, share driver menciptakan dan mengelola share server untuk setiap jaringan berbagi. Mode ini dapat dibagi dalam dua variasi:
tr_tr: :ref:`paylaşım sunucusu <share-servers-vs-no-paylaşım sunucuları>` arka uç kipi bir paylaşım sürücüsü, her paylaşım ağı için bir paylaşım sunucusu oluşturur ve yönetir. Bu kip iki değişime ayrılabilir:

source: In Newton, the QoS rule ``QosDscpMarkingRule`` was added. This rule marks the Differentiated Service Code Point (DSCP) value in the type of service header on IPv4 (RFC 2474) and traffic class header on IPv6 on all traffic leaving a virtual machine, where the rule is applied. This is a 6-bit header with 21 valid values that denote the drop priority of a packet as it crosses networks should it meet congestion. It can also be used by firewalls to match valid or invalid traffic against its access control list.
de: In Newton wurde die QoS-Regel ``QosDscpMarkingRule``hinzugefügt. Diese Regel markiert den Wert des differenzierten Servicecodepunkts (DSCP) in der Art des Dienstkopfes auf IPv4 (RFC 2474) und Verkehrsklassenüberschrift auf IPv6 auf allen Verkehr, der eine virtuelle Maschine verlässt, wobei die Regel angewendet wird. Dies ist ein 6-Bit-Header mit 21 gültigen Werten, die die Drop-Priorität eines Pakets bezeichnen, da es Netzwerke kreuzt, falls es zu Stauung kommt. Es kann auch von Firewalls verwendet werden, um einen gültigen oder ungültigen Verkehr gegen seine Zugriffssteuerungsliste zu steuern.
id: Di Newton, aturan QoS ``QosDscpMarkingRule`` ditambahkan. Aturan ini menandai nilai Differentialated Service Code Point (DSCP) pada tipe header layanan pada header IPv4 (RFC 2474) dan header kelas lalu lintas pada IPv6 pada semua lalu lintas yang meninggalkan mesin virtual, tempat aturan diterapkan. Ini adalah header 6-bit dengan 21 nilai valid yang menunjukkan prioritas drop dari sebuah paket saat ia melintasi jaringan jika memenuhi kemacetan. Ini juga dapat digunakan oleh firewall untuk mencocokkan lalu lintas yang valid atau tidak benar terhadap daftar kontrol aksesnya (access control list).
tr_tr: Newton'da QoS kuralı `QosDscpMarkingRule`` eklendi. Bu kural, IPv4'deki (RFC 2474) hizmet başlığı türüne Ayrılmış Hizmet Kodu Noktası (DSCP) değerini ve kuralın uygulandığı bir sanal makine bırakan tüm trafikteki IPv6 üzerindeki trafik sınıfı üst bilgisini işaretler. Bu, tıkanıklığı gidermek durumunda ağları geçtiği için bir paketin bırakma önceliğini belirten 21 geçerli değer içeren 6 bitlik bir başlıktır. Geçerli veya geçersiz trafiği erişim kontrol listesine uydurmak için güvenlik duvarları tarafından da kullanılabilir.

source: In ``/etc/swift``, on every node, there is a ``swift_hash_path_prefix`` setting and a ``swift_hash_path_suffix`` setting. These are provided to reduce the chance of hash collisions for objects being stored and avert one user overwriting the data of another user.
de: In ``/etc/swift``, auf jedem Knoten gibt es eine `` swift_hash_path_prefix``Einstellung und eine ``swift_hash_path_suffix`` Einstellung. Diese werden bereitgestellt, um die Wahrscheinlichkeit von Hash-Kollisionen für Objekte, die gespeichert werden, zu verringern und einen Benutzer zu überschreiben, der die Daten eines anderen Benutzers überschreibt.
id: Di ``/etc/swift``, pada setiap simpul, ada pengaturan ``swift_hash_path_prefix`` dan pengaturan ``swift_hash_path_suffix``. Ini disediakan untuk mengurangi kemungkinan benturan hash untuk objek yang disimpan dan mencegah satu pengguna menimpa data pengguna lain.
tr_tr: ``/etc/swift`` dosyasında, her düğümde bir ``swift_hash_path_prefix`` ve bir ``swift_hash_path_suffix`` ayarı vardır. Bunlar, depolanan nesneler için özet çarpışma ihtimalini azaltmak ve bir kullanıcının başka bir kullanıcının verilerini üzerine yazmasını önlemek için sağlanmıştır.

source: In a cloud environment, users work with either pre-installed images or images they upload themselves. In both cases, users should be able to ensure the image they are utilizing has not been tampered with. The ability to verify images is a fundamental imperative for security. A chain of trust is needed from the source of the image to the destination where it's used. This can be accomplished by signing images obtained from trusted sources and by verifying the signature prior to use. Various ways to obtain and create verified images will be discussed below, followed by a description of the image signature verification feature.
de: In einer Cloud-Umgebung arbeiten die Benutzer entweder mit vorinstallierten Abbildern oder Abbildern, die sie selbst hochladen. In beiden Fällen sollten die Benutzer in der Lage sein, sicherzustellen, dass das Abbild, das sie nutzen, nicht manipuliert wurde. Die Fähigkeit, Abbilder zu verifizieren, ist ein wesentlicher Imperativ für die Sicherheit. Eine Kette von Vertrauen wird von der Quelle des Abbildes an das Ziel benötigt, wo es verwendet wird. Dies kann durch das Signieren von Abbildern, die aus vertrauenswürdigen Quellen erhalten wurden, und durch Verifizieren der Signatur vor der Verwendung erreicht werden. Verschiedene Wege zum Erhalten und Erstellen von verifizierten Abbildern werden nachfolgend beschrieben, gefolgt von einer Beschreibung der Abbildsignatur-Bestätigungsfunktion.
id: Di lingkungan awan, pengguna bekerja dengan image atau image pra-instal yang mereka upload sendiri. Dalam kedua kasus tersebut, pengguna harus dapat memastikan image yang mereka gunakan belum dirusak. Kemampuan untuk memverifikasi image adalah keharusan mendasar untuk keamanan. Sebuah rantai kepercayaan dibutuhkan dari sumber image ke tempat tujuan penggunaannya. Hal ini dapat dilakukan dengan menandatangani image yang diperoleh dari sumber terpercaya dan dengan memverifikasi tanda tangan sebelum digunakan. Berbagai cara untuk mendapatkan dan membuat image terverifikasi akan dibahas di bawah ini, disusul dengan deskripsi fitur verifikasi tanda tangan image.
tr_tr: Bulut ortamında, kullanıcılar önceden yüklenmiş imajlarla veya kendilerinin yüklediği imajlarla çalışır. Her iki durumda da, kullanıcılar kullandıkları imajın bozulmadığından emin olmalıdır. İmajların doğrulama özelliği, güvenlik için temel bir zorunluluktur. İmajın kaynağından kullanıldığı yere bir güven zincirine ihtiyaç vardır. Bu, güvenilir kaynaklardan elde edilen imzalayarak ve imza kullanımdan önce doğrulanarak gerçekleştirilebilir. Doğrulanmış imajlar elde etmek ve oluşturmak için çeşitli yollar aşağıda izah edilecek ve ardından görüntü imza doğrulama özelliğinin bir açıklaması gelecektir.

source: In a typical deployment all traffic transmitted over public networks is secured, but security best practice dictates that internal traffic must also be secured. It is insufficient to rely on security domain separation for protection. If an attacker gains access to the hypervisor or host resources, compromises an API endpoint, or any other service, they must not be able to easily inject or capture messages, commands, or otherwise affect the management capabilities of the cloud.
de: In einer typischen Bereitstellung ist der gesamte über die öffentlichen Netze übertragene Verkehr gesichert, aber die Best Practice der Sicherheit bestimmt, dass der interne Verkehr auch gesichert werden muss. Es genügt nicht, sich auf die Sicherheitsdomänen-Trennung für den Schutz zu verlassen. Wenn ein Angreifer Zugang zu den Hypervisor- oder Host-Ressourcen erhält, kompromittiert er einen API-Endpunkt oder einen anderen Dienst, so dass sie nicht in der Lage sind, Nachrichten, Befehle oder sonstige Auswirkungen auf die Verwaltungsfunktionen der Cloud zu erfassen oder zu erfassen.
id: Dalam penyebaran yang khas, semua lalu lintas yang dikirim melalui jaringan publik dijamin, namun praktik keamanan terbaik menentukan bahwa lalu lintas internal juga harus diamankan. Tidak cukup mengandalkan pemisahan domain keamanan untuk perlindungan. Jika penyerang memperoleh akses ke hypervisor atau sumber daya host, kompromi API endpoint, atau layanan lainnya, mereka tidak boleh dapat dengan mudah menyuntikkan atau menangkap pesan, perintah, atau mempengaruhi kemampuan pengelolaan awan.
tr_tr: Tipik bir dağıtımda, kamuya açık ağlar üzerinden iletilen tüm trafik güvenlidir, ancak en iyi güvenlik prensibi, dahili trafiğin de güvence altına alınması gerektiğini belirtir. Koruma için güvenlik bölgesi ayrımına güvenmek yetersizdir. Bir saldırgan, bir hipervizöre veya sunucu kaynaklarına erişir, bir API uç noktasını veya başka herhangi bir servise erişirse, bulutların kolayca yönetim komutlarını, iletilerini, komutlarını veya enformasyonlarını yakalayamamalı veya bulamamamalıdır.

source: In addition to restricting database communications to the management network, we also strongly recommend that the cloud administrator configure their database back end to require TLS. Using TLS for the database client connections protects the communications from tampering and eavesdropping. As will be discussed in the next section, using TLS also provides the framework for doing database user authentication through X.509 certificates (commonly referred to as PKI). Below is guidance on how TLS is typically configured for the two popular database back ends MySQL and PostgreSQL.
de: Neben der Beschränkung der Datenbankkommunikation auf das Management-Netzwerk empfehlen wir auch dringend, dass der Cloud-Administrator sein Datenbank-Backend konfiguriert, um TLS anzufordern. Die Verwendung von TLS für die Datenbank-Client-Verbindungen schützt die Kommunikation vor Manipulation und Abhören. Wie im nächsten Abschnitt diskutiert wird, bietet TLS auch das Framework für die Datenbankbenutzerauthentifizierung über X.509-Zertifikate (allgemein als PKI bezeichnet). Im Folgenden finden Sie Anleitungen, wie TLS in der Regel für die beiden populären Datenbank-Backends MySQL und PostgreSQL konfiguriert ist.
id: Selain membatasi komunikasi database ke jaringan manajemen, kami juga sangat menyarankan administrator awan untuk mengkonfigurasi database mereka agar memerlukan TLS. Menggunakan TLS untuk koneksi klien basis data melindungi komunikasi dari gangguan dan penyadapan. Seperti yang akan dibahas pada bagian selanjutnya, dengan menggunakan TLS juga menyediakan framework untuk melakukan otentikasi pengguna database melalui sertifikat X.509 (biasa disebut PKI). Berikut adalah panduan tentang bagaimana TLS biasanya dikonfigurasi untuk dua database populer yang berakhir dengan MySQL dan PostgreSQL.
tr_tr: Yönetim ağına veritabanı iletişimi kısıtlamanın yanı sıra, bulut yöneticisinin, veritabanının arka uçını TLS'yi gerektirmesi için yapılandırmasını şiddetle tavsiye ederiz. Veritabanı istemci bağlantıları için TLS'i kullanmak, iletişimi kurcalamaya ve dinlemeye karşı korur. Bir sonraki bölümde tartışılacak olan TLS'in kullanılması, X.509 sertifikaları (genellikle PKI olarak anılacaktır) aracılığıyla veritabanı kullanıcı kimlik doğrulaması yapmak için bir çatı sunmaktadır. Aşağıda, TLS'nin genel olarak iki popüler veritabanı arka uç MySQL ve PostgreSQL için yapılandırıldığı konusunda rehberlik etmektedir.

source: In addition to validating a technologies capabilities, the Common Criteria process evaluates how technologies are developed.
de: Neben der Validierung von Technologie-Fähigkeiten bewertet das Common Criteria-Verfahren, wie Technologien entwickelt werden.
id: Selain memvalidasi kemampuan teknologi, proses Common Criteria mengevaluasi bagaimana teknologi dikembangkan.
tr_tr: Bir teknolojilerin yeteneklerini doğrulamaya ek olarak, Yaygın Kıstas süreci, teknolojilerin nasıl geliştirildiğini değerlendirir.

source: In addition, it is useful to examine account activity for unusual login times and suspicious actions, and take corrective actions such as disabling the account. Oftentimes this approach is taken by credit card providers for fraud detection and alert.
de: Darüber hinaus ist es sinnvoll, die Kontoaktivität für ungewöhnliche Anmeldezeiten und verdächtige Aktionen zu prüfen und Korrekturmaßnahmen wie das Deaktivieren des Kontos zu ergreifen. Oftmals wird dieser Ansatz von Kreditkartenanbietern für Betrugserkennung und Alarmierung genommen.
id: Selain itu, hal itu berguna untuk memeriksa aktivitas akun untuk waktu masuk yang tidak biasa dan tindakan mencurigakan, dan melakukan tindakan perbaikan seperti menonaktifkan akun. Seringkali pendekatan ini diambil oleh penyedia kartu kredit untuk deteksi dan kewaspadaan penipuan.
tr_tr: Buna ek olarak, olağandışı giriş saatleri ve şüpheli eylemler için hesap etkinliğini incelemek ve hesabı devre dışı bırakmak gibi düzeltici önlemler almak yararlı olacaktır. Çoğu zaman bu yaklaşım dolandırıcılık algılama ve uyarı için kredi kartı sağlayıcıları tarafından alınmaktadır.

source: In an OpenStack deployment you will need to address the following:
de: In einer OpenStack-Bereitstellung müssen Sie Folgendes ansprechen:
id: Dalam penyebaran OpenStack Anda harus mengatasi hal berikut:
tr_tr: Bir OpenStack dağıtımında aşağıdakileri ele almanız gerekecek:

source: In an Openstack context, there are two types of secrets that need to be managed - those that require a keystone token for access, and those that do not.
de: In einem Openstack-Kontext gibt es zwei Arten von Geheimnissen, die verwaltet werden müssen: diejenigen, die ein Keystone-Token für den Zugriff erfordern, und solche, die dies nicht tun.
id: Dalam konteks Openstack, ada dua jenis rahasia yang perlu dikelola - yang memerlukan token keystone untuk akses, dan yang tidak.

source: In both cases, all servers that are storing tokens need a shared back end. This means either that both point to the same database server, or both point to a common memcached instance.
de: In beiden Fällen benötigen alle Server, die Token speichern, ein gemeinsames Backend. Dies bedeutet entweder, dass beide auf denselben Datenbankserver verweisen oder beide auf eine gemeinsame Memcached-Instanz verweisen.
tr_tr: Her iki durumda da belirteçleri depolayan tüm sunucular paylaşılan bir arka uça ihtiyaç duyar. Bunun anlamı, her ikisinin de aynı veritabanı sunucusuna işaret etmesi veya her ikisinin de ortak memcached örneği göstermesi anlamına gelmektedir.

source: In cases where a security review has already been performed by a third party, or where a project prefers to use a third party to perform their review, information on how to take the output of that third party review and submit it to the OSSP for validation will be available in the upcoming third party security review process.
de: In Fällen, in denen eine Sicherheitsüberprüfung bereits von einem Dritten durchgeführt wurde oder wenn ein Projekt es vorzieht, einen Dritten zur Durchführung seiner Überprüfung zu verwenden, Informationen darüber, wie die Ausgabe dieser Drittpartei überprüft werden kann, und übermittelt sie dem OSSP zur Validierung wird in der bevorstehenden Drittanbieter-Sicherheitsprüfung zur Verfügung stehen.
id: Dalam kasus di mana review keamanan telah dilakukan oleh pihak ketiga, atau bila sebuah proyek lebih suka menggunakan pihak ketiga untuk melakukan review mereka, informasi tentang bagaimana mengambil hasil dari review pihak ketiga tersebut dan menyerahkannya kepada OSSP untuk validasi akan tersedia dalam proses pemeriksaan keamanan pihak ketiga yang akan datang.
tr_tr: Bir güvenlik incelemesinin üçüncü bir taraf tarafından daha önce yapıldığı veya bir projenin incelemesini yapmak için üçüncü bir tarafı tercih etmesi durumunda, söz konusu üçüncü taraf incelemesinin çıktısını alma ve doğrulama için OSSP'ye sunma hakkında bilgi yaklaşmakta olan üçüncü parti güvenlik inceleme sürecinde kullanıma sunulacaktır.

source: In cases where software termination offers insufficient performance, hardware accelerators may be worth exploring as an alternative option. It is important to be mindful of the size of requests that will be processed by any chosen TLS proxy.
de: In Fällen, in denen Software-Terminierung unzureichende Leistung bietet, können Hardware-Beschleuniger sich als eine alternative Option erweisen. Es ist wichtig, auf die Größe der Anfragen geachtet werden muss, die von einem ausgewählten TLS-Proxy verarbeitet werden.
id: Dalam kasus di mana penghentian perangkat lunak menawarkan kinerja yang tidak mencukupi, akselerator perangkat keras mungkin perlu ditelusuri sebagai opsi alternatif. Penting untuk memperhatikan ukuran permintaan yang akan diproses oleh proxy TLS yang dipilih.
tr_tr: Yazılımın sonlandırmasının performansı yetersiz olduğu durumlarda, donanım hızlandırıcıları alternatif bir seçenek olarak keşfedilmeye değer olabilir. Seçilen herhangi bir TLS vekil tarafından işlenecek isteklerin boyutunu göz önünde bulundurmak önemlidir.

source: In either case, the requirements for documentation artefacts are similar - the project must provide an architecture diagram for a best practise deployment. Vulnerability scans and static analysis scans are not sufficient evidence for a third party review, although they are strongly recommended as part of the development cycle for all teams.
de: In beiden Fällen sind die Anforderungen an Dokumentations-Artefakte ähnlich - das Projekt muss ein Architektur-Diagramm für eine Best-Practice-Bereitstellung bieten. Schwachstellen-Scans und statische Analysen-Scans sind keine ausreichenden Beweise für eine Überprüfung durch Dritte, obwohl sie im Rahmen des Entwicklungszyklus für alle Teams dringend empfohlen werden.
id: Bagaimanapun, persyaratan untuk artefak dokumentasi serupa - proyek harus menyediakan diagram arsitektur untuk penerapan praktik terbaik. Pemindaian kerentanan dan analisis analisis statis bukanlah bukti yang cukup untuk tinjauan pihak ketiga, walaupun mereka sangat disarankan sebagai bagian dari siklus pengembangan untuk semua tim.
tr_tr: Her iki durumda da, belgelendirme için şartlar benzerdir - proje, en iyi uygulama yerleştirmesi için bir mimari diyagram sağlamalıdır. Güvenlik açığı taraması ve statik analiz taramaları üçüncü şahısların incelemesine yeterli delil değildir, ancak tüm takımlar için geliştirme döngüsünün bir parçası olarak şiddetle tavsiye edilir.
