Repository: openstack/security-doc
Catalog: security-guide/source/locale/*/LC_MESSAGES/security-guide.po
Languages: de, id, tr_tr

source: Nova-conductor receives requests over RPC and performs actions on behalf of the calling service without granting granular access to the database, its tables, or data within. Nova-conductor essentially abstracts direct database access away from compute nodes.
de: Nova-Conductor empfängt Anfragen über RPC und führt Aktionen im Auftrag des anrufenden Dienstes durch, ohne einen granularen Zugriff auf die Datenbank, ihre Tabellen oder Daten innerhalb zu gewähren. Nova-Conductor abstrahiert im Wesentlichen den direkten Datenbankzugriff von Compute-Knoten.
id: Nova-conductor menerima permintaan di atas RPC dan melakukan tindakan atas nama layanan panggilan tanpa memberikan akses terperinci ke database, tabel, atau data di dalamnya. Nova-konduktor pada dasarnya abstrak akses database langsung dari node komputasi.
tr_tr: Nova-conductor, RPC üzerinden istek alır ve veritabanına, tablolarına veya içindeki verilere ayrıntılı erişim vermeden çağıran servis adına eylemler gerçekleştirir. Nova-conductor, esasen doğrudan veritabanı erişimini hesaplama düğümlerinden uzaklaştırır.

source: Now that the Identity Provider and Identity service are communicating, you can start to configure the ``OS-FEDERATION`` extension.
de: Nun, da der Identity Provider und Identity Service kommunizieren, können Sie beginnen, die ``OS-FEDERATION``Erweiterung zu konfigurieren.
tr_tr: Kimlik Sağlayıcı ve Kimlik servisi iletişim kurduğundan, ``OS-FEDERATION`` uzantısını yapılandırmaya başlayabilirsiniz.

source: Now we can mount a share on the host with IP address ``10.254.0.4`` and have ``rw`` permissions to the share:
de: Jetzt können wir eine Freigabe auf dem Host mit IP-Adresse ``10.254.0.4`` einhängen und haben ``rw``Berechtigungen an der Freigabe:
id: Sekarang kita bisa me-mount share di host dengan alamat IP ``10.254.0.4`` dan memiliki permission ``rw`` untuk share:
tr_tr: Şimdi makinede ``10.254.0.4`` IP adresine sahip bir paylaşım kurabilir ve paylaşıma ``rw`` izinleri verebiliriz:

source: Number of hours running instances or storing data
de: Anzahl der Stunden, die Instanzen ausführen oder Daten speichern
id: Jumlah jam instance yang sedang berjalan atau menyimpan data
tr_tr: Çalışan örnekler ve saklanan veri için çalışma saati

source: Number or size of running instances, buckets, objects, volumes, and other quota-related items
de: Anzahl oder Größe von laufenden Instanzen, Buckets, Objekten, Datenträger und anderen kontingentbezogenen Posten
id: Jumlah atau ukuran instance yang sedang berjalan, buckets, objek, volume, dan barang terkait kuota lainnya
tr_tr: Çalışan örneklerin, kovaların, nesnelerin, hacimlerin ve kota ile ilgili diğer öğelerin sayısı veya boyutu

source: Numerous OpenStack services maintain data and metadata belonging to tenants or reference tenant information.
de: Zahlreiche OpenStack-Dienste pflegen Daten und Metadaten von Tenantn oder Referenzmieterinformationen.
id: Sejumlah layanan OpenStack menjaga data dan metadata milik penyewa atau informasi penyewa referensi.
tr_tr: Birçok OpenStack servisi, kiracılar veya referans kiracı bilgileri için veri ve metaverileri korur.

source: Object Content-Type values
de: Objekt Inhalt-Typ Werte
tr_tr: Nesne Content-Type değerleri

source: Object Service
de: Objektdienst
tr_tr: Nesne Servisi

source: Object Storage
de: Objektspeicher
tr_tr: Nesne Depolama

source: Object Storage (swift) supports the optional encryption of object data at rest on storage nodes. The encryption of object data is intended to mitigate the risk of users’ data being read if an unauthorized party were to gain physical access to a disk.
de: Object Storage (swift) unterstützt die optionale Verschlüsselung von Objektdaten in Ruhe auf Speicherknoten. Die Verschlüsselung von Objektdaten soll das Risiko verringern, dass Benutzerdaten gelesen werden, wenn eine nicht autorisierte Partei physischen Zugriff auf eine Festplatte erhalten würde.
id: Object Storage (swift) mendukung enkripsi opsional data objek saat istirahat pada node penyimpanan. Enkripsi data objek dimaksudkan untuk mengurangi risiko data pengguna dibaca jika pihak yang tidak berwenang memperoleh akses fisik ke disk.
tr_tr: Nesne Depolama (swift), depolama düğümlerinde istirahat durumunda nesne verisinin isteğe bağlı şifrelemesini destekler. Nesne verisinin şifrelenmesi, bir yetkisiz tarafın bir diske fiziksel olarak erişmesi durumunda, kullanıcıların verilerinin okunması riskini azaltmak için tasarlanmıştır.

source: Object Storage account terminology
de: Objektspeicher-Konto-Terminologie
id: Terminologi akun Object Storage
tr_tr: Nesne Depolama hesabı terminolojisi

source: Object Storage authentication
de: Objektspeicher-Authentifizierung
id: Otentikasi Object Storage
tr_tr: Nesne Depolama kimlik doğrulama

source: Object Storage comes with two authentication middleware modules by default, either of which can be used as sample code for developing a custom authentication middleware.
de: Object Storage kommt standardmäßig mit zwei Authentifizierungs-Middleware-Modulen, von denen jeder als Beispielcode für die Entwicklung einer benutzerdefinierten Authentifizierungs-Middleware verwendet werden kann.
id: Object Storage dilengkapi dengan dua modul middleware otentikasi secara default, salah satunya dapat digunakan sebagai kode contoh untuk mengembangkan middleware otentikasi kustom.
tr_tr: Nesne Depolama, varsayılan olarak iki kimlik doğrulama katman modülü ile birlikte gelir; bunların ikisi de, özel bir kimlik doğrulama katmanı geliştirilmesi için örnek kod olarak kullanılabilir.

source: Object Storage does not employ encryption or authentication with inter-node communications. This is why you see a private switch or private network ([V]LAN) in the architecture diagrams. This data domain should be separate from other OpenStack data networks as well. For further discussion on security domains please see :doc:`introduction/security-boundaries-and-threats`.
de: Object Storage verwendet keine Verschlüsselung oder Authentifizierung mit Inter-Knoten-Kommunikation. Aus diesem Grund sehen Sie in den Architekturdiagrammen einen privaten Switch oder ein privates Netzwerk ([V] LAN). Diese Datendomäne sollte auch von anderen OpenStack-Datennetzen getrennt sein. Für weitere Diskussionen über Sicherheitsdomänen siehe :doc:`introduction/security-boundaries-and-threats`.
id: Object Storage tidak menggunakan enkripsi atau otentikasi dengan komunikasi antar node. Inilah sebabnya mengapa Anda melihat private switch atau private network ([V] LAN) dalam diagram arsitektur. Data domain ini harus terpisah dari jaringan data OpenStack lainnya. Untuk pembahasan lebih lanjut tentang domain keamanan silahkan lihat :doc:`introduction/security-boundaries-and-threats`.
tr_tr: Nesne Depolama, düğümler arası iletişimle şifreleme veya kimlik doğrulama kullanmaz. Bu nedenle mimari diyagramlarında özel bir anahtar veya özel ağ ([V]LAN) görüyorsunuz. Bu veri alanı diğer OpenStack veri ağlarından da ayrı olmalıdır. Güvenlik alanlarıyla ilgili daha fazla tartışma için bkz. :doc:`introduction/security-boundaries-and-threats`.

source: Object Storage network architecture with a management node (OSAM)
de: Objekt Storage Netzwerkarchitektur mit einem Managementknoten (OSAM)
tr_tr: Bir yönetim düğümü ile Nesne Depolama ağ mimarisi (OSAM)

source: Object Storage objects
de: Objekt Speicherobjekte
tr_tr: Nesne Depolama nesneleri

source: Object Storage uses a WSGI model to provide for a middleware capability that not only provides general extensibility, but is also used for authentication of end-point clients. The authentication provider defines what roles and user types exist. Some use traditional user name and password credentials, while others may leverage API key tokens or even client-side x.509 certificates. Custom providers can be integrated in using custom middleware.
de: Object Storage verwendet ein WSGI-Modell, um eine Middleware-Fähigkeit bereitzustellen, die nicht nur eine allgemeine Erweiterbarkeit bietet, sondern auch für die Authentifizierung von Endpunkt-Clients verwendet wird. Der Authentifizierungsanbieter legt fest, welche Rollen und Benutzertypen vorhanden sind. Einige verwenden traditionelle Benutzernamen und Kennwort-Anmeldeinformationen, während andere API-Schlüssel-Token oder sogar clientseitige x.509-Zertifikate verwenden können. Benutzerdefinierte Anbieter können in benutzerdefinierte Middleware integriert werden.
id: Object Storage menggunakan model WSGI untuk menyediakan kemampuan middleware yang tidak hanya menyediakan perluasan secara umum, namun juga digunakan untuk otentikasi klien end-point. Penyedia otentikasi menentukan peran dan jenis pengguna yang ada. Beberapa menggunakan nama pengguna dan kredensial kata kunci tradisional, sementara yang lain mungkin memanfaatkan token kunci API atau sertifikat x.509 sisi klien. Penyedia kustom dapat diintegrasikan dalam menggunakan middleware kustom.
tr_tr: Nesne Depolama Alanı, yalnızca genel genişletilebilirlik sağlamakla kalmaz, aynı zamanda son nokta istemcilerinin kimlik doğrulamasında kullanılan bir katman aracı yeteneği sağlamak için WSGI modelini kullanır. Kimlik doğrulama sağlayıcısı, hangi rollerin ve kullanıcı türlerinin bulunduğunu tanımlar. Bazıları geleneksel kullanıcı adı ve parola kimlik bilgilerini kullanırken, bazıları API anahtar belirteclerinden ve hatta istemci tarafında x.509 sertifikalarından yararlanabilir. Özel sağlayıcılar, özel katman kullanarak entegre edilebilir.

source: Object content. For example, the content of an object PUT request’s body
de: Objektinhalt Zum Beispiel der Inhalt eines Objekts PUT Anforderung der Körper
id: Isi objek. Misalnya, isi dari objek PUT request body
tr_tr: Nesne içeriği. Örneğin, bir nesnenin PUT isteğinin gövdesinin içeriği

source: Object security should focus on access control and encryption of data in transit and at rest. Other concerns might relate to system abuse, illegal or malicious content storage, and cross-authentication attack vectors.
de: Objektsicherheit sollte sich auf die Zugriffskontrolle und die Verschlüsselung von Daten im Transit und in Ruhe konzentrieren. Andere Bedenken können sich auf Systemmissbrauch, illegale oder böswillige Inhalte speichern und Cross-Authentifizierungs-Angriffsvektoren kreuzen.
id: Keamanan objek harus fokus pada kontrol akses dan enkripsi data saat transit dan saat istirahat. Masalah lainnya mungkin terkait dengan penyalahgunaan sistem, penyimpanan konten ilegal atau berbahaya, dan vektor serangan cross-authentication.

source: Object service
de: Objekt-Dienst
id: Layanan Object
tr_tr: Nesne servisi

source: Object size
de: Objektgröße
tr_tr: Nesne boyutu

source: Objectives
de: Ziele
id: Tujuan
tr_tr: Hedefler

source: Often overlooked is the need for key management for SSH hosts. As most or all hosts in an OpenStack deployment will provide an SSH service, it is important to have confidence in connections to these hosts. It cannot be understated that failing to provide a reasonably secure and accessible method to verify SSH host key fingerprints is ripe for abuse and exploitation.
de: Oft übersehen ist die Notwendigkeit für die Schlüsselverwaltung für SSH-Hosts. Da die meisten oder alle Hosts in einer OpenStack-Bereitstellung einen SSH-Dienst bereitstellen, ist es wichtig, Vertrauen in Verbindungen zu diesen Hosts zu haben. Es kann nicht unterschätzt werden, dass es nicht möglich ist, eine vernünftig sichere und zugängliche Methode zur Verfügung zu stellen, um zu bestätigen, dass SSH-Host-Key-Fingerabdrücke für Missbrauch und Ausbeutung reif sind.
id: Sering diabaikan adalah kebutuhan akan manajemen kunci untuk host SSH. Karena kebanyakan atau semua host dalam penyebaran OpenStack akan menyediakan layanan SSH, penting untuk memiliki kepercayaan dalam koneksi ke host ini. Tidak dapat dipungkiri bahwa gagal menyediakan metode yang cukup aman dan mudah diakses untuk memverifikasi sidik jari utama host SSH (SSH host key fingerprint) menjadi rentan untuk penyalahgunaan dan eksploitasi.
tr_tr: Sık sık göz ardı edilen SSH sunucular için anahtar yönetimi gereğidir. Bir OpenStack dağıtımında bulunan sunucuların çoğu veya tümü bir SSH hizmeti sağlayacağından, bu sunuculara olan bağlantılara güvenmeniz önemlidir. SSH sunucusunun anahtar parmak izlerini doğrulamak için makul derecede güvenli ve erişilebilir bir yöntem sağlamamak, istismar ve suistimal için uygun bir ortam yarattığından küçümsenmemeli.

source: Often, data encryption relates positively to the ability to reliably destroy tenant and per-instance data, simply by throwing away the keys. It should be noted that in doing so, it becomes of great importance to destroy those keys in a reliable and secure manner.
de: Häufig bezieht sich die Datenverschlüsselung positiv auf die Fähigkeit, Tenant und Instanzdaten zuverlässig zu zerstören, indem man einfach die Schlüssel wegwirft. Es ist anzumerken, dass es dabei von großer Wichtigkeit ist, diese Schlüssel zuverlässig und sicher zu zerstören.
id: Seringkali, enkripsi data berhubungan secara positif dengan kemampuan untuk menghancurkan data penyewa dan per-instance dengan mudah, cukup dengan membuang kunci. Perlu dicatat bahwa dengan berbuat demikian, menjadi sangat penting untuk menghancurkan kunci tersebut dengan cara yang andal dan aman.
tr_tr: Genellikle, veri şifreleme, yalnızca anahtarları atarak, kiracı ve örnek verileri güvenilir bir şekilde yok etme yeteneğiyle ilgilidir. Bunu yaparken, bu anahtarları güvenilir ve güvenli bir şekilde yok etmek büyük önem taşımaktadır.

source: On Linux virtual machines, the application profile above can be used in conjunction with a tool like `audit2allow <http://wiki.centos.org/HowTos/SELinux#head-faa96b3fdd922004cdb988c1989e56191c257c01>`_ to build an SELinux policy that will further protect sensitive system information on most Linux distributions. SELinux uses a combination of users, policies and security contexts to compartmentalize the resources needed for an application to run, and segmenting it from other system resources that are not needed.
de: Auf Linux virtuellen Maschinen kann das oben beschriebene Anwendungsprofil in Verbindung mit einem Tool wie `audit2all` verwendet werden <http://wiki.centos.org/HowTos/SELinux#head-faa96b3fdd922004cdb988c1989e56191c257c01>`_, um eine SELinux-Policy aufzubauen, die sensible Systeminformationen auf den meisten Linux-Distributionen weiter schützt. SELinux nutzt eine Kombination von Benutzern, Richtlinien und Sicherheitskontexten, um die Ressourcen zu kompilieren, die für eine Anwendung erforderlich sind, um sie auszuführen und sie von anderen Systemressourcen zu segmentieren, die nicht benötigt werden.
id: Pada mesin virtual Linux, profil aplikasi di atas bisa digunakan bersamaan dengan tool seperti `audit2allow <http://wiki.centos.org/HowTos/SELinux#head-faa96b3fdd922004cdb988c1989e56191c257c01>`_ untuk membangun sebuah kebijakan SELinux yang selanjutnya akan melindungi informasi sistem yang sensitif pada sebagian besar distribusi Linux. SELinux menggunakan kombinasi antara pengguna, kebijakan dan konteks keamanan untuk mengelompokkan sumber daya yang dibutuhkan agar aplikasi dapat berjalan, dan melakukan segmentasi dari sumber daya sistem lain yang tidak diperlukan.
tr_tr: Linux sanal makinelerinde, yukarıdaki uygulama profili, daha da koruyacak bir SELinux politikası oluşturmak için çoğu Linux dağıtımında hassas sistem bilgileri korumak için `audit2allow <http://wiki.centos.org/HowTos/SELinux#head-faa96b3fdd922004cdb988c1989e56191c257c01>` gibi bir araçla birlikte kullanılabilir. SELinux, bir uygulamanın çalışması için gerekli kaynakları bölümlemek ve ihtiyaç duyulmayan diğer sistem kaynaklarından ayırmak için kullanıcıların, ilkelerin ve güvenlik bağlamlarının bir kombinasyonunu kullanır.

source: On the RabbitMQ server, delete the default ``guest`` user:
de: Auf dem RabbitMQ Server löschen Sie den Standard ``guest``Benutzer:
id: Di server RabbitMQ, hapus pengguna ``guest`` default:
tr_tr: RabbitMQ sunucusunda, öntanımlı ``guest`` kullanıcısını silin:

source: On the RabbitMQ server, for each OpenStack service or node that communicates with the message queue set up user accounts and privileges:
de: Auf dem RabbitMQ-Server für jeden OpenStack-Dienst oder -Knoten, der mit der Nachrichtenwarteschlange kommuniziert, werden Benutzerkonten und Berechtigungen eingerichtet:
id: Di server RabbitMQ, untuk setiap layanan atau simpul OpenStack yang berkomunikasi dengan antrian pesan, siapkan akun pengguna dan hak istimewa (privileges):
tr_tr: RabbitMQ sunucusunda, mesaj sırası ile iletişim kuran her OpenStack servisi veya düğüm için kullanıcı hesaplarını ve ayrıcalıkları ayarlayın:

source: On the VM, send some text to the newly attached volume and synchronize it:
de: Auf der VM senden Sie einen Text an das neu angeschlossene Volume und synchronisieren Sie es:
id: Di VM, kirim beberapa teks ke volume yang baru dilampirkan dan sinkronkan:
tr_tr: Sanal makinede, yeni bağlanmış hacime metin gönder ve onu senkronize et:

source: On the image below you can see how different parts of the Shared File System service interact with each other.
de: Auf dem Bild unten sehen Sie, wie verschiedene Teile des Shared File System Service miteinander interagieren.
id: Pada image di bawah ini Anda dapat melihat bagaimana berbagai bagian layanan Shared File System berinteraksi satu sama lain.
tr_tr: Aşağıdaki resimde, Paylaşımlı Dosya Sistemi servisinin farklı bölümlerinin birbirleriyle nasıl etkileşime girdiğini görebilirsiniz.

source: On the system hosting cinder volume services, synchronize to flush the I/O cache then test to see if your string can be found:
de: Auf dem System Hosting Cinder Volume-Dienste, synchronisieren, um den I/O-Cache zu spülen, dann testen, um zu sehen, ob Ihre Zeichenfolge gefunden werden kann:
id: Pada sistem hosting layanan volume cinder, sinkronkan untuk menyiram (flush) cache I/O kemudian menguji untuk melihat apakah string Anda dapat ditemukan:
tr_tr: Cinder hacim servislerini barındıran sistemde, G/Ç önbelliğini temizlemek için senkronize et ve şu dizgenin bulunup bulunmadığını kontrol et:

source: Once a cloud is deployed, it is time for an internal audit. This is the time to compare the controls you identified above with the design, features, and deployment strategies utilized in your cloud. The goal is to understand how each control is handled and where gaps exist. Document all of the findings for future reference.
de: Sobald eine Cloud eingesetzt wird, ist es Zeit für ein internes Audit. Dies ist die Zeit, um die Steuerelemente, die Sie oben identifiziert haben, mit dem Design, Funktionen und Bereitstellungsstrategien, die in Ihrer Cloud verwendet werden, zu vergleichen. Das Ziel ist zu verstehen, wie jede Kontrolle behandelt wird und wo Lücken vorhanden sind. Dokumentieren Sie alle Ergebnisse für zukünftige Referenz.
id: Begitu awan digunakan, sekarang saatnya untuk melakukan audit internal. Inilah saatnya membandingkan kontrol yang Anda identifikasi di atas dengan desain, fitur, dan strategi penyebaran yang digunakan di awan Anda. Tujuannya adalah untuk memahami bagaimana setiap kontrol ditangani dan di mana ada kesenjangan. Dokumentasikan semua temuan untuk referensi di kemudian hari.
tr_tr: Bir bulut konuşlandırıldığında, bunun için dahili bir denetim zamanı geldi demektir. Yukarıda belirlediğiniz denetimleri bulutunuzda kullanılan tasarım, özellikler ve dağıtım stratejileri ile karşılaştırmanın zamanı geldi demektir. Hedef, her denetimin nasıl işlendiğini ve boşlukların nerede olduğunu anlamaktır. Gelecekte referans olması için tüm bulguları belgeleyin.

source: Once a user is authenticated, a token is generated for authorization and access to an OpenStack environment. A token can have a variable life span; however the default value for expiry is one hour. The recommended expiry value should be set to a lower value that allows enough time for internal services to complete tasks. In the event that the token expires before tasks complete, the cloud may become unresponsive or stop providing services. An example of expended time during use would be the time needed by the Compute service to transfer a disk image onto the hypervisor for local caching.
de: Sobald ein Benutzer authentifiziert ist, wird ein Token für die Autorisierung und den Zugriff auf eine OpenStack-Umgebung generiert. Ein Token kann eine variable Lebensdauer haben. Der Vorgabewert für das Auslaufen beträgt jedoch eine Stunde. Der empfohlene Verfallwert sollte auf einen niedrigeren Wert gesetzt werden, der genügend Zeit für interne Dienste zur Ausführung von Aufgaben bietet. In dem Fall, dass das Token abläuft, bevor Aufgaben abgeschlossen sind, kann die Cloud nicht mehr reagieren oder die Bereitstellung von Diensten beenden. Ein Beispiel für die verbrauchte Zeit während des Gebrauchs wäre die Zeit, die der Compute-Dienst benötigt, um ein Disk-Image auf den Hypervisor für die lokale Zwischenspeicherung zu übertragen.

source: Once system security controls are identified, an OpenStack architect will utilize NIST 800-53 to extract tailored control selection. For example, specification of what constitutes a "secure password".
de: Sobald System-Sicherheitskontrollen identifiziert sind, wird ein OpenStack-Architekt NIST 800-53 nutzen, um eine maßgeschneiderte Kontrollauswahl zu extrahieren. Zum Beispiel, Spezifikation, was ein "sicheres Passwort" darstellt.
id: Setelah kontrol keamanan sistem diidentifikasi, arsitek OpenStack akan menggunakan NIST 800-53 untuk mengekstrak pilihan kontrol yang disesuaikan. Misalnya, spesifikasi apa yang dimaksud dengan "secure password".
tr_tr: Sistem güvenlik kontrolleri tanımlandıktan sonra, bir OpenStack mimarı, özel kontrol seçimi için NIST 800-53'ü kullanacaktır. Örneğin, "güvenli parola"yı neyin oluşturduğunun belirtimi.

source: Once the SSH host key is generated, the host key fingerprint should be stored in a secure and queryable location. One particularly convenient solution is DNS using SSHFP resource records as defined in RFC-4255. For this to be secure, it is necessary that DNSSEC be deployed.
de: Sobald der SSH-Host-Key erzeugt wird, sollte der Host-Key-Fingerabdruck an einem sicheren und abrufbaren Ort gespeichert werden. Eine besonders bequeme Lösung ist DNS mit SSHFP Resource Records wie in RFC-4255 definiert. Damit dies sicher ist, ist es notwendig, dass DNSSEC eingesetzt wird.
id: Setelah SSH host key dihasilkan, host key fingerprint harus disimpan di lokasi yang aman dan queryable. Salah satu solusi yang sangat mudah digunakan adalah DNS menggunakan SSHFP resource record sebagaimana didefinisikan dalam RFC-4255. Agar aman, DNSSEC perlu dikerahkan.
tr_tr: SSH sunucu anahtarı oluşturulduktan sonra ana anahtar parmak izi güvenli ve sorgulanabilir bir konumda saklanmalıdır. RFC-4255'te tanımlanan SSHFP kaynak kayıtlarını kullanan DNS özellikle uygun bir çözümdür. Bunun güvenli olması için DNSSEC'in yayına alınması gerekiyor.

source: Once the internal audit results look good, it is time to prepare for an external audit. There are several key actions to take at this stage, these are outlined below:
de: Sobald die internen Audit-Ergebnisse gut aussehen, ist es Zeit, sich auf ein externes Audit vorzubereiten. Es sind mehrere wichtige Maßnahmen zu diesem Zeitpunkt anzugehen, diese sind unten skizziert:
id: Begitu hasil audit internal terlihat bagus, sekarang saatnya mempersiapkan audit eksternal. Ada beberapa tindakan penting yang harus dilakukan pada tahap ini, ini diuraikan di bawah ini:
tr_tr: İç denetim sonuçları iyi görünüyorsa, harici bir denetim hazırlama zamanı geldi demektir. Bu aşamada yapılması gereken birkaç önemli adım aşağıda belirtilmiştir:
