Repository: openstack/security-doc
Catalog: security-guide/source/locale/*/LC_MESSAGES/security-guide.po
Languages: de, id, tr_tr

source: This guide augments the `OpenStack Operations Guide <https://docs.openstack.org/ops/>`__ and can be referenced to harden existing OpenStack deployments or to evaluate the security controls of OpenStack cloud providers.
de: Diese Anleitung ergänzt das `OpenStack Operations Guide <https://docs.openstack.org/ops/>`__ und kann darauf hingewiesen werden, bestehende OpenStack-Bereitstellungen zu härten oder die Sicherheitskontrollen von OpenStack-Cloud-Anbietern zu bewerten.
id: Panduan ini menambah `OpenStack Operations Guide <https://docs.openstack.org/ops/>`__ dan dapat dirujuk untuk mengeras pemasangan OpenStack yang ada atau untuk mengevaluasi kontrol keamanan penyedia awan OpenStack.
tr_tr: Bu kılavuz `OpenStack Operasyon Kılavuzu <https://docs.openstack.org/ops/>`__ 'nu genişletir ve mevcut OpenStack dağıtımlarını sıkılaştırmak veya OpenStack bulut sağlayıcılarının güvenlik kontrollerini değerlendirmek için başvurulabilir.

source: This guide focuses on a standard architecture that includes a *cloud controller* host, a *network* host, and a set of *compute* hypervisors for running VMs.
de: Dieser Leitfaden konzentriert sich auf eine Standardarchitektur, die einen *Cloud Controller* Host, einen *Netzwerk* Host und einen Satz von *compute* Hypervisoren für das Ausführen von VMs umfasst.
id: Panduan ini berfokus pada arsitektur standar yang mencakup host *cloud controller* , host *network*, dan satu set *compute* hypervisor untuk menjalankan VM.
tr_tr: Bu kılavuz, bir *bulut denetleyicisi* barındırıcısı, bir *ağ* barındırıcısı ve VM'leri çalıştırmak için bir *hesaplama* denetleyicisi içeren standart bir mimari üzerine odaklanmaktadır.

source: This guide is intended as advice only.
de: Diese Anleitung dient nur als Rat.
id: Panduan ini dimaksudkan sebagai saran saja.
tr_tr: Bu kılavuz sadece bir tavsiye olarak tasarlandı.

source: This guide provides security insight into :term:`OpenStack` deployments. The intended audience is cloud architects, deployers, and administrators. In addition, cloud users will find the guide both educational and helpful in provider selection, while auditors will find it useful as a reference document to support their compliance certification efforts. This guide is also recommended for anyone interested in cloud security.
de: Dieser Leitfaden bietet Einblicke in die Sicherheit von :term:`OpenStack` Installationen. Das Zielpublikum sind Cloud-Architekten, Deployer und Administratoren. Darüber hinaus finden Cloud-Nutzer den Leitfaden sowohl pädagogisch als auch hilfreich bei der Anbieterauswahl, während die Auditoren es als Referenzdokument als nützlich erachten werden, um ihre Compliance-Zertifizierungsbemühungen zu unterstützen. Dieser Leitfaden wird auch für alle, die sich für Cloud-Sicherheit interessieren, empfohlen.
id: Panduan ini memberikan wawasan keamanan dalam :term: `OpenStack` deployments. Penonton yang dimaksud adalah arsitek awan, penginstal, dan administrator. Selain itu, pengguna awan akan menemukan panduan ini baik untuk pendidikan maupun dalam pemilihan penyedia layanan, sementara auditor akan merasa berguna sebagai dokumen referensi untuk mendukung upaya sertifikasi kepatuhan mereka. Panduan ini juga direkomendasikan bagi siapa saja yang berminat pada keamanan awan.
tr_tr: Bu kılavuz, :term:`OpenStack` dağıtımlarını canlıya alırken güvenlik konusundaki bilgileri içerir. Beklenen kitle, bulut mimarları, canlıya alanlar ve yöneticilerdir. Buna ek olarak, bulut kullanıcıları rehberin sağlayıcı seçiminde hem eğitim açısından hem de yararlı olmasını sağlarken, denetçiler uygunluk belgeleme çabalarını desteklemek için referans bir belge olarak yararlı bulacaktır. Bu rehber, bulut güvenliği ile ilgilenen herkes için de önerilir.

source: This guide was last updated as of the Pike release, documenting the OpenStack Pike, Ocata, and Newton releases. It may not apply to EOL releases Mitaka, Kilo and Liberty.
de: Dieser Leitfaden wurde zuletzt von der Pike-Version aktualisiert und dokumentiert die OpenStack Pike, Ocata und Newton Releases. Es kann nicht gelten für EOL Releases Mitaka, Kilo und Liberty.
tr_tr: Bu kılavuz, OpenStack Pike, Ocata ve Newton sürümlerini belgeleyen Pike sürümü itibarıyla güncellendi. Ömrünü doldurmuş, Mitaka, Kilo ve Liberty'ye uygun olmayabilir.

source: This instance follows a standard SAML2 authentication procedure, that is, the user will be redirected to the Identity Provider’s authentication webpage and be prompted for credentials. After successfully authenticating the user will be redirected to the Service Provider’s endpoint. If using a web browser, a token will be returned in XML format. As an alternative to using a web browser, you can use Enhanced Client or Proxy (ECP), which is available in the ``keystoneclient`` in the Identity service API.
de: Diese Instanz folgt einer Standard-SAML2-Authentifizierungsprozedur, d.h. der Benutzer wird auf die Authentifizierungswebseite des Identity Providers umgeleitet und zur Eingabe von Anmeldeinformationen aufgefordert. Nach erfolgreicher Authentifizierung wird der Benutzer an den Endpunkt des Dienstanbieters weitergeleitet. Bei Verwendung eines Webbrowsers wird ein Token im XML-Format zurückgegeben. Alternativ zur Verwendung eines Webbrowsers können Sie den Enhanced Client oder Proxy (ECP) verwenden, der im ``keystoneclient``in der Identity Service API verfügbar ist.
tr_tr: Bu örnek, standart bir SAML2 kimlik doğrulama prosedürünü izlemektedir, yani kullanıcı Kimlik Sağlayıcı'nın kimlik doğrulama web sayfasına yönlendirilecek ve kimlik bilgileri istenir. Başarıyla kimlik doğrulamasını yaptıktan sonra, Hizmet Sağlayıcının son noktasına yönlendirilirsiniz. Bir web tarayıcısı kullanılıyorsa, bir belirteç XML biçiminde döndürülecektir. Bir web tarayıcısını kullanmaya alternatif olarak, Kimlik hizmeti API'sındaki ``keystoneclient``'de bulunan Geliştirilmiş İstemci veya Proxy (ECP) kullanabilirsiniz.

source: This is recorded in the following format:
de: Dies wird im folgenden Format aufgezeichnet:
id: Ini dicatat dalam format berikut:
tr_tr: Bu, aşağıdaki biçimde kaydedilmiştir:

source: This is the formal audit process. Auditors will test security controls in scope for a specific certification, and demand evidentiary requirements to prove that these controls were also in place for the audit window (for example SOC 2 audits generally evaluate security controls over a 6-12 months period). Any control failures are logged, and will be documented in the external auditors final report. Dependent on the type of OpenStack deployment, these reports may be viewed by customers, so it is important to avoid control failures. This is why audit preparation is so important.
de: Dies ist der formale Prüfungsprozess. Die Auditoren werden die Sicherheitskontrollen im Rahmen einer bestimmten Zertifizierung prüfen und nachweisen, dass diese Kontrollen auch für das Audit-Fenster vorhanden sind (z.B. SOC 2-Audits bewerten in der Regel Sicherheitskontrollen über einen Zeitraum von 6-12 Monaten). Alle Kontrollfehler werden protokolliert und werden im Abschlussprüfung des Abschlussprüfers dokumentiert. Abhängig von der Art der OpenStack-Bereitstellung können diese Berichte von Kunden eingesehen werden. Daher ist es wichtig, Steuerfehler zu vermeiden. Deshalb ist die Audit-Vorbereitung so wichtig.
id: Ini adalah proses audit formal. Auditor akan menguji sekuriti keamanan dalam lingkup sertifikasi tertentu, dan menuntut persyaratan pembuktian untuk membuktikan bahwa kontrol ini juga diterapkan untuk audit windowt (misalnya audit SOC 2 pada umumnya mengevaluasi kontrol keamanan selama periode 6-12 bulan). Setiap kegagalan kontrol dicatat, dan akan didokumentasikan dalam laporan akhir auditor eksternal. Bergantung pada jenis penyebaran OpenStack, laporan ini dapat dilihat oleh pelanggan, jadi penting untuk menghindari kegagalan pengendalian. Inilah sebabnya mengapa persiapan audit sangat penting.
tr_tr: Bu resmi denetim sürecidir. Denetçiler güvenlik kontrollerini belirli bir sertifika için test edecek ve denetim penceresi için bu kontrollerin de geçerli olduğunu kanıtlayan kanıtlayıcı gereklilikleri talep edecektir (örneğin, SOC 2 denetimleri genelde 6-12 ay boyunca güvenlik kontrollerini değerlendirmektedir). Herhangi bir kontrol başarısızlığı kaydedilir ve bunlar harici denetçilerin nihai raporunda belgelenir. OpenStack dağıtım türüne bağlı olarak, bu raporlar müşteriler tarafından görülebilir, bu nedenle denetim hatalarını önlemek önemlidir. Bu nedenle denetim hazırlığı çok önemlidir.

source: This is very similar to the :ref:`secure-communication-proxy-in-front` but the SSL/TLS proxy is on the same physical system as the API endpoint. The API endpoint would be configured to only listen on the local network interface. All remote communication with the API endpoint would go through the SSL/TLS proxy. With this deployment model, we address a number of the bullet points in :ref:`secure-communication-proxy-in-front` A proven SSL implementation that performs well would be used. The same SSL proxy software would be used for all services, so SSL configuration for the API endpoints would be consistent. The OpenStack service processes would not have direct access to the private keys used for SSL/TLS, as you would run the SSL proxies as a different user and restrict access using permissions (and additionally mandatory access controls using something like SELinux). We would ideally have the API endpoints listen on a Unix socket such that we could restrict access to it using permissions and mandatory access controls as well. Unfortunately, this does not seem to work currently in Eventlet from our testing. It is a good future development goal.
de: Dies ist sehr ähnlich wie die :ref:`secure-communication-proxy-in-front` aber der SSL/TLS-Proxy befindet sich auf dem gleichen physischen System wie der API-Endpunkt. Der API-Endpunkt wäre so konfiguriert, dass er nur auf der lokalen Netzwerkschnittstelle hört. Alle Remote-Kommunikation mit dem API-Endpunkt würde durch den SSL/TLS-Proxy gehen. Mit diesem Einsatzmodell adressieren wir eine Reihe von Aufzählungspunkten in :ref:`secure-communication-proxy-in-front` Eine bewährte SSL-Implementierung, die gut funktioniert, würde verwendet werden. Die gleiche SSL-Proxy-Software würde für alle Dienste verwendet werden, so dass die SSL-Konfiguration für die API-Endpunkte konsistent sein würde. Die OpenStack-Serviceprozesse hätten keinen direkten Zugriff auf die privaten Schlüssel, die für SSL/TLS verwendet wurden, da Sie die SSL-Proxies als einen anderen Benutzer ausführen und den Zugriff mit Berechtigungen einschränken (und zusätzlich obligatorische Zugriffskontrollen mit SELinux). Wir hätten idealerweise die API-Endpunkte auf einen Unix-Socket zu hören, so dass wir den Zugriff darauf auch mit Berechtigungen und obligatorischen Zugriffskontrollen einschränken konnten. Leider scheint das derzeit nicht in Eventlet aus unserem Test zu arbeiten. Es ist ein gutes zukünftiges Entwicklungsziel.
id: Ini sangat mirip dengan :ref: `secure-communication-proxy-in-front` tapi proxy SSL/TLS berada pada sistem fisik yang sama dengan endpoint API. Endpoint API akan dikonfigurasi untuk hanya mendengarkan pada antarmuka jaringan lokal. Semua komunikasi jarak jauh dengan endpoint API akan melalui proxy SSL/TLS. Dengan model penyebaran ini, kami menangani sejumlah butir di :ref: `secure-communication-proxy-in-front` Implementasi SSL yang telah teruji yang berkinerja baik akan digunakan. Perangkat lunak proxy SSL yang sama akan digunakan untuk semua layanan, jadi konfigurasi SSL untuk endpoint API akan konsisten. Proses layanan OpenStack tidak akan memiliki akses langsung ke kunci privat yang digunakan untuk SSL/TLS, karena Anda akan menjalankan proxy SSL sebagai pengguna yang berbeda dan membatasi akses menggunakan izin (dan juga kontrol akses wajib menggunakan sesuatu seperti SELinux). Kami idealnya memiliki endpoint API mendengarkan di soket Unix sehingga kami dapat membatasi akses ke sana menggunakan izin dan kontrol akses wajib juga. Sayangnya, sepertinya ini tidak bekerja saat ini di Eventlet dari pengujian kami. Ini adalah tujuan pembangunan masa depan yang baik.
tr_tr: Bu, :ref:`secure-communication-proxy-in-front` ile çok benzer, ancak SSL / TLS vekili API uç noktası ile aynı fiziksel sistemdedir. API bitiş noktası yalnızca yerel ağ arayüzünde dinlenecek şekilde yapılandırılacaktır. API uç noktasıyla olan tüm uzaktan iletişim, SSL/TLS vekilinden geçecektir. Bu dağıtım modeliyle, birkaç sayıdaki madde işareti noktasına değindik :ref:`secure-communication-proxy-in-front` İyi performans gösteren kanıtlanmış bir SSL uygulaması kullanılacaktır. Tüm hizmetler için aynı SSL vekil yazılımı kullanılacaktır, bu nedenle API uç noktaları için SSL yapılandırması tutarlı olacaktır. SSL vekillerini farklı bir kullanıcı olarak çalıştırıp izinleri (ve ayrıca SELinux gibi bir şey kullanarak zorunlu erişim denetimlerini) kullanarak erişimi kısıtladığınız için OpenStack servis süreçleri, SSL/TLS için kullanılan özel anahtarlara doğrudan erişemezdi. İdeal olarak, API uç noktalarının bir Unix soketi üzerinde dinlenmesini sağlayacağız, böylece izinleri ve zorunlu erişim denetimlerini kullanarak erişimi sınırlandırabiliriz. Maalesef, bu, testlerimizde gördüğümüz kadarıyla şu anda Eventlet'te çalışmıyor. Bu, gelecekteki iyi bir geliştirme hedefidir.

source: This necessitates that the proxy nodes have dual interfaces (physical or virtual):
de: Dies erfordert, dass die Proxy-Knoten Dual-Interfaces (physisch oder virtuell) haben:
id: Ini mengharuskan bahwa node proxy memiliki dua antarmuka (fisik atau virtual):
tr_tr: Bu, vekil düğümlerin çift arabirimlere (fiziksel veya sanal) sahip olmasını gerektirir:

source: This option was introduced in Kilo release.
de: Diese Option wurde im Kilo Release eingeführt.
id: Pilihan ini diperkenalkan dalam rilis Kilo.
tr_tr: Bu seçenek Kilo sürümü ile tanıtıldı.

source: This path is Ubuntu-specific. For other distributions, replace with appropriate path.
de: Dieser Pfad ist Ubuntu-spezifisch. Für andere Distributionen ersetzen Sie den entsprechenden Pfad.
tr_tr: Bu yol Ubuntu'ya özgüdür. Diğer dağıtımlar için uygun şekilde değiştirin.

source: This process is broken apart into three primary categories:
de: Dieser Vorgang wird in drei Hauptkategorien zerlegt:
id: Proses ini dipecah menjadi tiga kategori utama:
tr_tr: Bu süreç üç ayrı ana kategoriye ayrılır:

source: This recommendation provides insulation from brute force, social engineering, and both spear and mass phishing attacks that may compromise administrator passwords.
de: Diese Empfehlung bietet Isolierung von Brute Force, Social Engineering, und sowohl Speer- und Massen-Phishing-Angriffe, die Administrator-Passwörter kompromittieren können.
id: Rekomendasi ini memberikan isolasi dari kekerasan (brute force), rekayasa sosial, dan serangan tusukan (spear) dan massa phishing yang dapat membahayakan passwords administrator.
tr_tr: Bu öneri, kaba kuvvet, sosyal mühendislik ve yönetici parolalarını tehlikeye atabilecek hem e-dolandırıcılık hem de toplu kimlik avı saldırılarından yalıtımı sağlar.

source: This refers to 'Hacktivist' type organizations who are not typically commercially funded but can pose a serious threat to service providers and cloud operators.
de: Dies bezieht sich auf 'Hacktivist'-Typen, die typischerweise nicht kommerziell finanziert werden, aber eine ernsthafte Bedrohung für Dienstleister und Cloud-Betreiber darstellen können.
id: Ini mengacu pada jenis organisasi 'Hacktivist' yang biasanya tidak didanai secara komersial namun dapat menimbulkan ancaman serius bagi penyedia layanan dan operator awan.
tr_tr: Bu, genellikle ticari olarak finanse edilmeyen ancak servis sağlayıcılara ve bulut operatörlerine ciddi bir tehdit oluşturabilecek 'Hacktivist' türü organizasyonları ifade eder.

source: This restricts only root to be able to modify configuration files while allowing the services to read them through their group membership in the ``swift`` group.
de: Dies beschränkt nur root, um Konfigurationsdateien ändern zu können, während die Dienste sie über ihre Gruppenmitgliedschaft in der ``swift``Gruppe lesen können.
id: Ini membatasi hanya root untuk dapat memodifikasi file konfigurasi sambil membiarkan layanan membacanya melalui keanggotaan grup mereka di grup ``swift`` .
tr_tr: Bu, yalnızca root'u, yapılandırma dosyalarını değiştirebilecek durumda kısıtlarken, ``swift`` grubundaki servislerin grup üyeliği yoluyla onları okumasına izin verir.

source: This section discusses OpenStack Networking configuration best practices as they apply to project network security within your OpenStack deployment.
de: In diesem Abschnitt werden die Best Practices der OpenStack Networking-Konfiguration beschrieben, die für die Projektnetzwerksicherheit in Ihrer OpenStack-Bereitstellung gelten.
id: Bagian ini membahas praktik terbaik konfigurasi OpenStack Networking saat mereka menerapkan keamanan jaringan proyek di dalam penyebaran OpenStack Anda.
tr_tr: Bu bölüm OpenStack kurulumunuzdaki proje ağ güvenliği için geçerli olan OpenStack Ağ yapılandırmasının en iyi uygulamalarını ele almaktadır.

source: This section discusses security hardening approaches for the three most common message queuing solutions used in OpenStack: RabbitMQ, Qpid, and ZeroMQ.
de: In diesem Abschnitt werden Sicherheitshärtungsansätze für die drei häufigsten Nachrichtenwarteschlangenlösungen beschrieben, die in OpenStack verwendet werden: RabbitMQ, Qpid und ZeroMQ.
id: Bagian ini membahas pendekatan pengerasan keamanan untuk tiga solusi antrian pesan paling umum yang digunakan di OpenStack: RabbitMQ, Qpid, dan ZeroMQ.
tr_tr: Bu bölümde, OpenStack'da kullanılan üç en yaygın mesaj kuyruklama çözümü olan RabbitMQ, Qpid ve ZeroMQ için güvenlik sıkılaştırma yaklaşımları anlatılmaktadır.

source: This section is a high-level overview of what processes and best practices should be considered when implementing OpenStack Networking.
de: Dieser Abschnitt ist ein hochrangiger Überblick darüber, welche Prozesse und Best Practices bei der Implementierung von OpenStack Networking berücksichtigt werden sollten.
id: Bagian ini adalah gambaran umum tingkat tinggi tentang proses dan praktik terbaik yang harus dipertimbangkan saat mengimplementasikan OpenStack Networking.
tr_tr: Bu bölüm, OpenStack Ağını uygularken hangi işlemlerin ve en iyi yöntemlerin göz önüne alınması gerektiğine ilişkin üst düzey bir bakış açısıdır.

source: This section titles the architecture page, gives the status of the review (draft, ready for review, reviewed) and captures the release and version of the project (where relevant). It also records the PTL for the project, the project's architect who is responsible for producing the architecture page, diagrams and working through the review (this may or may not be the PTL), and the security reviewer(s).
de: Dieser Abschnitt titelt die Architektur-Seite, gibt den Status der Überprüfung (Entwurf, bereit für die Überprüfung, überprüft) und erfasst die Freigabe und Version des Projekts (wo relevant). Es zeichnet auch die PTL für das Projekt auf, der Projektarchitekt, der für die Erstellung der Architekturseite verantwortlich ist, Diagramme und die Überprüfung durch die Überprüfung (dies kann oder ist nicht die PTL) und der Sicherheitsprüfer (s).
id: Bagian ini berisi judul halaman arsitektur, memberikan status tinjauan (draft, siap untuk diperiksa, ditinjau) dan menangkap rilis dan versi proyek (jika relevan). Ini juga mencatat proyek PTL untuk proyek ini, arsitek proyek yang bertanggung jawab untuk memproduksi halaman arsitektur, diagram dan mengerjakan tinjauan (ini mungkin atau mungkin bukan PTL), dan reviewer keamanan.
tr_tr: Bu bölüm, mimari sayfanın başlığını taşıyor, incelemenin durumunu (taslak, incelenmeye hazır, incelenmiştir) verir ve projenin yayın ve sürümünü (ilgili olduğu yerde) yakalar. Ayrıca, projenin PTL'sini, mimari sayfayı üretmekten sorumlu olan projenin mimarını, diyagramları ve incelemenin (bu PTL olabilir veya olmayabilir) ve güvenlik incelemeci(ler)sinin çalışmasını da kaydeder.

source: This section will contain a brief description of the project to introduce third parties to the service. This should be a paragraph or two and can be cut/paste from wiki or other documentation. Include links to relevant presentations and further documentation if available.
de: Dieser Abschnitt enthält eine kurze Beschreibung des Projekts, um Dritte an die Dienstleistung vorzustellen. Dies sollte ein Absatz oder zwei sein und kann aus Wiki oder anderen Dokumentationen geschnitten/eingefügt werden. Fügen Sie Links zu relevanten Präsentationen und weiteren Unterlagen hinzu, falls vorhanden.
id: Bagian ini akan berisi deskripsi singkat tentang proyek untuk memperkenalkan pihak ketiga ke layanan ini. Ini harus satu paragraf atau dua dan bisa cut/paste dari wiki atau dokumentasi lainnya. Sertakan tautan ke presentasi yang relevan dan dokumentasi lebih lanjut jika tersedia.
tr_tr: Bu bölüm, projeye üçüncü kişileri tanıtmak için projenin kısa bir açıklamasını içerecektir. Bu bir veya iki paragraf olmalı ve wiki veya diğer dokümanlardan kes / yapıştır yapılabilir. İlgili sunulara ve varsa daha fazla belgeye bağlantıları ekleyin.

source: This service is responsible for managing data operations which may take a long time to complete and block other services if not handled separately.
de: Dieser Dienst ist verantwortlich für die Verwaltung von Datenoperationen, die eine lange Zeit dauern können, um andere Dienste zu vervollständigen und zu blockieren, wenn sie nicht separat behandelt werden.
id: Layanan ini bertanggung jawab untuk mengelola operasi data yang memerlukan waktu lama untuk menyelesaikan dan memblokir layanan lain jika tidak ditangani secara terpisah.
tr_tr: Bu servis, ayrı işlem yapılmaması durumunda diğer servislerin tamamlanması ve engellenmesi için uzun sürebilecek veri işlemlerini yönetmekten sorumludur.

source: This service runs on the network node to service the Networking API and its extensions. It also enforces the network model and IP addressing of each port. The neutron-server requires indirect access to a persistent database. This is accomplished through plugins, which communicate with the database using AMQP (Advanced Message Queuing Protocol).
de: Dieser Dienst läuft auf dem Netzwerkknoten, um die Networking API und ihre Erweiterungen zu bedienen. Es erzwingt auch das Netzwerkmodell und die IP-Adressierung jedes Portes. Der Neutronenserver benötigt indirekten Zugriff auf eine persistente Datenbank. Dies geschieht durch Plugins, die mit der Datenbank mit AMQP (Advanced Message Queuing Protocol) kommunizieren.
id: Layanan ini berjalan pada node jaringan untuk melayani Networking API dan ekstensi-nya. Ini juga memberlakukan model jaringan dan pengalamatan IP masing-masing port. Server neutron membutuhkan akses tidak langsung ke database yang persisten. Hal ini dilakukan melalui plugin, yang berkomunikasi dengan database menggunakan AMQP (Advanced Message Queuing Protocol).
tr_tr: Bu servis, Ağ Oluşturma API'sı ve uzantılarına hizmet etmek için ağ düğümünde çalışır. Ayrıca, her bir portun ağ modeli ve IP adresini zorlar. neutron-server, kalıcı bir veritabanına dolaylı olarak erişilmesini gerektirir. Bu, veritabanı ile AMQP (Gelişmiş Mesaj Kuyruklama Protokolü) kullanılarak iletişim kuran eklentiler aracılığıyla gerçekleştirilir.
