Repository: openstack/security-doc
Catalog: security-guide/source/locale/*/LC_MESSAGES/security-guide.po
Languages: de, id, tr_tr

source: It is recommended that you follow the guidelines provided in :ref:`database-authentication-and-access-control` for all components which require direct DB connections.
de: Es empfiehlt sich, die folgenden Richtlinien zu beachten :ref:`Datenbank-Authentifizierungs- und Zugriffskontrolle` für alle Komponenten, die direkte DB-Verbindungen erfordern.
id: Disarankan agar Anda mengikuti panduan yang diberikan di :ref:`database-authentication-and-access-control` untuk semua komponen yang memerlukan koneksi DB langsung.
tr_tr: Doğrudan DB bağlantıları gerektiren tüm bileşenler için :ref:`database-authentication-and-access-control` içinde verilen yönergeleri izlemeniz önerilir.

source: It is recommended that you follow the guidelines provided in :ref:`queue-authentication-and-access-control` for all components which require RPC communication.
de: Es wird empfohlen, dass Sie die folgenden Richtlinien befolgen :ref:`queue-authentication-and-access-control` für alle Komponenten, die eine RPC-Kommunikation erfordern.
id: Disarankan agar Anda mengikuti panduan yang diberikan di :ref:`queue-authentication-and-access-control` untuk semua komponen yang memerlukan komunikasi RPC.
tr_tr: RPC iletişimini gerektiren tüm bileşenler için :ref:`queue-authentication-and-access-control` ile sağlanan yönergeleri izlemeniz önerilir.

source: It is recommended to avoid the manual image building process as it is complex and prone to error. Additionally, using an automated system like Oz for image building or a configuration management utility like Chef or Puppet for post-boot image hardening gives you the ability to produce a consistent image as well as track compliance of your base image to its respective hardening guidelines over time.
de: Es wird empfohlen, den manuellen Abbildaufbau zu vermeiden, da er komplex und fehleranfällig ist. Darüber hinaus bietet Ihnen die Verwendung eines automatisierten Systems wie Oz für das Image-Building oder ein Konfigurationsmanagement-Dienstprogramm wie Chef oder Puppet für die Post-Boot-Image-Härtung die Möglichkeit, über die Zeit ein konsistentes Abbild zu erstellen und die Übereinstimmung Ihres Basisbildes mit den jeweiligen Härtungsrichtlinien zu verfolgen.
id: Dianjurkan untuk menghindari proses pembuatan image manual karena kompleks dan rentan terhadap kesalahan. Selain itu, dengan menggunakan sistem otomatis seperti Oz untuk pembuatan image atau utilitas pengelolaan konfigurasi seperti Chef atau Puppet untuk pengerasan image post-boot memberi Anda kemampuan untuk menghasilkan image yang konsisten serta melacak kepatuhan image dasar Anda untuk masing-masing panduan pengerasan dari waktu ke waktu.
tr_tr: Elle imaj oluşturma işleminin karmaşık olması ve hataya eğilimli olması nedeniyle önlenmesi önerilir. Ek olarak, görüntü oluşturma için Oz gibi otomatik bir sistem veya açılış sonrası imaj sıkılaştırması için Chef veya Puppet gibi bir yapılandırma yönetimi programı kullanarak, tutarlı bir imaj üretmenin yanı sıra, taban görüntüsünün kendi sıkılaştırma kurallarına uyumunu izleyebilirsiniz.

source: It should be noted that with this type of implementation sensitive access tokens will be stored in the browser and will be transmitted with each request made. The back end ensures the integrity of session data, even though the transmitted data is only encrypted by HTTPS.
de: Es ist zu beachten, dass bei dieser Art von Implementierung sensible Zugriffstoken im Browser gespeichert und mit jeder Anfrage gesendet werden. Das Back-End sorgt für die Integrität der Sitzungsdaten, obwohl die übertragenen Daten nur von HTTPS verschlüsselt werden.
id: Perlu dicatat bahwa dengan jenis pelaksanaan ini token akses yang sensitif akan disimpan di browser dan akan dikirimkan dengan setiap permintaan yang dilakukan. Back end memastikan integritas data sesi, meskipun data yang dikirim hanya dienkripsi oleh HTTPS.
tr_tr: Bu tür bir uygulamanın hassas erişim simgelerinin tarayıcıda saklanacağına ve yapılan her istekte bulunacağına dikkat edilmelidir. İletilen veriler yalnızca HTTPS tarafından şifrelese dahi, arka uç, oturum verisinin bütünlüğünü sağlar.

source: KVM-based virtual machine instances are labelled with their own SELinux data type, known as ``svirt_image_t``. Kernel level protections prevent unauthorized system processes, such as malware, from manipulating the virtual machine image files on disk. When virtual machines are powered off, images are stored as ``svirt_image_t`` as shown below:
de: KVM-basierte virtuelle Maschineninstanzen sind mit ihrem eigenen SELinux- Datentyp gekennzeichnet, der als ``svirt_image_t``bekannt ist. Kernel- Level-Schutz verhindert unautorisierte Systemprozesse wie Malware, um die virtuellen Maschinen-Image-Dateien auf der Festplatte zu manipulieren. Wenn virtuelle Maschinen ausgeschaltet sind, werden die Abbilder als `` svirt_image_t``wie unten gezeigt gespeichert:
id: Instance mesin virtual berbasis KVM diberi label dengan tipe data SELinux mereka sendiri, yang dikenal sebagai ``svirt_image_t``. Perlindungan tingkat kernel mencegah proses sistem yang tidak sah, seperti perangkat lunak perusak, dari memanipulasi file image mesin virtual pada disk. Saat mesin virtual dimatikan, image disimpan sebagai ``svirt_image_t`` seperti di bawah ini:
tr_tr: KVM tabanlı sanal makine örnekleri ``svirt_image_t`` olarak bilinen kendi SELinux veri türüne göre etiketlenmiştir. Çekirdek düzeyinde koruma, kötü amaçlı yazılım gibi yetkisiz sistem işlemlerinin disk üzerindeki sanal makine resim dosyalarını manipüle etmesini engeller. Sanal makineler kapalı olduğunda, görüntüler aşağıda gösterildiği gibi ``svirt_image_t`` olarak depolanır:

source: KVM: Kernal-based Virtual Machine. Kernal Samepage Merging. 2010. `http://www.linux-kvm.org/page/KSM <http://www.linux-kvm.org/page/KSM>`_
de: KVM: Kernbasierte virtuelle Maschine. Kernal Samepage Merging. 2010. `http://www.linux-kvm.org/page/KSM <http://www.linux-kvm.org/page/KSM>`_
tr_tr: KVM: Çekirdek-tabanlı Sanal Makine. Kernal Samepage Merging. 2010. `http://www.linux-kvm.org/page/KSM <http://www.linux-kvm.org/page/KSM>`_

source: Keith Basil is a Principal Product Manager for Red Hat OpenStack and is focused on Red Hat's OpenStack product management, development and strategy. Within the US public sector, Basil brings previous experience from the design of an authorized, secure, high-performance cloud architecture for Federal civilian agencies and contractors.
de: Keith Basil ist ein Principal Product Manager für Red Hat OpenStack und konzentriert sich auf Red Hats OpenStack Produktmanagement, Entwicklung und Strategie. Innerhalb des US-amerikanischen öffentlichen Sektors bringt Basil frühere Erfahrungen aus dem Entwurf einer autorisierten, sicheren und leistungsstarken Cloud-Architektur für Bundes-, Zivil- und Auftragnehmer.
id: Keith Basil adalah Principal Product Manager untuk Red Hat OpenStack dan berfokus pada pengelolaan, pengembangan dan strategi produk di Red Hat. Di sektor publik AS, Basil membawa pengalaman sebelumnya dari disain arsitektur awan yang berwenang (authorized), aman, berkinerja tinggi untuk agen sipil Federal dan kontraktor.
tr_tr: Keith Basil, Red Hat OpenStack'ın Ürün Müdürüdür ve Red Hat'ın OpenStack ürün yönetimi, geliştirilmesi ve stratejisine odaklanmıştır. ABD kamu sektöründe Basil, federal sivil ajanslar ve müteahhitler için daha önce edinilmiş, yetkili, güvenli, yüksek performanslı bir bulut mimarisi tasarımını getiriyor.

source: Key length
de: Schlüssellänge
id: Key Length (panjang kunci)
tr_tr: Anahtar uzunluğu

source: Key management
de: Schlüsselverwaltung
id: Manajemen kunci
tr_tr: Anahtar yönetimi

source: Key management service will support data isolation by providing ephemeral disk encryption keys on a per-tenant basis
de: Key-Management-Service wird die Daten-Isolation durch die Bereitstellung von kurzlebigen Festplatten-Verschlüsselung Schlüssel auf einer Tenant-Basis zu unterstützen
id: Layanan manajemen Key akan mendukung isolasi data dengan menyediakan kunci enkripsi disk sesaat pada basis per-penyewa
tr_tr: Anahtar yönetim servisi, kiracı başına geçici olarak disk şifreleme anahtarları sağlayarak veri izolasyonunu destekleyecek

source: Keystone is the commonly used Identity provider in OpenStack. It may also be used for authentication in Object Storage. Coverage of securing keystone is already provided in :doc:`identity`.
de: Keystone ist der häufig verwendete Identity Provider in OpenStack. Es kann auch für die Authentifizierung in Object Storage verwendet werden. Die Absicherung von Keystone ist bereits in :doc:`identity` abgedeckt.
id: Keystone adalah penyedia Identitas yang umum digunakan di OpenStack. Ini juga bisa digunakan untuk otentikasi di Object Storage. Cakupan pengamanan keystone i sudah tersedia di :doc:`identity`.
tr_tr: Keystone, OpenStack'te yaygın olarak kullanılan Kimlik sağlayıcısıdır. Nesne Depolama alanında kimlik doğrulama için de kullanılabilir. Keystone'un korunması kapsamı zaten :doc:`identity` bölümünde sağlanmıştır.

source: Knowing information about organizational assets is typically a best practice. An assets table can assist with validating security requirements and help to maintain standard security components such as firewall configuration, service port conflicts, security remediation areas, and compliance. Additionally, the table can help to understand the relationship between OpenStack components. The table might include:
de: Informationen über organisatorische Vermögenswerte zu kennen ist normalerweise eine beste Praxis. Eine Assettentabelle kann bei der Validierung von Sicherheitsanforderungen helfen und zur Aufrechterhaltung standardmäßiger Sicherheitskomponenten wie Firewallkonfiguration, Serviceportkonflikte, Sicherheitsmaßnahmen und Compliance beitragen. Darüber hinaus kann die Tabelle helfen, die Beziehung zwischen OpenStack-Komponenten zu verstehen. Die Tabelle könnte Folgendes enthalten:
id: Mengetahui informasi tentang aset organisasi biasanya merupakan praktik terbaik. Tabel aset dapat membantu memvalidasi persyaratan keamanan dan membantu menjaga komponen keamanan standar seperti konfigurasi firewall, konflik port servis, area remediasi keamanan, dan kepatuhan. Selain itu, tabel dapat membantu untuk memahami hubungan antara komponen OpenStack. Table termasuk:

source: L2 isolation using VLANs and tunneling
de: L2 Isolation mit VLANs und Tunneling
id: Isolasi L2 menggunakan VLAN dan tunneling
tr_tr: VLAN'ları ve tünellemeyi kullanarak L2 izolasyonu

source: L2 tunneling
de: L2-Tunnelbau
tr_tr: L2 tünelleme

source: L3 routing and NAT
de: L3-Routing und NAT
id: L3 routing dan NAT
tr_tr: L3 yönlendirme ve NAT

source: LDAP simplifies integration of Identity authentication into an organization's existing directory service and user account management processes.
de: LDAP vereinfacht die Integration der Identitätsauthentifizierung in die vorhandenen Verzeichnisdienst- und Benutzerkontenverwaltungsprozesse eines Unternehmens.
id: LDAP menyederhanakan integrasi otentikasi Identitas ke dalam layanan direktori dan proses pengelolaan akun perusahaan yang ada.
tr_tr: LDAP, kimlik doğrulamasını bir organizasyonun varolan dizin hizmeti ve kullanıcı hesabı yönetimi süreçlerine entegrasyonunu basitleştirir.

source: Labels and categories
de: Etiketten und Kategorien
id: Label dan kategori
tr_tr: Etiketler ve kategoriler

source: Lastly, if a scoped token and a Service Provider region are presented to keystone, the result will be a full SAML Assertion, signed by the IdP keystone, specifically intended for the Service Provider keystone.
de: Schließlich, wenn ein Scoped-Token und ein Service Provider Region Keystone präsentiert wird, wird das Ergebnis eine vollständige SAML Assertion, die von der IdP Keystone, speziell für die Service Provider Keystone, sein.
tr_tr: Son olarak, keystone'a kapsamalı bir belirteç ve Servis Sağlayıcı bölge sunulursa sonuç, özellikle Servis Sağlayıcı keystone için tasarlanmış olan IdP keystone tarafından imzalanmış tam bir SAML belirtmesi olacaktır.

source: Later in the guide, we focus generically on the virtualization stack as it relates to hypervisors.
de: Später im Leitfaden konzentrieren wir uns generisch auf den Virtualisierungsstapel, wie er sich auf Hypervisoren bezieht.
id: Kemudian dalam panduan ini, kami fokus secara umum pada tumpukan virtualisasi yang berkaitan dengan hypervisor.
tr_tr: Kılavuzun ilerleyen kısımlarında, sanal denetim yığınına, genelde hipervizörlere ilişkin olduğu için odaklanmaktadır.

source: Layered defenses
de: Schichtverteidigung
id: Pertahanan Berlapis
tr_tr: Katmanlı savunma

source: Learn more about how to contribute to the OpenStack docs, see the `OpenStack Documentation Contributor Guide <https://docs.openstack.org/contributor-guide/index.html>`__.
de: Erfahren Sie mehr darüber, wie Sie zu den OpenStack-Dokumenten beitragen können, finden Sie im `OpenStack Documentation Contributor Guide <https://docs.openstack.org/contributor-guide/index.html>`__.

source: Least privilege
de: Wenige Privilegien
id: Hak istimewa yang paling sedikit
tr_tr: En az ayrıcalık

source: Legacy browsers are still vulnerable to a Cross-Frame Scripting (XFS) vulnerability, so the OpenStack dashboard provides an option ``DISALLOW_IFRAME_EMBED`` that allows extra security hardening where iframes are not used in deployment.
de: Legacy-Browser sind immer noch anfällig für eine Cross-Frame Scripting (XFS) Sicherheitsanfälligkeit, so dass das OpenStack-Dashboard eine Option `` DISALLOW_IFRAME_EMBED` bietet, die eine zusätzliche Sicherheitsverhärtung ermöglicht, bei der iframes nicht in der Bereitstellung verwendet werden.
id: Browser lawas masih rentan terhadap kerentanan Cross-Frame Scripting (XFS), jadi dasbor OpenStack memberikan opsi ``DISALLOW_IFRAME_EMBED`` yang memungkinkan pengerasan keamanan ekstra dimana iframe tidak digunakan dalam penempatan.
tr_tr: Eski tarayıcılar, Çerçeveler Arası Komut Dosyası Çalıştırma (XFS) güvenlik açığına karşı halen savunmasızdır, bu nedenle OpenStack paneli, iframelerin dağıtımda kullanılmadığı ek güvenlik önlemlerine izin veren bir ``DISALLOW_IFRAME_EMBED`` seçeneği sunmaktadır.

source: Legacy browsers are still vulnerable to a Cross-Frame Scripting (XFS) vulnerability, so this option allows extra security hardening where iframes are not used in deployment.
de: Legacy-Browser sind immer noch anfällig für eine Cross-Frame Scripting (XFS) Sicherheitsanfälligkeit, so dass diese Option zusätzliche Sicherheitsverhärtung ermöglicht, wo iframes nicht in der Bereitstellung verwendet werden.
id: Browser lawas masih rentan terhadap kerentanan Cross-Frame Scripting (XFS), jadi opsi ini memungkinkan pengerasan keamanan ekstra jika iframe tidak digunakan dalam penerapan.
tr_tr: Eski tarayıcılar, Çerçeveler Arası Komut Dosyası Çalıştırma (XFS) güvenlik açığı için halen savunmasızdır, bu nedenle bu seçenek, kurulumda iframelerin kullanılmadığı durumlarda ek güvenlik zorlamasına izin verir.

source: Likewise, encrypted data will remain encrypted as it is transferred over the network.
de: Ebenso bleiben verschlüsselte Daten verschlüsselt, während sie über das Netzwerk übertragen werden.
id: Demikian juga, data terenkripsi akan tetap dienkripsi saat ditransfer melalui jaringan.
tr_tr: Aynı şekilde, şifreli veriler ağ üzerinden aktarıldığı haliyle şifrelenmiş olarak kalır.

source: Limitations
de: Einschränkungen
id: Keterbatasan
tr_tr: Sınırlandırmalar

source: List domains a federated user can access: ``GET /OS-FEDERATION/domains``
de: List-Domains, die ein Verbundbenutzer aufrufen kann: ``GET /OS-FEDERATION/domains``
tr_tr: Federe kullanıcıların erişebileceği alan adları listeleme: ``GET /OS-FEDERATION/domains``

source: List projects a federated user can access: ``GET /OS-FEDERATION/projects``
de: Listenprojekte, die ein Verbundbenutzer zugreifen kann: ``GET/OS-FEDERATION/projects``
tr_tr: Federe kullanıcıların erişebileceği proje listeleme: ``GET /OS-FEDERATION/projects``

source: List resources relevant to the project, such as wiki pages describing its deployment and usage, and links to code repositories and relevant presentations.
de: Aufgelistete Ressourcen, die für das Projekt relevant sind, wie z.B. Wiki-Seiten, die ihre Bereitstellung und Nutzung beschreiben, sowie Links zu Code-Repositories und relevanten Präsentationen.
id: Buat daftar sumber daya yang relevan dengan proyek, seperti halaman wiki yang menjelaskan penyebaran dan penggunaannya, dan tautkan ke repositori kode dan presentasi yang relevan.
tr_tr: Projeye ilişkin, kaynak ve kullanımını açıklayan wiki sayfaları, kod depolarına bağlantılar ve ilgili sunumlar gibi kaynakları listeleyin.

source: Live migration mitigations
de: Live-Migrationsminderungen
id: Keterbatasan migrasi langsung
tr_tr: Canlı göç sınırlamaları

source: Live migration risks
de: Live-Migrationsrisiken
id: Resiko migrasi langsung (live).
tr_tr: Canlı göç riskleri

source: Load balancer
de: Lastenausgleicher
id: Load balancer (penyeimbang beban)
tr_tr: Yük dengeleyici

source: Load balancing
de: Lastverteilung
id: Penyeimbang beban (load balancing)
tr_tr: Yük dengeleme

source: Logging
de: Protokollierung
tr_tr: Günlük tutma

source: Logging capability
de: Logging-Fähigkeit
id: Kemampuan logging
tr_tr: Günlükleme yeteneği

source: Logs are not only valuable for proactive security and continuous compliance activities, but they are also a valuable information source for investigating and responding to incidents.
de: Logs sind nicht nur wertvoll für proaktive Sicherheit und kontinuierliche Compliance-Aktivitäten, sondern sie sind auch eine wertvolle Informationsquelle für die Untersuchung und Reaktion auf Zwischenfälle.
id: Log tidak hanya bermanfaat untuk keamanan proaktif dan aktivitas kepatuhan yang berkelanjutan, namun juga merupakan sumber informasi yang berharga untuk menyelidiki dan merespons insiden.
tr_tr: Kayıtlar yalnızca proaktif güvenlik ve sürekli uyumluluk faaliyetleri için değerli değildir, aynı zamanda olayları araştırıp bunlara yanıt vermek için değerli bir bilgi kaynağıdır.

source: Low
de: Niedrig
tr_tr: Düşük

source: Lower impact
de: Geringere Auswirkungen
id: Dampak lebih rendah
tr_tr: Daha düşük etki

source: MD5 is a weak and depreciated hashing algorithm. It can be cracked using brute force attack. Identity tokens are sensitive and need to be protected with a stronger hashing algorithm to prevent unauthorized disclosure and subsequent access.
de: MD5 ist ein schwacher und abgeschriebener Hash-Algorithmus. Es kann mit einem Brute-Force-Angriff geknackt werden. Identity Token sind empfindlich und müssen mit einem stärkeren Hash-Algorithmus geschützt werden, um eine unberechtigte Offenlegung und einen späteren Zugriff zu verhindern.
id: MD5 adalah algoritma hashing yang lemah dan terdepresiasi. Bisa retak menggunakan serangan brute force. Token identitas sensitif dan perlu dilindungi dengan algoritma hashing yang lebih kuat untuk mencegah pengungkapan yang tidak sah dan akses berikutnya.
tr_tr: MD5 zayıf ve değer kaybetmiş bir özetleme algoritmasıdır. Kaba kuvvet saldırısı ile kırılabilir. Kimlik belirteçleri hassasdır ve yetkisiz açıklama ve daha sonraki erişimi önlemek için daha güçlü bir özetleme algoritması ile korunması gerekir.

source: MGMT, GUEST, and PUBLIC as configured
de: MGMT, GUEST und PUBLIC wie konfiguriert
tr_tr: MGMT, GUEST, ve PUBLIC yapılandırıldığı gibi

source: Machine snapshots
de: Maschinenschattenkopien
id: Snapshot mesin
tr_tr: Makine görüntüleri

source: Maintain good records from your internal audit. These will prove useful during the external audit so you can be prepared to answer questions about mapping the compliance controls to a particular deployment.
de: Pflegen Sie gute Aufzeichnungen aus Ihrem internen Audit. Diese werden sich während des externen Audits als nützlich erweisen, so dass Sie bereit sind, Fragen zu beantworten, um die Compliance-Kontrollen einer bestimmten Implementierung zuzuordnen.
id: Pertahankan catatan bagus dari audit internal Anda. Ini akan terbukti berguna selama audit eksternal sehingga Anda dapat siap untuk menjawab pertanyaan tentang pemetaan kontrol kepatuhan terhadap penerapan tertentu.
tr_tr: İç denetiminizden iyi kayıt tutun. Bunlar harici denetim sırasında yararlı olacağından, uygunluk denetimlerini belirli bir dağıtıma eşleştirme hakkında soruları yanıtlamaya hazır olabilirsiniz.

source: Make sure you use either the SQL or the ``memcached`` driver for tokens, otherwise the tokens will not be shared between the processes of the Apache HTTPD server.
de: Vergewissern Sie sich, dass Sie entweder den SQL oder den ``memcached`` Treiber für Token verwenden, sonst werden die Token nicht zwischen den Prozessen des Apache HTTPD Servers geteilt.
tr_tr: Belirteçler için SQL veya ``memcached`` sürücüsünü kullandığınızdan emin olun, aksi takdirde belirteçler Apache HTTPD sunucusu süreçleri arasında paylaşılmaz.

source: Malini Bhandaru is a security architect at Intel. She has a varied background, having worked on platform power and performance at Intel, speech products at Nuance, remote monitoring and management at ComBrio, and web commerce at Verizon. She has a Ph.D. in Artificial Intelligence from the University of Massachusetts, Amherst.
de: Malini Bhandaru ist ein Sicherheitsarchitekt bei Intel. Sie hat einen abwechslungsreichen Hintergrund, nachdem sie an der Plattform Power and Performance bei Intel, Sprachprodukte bei Nuance, Fernüberwachung und Management bei ComBrio und Web-Commerce bei Verizon gearbeitet hat. Sie hat einen Ph.D. in Künstliche Intelligenz von der Universität von Massachusetts, Amherst.
id: Malini Bhandaru adalah seorang arsitek keamanan di Intel. Dia memiliki latar belakang yang bervariasi, setelah mengerjakan kekuatan dan kinerja platform di Intel, produk ucapan (speech) di Nuance, pemantauan jarak jauh dan manajemen di ComBrio, dan perdagangan web di Verizon. Dia memiliki gelar Ph.D. dalam Artificial Intelligence dari University of Massachusetts, Amherst.
tr_tr: Malini Bhandaru, Intel'de bir güvenlik mimarı. Intel'de platform gücü ve performansı, Nuance'taki konuşma ürünleri, ComBrio'daki uzaktan izleme ve yönetim ve Verizon'daki web ticareti üzerinde çalıştığı çeşitli geçmişe sahiptir. Massachusetts, Amherst Üniversitesi'nden Yapay Zekada doktora sahibidir.

source: Management interfaces
de: Management-Schnittstellen
id: Antarmuka manajemen
tr_tr: Yönetim arayüzleri

source: Management network
de: Management-Netzwerk
id: Jaringan manajemen
tr_tr: Yönetim ağı

source: Management utilities
de: Management-Dienstprogramme
id: Utilitas manajemen
tr_tr: Yönetim yardımcı programları

source: Mandatory Access Control (MAC)
de: Obligatorische Zugriffskontrolle (MAC)
tr_tr: Zorunlu Erişim Kontrolü (MAC)
