Repository: openstack/security-doc
Catalog: security-guide/source/locale/*/LC_MESSAGES/security-guide.po
Languages: de, id, tr_tr

source: You must also specify one of these supported authentication methods:
de: Sie müssen auch eine dieser unterstützten Authentifizierungsmethoden angeben:
id: Anda juga harus menentukan salah satu dari metode otentikasi yang didukung ini:
tr_tr: Bu desteklenen kimlik doğrulama yöntemlerinden birini de belirtmeniz gerekir:

source: You should configure your web service as a non-root (no UID 0) user such as ``swift`` mentioned before. The use of a port greater than 1024 is required to make this easy and avoid running any part of the web container as root. Normally, clients using the HTTP REST API and performing authentication automatically retrieve the full REST API URL they require from the authentication response. OpenStack's REST API allows for a client to authenticate to one URL and then be told to use a completely different URL for the actual service. For example, a Client authenticates to https://identity.cloud.example.org:55443/v1/auth and gets a response with their authentication key and Storage URL (the URL of the proxy nodes or load balancer) of https://swift.cloud.example.org:44443/v1/AUTH_8980.
de: Sie sollten Ihren Web-Service als Nicht-Root-Benutzer (keine UID 0) wie `` swift``konfigurieren. Die Verwendung eines Portes größer als 1024 ist erforderlich, um dies einfach zu machen und zu vermeiden, dass ein Teil des Webcontainers als root ausgeführt wird. Normalerweise erhalten Clients, die die HTTP-REST-API verwenden und die Authentifizierung durchführen, automatisch die vollständige REST-API-URL, die sie von der Authentifizierungsantwort benötigen. Die REST-API von OpenStack ermöglicht es einem Client, sich für eine URL zu authentifizieren und dann eine ganz andere URL für den eigentlichen Service zu verwenden. Zum Beispiel authentifiziert ein Client zu https://identity.cloud.example.org:55443/v1/auth und bekommt eine Antwort mit ihrem Authentifizierungsschlüssel und der Speicher-URL (die URL der Proxy-Knoten oder Load-Balancer) von https:/ /wift.cloud.example.org:44443/v1/AUTH_8980.
id: Anda harus mengkonfigurasi layanan web Anda sebagai pengguna non-root (no UID 0) seperti ``swift`` yang disebutkan sebelumnya. Penggunaan port yang lebih besar dari 1024 diperlukan untuk mempermudah dan menghindari menjalankan bagian penampung web sebagai root. Biasanya, klien yang menggunakan HTTP REST API dan melakukan autentikasi secara otomatis mengambil full REST API URL yang mereka butuhkan dari respons autentikasi. REST API OpenStack memungkinkan klien mengautentikasi ke satu URL dan kemudian diberi tahu untuk menggunakan URL yang sama sekali berbeda untuk layanan sebenarnya. Misalnya, Klien mengotentikasi https://identity.cloud.example.org:55443/v1/auth dan mendapat tanggapan dengan kunci autentikasi dan Storage URL (URL dari nodus proxy atau penyeimbang beban) https: / /swift.click.example.org:44443/v1/AUTH_8980.
tr_tr: Web servisinizi, daha önce bahsedilen ``swift`` gibi root olmayan bir kullanıcı (UID 0 olmayan) olarak yapılandırmalısınız. Bunu kolaylaştırmak ve web kabının herhangi bir bölümünü root olarak çalıştırmaktan kaçınmak için 1024'ten daha büyük bir port kullanılması gereklidir. Normalde, HTTP REST API'sını kullanan ve kimlik doğrulama gerçekleştiren istemciler otomatik olarak kimlik doğrulama yanıtından istedikleri tam REST API URL'sini alırlar. OpenStack'in REST API'sı, bir istemcinin bir URL'de kimlik doğrulamasını yapmasına ve ardından gerçek servis için tamamen farklı bir URL kullanması için söylenmesine izin verir. Örneğin, bir Müşteri, https://identity.cloud.example.org:55443/v1/auth adresinde kimlik doğrulaması yapar ve kimlik doğrulama anahtarı cevabını alır ve Depolama URL'si (vekil düğümlerin URL'si veya yük dengeleyici) ise https://swift.cloud.example.org:44443/v1/AUTH_8980'dir.

source: You should isolate API endpoint processes from each other and other processes on a machine. The configuration for those processes should be restricted to those processes not only by Discretionary Access Controls, but through Mandatory Access Controls. The goal of these enhanced access controls is to aid in the containment and escalation of API endpoint security breaches. With mandatory access controls, such breaches severely limit access to resources and provide earlier alerting on such events.
de: Sie sollten API-Endpunktprozesse voneinander und andere Prozesse auf einer Maschine isolieren. Die Konfiguration für diese Prozesse sollte auf diese Prozesse nicht nur durch diskretionäre Zugriffskontrollen beschränkt werden, sondern durch obligatorische Zugriffskontrollen. Das Ziel dieser erweiterten Zugangskontrollen ist es, die Eindämmung und Eskalation von API-Endpunktsicherheitsverletzungen zu unterstützen. Mit obligatorischen Zugangskontrollen beschränken diese Verstöße den Zugang zu Ressourcen erheblich und bieten eine frühere Alarmierung bei solchen Ereignissen.
id: Anda harus mengisolasi proses endpoint API satu sama lain dan proses lainnya pada mesin. Konfigurasi untuk proses tersebut harus dibatasi pada proses-proses tersebut tidak hanya oleh Discretionary Access Controls, namun melalui Mandatory Access Control. Tujuan dari kontrol akses yang disempurnakan ini adalah untuk membantu penahanan dan eskalasi pelanggaran keamanan endpoint API. Dengan kontrol akses wajib, pelanggaran tersebut sangat membatasi akses terhadap sumber daya dan memberikan peringatan sebelumnya mengenai kejadian tersebut.
tr_tr: API uç nokta süreçlerini diğerlerinden ve makinedeki diğer süreçlerden soyutlamalısınız. Bu süreçler için yapılandırmalar, diğer süreçlere sadece İsteğe Bağlı Erişim Kontrolü üzerinden değil, Zorunlu Erişim Kontrolü ile de kısıtlanmalıdır. Bu gelişmeiş erişim kontrollerinin hedefi API uç noktasının güvenlik ihlallerini sınırlanmasına yardımcı olmaktır. Zorunlu erişim kontrolleri ile bu tip ihlallerde kaynaklara erişimi kısıtlayabilir ve erken uyarı sistemleri sağlayabilir.

source: You should isolate API endpoint processes, especially those that reside within the public security domain should be isolated as much as possible. Where deployments allow, API endpoints should be deployed on separate hosts for increased isolation.
de: Sie sollten API-Endpunktprozesse isolieren. Insbesondere diejenigen, die sich innerhalb der öffentlichen Sicherheitsdomäne befinden, sollten so weit wie möglich isoliert sein. Wo Deployments erlaubt sind, sollten API-Endpunkte auf separaten Hosts für eine erhöhte Isolation eingesetzt werden.
id: Anda harus mengisolasi proses endpoint API, terutama yang berada di dalam domain keamanan publik harus diisolasi sebanyak mungkin. Bila pengerahan memungkinkan, endpoint API harus dipasang di host terpisah untuk peningkatan isolasi.
tr_tr: API uç noktası süreçlerini, özellikle de genel güvenliği alanında bulunanları izole etmeniz gerekir. Dağıtımların izin verdiği durumlarda, API uç noktaları, daha fazla yalıtım için ayrı ana bilgisayarlara yerleştirilmelidir.

source: You should test any update before you deploy it in a production environment. Typically this requires having a separate test cloud setup that first receives the update. This cloud should be as close to the production cloud as possible, in terms of software and hardware. Updates should be tested thoroughly in terms of performance impact, stability, application impact, and more. Especially important is to verify that the problem theoretically addressed by the update, such as a specific vulnerability, is actually fixed.
de: Sie sollten jedes Update testen, bevor Sie es in einer Produktionsumgebung bereitstellen. Typischerweise erfordert dies einen separaten Test-Cloud-Setup, der zuerst das Update erhält. Diese Cloud sollte so nah wie möglich an der Produktions-Cloud liegen, in Sachen Software und Hardware. Updates sollten gründlich in Bezug auf Leistung Auswirkungen, Stabilität, Anwendung Auswirkungen und vieles mehr getestet werden. Besonders wichtig ist es, zu überprüfen, ob das theoretisch durch die Aktualisierung angesprochene Problem, wie z.B. eine spezifische Anfälligkeit, tatsächlich behoben ist.
id: Anda harus menguji pembaruan sebelum menerapkannya di lingkungan produksi. Biasanya ini memerlukan setup awan uji terpisah yang pertama kali menerima pembaruan. Awan ini harus sedekat mungkin dengan awan produksi, dalam hal perangkat lunak dan perangkat keras. Pembaruan harus diuji secara menyeluruh dalam hal dampak kinerja, stabilitas, dampak aplikasi, dan lainnya. Terutama yang penting adalah untuk memverifikasi bahwa masalah yang secara teoritis ditangani oleh pembaruan, seperti kerentanan spesifik, dan masalah ini diperbaiki secara nata.
tr_tr: Herhangi bir güncelleştirmeyi bir canlı ortama dağıtmadan önce test etmelisiniz. Genellikle bu, önce güncellemeyi alan ayrı bir test bulutu kurulumuna ihtiyaç duyar. Bu bulut, yazılım ve donanım bakımından olabildiğince canlı ortam bulutuna yakın olmalıdır. Güncellemeler, performans etkisi, istikrar, uygulama etkisi ve daha fazlası bakımından iyice test edilmelidir. Özellikle önemli olan, güncellemenin teorik olarak ele aldığı, belirli bir güvenlik açığı gibi problemin gerçekte giderildiğini doğrulamaktır.

source: Your selection of supporting software, such as messaging and load balancing, can have serious security impacts on your cloud. It is important that you make the proper choices for your organization. This section provides some general guidelines for selecting supporting software.
de: Ihre Auswahl an unterstützender Software, wie Messaging und Load Balancing, können ernsthafte Sicherheitsauswirkungen auf Ihre Cloud haben. Es ist wichtig, dass Sie die richtige Wahl für Ihre Organisation treffen. Dieser Abschnitt enthält einige allgemeine Richtlinien für die Auswahl der unterstützenden Software.
id: Pilihan perangkat lunak pendukung Anda, seperti olah pesan dan penyeimbangan beban, dapat menimbulkan dampak keamanan serius pada awan Anda. Adalah penting bahwa Anda membuat pilihan yang tepat untuk organisasi Anda. Bagian ini memberikan beberapa panduan umum untuk memilih perangkat lunak pendukung.
tr_tr: Mesajlaşma ve yük dengeleme gibi destekleyici yazılım seçiminiz, bulutunuzda ciddi güvenlik etkileri yaratabilir. Kuruluşunuz için doğru seçimleri yapmanız önemlidir. Bu bölüm, destekleyen yazılımları seçmek için bazı genel yönergeler sunmaktadır.

source: ZeroMQ or 0MQ
de: ZeroMQ oder 0MQ
id: ZeroMQ atau 0MQ
tr_tr: ZeroMQ ya da 0MQ

source: `Apache Qpid Authentication <http://qpid.apache.org/releases/qpid-0.32/cpp-broker/book/chap-Messaging_User_Guide-Security.html#sect-Messaging_User_Guide-Security-User_Authentication>`__
de: `Apache Qpid Authentifizierung <http://qpid.apache.org/releases/qpid-0.32/cpp-broker/book/chap-Messaging_User_Guide-Security.html#sect-Messaging_User_Guide-Security-User_Authentication>`__
tr_tr: `Apache Qpid Kimlik Doğrulama <http://qpid.apache.org/releases/qpid-0.32/cpp-broker/book/chap-Messaging_User_Guide-Security.html#sect-Messaging_User_Guide-Security-User_Authentication>`__

source: `Apache Qpid Authorization <http://qpid.apache.org/releases/qpid-0.32/cpp-broker/book/chap-Messaging_User_Guide-Security.html#sect-Messaging_User_Guide-Security-Authorization>`__
de: `Apache Qpid Berechtigung <http://qpid.apache.org/releases/qpid-0.32/cpp-broker/book/chap-Messaging_User_Guide-Security.html#sect-Messaging_User_Guide-Security-Authorization>`__
tr_tr: `Apache Qpid Yetkilendirme <http://qpid.apache.org/releases/qpid-0.32/cpp-broker/book/chap-Messaging_User_Guide-Security.html#sect-Messaging_User_Guide-Security-Authorization>`__

source: `Barbican <https://docs.openstack.org/barbican/latest/>`_ is an OpenStack service that provides a back-end for Castellan. Barbican expects and authenticates a keystone authentication token to identify the user and project accessing or storing a secret. It then applies policy to determine if access is permitted. It also provides a number of additional useful features to improve secret management including quotas, per-secret ACLs, tracking of secret consumers and grouping of secrets in secret containers. Octavia, for example, integrates directly with Barbican (instead of Castellan) to take advantage of some of these features.
de: `Barbican <https://docs.openstack.org/barbican/latest/>` _ ist ein OpenStack-Dienst, der ein Back-End für Castellan bereitstellt. Barbican erwartet und authentifiziert ein Keystone-Authentifizierungstoken, um den Benutzer zu identifizieren und auf ein Geheimnis zuzugreifen oder zu speichern. Es wendet dann eine Richtlinie an, um festzustellen, ob der Zugriff erlaubt ist. Es bietet außerdem eine Reihe zusätzlicher nützlicher Funktionen, um das geheime Management zu verbessern, einschließlich der Kontingente, geheimen ACLs, der Verfolgung der Geheimnisse von Konsumenten und der Gruppierung von Geheimnissen in geheimen Containern. Octavia zum Beispiel integriert sich direkt mit Barbican (anstelle von Castellan), um einige dieser Funktionen zu nutzen.
id: `Barbican <https://docs.openstack.org/barbican/latest/>`_ adalah layanan OpenStack yang menyediakan back-end untuk Castellan. Barbican mengharapkan dan mengotentikasi token otentikasi keystone untuk mengidentifikasi pengguna dan proyek yang mengakses atau menyimpan sebuah rahasia. Kemudian menerapkan kebijakan untuk menentukan apakah akses diizinkan. Ini juga menyediakan sejumlah fitur bermanfaat tambahan untuk memperbaiki manajemen rahasia termasuk kuota, ACL per rahasia, pelacakan konsumen rahasia dan pengelompokan rahasia dalam wadah rahasia. Octavia, misalnya, terintegrasi langsung dengan Barbican (bukan Castellan) untuk memanfaatkan beberapa fitur ini.

source: `Castellan <https://docs.openstack.org/castellan/latest/>`_ is a library that provides a simple common interface to store, generate and retrieve secrets. It is used by most Openstack services for secret management. As a library, Castellan does not provide a secret store in and of itself. Rather, a back-end implementation is required to be deployed.
de: `Castellan <https://docs.openstack.org/castellan/latest/>` _ ist eine Bibliothek, die eine einfache gemeinsame Schnittstelle zum Speichern, Generieren und Abrufen von Geheimnissen bietet. Es wird von den meisten Openstack-Diensten für das Geheimnismanagement verwendet. Als Bibliothek bietet Castellan kein Geheimlager an und für sich. Stattdessen muss eine Back-End-Implementierung implementiert werden.
id: `Castellan <https://docs.openstack.org/castellan/latest/>`_ adalah sebuah perpustakaan yang menyediakan antarmuka umum sederhana untuk menyimpan, menghasilkan dan mengambil rahasia. Ini digunakan oleh sebagian besar layanan Openstack untuk manajemen rahasia. Sebagai perpustakaan, Castellan tidak menyediakan penyimpanan rahasia itu sendiri. Sebaliknya, implementasi back-end harus dilakukan.

source: `Common Criteria <https://www.commoncriteriaportal.org/>`_ is an internationally standardized software evaluation process, used by governments and commercial companies to validate that software technologies perform as advertised.
de: `Gemeinsame Kriterien <https://www.commoncriteriaportal.org/>`_ ist ein international standardisierter Software-Evaluierungsprozess, der von Regierungen und kommerziellen Unternehmen verwendet wird, um zu bestätigen, dass Software-Technologien wie angekündigt durchgeführt werden.
id: `Common Criteria <https://www.commoncriteriaportal.org/>`_ adalah proses evaluasi perangkat lunak yang distandarkan secara internasional, yang digunakan oleh pemerintah dan perusahaan komersial untuk memvalidasi teknologi perangkat lunak yang dilakukan seperti yang diiklankan.
tr_tr: `Ortak Kriter <https://www.commoncriteriaportal.org/>`_ hükümetler ve ticari şirketler tarafından yazılım teknolojilerinin reklamını yaptığını doğrulamak için kullanılan, uluslararası düzeyde standartlaştırılmış bir yazılım değerlendirme sürecidir.

source: `Hortonworks Data Platform <http://docs.hortonworks.com>`_
de: `Hortonworks Datenplattform <http://docs.hortonworks.com>`_
tr_tr: `Hortonworks Veri Platformu <http://docs.hortonworks.com>`_

source: `How to assign devices with VT-d in KVM <http://www.linux-kvm.org/page/How_to_assign_devices_with_VT-d_in_KVM>`_
de: `Wie man Geräte mit VT-d in KVM zuweisen kann <http://www.linux-kvm.org/page/How_to_assign_devices_with_VT-d_in_KVM>`_
tr_tr: `KVM'de aygıtlar VT-d ile nasıl atanır <http://www.linux-kvm.org/page/How_to_assign_devices_with_VT-d_in_KVM>`_

source: `How to create an RPM package <http://fedoraproject.org/wiki/How_to_create_an_RPM_package>`_
de: "So erstellen Sie ein RPM-Paket <http://fedoraproject.org/wiki/How_to_create_an_RPM_package>`_
tr_tr: `Nasıl RPM paketi oluşturulur <http://fedoraproject.org/wiki/How_to_create_an_RPM_package>`_

source: `National Security Agency, Suite B Cryptography <http://www.nsa.gov/ia/programs/suiteb_cryptography/index.shtml>`_
de: `National Security Agency, Suite B Kryptographie <http://www.nsa.gov/ia/programs/suiteb_cryptography/index.shtml>`_
tr_tr: `Ulusal Güvenlik Ajansı, Suit B Kriptografi <http://www.nsa.gov/ia/programs/suiteb_cryptography/index.shtml>`_

source: `OWASP Guide to Cryptography <https://www.owasp.org/index.php/Guide_to_Cryptography>`_
de: `OWASP Führer zur Kryptographie <https://www.owasp.org/index.php/Guide_to_Cryptography>`_
tr_tr: `OWASP Kriptografi Kılavuzu <https://www.owasp.org/index.php/Guide_to_Cryptography>`_

source: `OWASP MySQL Hardening <https://www.owasp.org/index.php/OWASP_Backend_Security_Project_MySQL_Hardening>`__
de: `OWASP MySQL Härten <https://www.owasp.org/index.php/OWASP_Backend_Security_Project_MySQL_Hardening> `__
tr_tr: `OWASP MySQL Sıkılaştırma <https://www.owasp.org/index.php/OWASP_Backend_Security_Project_MySQL_Hardening>`__

source: `OWASP PostgreSQL Hardening <https://www.owasp.org/index.php/OWASP_Backend_Security_Project_PostgreSQL_Hardening>`__
de: `OWASP PostgreSQL Härten <https://www.owasp.org/index.php/OWASP_Backend_Security_Project_PostgreSQL_Hardening> `__
tr_tr: `OWASP PostgreSQL Sıkılaştırma <https://www.owasp.org/index.php/OWASP_Backend_Security_Project_PostgreSQL_Hardening>`__

source: `OWASP Transport Layer Protection Cheat Sheet <https://www.owasp.org/index.php/Transport_Layer_Protection_Cheat_Sheet>`_
de: `OWASP Transport Layer Schutz Cheat Sheet <https://www.owasp.org/index.php/Transport_Layer_Protection_Cheat_Sheet>`_
tr_tr: `OWASP Taşıma Katmanı Koruması Kopya Kağıdı <https://www.owasp.org/index.php/Transport_Layer_Protection_Cheat_Sheet>`_

source: `OpenSSL and FIPS 140-2 <http://www.openssl.org/docs/fips/fipsnotes.html>`_
de: `OpenSSL und FIPS 140-2 <http://www.openssl.org/docs/fips/fipsnotes.html>`_
tr_tr: `OpenSSL ve FIPS 140-2 <http://www.openssl.org/docs/fips/fipsnotes.html>`_

source: `RabbitMQ Access Control <http://www.rabbitmq.com/access-control.html>`__
de: `RabbitMQ Zugriffskontrolle <http://www.rabbitmq.com/access-control.html> `__

source: `RabbitMQ Authentication <http://www.rabbitmq.com/authentication.html>`__
de: `RabbitMQ Authentifizierung <http://www.rabbitmq.com/authentication.html> `__

source: `RabbitMQ Configuration <http://www.rabbitmq.com/configure.html>`__
de: `RabbitMQ Konfiguration <http://www.rabbitmq.com/configure.html>`__
tr_tr: `RabbitMQ Yapılandırması <http://www.rabbitmq.com/configure.html>`__

source: `RabbitMQ SASL External Auth <http://hg.rabbitmq.com/rabbitmq-auth-mechanism-ssl/file/rabbitmq_v3_1_3/README>`__
de: `RabbitMQ SASL Externer Auth <http://hg.rabbitmq.com/rabbitmq-auth-mechanism-ssl/file/rabbitmq_v3_1_3/README>`__
tr_tr: `RabbitMQ SASL Harici Kimlik Doğrulama <http://hg.rabbitmq.com/rabbitmq-auth-mechanism-ssl/file/rabbitmq_v3_1_3/README>`__

source: `Security Technical Implementation Guide (STIG) <http://iase.disa.mil/stigs/Pages/index.aspx>`_
de: "Sicherheitstechnische Einführungsleitfaden (STIG) <http://iase.disa.mil/stigs/Pages/index.aspx>`_
tr_tr: `Güvenlik Teknik Uygulama Kılavuzu (STIG) <http://iase.disa.mil/stigs/Pages/index.aspx>`_

source: `Security in MySQL <http://downloads.mysql.com/docs/mysql-security-excerpt-5.1-en.pdf>`__
de: `Sicherheit in MySQL <http://downloads.mysql.com/docs/mysql-security-excerpt-5.1-en.pdf>`__
tr_tr: `MySQL'de kimlik doğrulama <http://downloads.mysql.com/docs/mysql-security-excerpt-5.1-en.pdf>`__

source: `SoK: SSL and HTTPS: Revisiting past challenges and evaluating certificate trust model enhancements <http://www.ieee-security.org/TC/SP2013/papers/4977a511.pdf>`_
de: `SoK: SSL und HTTPS: Revisiting past challenges and evaluating certificate trust model enhancements <http://www.ieee-security.org/TC/SP2013/papers/4977a511.pdf>`_
tr_tr: `SoK: SSL ve HTTPS: Geçmişteki zorlukların tekrar gözden geçirilmesi ve sertifika güven modeli geliştirmelerinin değerlendirilmesi <http://www.ieee-security.org/TC/SP2013/papers/4977a511.pdf>`_

source: `Spark <https://spark.apache.org>`_
de: `Funken <https://spark.apache.org>`_

source: `The Most Dangerous Code in the World: Validating SSL Certificates in Non-Browser Software <http://www.cs.utexas.edu/~shmat/shmat_ccs12.pdf>`_
de: `Der gefährlichste Code in der Welt: Validierung von SSL-Zertifikaten in Non-Browser-Software <http://www.cs.utexas.edu/~shmat/shmat_ccs12.pdf>`_
tr_tr: `Dünyadaki En Tehlikeli Kod: Tarayıcı Olmayan Yazılımda SSL Sertifikalarını Doğrulama <http://www.cs.utexas.edu/~shmat/shmat_ccs12.pdf>`_

source: `Total security in a PostgreSQL database <https://www.ibm.com/developerworks/opensource/library/os-postgresecurity>`__
de: `Gesamtsicherheit in einer PostgreSQL Datenbank <https://www.ibm.com/developerworks/opensource/library/os-postgresecurity> `__
tr_tr: `PostgreSQL veritabanında toplam güvenlik <https://www.ibm.com/developerworks/opensource/library/os-postgresecurity>`__

source: ``$PGDATA/root.crl`` - Certificate revocation list
de: ``$PGDATA/root.crl``- Zertifikatswiderrufliste
id: ``$PGDATA/root.crl`` - Daftar pencabutan sertifikat
tr_tr: ``$PGDATA/root.crl`` - Sertifika iptal listesi

source: ``$PGDATA/root.crt`` - Trusted certificate authorities
de: ``$PGDATA/root.crt``- Vertrauenswürdige Zertifizierungsstellen
id: ``$PGDATA/root.crt`` - Otoritas sertifikat dipercaya
tr_tr: ``$PGDATA/root.crt`` - Güvenilen sertifika otoriteleri

source: ``$PGDATA/server.crt`` - Server certificate
de: ``$PGDATA/server.crt``- Serverzertifikat
id: ``$PGDATA/server.crt`` - Sertifikat server
tr_tr: ``$PGDATA/server.crt`` - Sunucu sertifikası

source: ``$PGDATA/server.key`` - Private key corresponding to ``server.crt``
de: ``$PGDATA/server.key``- Privater Schlüssel, der ``server.crt`` entspricht
id: ``$PGDATA/server.key`` - Private key yang sesuai ``server.crt``
tr_tr: ``$PGDATA/server.key`` - ``server.crt`` sertifikasının gizli anahtarı

source: ``DISALLOW_IFRAME_EMBED`` can be used to prevent the OpenStack Dashboard from being embedded within an iframe.
de: ``DISALLOW_IFRAME_EMBED``kann verwendet werden, um zu verhindern, dass das OpenStack Dashboard in einem iframe eingebettet wird.
id: ``DISALLOW_IFRAME_EMBED`` dapat digunakan untuk mencegah Dasbor OpenStack tidak disisipkan dalam iframe.
tr_tr: ``DISALLOW_IFRAME_EMBED`` parametresi OpenStack Panelinin bir iframe içinde gömülmesini engellemek içindir.

source: ``Protocols``
de: ``Protokolle``
tr_tr: ``Protokoller``

source: ``Storage controller``
de: ``Speichercontroller``
tr_tr: ``Depolama kontrolcüsü``

source: ``demo`` user in ``demo`` tenant can list the types and the private share type named ``my_type`` is not visible for him.
de: ``demo``Benutzer in ``demo``Tenant kann die Typen auflisten und der private Anteil Typ namens ``my_type`` ist für ihn nicht sichtbar.
id: Pengguna ``demo`` di penyewaan ``demo`` dapat mendaftar jenis dan jenis share privat bernama ``my_type`` tidak terlihat untuknya.
tr_tr: ``demo`` kiracısındaki ``demo`` kullanıcısı türleri listeleyebilir ve ``my_type`` adlı gizli paylaşım türü onun için görünür değildir.
