Repository: openstack/security-doc
Catalog: security-guide/source/locale/*/LC_MESSAGES/security-guide.po
Languages: de, id, tr_tr

source: The reasons for doing this will change depending on the organizational requirements of the installation. In general, these fine grained controls are used in situations where an operator needs to restrict the creation, deletion, and retrieval of the Data processing service resources. Operators who need to restrict access within a project should be fully aware that there will need to be alternative means for users to gain access to the core functionality of the service (for example, provisioning clusters).
de: Die Gründe dafür werden sich je nach den organisatorischen Anforderungen der Anlage ändern. Im Allgemeinen werden diese feinkörnigen Kontrollen in Situationen verwendet, in denen ein Bediener die Erstellung, Löschung und Abfrage der Datenverarbeitungsdienstressourcen einschränken muss. Betreiber, die den Zugang innerhalb eines Projekts einschränken müssen, sollten sich bewusst sein, dass es für die Benutzer alternative Mittel gibt, um Zugang zu der Kernfunktionalität des Dienstes zu erhalten (z. B. Bereitstellungscluster).
id: Alasan untuk melakukan hal ini akan berubah tergantung pada persyaratan organisasi instalasi. Secara umum, kontrol berbutir halus (fine grained control) ini digunakan dalam situasi di mana operator perlu membatasi pembuatan, penghapusan, dan pengambilan sumber daya layanan pemrosesan Data. Operator yang perlu membatasi akses dalam sebuah proyek harus sepenuhnya sadar bahwa perlu ada cara alternatif bagi pengguna untuk mendapatkan akses ke fungsionalitas inti layanan (misalnya, provisioning cluster).
tr_tr: Bunu yapmanın nedenleri kurulumun örgütsel gerekliliklerine bağlı olarak değişecektir. Genel olarak, bu iyi ayarlanmış kontroller, operatöre Veri işleme hizmet kaynaklarının oluşturulması, silinmesi ve alınmasını sınırlamaları gereken durumlarda kullanılır. Bir projedeki erişimi kısıtlamaya ihtiyaç duyan operatörler, kullanıcıların hizmetin temel işlevselliğine erişebilecekleri alternatif araçların olması gerektiğinin tam olarak farkında olmalıdır (örneğin, provizyon kümeleri).

source: The recommended configuration for the Shared File Systems service real usage is to create a share with the CIFS share protocol and add to it the Microsoft Active Directory directory service. In this configuration you will get the centralized data base and the service that unites Kerberos and LDAP approaches. This is a real use case that is convenient for production shared file systems.
de: Die empfohlene Konfiguration für den Shared File Systems Service produktive Nutzung ist es, eine Freigabe mit dem CIFS-Freigabeprotokoll zu erstellen und ihm den Microsoft Active Directory-Verzeichnisdienst hinzuzufügen. In dieser Konfiguration erhalten Sie die zentrale Datenbank und den Service, der Kerberos- und LDAP-Ansätze vereint. Dies ist ein echter Anwendungsfall, der für die Produktion von gemeinsam genutzten Dateisystemen bequem ist.
id: Konfigurasi yang disarankan untuk penggunaan layanan Shared File Systems sebenarnya adalah membuat share dengan protokol share CIFS dan menambahkannya ke layanan direktori Microsoft Active Directory. Dalam konfigurasi ini Anda akan mendapatkan basis data terpusat dan layanan yang menyatukan pendekatan Kerberos dan LDAP. Ini adalah kasus penggunaan nyata yang sesuai untuk sistem file shared produksi.
tr_tr: Paylaşımlı Dosya Sistemleri servisinin gerçek kullanımı için önerilen yapılandırma, CIFS paylaşım protokolüyle bir paylaşım oluşturmak ve buna Microsoft Active Directory dizin hizmetini eklemektir. Bu yapılandırmada merkezi veri tabanını ve Kerberos ve LDAP yaklaşımlarını bir araya getiren servisi edineceksiniz. Bu, canlı paylaşımlı dosya sistemleri için uygun olan gerçek bir kullanım durumudur.

source: The recommended way to securely store and manage secrets in OpenStack is to use Barbican.
de: Der empfohlene Weg zum sicheren Speichern und Verwalten von Geheimnissen in OpenStack ist Barbican.
id: Cara yang disarankan untuk menyimpan dan mengelola rahasia di OpenStack dengan aman adalah dengan menggunakan Barbican.

source: The resources (clusters, jobs, and data sources) of the Data processing service are shared within the scope of a project. Although a single controller installation may manage several sets of resources, these resources will each be scoped to a single project. Given this constraint we recommend that user membership in projects is monitored closely to maintain proper segregation of resources.
de: Die Ressourcen (Cluster, Jobs und Datenquellen) des Datenverarbeitungsdienstes werden im Rahmen eines Projekts geteilt. Obwohl eine einzelne Controller-Installation mehrere Sätze von Ressourcen verwalten kann, werden diese Ressourcen jeweils zu einem einzigen Projekt skizziert. Angesichts dieser Einschränkung empfehlen wir, dass die Benutzer-Mitgliedschaft in Projekten genau überwacht wird, um eine ordnungsgemäße Trennung der Ressourcen zu gewährleisten.
id: Sumber daya (clusters, jobs, dan data source) dari layanan pengolahan Data dibagi dalam lingkup proyek. Meskipun satu instalasi pengontrol tunggal dapat mengatur beberapa kumpulan sumber daya, sumber daya ini masing-masing akan diolah satu proyek tunggal. Dengan kendala ini, kami merekomendasikan agar keanggotaan pengguna dalam proyek dipantau secara ketat untuk menjaga pemisahan sumber daya secara benar.
tr_tr: Veri işleme servisinin kaynakları (kümeler, işler ve veri kaynakları) bir proje kapsamında paylaşılır. Tek bir denetleyici kuruluşu birkaç kaynak kümesini yönetebilir, ancak bu kaynaklar her biri tek bir proje kapsamına alınır. Bu kısıtlamaya bakarsak, kaynakların uygun ayrımını sağlamak için projelerdeki kullanıcı üyeliğinin yakından izlenmesi önerilir.

source: The rsync protocol is used between storage service nodes to replicate data for high availability. In addition, the proxy service communicates with the storage service when relaying data back and forth between the client end-point and the cloud environment.
de: Das rsync-Protokoll wird zwischen Speicherdienstknoten verwendet, um Daten für Hochverfügbarkeit zu replizieren. Darüber hinaus kommuniziert der Proxy-Dienst mit dem Speicherdienst, wenn er Daten zwischen dem Client-Endpunkt und der Cloud-Umgebung hin- und herleitet.
id: Protokol rsync digunakan antara node layanan penyimpanan untuk mereplikasi data untuk ketersediaan tinggi. Selain itu, layanan proxy berkomunikasi dengan layanan penyimpanan saat menyampaikan data bolak-balik antara titik end-point dan lingkungan awan.
tr_tr: Yüksek kullanılabilirlik için veriyi çoğaltmak için depolama servisi düğümleri arasında rsync protokolü kullanılır. Ayrıca, vekil servisi, istemci sonlandırma noktası ile bulut ortamı arasında ileri geri veri iletirken depolama servisi ile iletişim kurar.

source: The search should not return the string written to the encrypted volume.
de: Die Suche sollte nicht die Zeichenfolge zurückgeben, die in das verschlüsselte Volume geschrieben wurde.
id: Pencarian seharusnya tidak mengembalikan string yang ditulis ke volume terenkripsi.
tr_tr: Arama, şifrelenmiş hacime yazılan dizgeyi döndürmez.

source: The second option is to use the `OpenStack Virtual Machine Image Guide <https://docs.openstack.org/image-guide/>`_. In this case, you will want to follow your organizations OS hardening guidelines or those provided by a trusted third-party such as the `Linux STIGs <http://iase.disa.mil/stigs/os/unix-linux/Pages/index.aspx>`_.
de: Die zweite Option besteht darin, den `OpenStack Virtual Machine Image Guide zu verwenden <https://docs.openstack.org/image-guide/>`_. In diesem Fall möchten Sie den OS Hardening Richtlinien Ihrer Organisation oder den von einem vertrauenswürdigen Drittanbieter wie die `Linux STIGs zur Verfügung gestellt <http://iase.disa.mil/stigs/os/unix-linux/Pages/index.aspx>`_ folgen.
id: Pilihan kedua adalah menggunakan `OpenStack Virtual Machine Image Guide <https://docs.openstack.org/image-guide/>`_. Dalam kasus ini, Anda akan ingin mengikuti panduan pengarahan OS organisasi Anda atau yang disediakan oleh pihak ketiga yang tepercaya seperti `Linux STIGs <http://iase.disa.mil/stigs/os/unix-linux/Pages/index.aspx>`_.
tr_tr: İkinci seçenek, `OpenStack Sanal Makine İmaj Rehberi'ni (https://docs.openstack.org/image-guide/)`_ kullanmaktır. Bu durumda organizasyonlarınızın OS sıkılaştırma yönergelerini veya `Linux STIGs <http://iase.disa.mil/stigs/os/unix-linux/Pages/index.aspx`_ gibi güvenilir bir üçüncü taraf tarafından sağlanan yönergeleri izlemek isteyeceksiniz.

source: The selection and configuration of a host-based intrusion detection tool is highly deployment specific. We recommend starting by exploring the following open source projects which implement a variety of host-based intrusion detection and file monitoring features.
de: Die Auswahl und Konfiguration eines Host-basierten Intrusion Detection-Tools ist hochgradig implementierungsspezifisch. Wir empfehlen Ihnen, die folgenden Open-Source-Projekte zu erkunden, die eine Vielzahl von Host-basierten Intrusion Detection- und File Monitoring-Funktionen implementieren.
id: Pemilihan dan konfigurasi alat deteksi intrusi berbasis host sangat spesifik. Sebaiknya mulailah dengan mengeksplorasi proyek open source berikut yang menerapkan berbagai deteksi intrusi berbasis host dan fitur pemantauan file.
tr_tr: Bir sunucu tabanlı saldırı tespit aletinin seçimi ve yapılandırması son derece kuruluma özgüdür. Başlangıçta, çeşitli sunucu tabanlı saldırı tespit ve dosya izleme özelliklerini uygulayan aşağıdaki açık kaynak projelerini incelemenizi öneriyoruz.

source: The server certificate, key, and certificate authority (CA) files should be placed in the $PGDATA directory in the following files:
de: Die Dateien des Zertifikats, des Schlüssels und der Zertifizierungsstelle (CA) sollten im Verzeichnis $PGDATA in den folgenden Dateien abgelegt werden:
id: File sertifikat server, key, dan certificate authority (CA) harus ditempatkan di direktori $PGDATA pada file berikut:
tr_tr: Sunucu sertifikası, anahtar ve sertifika yetkilisi (CA) dosyaları, $PGDATA dizinindeki aşağıdaki dosyalara yerleştirilmelidir:

source: The service that provides a stable RESTful API. The service authenticates and routes requests throughout the Shared Filesystem service. There is python-manilaclient to interact with the API. For more details on the Shared File Systems API, see the `OpenStack Shared File Systems API <https://developer.openstack.org/api-ref-share-v2.html>`_.
de: Der Dienst bietet eine stabile RESTful API. Der Dienst authentifiziert und leitet Anfragen im gesamten Shared Filesystem Service. Es ist python-manilaclient, um mit der API zu interagieren. Weitere Informationen zur API der Shared File Systems finden Sie in der API der OpenStack Shared File Systems <https://developer.openstack.org/api-ref-share-v2.html>`_.

source: The share driver creates the share server and manages, or handles, the share server life cycle.
de: Der Freigabetreiber erstellt den Freigabeserver und verwaltet oder verarbeitet den Lebenszyklus des Share-Servers.
id: Share driver menciptakan share server dan mengelola, atau menangani, siklus hidup share server
tr_tr: Paylaşım sürücüsü paylaşım sunucusunu oluşturur ve paylaşım sunucusu ömrünü yönetir veya yönetir.

source: The simple crypto plugin is configured by default in ``barbican.conf``. This plugin uses single symmetric key (KEK - or 'Key Encryption Key') which is stored in plain text in the ``barbican.conf`` file to encrypt and decrypt all secrets. This plugin is considered a less secure option and is only suitable for development and testing as the master key is stored within a config file in plain text, and is therefore not recommended for use in production deployments.
de: Das Simple Crypto-Plugin ist standardmäßig in ``barbican.conf`` konfiguriert. Dieses Plugin verwendet einen einzigen symmetrischen Schlüssel (KEK - oder 'Key Encryption Key'), der in Klartext in der Datei ``barbican.conf`` gespeichert wird, um alle Geheimnisse zu verschlüsseln und zu entschlüsseln. Dieses Plugin gilt als weniger sichere Option und eignet sich nur für Entwicklung und Test, da der Hauptschlüssel in Klartext in einer Konfigurationsdatei gespeichert wird und daher nicht für die Verwendung in Produktionsbereitstellungen empfohlen wird.
id: Plugin kripto sederhana dikonfigurasi secara default di ``barbican.conf``. Plugin ini menggunakan kunci simetris tunggal (KEK - atau 'Key Encryption Key') yang disimpan dalam teks biasa di file ``barbican.conf`` untuk mengenkripsi dan mendekripsi semua rahasia. Plugin ini dianggap sebagai pilihan yang kurang aman dan hanya cocok untuk pengembangan dan pengujian karena kunci utama disimpan dalam file konfigurasi dalam teks biasa, oleh karena itu tidak disarankan untuk digunakan dalam penyebaran produksi.

source: The system documentation for an OpenStack cloud deployment should follow the templates and best practices for the Enterprise Information Technology System in your organization. Organizations often have compliance requirements which may require an overall System Security Plan to inventory and document the architecture of a given system. There are common challenges across the industry related to documenting the dynamic cloud infrastructure and keeping the information up-to-date.
de: Die Systemdokumentation für eine OpenStack Cloud-Bereitstellung sollte den Vorlagen und Best Practices für das Enterprise Information Technology System in Ihrer Organisation folgen. Organisationen haben oft Compliance-Anforderungen, die einen Gesamtsystem-Sicherheitsplan erfordern, um die Architektur eines bestimmten Systems zu inventarisieren und zu dokumentieren. Es gibt gemeinsame Herausforderungen in der gesamten Branche im Zusammenhang mit der Dokumentation der dynamischen Cloud-Infrastruktur und halten die Informationen up-to-date.
id: Dokumentasi sistem untuk pengerahan awan OpenStack harus mengikuti template dan praktik terbaik untuk Enterprise Information Technology System di organisasi Anda. Organisasi sering memiliki persyaratan kepatuhan yang mungkin memerlukan System Security Plan secara keseluruhan untuk menginventarisasi dan mendokumentasikan arsitektur sistem yang diberikan. Ada tantangan umum di industri terkait dengan mendokumentasikan infrastruktur awan dinamis dan menjaga agar informasi tetap up-to-date.
tr_tr: OpenStack bulut dağıtımına ilişkin sistem belgeleri, kuruluşunuzdaki Kurumsal Bilgi Teknolojisi Sistemi için kullanılan şablonları ve en iyi uygulamaları takip etmelidir. Organizasyonların çoğu zaman, belirli bir sistemin mimarisini envanter ve belgelendirme için genel bir Sistem Güvenlik Planı gerektirebilecek uygunluk gereksinimleri vardır. Dinamik bulut altyapısını belgelemek ve bilginin güncelliğini korumak için endüstri genelinde karşılaşılan zorluklar vardır.

source: The system provides the capability to audit a large number of events, including individual system calls and events generated by trusted processes. Audit data is collected in regular files in ASCII format. The system provides a program for the purpose of searching the audit records. The system administrator can define a rule base to restrict auditing to the events they are interested in. This includes the ability to restrict auditing to specific events, specific users, specific objects or a combination of all of this. Audit records can be transferred to a remote audit daemon.
de: Das System bietet die Möglichkeit, eine Vielzahl von Ereignissen zu auditieren, einschließlich einzelner Systemaufrufe und Ereignisse, die von vertrauenswürdigen Prozessen generiert werden. Auditdaten werden in regulären Dateien im ASCII-Format gesammelt. Das System bietet ein Programm für die Suche nach den Audit-Datensätzen. Der Systemadministrator kann eine Regelbasis definieren, um die Überwachung auf die von ihnen interessierten Ereignisse zu beschränken. Dazu gehört auch die Möglichkeit, die Auditierung auf bestimmte Ereignisse, bestimmte Benutzer, bestimmte Objekte oder eine Kombination aus all dem zu beschränken. Audit-Datensätze können an einen Remote-Audit-Daemon übertragen werden.
id: Sistem ini menyediakan kemampuan untuk mengaudit sejumlah besar event, termasuk panggilan sistem individual dan kejadian yang dihasilkan oleh proses terpercaya (trusted processes). Data audit dikumpulkan dalam file biasa dalam format ASCII. Sistem ini menyediakan sebuah program untuk tujuan mencari catatan audit. Administrator sistem dapat menentukan basis aturan untuk membatasi pengauditan terhadap kejadian yang mereka minati. Ini mencakup kemampuan untuk membatasi audit terhadap kejadian tertentu, pengguna tertentu, objek tertentu atau kombinasi dari semua ini. Catatan audit dapat dipindahkan ke daemon audit jarak jauh.
tr_tr: Sistem, bireysel sistem çağrıları ve güvenilir süreçler tarafından üretilen olaylar da dahil olmak üzere çok sayıda olayı denetleme olanağı sağlar. Denetim verileri normal dosyalarda ASCII formatında toplanır. Sistem, denetim kayıtlarını aramak amacıyla bir program sunmaktadır. Sistem yöneticisi, denetimi ilgilendikleri olaylarla sınırlamak için bir kural tabanını tanımlayabilir. Bu, denetlemeyi belirli olaylara, belirli kullanıcılara, belirli nesneler veya bunların hepsinin bir birleşimi ile sınırlama becerisini içerir. Denetim kayıtları uzaktan denetim masasına aktarılabilir.

source: The system supports encrypted block devices to provide storage confidentiality via ``dm_crypt``.
de: Das System unterstützt verschlüsselte Blockgeräte, um die Vertraulichkeit der Speicherung über ``dm_crypt`` zur Verfügung zu stellen.
id: Sistem ini mendukung perangkat blok terenkripsi untuk menyediakan kerahasiaan penyimpanan via ``dm_crypt``.
tr_tr: Sistem, ``dm_crypt`` yoluyla depolama gizliliği sağlamak için şifreli blok aygıtlarını desteklemektedir.

source: The system supports the definition of trusted channels using SSH. Password based authentication is supported. Only a restricted number of cipher suites are supported for those protocols in the evaluated configuration.
de: Das System unterstützt die Definition von vertrauenswürdigen Kanälen mit SSH. Die passwortbasierte Authentifizierung wird unterstützt. Für diese Protokolle wird in der ausgewerteten Konfiguration nur eine eingeschränkte Anzahl von Chiffre-Suiten unterstützt.
id: Sistem ini mendukung definisi kanal terpercaya dengan menggunakan SSH. Otentikasi berbasis kata kunci didukung. Hanya sejumlah kecil cipher suites yang didukung untuk protokol tersebut dalam konfigurasi yang dievaluasi.
tr_tr: Sistem, SSH'yi kullanarak güvenilir kanalların tanımını desteklemektedir. Parola tabanlı kimlik doğrulama desteklenmektedir. Değerlendirilen yapılandırmada bu protokoller için sınırlı sayıda şifreleme grubu desteklenmektedir.

source: The team converged in Annapolis, MD due to the close proximity of some key members of the group. This was a remarkable collaboration between public sector intelligence community members, silicon valley startups and some large, well-known technology companies. The book sprint ran during the last week in June 2013 and the first edition was created in five days.
de: Das Team konvergierte in Annapolis, MD, aufgrund der Nähe von einigen wichtigen Mitgliedern der Gruppe. Dies war eine bemerkenswerte Zusammenarbeit zwischen Public-Intelligence-Community-Mitgliedern, Silizium-Tal-Startups und einigen großen, bekannten Technologie-Unternehmen. Der Buchsprint lief in der letzten Woche im Juni 2013 und die erste Auflage wurde in fünf Tagen erstellt.
id: Tim berkumpul di Annapolis, MD karena kedekatan beberapa anggota kunci kelompok tersebut. Ini adalah kolaborasi yang luar biasa antara anggota komunitas intelijen sektor publik, startup lembah silikon dan beberapa perusahaan teknologi besar dan terkenal. Book sprint berjalan cepat selama minggu terakhir di bulan Juni 2013 dan edisi pertama dibuat dalam lima hari.
tr_tr: Takım, grubun bazı kilit üyelerinin yakınlığı nedeniyle Annapolis, MD'de toplandı. Bu, kamu sektörü istihbarat derneği üyeleri, silikon vadili yeni teşebbüsler ve bazı büyük ve tanınmış teknoloji şirketleri arasındaki dikkat çekici bir işbirliğiydi. Kitap sprinti Haziran 2013'teki son haftada oldu ve ilk basım beş gün içinde oluşturuldu.

source: The team included:
de: Das Team beinhaltet:
id: Tim termasuk:
tr_tr: Takımdakiler:

source: The token is often passed within the structure of a larger context of an Identity service response. These responses also provide a catalog of the various OpenStack services. Each service is listed with its name, access endpoints for internal, admin, and public access.
de: Das Token wird oft innerhalb der Struktur eines größeren Kontextes einer Identitätsdienstantwort verabschiedet. Diese Antworten liefern auch einen Katalog der verschiedenen OpenStack-Dienste. Jeder Dienst ist mit seinem Namen, Zugangsendpunkte für interne, admin und öffentlichen Zugriff aufgeführt.
id: Token sering dilewatkan dalam struktur konteks respon layanan Identity yang lebih besar. Tanggapan ini juga menyediakan katalog berbagai layanan OpenStack. Setiap layanan terdaftar dengan namanya, akses endpoint untuk akses internal, admin, dan publik.
tr_tr: Belirteç, çoğu zaman bir Kimlik servisi yanıtının daha geniş bir bağlamının yapısı içinde geçirilir. Bu yanıtlar aynı zamanda çeşitli OpenStack servislerinin bir katalogunu sağlar. Her servis kendi adıyla, dahili, yönetici ve genel erişim için erişim uç noktaları ile listelenir.

source: The trust level of this network is heavily dependent on deployment decisions and as such we do not assign this any default level of trust.
de: Die Vertrauensstufe dieses Netzwerks hängt stark von den Entscheidungsentscheidungen ab, und als solche vergeben wir diese Standardvertragsstufe nicht.
id: Tingkat kepercayaan dari jaringan ini sangat bergantung pada keputusan penerapan dan karena itu kami tidak menetapkan tingkat kepercayaan default ini.
tr_tr: Bu ağın güven düzeyi, dağıtım kararlarına büyük ölçüde bağımlıdır ve bu nedenle, bu varsayılan herhangi bir güven düzeyini atamayız.

source: The two broadly defined types of nodes that generally make up an OpenStack installation are:
de: Die beiden weitgehend definierten Typen von Knoten, die in der Regel eine OpenStack-Installation bilden, sind:
id: Dua jenis node yang didefinisikan secara umum yang umumnya merupakan instalasi OpenStack adalah:
tr_tr: Genellikle bir OpenStack kurulumunu oluşturan iki geniş tanımlı düğüm türü vardır:
