Repository: openstack/security-doc
Catalog: security-guide/source/locale/*/LC_MESSAGES/security-guide.po
Languages: de, id, tr_tr

source: The dashboard's static media should be deployed to a subdomain of the dashboard domain and served by the web server. The use of an external content delivery network (CDN) is also acceptable. This subdomain should not set cookies or serve user-provided content. The media should also be served with HTTPS.
de: Die statischen Medien des Dashboards sollten in einer Subdomain der Dashboard-Domäne bereitgestellt und vom Webserver bedient werden. Die Verwendung eines externen Content Delivery Network (CDN) ist ebenfalls akzeptabel. Diese Subdomain sollte keine Cookies setzen oder den vom Benutzer bereitgestellten Inhalt dienen. Die Medien sollten auch mit HTTPS bedient werden.
id: Media statis dasbor harus dikirim ke subdomain dari domain dasbor dan dilayani oleh server web. Penggunaan content delivery network (CDN) eksternal juga dapat diterima. Subdomain ini tidak boleh menyetel cookies atau menyajikan konten yang disediakan pengguna. Media juga harus dilayani dengan HTTPS.
tr_tr: Panelin statik medyası, panel alanının bir alt alanına dağıtılmalı ve web sunucusu tarafından sunulmalıdır. Harici bir içerik dağıtım ağı (CDN) kullanılması da kabul edilebilir. Bu alt alan, çerezleri ayarlamaz veya kullanıcı tarafından sağlanan içerikler sunmamalıdır. Medya HTTPS ile de sunulmalıdır.

source: The data asset impact analysis breaks down the impact of the loss of confidentiality, integrity or availability for each data asset. Project architects should attempt to complete this, as they understand their project in the most detail, but the OpenStack Security Project (OSSP) will work through this with the project during the security review and are likely to add or update the impact details.
de: Die Analyse der Datenvermögen berücksichtigt die Auswirkungen des Vertrauensverlustes, der Integrität oder der Verfügbarkeit für jeden Datenbestand. Projektarchitekten sollten versuchen, dies zu vervollständigen, da sie ihr Projekt im Detail verstehen, aber das OpenStack Security Project (OSSP) wird dies mit dem Projekt während der Sicherheitsüberprüfung durchgehen und wahrscheinlich die Details hinzuzufügen oder aktualisieren.
id: Analisis dampak aset data memecah dampak hilangnya kerahasiaan, integritas atau ketersediaan setiap aset data. Arsitek proyek harus berusaha menyelesaikan ini, karena mereka memahami proyek mereka secara terinci, OpenStack Security Project (OSSP) akan menyelesaikannya dengan proyek selama tinjauan keamanan dan cenderung menambahkan atau memperbarui rincian dampaknya.
tr_tr: Veri varlığı etki analizi, her bir veri öğesi için gizlilik, bütünlük veya kullanılabilirlik kaybının etkisini ortadan kaldırır. Proje mimarları, projelerini en ayrıntılı şekilde anladıkları için bunu tamamlamaya çalışmalıdırlar ancak OpenStack Güvenlik Projesi (OSSP) güvenlik incelemesi sırasında projeyle birlikte çalışacak ve etki ayrıntılarını ekleme veya güncelleme olasılığı yüksektir.

source: The data processing controller can be configured to use proxy commands for accessing its cluster instances. In this manner custom network topologies can be created for installations which will not use the networks provided directly by the Networking service. We recommend using this option for installations which require limiting access between the controller and the instances.
de: Der Datenverarbeitungscontroller kann so konfiguriert werden, dass er Proxy-Befehle für den Zugriff auf seine Cluster-Instanzen verwendet. Auf diese Weise können benutzerdefinierte Netzwerk-Topologien für Installationen erstellt werden, die die direkt vom Networking-Dienst bereitgestellten Netzwerke nicht nutzen. Wir empfehlen, diese Option für Installationen zu verwenden, die einen eingeschränkten Zugriff zwischen dem Controller und den Instanzen erfordern.
id: Pengontrol pengolahan data dapat dikonfigurasi untuk menggunakan perintah proxy untuk mengakses instance clusternya. Dengan cara ini topologi jaringan kustom dapat dibuat untuk instalasi yang tidak akan menggunakan jaringan yang disediakan secara langsung oleh layanan Networking. Sebaiknya gunakan opsi ini untuk pemasangan yang memerlukan pembatasan akses antara pengontrol dan instances.
tr_tr: Veri işleme denetleyicisi, küme örneklerine erişmek için vekil komutlarını kullanacak şekilde yapılandırılabilir. Bu şekilde doğrudan ağ servisi tarafından sağlanan şebekeleri kullanmayan kurulumlar için özel ağ topolojileri oluşturulabilir. Denetleyici ile örnekler arasındaki erişimi sınırlayan kurulumlar için bu seçeneği kullanmanızı öneririz.

source: The data processing controller retains temporary storage of the username and password provided for object store access. When using proxy domains the controller will generate this pair for the proxy user, and the access of this user will be limited to that of the identity trust. We recommend using proxy domains in any installation where the controller or its database have routes to or from public networks.
de: Der Datenverarbeitungscontroller behält die temporäre Speicherung des Benutzernamens und des Kennworts für den Objektspeicherzugriff vor. Bei der Verwendung von Proxy-Domains wird der Controller dieses Paar für den Proxy-Benutzer generieren, und der Zugriff dieses Benutzers wird auf den Identitätsvertrauen beschränkt. Wir empfehlen die Verwendung von Proxy-Domains in jeder Installation, in der der Controller oder seine Datenbank Routen zu oder von öffentlichen Netzwerken hat.
tr_tr: Veri işleme denetleyicisi, nesne deposu erişimi için sağlanan kullanıcı adı ve parolanın geçici depolanmasını korur. Vekil etki alanlarını kullanırken, denetçi vekil kullanıcı için bu çifti oluşturacak ve bu kullanıcının erişimi kimlik güvenininkiyle sınırlı olacaktır. Denetleyicinin veya veritabanının ortak ağlara giden veya ortak ağlara yönlendirdiği herhangi bir kurulumda vekil etki alanlarını kullanmanızı öneririz.

source: The data security domain is concerned primarily with information pertaining to the storage services within OpenStack. Most of the data transmitted across this network requires high levels of integrity and confidentiality. In some cases, depending on the type of deployment there may also be strong availability requirements.
de: Die Datensicherheitsdomäne beschäftigt sich primär mit Informationen über die Speicherdienste im Rahmen von OpenStack. Die meisten Daten, die über dieses Netzwerk übertragen werden, benötigen ein hohes Maß an Integrität und Vertraulichkeit. In einigen Fällen kann es je nach Art der Bereitstellung auch starke Verfügbarkeitsanforderungen geben.
id: Domain keamanan data terutama terkait dengan informasi yang berkaitan dengan layanan penyimpanan di dalam OpenStack. Sebagian besar data yang dikirim melalui jaringan ini memerlukan tingkat integritas dan kerahasiaan yang tinggi. Dalam beberapa kasus, tergantung pada jenis penempatan, mungkin juga ada persyaratan ketersediaan yang kuat.
tr_tr: Veri güvenliği alanı öncelikle OpenStack içindeki depolama servisleri ile ilgili bilgilerle ilgilidir. Bu ağ üzerinden iletilen verilerin çoğunun yüksek seviyede bütünlük ve gizlilik gerektirir. Bazı durumlarda, dağıtım türüne bağlı olarak güçlü kullanılabilirlik gereksinimleri de olabilir.

source: The database user accounts created for the OpenStack services and for each node should have privileges limited to just the database relevant to the service where the node is a member.
de: Die für die OpenStack-Dienste erstellten Datenbankbenutzerkonten und für jeden Knoten sollten Berechtigungen auf nur die Datenbank beschränkt sein, die für den Dienst relevant ist und auf dem der Knoten Mitglied ist.
id: Akun pengguna database dibuat untuk layanan OpenStack dan untuk setiap node harus memiliki hak istimewa terbatas hanya pada database yang relevan dengan layanan di mana node adalah anggota.
tr_tr: OpenStack servisleri ve her düğüm için oluşturulan veritabanı kullanıcı hesaplarının, düğümün üye olduğu servise ilişkin yalnızca veritabanıyla sınırlı ayrıcalıklara sahip olması gerekir.

source: The dedicated management utilities (\*-manage) in some cases use the direct database connection.
de: Die dedizierten Verwaltungsdienstprogramme (\*-manage) verwenden in manchen Fällen die direkte Datenbankverbindung.
id: Utilitas manajemen dedicated (\*-manage) dalam beberapa kasus menggunakan koneksi database langsung.
tr_tr: Özel yönetim yardımcı programları (\*-manage) bazı durumlarda doğrudan veritabanı bağlantısını kullanır.

source: The default assumption for a data processing installation is that users will have access to all functionality within their projects. In the event that more granular control is required the Data processing service provides a policy file (as described in :doc:`../identity/policies`). These configurations will be highly dependent on the needs of the installing organization, and as such there is no general advice on their usage: see :ref:`data-processing-rbac-policies` for details.
de: Die Standardannahme für eine Datenverarbeitungsinstallation ist, dass Benutzer Zugriff auf alle Funktionalität in ihren Projekten haben. Für den Fall, dass eine umfangreichere Kontrolle erforderlich ist, stellt der Datenverarbeitungsdienst eine Richtliniendatei zur Verfügung (wie in :doc:`../identity/policy`) beschrieben. Diese Konfigurationen werden in hohem Maße von den Bedürfnissen der Installationsorganisation abhängig sein, und als solche gibt es keinen allgemeinen Rat über ihre Verwendung: siehe:ref:`data-processing-rbac-policies` für Details.
id: Asumsi default untuk instalasi pengolahan data adalah pengguna akan memiliki akses ke semua fungsi dalam proyek mereka. Jika diperlukan kontrol yang lebih terperinci, layanan pengolahan data menyediakan file kebijakan (seperti yang dijelaskan di :doc:`../identity/policies`). Konfigurasi ini akan sangat tergantung pada kebutuhan organisasi penginstalan, dan karena itu tidak ada saran umum mengenai penggunaannya: lihat :ref:`data-processing-rbac-policies` untuk rinciannya.
tr_tr: Veri işleme kurulumu için ana varsayım, kullanıcıların projelerindeki tüm işlevlere erişebilmesidir. Daha ayrıntılı denetime ihtiyaç duyulması durumunda, Veri işleme servisi bir politika dosyası sağlar (burada açıklandığı gibi :doc:`../identity/policies `). Bu yapılandırmalar yükleyen organizasyonun ihtiyaçlarına oldukça bağımlı olacaktır ve bu nedenle kullanımlarıyla ilgili genel bir tavsiye yoktur: ayrıntılar için bakınız :ref:`data-processing-rbac-policies`.

source: The default configuration file is ``/etc/apache2/apache2.conf`` on Ubuntu, ``/etc/httpd/conf/httpd.conf`` on RHEL and CentOS, ``/etc/apache2/httpd.conf`` on openSUSE and SUSE Linux Enterprise.
de: Die Standardkonfigurationsdatei lautet ``/etc/apache2/apache2.conf`` auf Ubuntu, ``/etc/httpd/conf/httpd.conf``auf RHEL und CentOS, ``/ etc/apache2/httpd.conf` `auf openSUSE und SUSE Linux Enterprise.
id: File konfigurasi defaultnya adalah ``/etc/apache2/apache2.conf`` di Ubuntu, ``/etc/httpd/conf/httpd.conf`` di RHEL dan CentOS, ``/etc/apache2/httpd.conf`` di openSUSE dan SUSE Linux Enterprise.
tr_tr: Varsayılan yapılandırma dosyası Ubuntu'da ``/etc/apache2/apache2.conf``, RHEL ve CentOS`da ``/etc/httpd/conf/httpd.conf``, openSUSE ve SUSE Linux Enterprise'da ``/etc/apache2/httpd.conf``.

source: The default session back end for horizon ``django.contrib.sessions.backends.signed_cookies`` saves user data in signed, but unencrypted cookies stored in the browser. Due to the fact that each dashboard instance is stateless, the previously mentioned methodology provides the ability to implement the most simple session back-end scaling.
de: Die Standard-Session-Back-End für den Horizont `` django.contrib.sessions.backends.signed_cookies``speichert Benutzerdaten in signierten, aber unverschlüsselten Cookies gespeichert im Browser. Aufgrund der Tatsache, dass jede Dashboard-Instanz zustandslos ist, bietet die oben erwähnte Methodik die Möglichkeit, die einfachste Session-Back-End- Skalierung zu implementieren.
id: Sesi back end default horizon ``django.contrib.sessions.backends.signed_cookies`` menyimpan data pengguna yang masuk, tapi cookie yang tidak dienkripsi disimpan di browser. Karena fakta bahwa setiap instance dasbor stateless, metodologi yang disebutkan sebelumnya memberi kemampuan untuk menerapkan penskalaan sesi back-end yang paling sederhana.
tr_tr: Horizon için varsayılan oturum arka ucu ``django.contrib.sessions.backends.signed_cookies`` kullanıcı verilerini tarayıcıda saklanan imzalanmış, ancak şifrelenmemiş çerezlere kaydeder. Her gösterge tablosu örneğinin durum bilgisiz olması nedeniyle daha önce bahsedilen metodoloji, en basit oturum arka uç ölçeklemeyi gerçekleştirme olanağı sağlar.

source: The design of OpenStack is such that separation of security domains is difficult. Because core services will usually bridge at least two domains, special consideration must be given when applying security controls to them.
de: Das Design von OpenStack ist so, dass die Trennung von Sicherheitsdomänen schwierig ist. Da Kerndienste in der Regel mindestens zwei Domänen überbrücken, muss bei der Anwendung von Sicherheitskontrollen besondere Rücksicht genommen werden.
id: Desain OpenStack sedemikian rupa sehingga pemisahan domain keamanan sulit dilakukan. Karena layanan inti biasanya akan menjembatani setidaknya dua domain, pertimbangan khusus harus diberikan saat menerapkan kontrol keamanan kepada mereka.
tr_tr: OpenStack'ın tasarımı, güvenlik alanlarının ayrılması zor olmaktadır. Çekirdek servisler çoğunlukla en az iki alanla köprü kuracağından, onlara güvenlik denetimleri uygularken özel bir dikkat gösterilmelidir.

source: The diagram above shows a compute node bridging the data and management domains; as such, the compute node should be configured to meet the security requirements of the management domain. Similarly, the API Endpoint in this diagram is bridging the untrusted public domain and the management domain, which should be configured to protect against attacks from the public domain propagating through to the management domain.
de: Das obige Diagramm zeigt einen Compute-Knoten, der die Daten- und Verwaltungsdomänen überbrückt; Als solches sollte der Compute-Knoten so konfiguriert sein, dass er die Sicherheitsanforderungen der Verwaltungsdomäne erfüllt. Ähnlich überbrückt der API-Endpunkt in diesem Diagramm die nicht vertrauenswürdige Öffentlichkeit und die Verwaltungsdomäne, die so konfiguriert sein sollte, dass sie vor Angriffen von der Öffentlichkeit, die sich in die Verwaltungsdomäne ausbreiten, schützen soll.
id: Diagram di atas menunjukkan sebuah node komputasi yang menjembatani data dan domain manajemen; Dengan demikian, node komputasi harus dikonfigurasi untuk memenuhi persyaratan keamanan dari domain manajemen. Demikian pula, Endpoint API dalam diagram ini menjembatani domain publik yang tidak tepercaya dan domain manajemen, yang harus dikonfigurasi untuk melindungi dari serangan dari domain publik yang memperbanyak melalui domain manajemen.
tr_tr: Yukarıdaki diyagram, veri ve yönetim alanlarını birbirine bağlayan bir hesaplama düğümünü göstermektedir; bu nedenle hesaplama düğümü, yönetim alanının güvenlik gereksinimlerini karşılayacak şekilde yapılandırılmalıdır. Benzer şekilde, bu diyagramdaki API Uç Noktası, güvenilmeyen genel alan ve yönetim alanını köprülemektedir; bu alan, kamu alanının yönetim alanına geçtiği saldırılara karşı koruma sağlamak üzere yapılandırılmalıdır.

source: The diagram shows the typical types of attacks that may be expected from the actors described in the previous section. Note that there will always be exceptions to this diagram.
de: Das Diagramm zeigt die typischen Angriffsarten, die von den im vorigen Abschnitt beschriebenen Akteuren erwartet werden können. Beachten Sie, dass es immer Ausnahmen von diesem Diagramm gibt.
id: Diagram menunjukkan jenis serangan khas yang mungkin diharapkan dari aktor yang dijelaskan pada bagian sebelumnya. Perhatikan bahwa akan selalu ada pengecualian pada diagram ini.
tr_tr: Şema bir önceki bölümde anlatılan aktörlerden beklenebilecek tipik saldırı türlerini göstermektedir. Bu diyagram için her zaman istisna olacağına dikkat edin.

source: The endpoint that receives the digitally signed certificate that is verifiable with reference to the public key listed on the certificate. The relying party should be in a position to verify the certificate up the chain, ensure that it is not present in the :term:`CRL` and also must be able to verify the expiry date on the certificate.
de: Der Endpunkt, der das digital signierte Zertifikat erhält, das mit Bezug auf den im Zertifikat aufgelisteten öffentlichen Schlüssel verifizierbar ist. Die verlassende Partei sollte in der Lage sein, die Bescheinigung über die Kette zu überprüfen, sicherzustellen, dass sie nicht in der: term: `CRL` vorhanden ist und auch in der Lage sein muss, das Verfallsdatum auf dem Zertifikat zu überprüfen.
id: Endpoint yang menerima sertifikat yang ditandatangani secara digital yang dapat diverifikasi dengan mengacu pada kunci publik yang tercantum pada sertifikat. Pihak yang mengandalkan harus berada dalam posisi untuk memverifikasi sertifikat atas rantai tersebut, memastikan bahwa hal itu tidak ada dalam :term:`CRL` dan juga harus dapat memverifikasi tanggal kadaluarsa sertifikat.
tr_tr: Sertifikada listelenen genel anahtarı referans alarak doğrulanabilir dijital olarak imzalanmış sertifikayı alan uç nokta. Bağlayıcı parti, sertifika zincirini doğrulamak için bir konumda olmalı, :term:`CRL` içinde yer almamalı ve sertifikadaki geçerlilik tarihini doğrulayabilmelisiniz.

source: The entity tag (ETag) of objects that have non-zero content
de: Das Entity-Tag (ETag) von Objekten, die keinen Inhalt haben
id: The entity tag (ETag) dari objek yang memiliki konten tidak nol
tr_tr: Sıfır içeriği olmayan nesnelerin varlık etiketi (ETag)

source: The ephemeral disk encryption feature addresses data privacy. The ephemeral disk is a temporary work space used by the virtual host operating system. Without encryption, sensitive user information could be accessed on this disk, and vestigial information could remain after the disk is unmounted.
de: Die Funktion zur flüchtigen Festplattenverschlüsselung berücksichtigt den Datenschutz. Bei der ephemeren Festplatte handelt es sich um einen temporären Arbeitsbereich, der vom Betriebssystem des virtuellen Hosts verwendet wird. Ohne Verschlüsselung kann auf diese Festplatte auf vertrauliche Benutzerinformationen zugegriffen werden, und Restdaten können nach dem Abhängen der Festplatte verbleiben.
id: Fitur enkripsi disk sesaat membahas privasi data. Disk fana adalah ruang kerja sementara yang digunakan oleh sistem operasi virtual host. Tanpa enkripsi, informasi pengguna yang sensitif dapat diakses pada disk ini, dan informasi sisa bisa tetap ada setelah disk tidak terpasang.

source: The ephemeral disk encryption feature, can interface with a key management service through a secure wrapper and support data isolation by providing ephemeral disk encryption keys on a per-tenant basis. Back-end key storage is recommended for enhanced security (for example, an HSM or KMIP server can be used as a barbican back-end secret store).
de: Die Funktion zur flüchtigen Festplattenverschlüsselung kann über einen sicheren Wrapper mit einem Schlüsselverwaltungsdienst verbunden werden und die Datenisolierung durch die Bereitstellung ephemerer Festplattenverschlüsselungsschlüssel auf Mandantenbasis unterstützen. Der Back-End-Schlüsselspeicher wird für erhöhte Sicherheit empfohlen (ein HSM- oder KMIP-Server kann beispielsweise als Backbone-Geheimspeicher verwendet werden).
id: Fitur enkripsi disk sesaat, dapat berinteraksi dengan layanan manajemen kunci melalui pembungkus yang aman dan mendukung isolasi data dengan menyediakan kunci enkripsi disk sesaat pada basis per-penyewa. Penyimpanan kunci back-end direkomendasikan untuk keamanan yang ditingkatkan (misalnya, server HSM atau KMIP dapat digunakan sebagai penyimpanan rahasia back-end barbican).

source: The file location should match the value of the configuration option ``idp_metadata_path`` that was assigned in the list of ``[saml]`` updates.
de: Der Dateispeicherort sollte mit dem Wert der Konfigurationsoption `` idp_metadata_path``übereinstimmen, die in der Liste der ``[saml] `` Updates zugewiesen wurde.
tr_tr: Dosya konumu, ``[saml]`` güncellemeleri listesinde atanan yapılandırma seçeneği ``idp_metadata_path`` değeriyle eşleşmelidir.

source: The final option is to use an automated image builder. The following example uses the Oz image builder. The OpenStack community has recently created a newer tool worth investigating: disk-image-builder. We have not evaluated this tool from a security perspective.
de: Die endgültige Option ist, einen automatisierten Abbildbauer zu verwenden. Im folgenden Beispiel wird der Oz-Abbild-Builder verwendet. Die OpenStack-Community hat vor kurzem ein neueres Tool geschaffen, das es untersucht hat: disk-image-builder. Wir haben dieses Tool aus Sicht der Sicherheit nicht ausgewertet.
id: Pilihan terakhir adalah menggunakan pembangun image otomatis. Contoh berikut menggunakan pembangun image Oz. Komunitas OpenStack baru-baru ini menciptakan alat baru yang layak untuk penyeledikan: disk-image-builder. Kami belum mengevaluasi alat ini dari perspektif keamanan.
tr_tr: Son seçenek, otomatik bir imaj oluşturucu kullanmaktır. Aşağıdaki örnek Oz imaj oluşturucuyu kullanmaktadır. OpenStack topluluğu son zamanlarda araştırmaya değer yeni bir araç yarattı: disk-image-builder. Bu aracı güvenlik açısından değerlendirmedik.

source: The first option is to obtain boot media from a trusted source.
de: Die erste Möglichkeit besteht darin, Boot-Medien aus einer vertrauenswürdigen Quelle zu erhalten.
id: Pilihan pertama adalah untuk mendapatkan media boot dari sumber terpercaya.
tr_tr: İlk seçenek güvenilir bir kaynaktan önyükleme medyası almaktır.

source: The first thing one should do when evaluating their OpenStack SSL/TLS needs is to identify the threats. You can divide these threats into external and internal attacker categories, but the lines tend to get blurred since certain components of OpenStack operate on both the public and management networks.
de: Das erste, was man bei der Auswertung ihrer OpenStack SSL/TLS-Bedürfnisse tun sollte, ist, die Bedrohungen zu identifizieren. Sie können diese Bedrohungen in externe und interne Angreiferkategorien aufteilen, aber die Linien neigen dazu, verschwommen zu werden, da bestimmte Komponenten von OpenStack sowohl im öffentlichen als auch im Managementnetz betrieben werden.
id: Hal pertama yang harus dilakukan saat mengevaluasi kebutuhan OpenStack SSL/TLS adalah untuk mengidentifikasi ancaman. Anda dapat membagi ancaman ini ke dalam kategori penyerang eksternal dan internal, namun garis tersebut cenderung menjadi kabur karena beberapa komponen OpenStack beroperasi pada jaringan publik dan manajemen.
tr_tr: OpenStack SSL/TLS ihtiyaçlarını değerlendirirken yapılması gereken ilk şey, tehditleri tanımlamaktır. Bu tehditleri harici ve dahili saldırgan kategorilerine bölebilirsiniz, ancak OpenStack'in belirli bileşenleri hem kamu hem de yönetim ağlarında faaliyet gösterdiğinden hatlar bulanıklaşır.

source: The following are the default listening ports for the various storage services:
de: Im Folgenden sind die Standard-Listenports für die verschiedenen Speicherdienste aufgeführt:
id: Berikut adalah listening port default untuk berbagai layanan penyimpanan:
tr_tr: Çeşitli depolama servisleri için varsayılan dinleme portları şunlardır:
