Repository: openstack/security-doc
Catalog: security-guide/source/locale/*/LC_MESSAGES/security-guide.po
Languages: de, id, tr_tr

source: Identify where risks exist in a cloud architecture and apply controls to mitigate the risks. In areas of significant concern, layered defenses provide multiple complementary controls to manage risk down to an acceptable level. For example, to ensure adequate isolation between cloud tenants, we recommend hardening :term:`QEMU <Quick EMUlator (QEMU)>`, using a hypervisor with SELinux support, enforcing mandatory access control policies, and reducing the overall attack surface. The foundational principle is to harden an area of concern with multiple layers of defense such that if any one layer is compromised, other layers will exist to offer protection and minimize exposure.
de: Identifizieren Sie, wo Risiken in einer Cloud-Architektur existieren und wenden Sie Kontrollen, um die Risiken zu mindern. In Bereichen von erheblicher Besorgnis bieten Schichtverteidigungen mehrere komplementäre Kontrollen, um das Risiko auf ein akzeptables Niveau zu lenken. Um beispielsweise eine ausreichende Trennung zwischen den Cloud-Mandaten zu gewährleisten, empfehlen wir ein Hardening :term:QEMU <Quick EMUlator (QEMU)>`, die Verwendung eines Hypervisor mit SELinux-Unterstützung, die Durchsetzung verbindlicher Zugangskontroll-Richtlinien und die Verringerung der gesamten Angriffsfläche. Das Grundprinzip besteht darin, einen Bereich mit mehreren Verteidigungsschichten zu verhärten, so dass, wenn eine Schicht kompromittiert wird, andere Schichten vorhanden sind, um Schutz zu bieten und die Exposition zu minimieren.
id: Identifikasi dimana ada risiko dalam arsitektur awan dan menerapkan kontrol untuk mengurangi risiko. Di bidang yang menjadi perhatian penting, pertahanan berlapis memberikan beberapa kontrol komplementer untuk mengelola risiko hingga tingkat yang dapat diterima. Misalnya, untuk memastikan isolasi yang memadai antara penyewa awan, kami merekomendasikan pengerasan (hardening) :term:`QEMU <Quick EMUlator (QEMU)>`, menggunakan hypervisor dengan dukungan SELinux, menerapkan kebijakan kontrol akses wajib, dan mengurangi keseluruhan permukaan serangan. Prinsip dasarnya adalah untuk mengeraskan area yang menjadi perhatian dengan banyak lapisan pertahanan sehingga jika ada satu lapisan yang terganggu, lapisan lain akan ada untuk menawarkan perlindungan dan meminimalkan pemaparan.
tr_tr: Bir bulut mimarisinde risklerin nerede olduğunu belirleyin ve riskleri azaltmak için kontrolleri uygulayın. Önemli endişe duyulan alanlarda, katmanlı savunma, riski kabul edilebilir bir seviyeye indirmek için birden fazla tamamlayıcı kontrol sağlar. Örneğin, bulut kiracıları arasında yeterli izolasyonu sağlamak için, :term:` QEMU <Quick EMUlator (QEMU)>`yu, SELinux desteği olan bir hypervisor kullanarak, zorunlu erişim kontrolü politikalarını zorlayan ve genel saldırı yüzeyini azaltan bir sıkılaştırma öneriyoruz. Temel ilke, bir alanı ilgilendiren bir alanı birden fazla katmanla sıkılaştırmak ve herhangi bir katmanın ele geçirilmesi durumunda koruma sağlayacak ve pozlamayı en aza indirecek diğer katmanların var olacağı şekilde sıkılaştırmaktır.

source: Identity
de: Identität
id: Identitas
tr_tr: Kimlik

source: Identity API endpoints
de: Identity-API-Endpunkte
tr_tr: Kimlik API uç noktaları

source: Identity service (keystone) provides identity, token, catalog, and policy services for use specifically by services in the OpenStack family. Identity service is organized as a group of internal services exposed on one or many endpoints. Many of these services are used in a combined fashion by the front end. For example, an authentication call validates user and project credentials with the identity service. If successful, it will create and return a token with the token service. More information can be found by reading the `keystone Developer Documentation <https://docs.openstack.org/keystone/latest/index.html>`_.
de: Identity Service (Keystone) bietet Identitäts-, Token-, Katalog- und Richtliniendienste für die Nutzung speziell durch Dienstleistungen in der OpenStack-Familie. Der Identitätsdienst ist als eine Gruppe von internen Diensten organisiert, die auf einem oder mehreren Endpunkten liegen. Viele dieser Dienstleistungen werden in einer kombinierten Art und Weise von der Vorderseite verwendet. Beispielsweise validiert ein Authentifizierungsaufruf Benutzer- und Projektanmeldeinformationen mit dem Identitätsdienst. Wenn es erfolgreich ist, wird es ein Token mit dem Token-Service erstellen und zurückgeben. Weitere Informationen finden Sie unter `Keystone Developer Documentation <https://docs.openstack.org/keystone/latest/index.html>`_.
id: Layanan Identity (keystone) menyediakan layanan identitas, token, katalog, dan kebijakan untuk digunakan secara khusus oleh layanan di keluarga OpenStack. Layanan Identity diatur sebagai sekelompok layanan internal yang terpapar pada satu atau banyak endpoint. Banyak dari layanan ini digunakan secara gabungan oleh front end. Misalnya, panggilan otentikasi memvalidasi kredensial pengguna dan proyek dengan layanan Identity. Jika berhasil, maka akan membuat dan mengembalikan token dengan layanan token. Informasi lebih lanjut dapat ditemukan dengan membaca `keystone Developer Documentation <https://docs.openstack.org/keystone/latest/index.html>`_.

source: Identity service enforces ``external`` authentication when environment variable ``REMOTE_USER`` is present so make sure Shibboleth does not set the ``REMOTE_USER`` environment variable. To do so, scan through the ``/etc/shibboleth/shibboleth2.xml`` configuration file and remove the ``REMOTE_USER`` directives.
de: Identity Service erzwingt die ``externe``Authentifizierung, wenn die Umgebungsvariable ``REMOTE_USER``vorhanden ist, also stellen Sie sicher, dass Shibboleth die ``REMOTE_USER``Umgebungsvariable nicht setzt. Um dies zu tun, scannen Sie durch die ``/etc/shibboleth/shibboleth2.xml`` Konfigurationsdatei und entfernen Sie die ``REMOTE_USER``Richtlinien.
tr_tr: Kimlik servisi, ``REMOTE_USER`` çevre değişkeni olduğunda ``harici`` kimlik doğrulamasını zorlar; bu nedenle Shibboleth'in ``REMOTE_USER`` çevre değişkenini ayarlamadığından emin olun. Bunu yapmak için ``/etc/shibboleth/shibboleth2.xml`` yapılandırma dosyasını tarayın ve ``REMOTE_USER`` yönergelerini kaldırın.

source: If :ref:`check_compute_01` and permissions set to 640, root has read/write access and nova has read access to these configuration files. The access rights can also be validated using the following command. This command will only be available on your system if it supports ACLs.
de: Wenn:ref:`check_compute_01` und Berechtigungen auf 640 eingestellt sind, hat root Lese-/Schreibzugriff und nova hat Lesezugriff auf diese Konfigurationsdateien. Die Zugriffsrechte können auch mit dem folgenden Befehl validiert werden. Dieser Befehl ist nur auf Ihrem System verfügbar, wenn er ACLs unterstützt.
id: Jika :ref:`check_compute_01` dan izin diset ke 640, root telah membaca/menulis akses dan nova telah membaca akses ke file konfigurasi ini. Hak akses juga dapat divalidasi dengan menggunakan perintah berikut. Perintah ini hanya akan tersedia di sistem Anda jika mendukung ACL.
tr_tr: Eğer :ref:`check_compute_01` ve izinler 640 olarak ayarlandıysa, root'un okuma/yazma yetkisi varsa ve nova'nın bu yapılandırma dosyalarına okuma yetkisi varsa. Bu erişim izinleri aşağıdaki komut ile de doğrulanabilir. Bu komutlar sisteminiz ACL'leri destekliyorsa kullanılabilirdir.

source: If ``insecure_debug`` is set to true, then the server will return information in HTTP responses that may allow an unauthenticated or authenticated user to get more information than normal, such as additional details about why authentication failed.
de: Wenn ``insecure_debug``auf true gesetzt ist, gibt der Server Informationen in HTTP-Antworten zurück, die einem nicht authentifizierten oder authentifizierten Benutzer erlauben können, mehr Informationen als normal zu erhalten, z. B. zusätzliche Details darüber, warum die Authentifizierung fehlgeschlagen ist.
id: Jika ``insecure_debug`` disetel ke true, server akan mengembalikan informasi dalam tanggapan HTTP yang memungkinkan pengguna yang tidak berkepentingan atau dikonfirmasi untuk mendapatkan lebih banyak informasi daripada biasanya, seperti detail tambahan mengapa otentikasi gagal.
tr_tr: `` Insecure_debug`` parametresi true olarak ayarlanırsa sunucu, kimlik doğrulamanın başarısız olmasına ilişkin ek ayrıntılar gibi, kimliği doğrulanmamış veya kimliği doğrulanmış bir kullanıcının normalden daha fazla bilgi almasına izin verebilecek HTTP yanıtlarında bilgi döndürür.

source: If a cloud deployment requires strong separation of tenants, as is the situation with public clouds and some private clouds, deployers should consider disabling TPS and KSM memory optimizations.
de: Wenn eine Cloud-Implementierung eine starke Trennung der Tenant erfordert, wie es bei öffentlichen Clouds und einigen privaten Clouds der Fall ist, sollten die Deployer TPS- und KSM-Speicheroptimierungen deaktivieren.
id: Jika penyebaran awan memerlukan pemisahan penyewa yang kuat, seperti situasi dengan awan publik dan beberapa awan pribadi, pengawas harus mempertimbangkan untuk menonaktifkan pengoptimalan memori TPS dan KSM.
tr_tr: Kamu bulutları ve bazı özel bulutlar ile olduğu gibi bir bulut dağıtımı kiracıların güçlü bir şekilde ayrılmasını gerektiriyorsa, dağıtımcılar TPS ve KSM bellek optimizasyonlarını devre dışı bırakmayı düşünmelidirler.

source: If network namespace support is not present, a further limitation of the L3 agent is that only a single logical router is supported.
de: Wenn keine Netzwerk-Namespace-Unterstützung vorhanden ist, ist eine weitere Einschränkung des L3-Agenten, dass nur ein einzelner logischer Router unterstützt wird.
id: Jika dukungan namespace jaringan tidak ada, batasan lebih lanjut dari agen L3 adalah bahwa hanya satu router logis yang didukung.
tr_tr: Ağ ad alanı desteği yoksa, L3 aracısının bir başka kısıtlaması yalnızca tek bir mantıksal yönlendiricinin desteklenmesidir.

source: If new certificates are required, they can be easily created by executing:
de: Wenn neue Zertifikate erforderlich sind, können sie einfach durch Ausführen erstellt werden:
tr_tr: Yeni sertifikalar gerekiyorsa, aşağıdakileri uygulayarak kolayca oluşturulabilirler:

source: If nodes that run either neutron-l3-agent or neutron-dhcp-agent use overlapping IP addresses, those nodes must use Linux network namespaces. By default, the DHCP and L3 agents use Linux network namespaces and run in their own respective namespaces. However, if the host does not support multiple namespaces, the DHCP and L3 agents should be run on separate hosts. This is due to the fact that there is no isloation between the IP addresses created by the L3 agent and the DHCP agent.
de: Wenn Knoten, die entweder Neutron-l3-Agent oder Neutron-DHCP-Agent überlappende IP-Adressen verwenden, müssen diese Knoten Linux-Netzwerk-Namespaces verwenden. Standardmäßig verwenden die DHCP- und L3-Agenten Linux-Netzwerk-Namespaces und laufen in ihren eigenen Namespaces. Wenn der Host jedoch nicht mehrere Namespaces unterstützt, sollten die DHCP- und L3-Agenten auf separaten Hosts ausgeführt werden. Dies liegt daran, dass zwischen den vom L3-Agenten und dem DHCP-Agenten erstellten IP-Adressen keine Isolation besteht.
id: Jika node yang menjalankan agen neutron-l3-agent atau neutron-dhcp-agent menggunakan alamat IP yang tumpang tindih, node tersebut harus menggunakan namespace jaringan Linux. Secara default, agen DHCP dan L3 menggunakan namespace jaringan Linux dan berjalan di namespace masing-masing. Namun, jika host tidak mendukung beberapa namespace, agen DHCP dan L3 harus dijalankan di host yang terpisah. Hal ini disebabkan fakta bahwa tidak ada isolasi antara alamat IP yang dibuat oleh agen L3 dan agen DHCP.
tr_tr: neutron-l3-agent veya neutron-dhcp-agent çalıştıran düğümler çakışan IP adresleri kullanıyorsa, bu düğümler Linux ağ ad alanlarını kullanmalıdır. Varsayılan olarak, DHCP ve L3 aracıları Linux ağ ad alanlarını kullanır ve kendi ilgili ad alanlarında çalışır. Bununla birlikte, ana makine birden fazla ad alanını desteklemiyorsa, DHCP ve L3 aracıları ayrı bilgisayarlarda çalıştırılmalıdır. Bunun nedeni, L3 aracısı ve DHCP aracı tarafından oluşturulan IP adresleri arasında hiçbir yalıtım bulunmamasıdır.

source: If prevention is not an option, detection can be used to mitigate damage. Detection involves frequent review of access control logs to identify unauthorized attempts to access accounts. Possible remediation would include reviewing the strength of the user password, or blocking the network source of the attack through firewall rules. Firewall rules on the keystone server that restrict the number of connections could be used to reduce the attack effectiveness, and thus dissuade the attacker.
de: Wenn Prävention keine Option ist, kann die Erkennung zur Schadensbegrenzung verwendet werden. Die Erkennung beinhaltet eine häufige Überprüfung der Zugriffssteuerungsprotokolle, um nicht autorisierte Versuche zu identifizieren, auf Konten zuzugreifen. Mögliche Sanierung würde die Überprüfung der Stärke des Benutzerpassworts oder die Blockierung der Netzwerkquelle des Angriffs durch Firewall-Regeln beinhalten. Firewall-Regeln auf dem Keystone-Server, die die Anzahl der Verbindungen einschränken, könnten verwendet werden, um die Angriffseffektivität zu reduzieren und somit den Angreifer abzubringen.
id: Jika pencegahan bukan pilihan, deteksi bisa digunakan untuk mengurangi kerusakan. Deteksi melibatkan tinjauan berulang terhadap log kontrol akses untuk mengidentifikasi upaya yang tidak sah untuk mengakses akun. Remediasi yang mungkin dilakukan mencakup meninjau kekuatan kata sandi pengguna, atau memblokir sumber serangan jaringan melalui peraturan firewall. Aturan firewall pada server keystone yang membatasi jumlah koneksi dapat digunakan untuk mengurangi efektivitas serangan, dan dengan demikian mencegah penyerang.
tr_tr: Eğer önleme bir seçenek değilse, hasarın hafifletilmesi için tespit kullanılabilir. Algılama, hesaplara erişmek için yetkisiz girişimleri tanımlamak için erişim denetim günlüklerinin sık gözden geçirilmesini içerir. Olası düzeltme, kullanıcı parolasının gücünü incelemek veya güvenlik duvarı kuralları aracılığıyla saldırının ağ kaynağını engellemek olabilir. Bağlantı sayısını kısıtlayan keystone sunucusundaki güvenlik duvarı kuralları, saldırı etkinliğini azaltmak ve böylece saldırganı caydırmak için kullanılabilir.

source: If ssync is used instead of rsync, the object service port is used for maintaining durability.
de: Wenn anstelle von rsync ssync verwendet wird, wird der Objekt-Service-Port zur Aufrechterhaltung der Haltbarkeit verwendet.
id: Jika ssync digunakan sebagai pengganti rsync, port layanan objek digunakan untuk menjaga daya tahan.
tr_tr: Rsync yerine ssync kullanılırsa, nesne servis portu dayanıklılığı korumak için kullanılır.

source: If subscribing to a public cloud service, you should check with the cloud provider for an outline of the process used to produce their default images. If the provider allows you to upload your own images, you will want to ensure that you are able to verify that your image was not modified before using it to create an instance. To do this, refer to the following section on Image Signature Verification, or the following paragraph if signatures cannot be used.
de: Wenn Sie einen öffentlichen Cloud-Service abonnieren, sollten Sie mit dem Cloud-Anbieter nach einem Umriss des Prozesses, der verwendet wird, um ihre Standardbilder zu erstellen, prüfen. Wenn der Provider Ihnen erlaubt, Ihre eigenen Abbilder hochzuladen, müssen Sie sicherstellen, dass Sie in der Lage sind zu überprüfen, ob Ihr Abbild nicht geändert wurde, bevor Sie es verwenden, um eine Instanz zu erstellen. Weitere Informationen hierzu finden Sie im folgenden Abschnitt zur Abbildsignaturprüfung oder im folgenden Absatz, wenn Signaturen nicht verwendet werden können.
id: Jika berlangganan layanan awan publik, Anda harus memeriksa dengan penyedia awan untuk garis besar (outline) proses yang digunakan untuk menghasilkan image default mereka. Jika penyedia memungkinkan Anda untuk mengunggah image Anda sendiri, Anda akan ingin memastikan bahwa Anda dapat memverifikasi bahwa image Anda tidak dimodifikasi sebelum menggunakannya untuk membuat sebuah instance. Untuk melakukan ini, lihat bagian berikut pada Image Signature Verification, atau paragraf berikut jika tanda tangan tidak dapat digunakan.
tr_tr: Bir genel bulut hizmetine abone oluyorsanız, varsayılan görüntülerini üretmek için kullanılan işlemin ana hatlarını bulmak için bulut sağlayıcısına danışmalısınız. Sağlayıcı kendi imajlarınızı yüklemenizi sağlarsa, imajınızın bir örneğini oluşturmak için kullanmadan önce değiştirilmediğini doğrulayabildiğinizden emin olmasını isteyeceksiniz. Bunu yapmak için imaj İmzalama Doğrulama hakkında aşağıdaki bölüme veya imzalar kullanılamıyorsa aşağıdaki paragrafa bakın.

source: If the OpenStack Dashboard is deployed behind a proxy and the proxy strips ``X-Forwarded-Proto`` header from all incoming requests, or sets the ``X-Forwarded-Proto`` header and sends it to the Dashboard, but only for requests that originally come in via HTTPS, then you should consider configuring ``SECURE_PROXY_SSL_HEADER``
de: Wenn das OpenStack Dashboard hinter einem Proxy installiert ist und der Proxy ``X-Forwarded-Proto``Header aus allen eingehenden Anfragen entfernt oder den ``X-Forwarded-Proto``Header setzt und ihn an das Dashboard sendet, aber nur für Anfragen, die ursprünglich über HTTPS kommen, dann sollten Sie erwägen, ``SECURE_PROXY_SSL_HEADER``zu konfigurieren.
id: Jika Dasbor OpenStack ditempatkan di belakang proxy dan proxy strips ``X-Forwarded-Proto`` header dari semua permintaan masuk, atau setel ``X-Forwarded-Proto`` header dan kirimkan ke Dashboard, tapi hanya untuk permintaan yang awalnya masuk melalui HTTPS, maka Anda harus mempertimbangkan untuk mengkonfigurasi ``SECURE_PROXY_SSL_HEADER``
tr_tr: OpenStack Paneli bir vekilin arkasında konuşlandırılmışsa ve vekil, gelen tüm isteklerden ``X-Forwarded-Proto`` başlığını kaldırıyorsa veya ``X-Forwarded-Proto`` başlığını ayarlar ve Panele gönderirse ancak yalnızca Panele gönderirse başlangıçta HTTPS yoluyla gelen talepler için, ``SECURE_PROXY_SSL_HEADER`` yapılandırmayı düşünmelisiniz.

source: If the OpenStack volume encryption feature is not used, then other approaches generally would be more difficult to enable. If a back-end plug-in is being used, there may be independent ways of doing encryption or non-standard overwrite solutions. Plug-ins to OpenStack Block Storage will store data in a variety of ways. Many plug-ins are specific to a vendor or technology, whereas others are more DIY solutions around filesystems such as LVM or ZFS. Methods to securely destroy data will vary from one plug-in to another, from one vendor's solution to another, and from one filesystem to another.
de: Wenn die OpenStack-Volume-Verschlüsselungsfunktion nicht verwendet wird, dann sind andere Ansätze im Allgemeinen schwieriger zu aktivieren. Wenn ein Back-End-Plug-In verwendet wird, kann es unabhängige Möglichkeiten geben, Verschlüsselungs- oder Nicht-Standard-Überschreiblösungen durchzuführen. Plug-Ins zu OpenStack Block Storage speichert Daten auf vielfältige Weise. Viele Plug-Ins sind spezifisch für einen Anbieter oder eine Technologie, während andere mehr DIY-Lösungen rund um Dateisysteme wie LVM oder ZFS sind. Methoden, um Daten sicher zu zerstören, variieren von einem Plug-In zum anderen, von der Lösung eines Lieferanten zu einem anderen und von einem Dateisystem zum anderen.
id: Jika fitur enkripsi volume OpenStack tidak digunakan, maka pendekatan lain pada umumnya akan lebih sulit untuk diaktifkan. Jika plug-in back-end digunakan, mungkin ada cara independen untuk melakukan solusi enkripsi atau non-standar akan menimpa. Plug-in ke OpenStack Block Storage akan menyimpan data dengan berbagai cara. Banyak plug-in khusus untuk vendor atau teknologi, sedangkan yang lain akan lebih banyak solusi DIY seputar filesystem seperti LVM atau ZFS. Metode untuk menghancurkan data dengan aman akan bervariasi dari satu plug-in ke yang lain, dari satu solusi vendor ke yang lain, dan dari satu sistem berkas ke file lainnya.
tr_tr: OpenStack hacim şifreleme özelliği kullanılmazsa, genellikle diğer yaklaşımların etkinleştirilmesi daha zor olur. Arka uç bir eklenti kullanılıyorsa, şifreleme yapmanın ya da standart olmayan üzerine yazma çözümleri için bağımsız yollar olabilir. OpenStack Blok Depolama'ya eklentiler, verileri çeşitli şekillerde depolar. Birçok eklenti bir satıcıya veya teknolojiye özeldir; diğerleri ise LVM veya ZFS gibi dosya sistemleri etrafında daha DIY çözümlerdir. Verileri güvenli bir şekilde yok etme yöntemleri, bir eklentiden diğerine, bir satıcı çözümünden diğerine ve bir dosya sisteminden diğerine değişir.

source: If the maximum body size per request is not defined, the attacker can craft an arbitrary OSAPI request of large size causing the service to crash and finally resulting in Denial Of Service attack. Assigning the maximum value ensures that any malicious oversized request gets blocked ensuring continued availability of the service.
de: Wenn die maximale Körpergröße pro Anfrage nicht definiert ist, kann der Angreifer eine beliebige OSAPI-Anforderung von großer Größe erstellen, die den Dienst zum Absturz bringt und schließlich zu einem Denial Of Service-Angriff führt. Die Zuweisung des Maximalwertes stellt sicher, dass jede böswillige, überdimensionierte Anfrage gesperrt wird, um eine fortgesetzte Verfügbarkeit des Dienstes zu gewährleisten.
id: Jika ukuran tubuh maksimum per permintaan tidak ditentukan, penyerang dapat menghasilkan permintaan OSAPI yang sewenang-wenang (arbitrary) dengan ukuran besar menyebabkan layanan mogok dan akhirnya mengakibatkan serangan Denial Of Service. Menetapkan nilai maksimum memastikan bahwa permintaan besar yang berbahaya diblokir untuk memastikan ketersediaan layanan lanjutan.
tr_tr: İstek başına azami gövde boyutu tanımlanmadıysa, saldırgan, servisin çökmesine neden olan ve sonuçta Hizmet Reddine neden olan büyük boyutlu keyfi bir OSAPI isteği oluşturabilir. Maksimum değeri atamak, kötü niyetli büyük boyutlu talebin engellenmesini sağlayarak hizmetin devamlılığını sağlar.

source: If the maximum body size per request is not defined, the attacker can craft an arbitrary osapi request of large size causing the service to crash and finally resulting in Denial Of Service attack. Assigning the maximum value ensures that any malicious oversized request gets blocked ensuring continued availability of the service.
de: Wenn die maximale Körpergröße pro Anfrage nicht definiert ist, kann der Angreifer eine beliebige osapi-Anforderung von großer Größe erstellen, die den Dienst zum Absturz bringt und schließlich zu einem Denial Of Service-Angriff führt. Die Zuweisung des Maximalwertes stellt sicher, dass jede böswillige, überdimensionierte Anfrage gesperrt wird, um eine fortgesetzte Verfügbarkeit des Dienstes zu gewährleisten.
id: Jika ukuran body maksimum per permintaan tidak ditentukan, penyerang bisa menggunakan permintaan osilator yang sewenang-wenang dengan ukuran besar menyebabkan layanan mogok dan akhirnya mengakibatkan serangan Denial Of Service. Menetapkan nilai maksimum memastikan bahwa permintaan besar yang berbahaya diblokir untuk memastikan ketersediaan layanan lanjutan.
tr_tr: İstek başına maksimum gövde boyutu tanımlanmamışsa, saldırgan, hizmetin çökmesine neden olan ve sonuçta Hizmet Reddine neden olan büyük boyutlu bir osapi isteği oluşturabilir. Maksimum değeri atamak, kötü niyetli büyük boyutlu talebin engellenerek hizmetin devamlılığı sağlanmasını sağlar.
