Repository: openstack/security-doc
Catalog: security-guide/source/locale/*/LC_MESSAGES/security-guide.po
Languages: de, id, tr_tr

source: The Dashboard is based on the Django web framework, ensuring secure deployment practices for Django apply directly to horizon. This guide provides a set of Django security recommendations. Further information can be found by reading the `Django documentation <https://docs.djangoproject.com/>`_.
de: Das Dashboard basiert auf dem Django Web Framework und sorgt für sichere Bereitstellungspraktiken für Django direkt auf den Horizon. Dieser Leitfaden enthält eine Reihe von Django-Sicherheitsempfehlungen. Weitere Informationen finden Sie unter dem Lesen der `Django Dokumentation <https://docs.djangoproject.com/>`_.
id: Dasbor didasarkan pada kerangka web Django, memastikan praktek penerapan yang aman untuk Django berlaku langsung ke horizon. Panduan ini menyediakan satu set rekomendasi keamanan Django. Informasi lebih lanjut dapat ditemukan dengan membaca `Django documentation <https://docs.djangoproject.com/> `_.
tr_tr: Panel, Django web çatısına dayalıdır, böylece Django'nun doğrudan horizon'da uygulanması için güvenli dağıtım uygulamaları sağlanmış olur. Bu kılavuz bir dizi Django güvenlik önerisi sunmaktadır. Daha fazla bilgi `Django belgelerini <https://docs.djangoproject.com/>`_ okuyarak bulunabilir.

source: The Dashboard ships with default security settings, and has `deployment and configuration documentation <https://docs.openstack.org/horizon/latest/user/index.html>`_.
de: Das Dashboard wird mit Standard-Sicherheitseinstellungen ausgeliefert und verfügt über `Deployment- und Konfigurationsdokumentation <https://docs.openstack.org/horizon/latest/user/index.html>`_.
id: Dashboard dilengkapi dengan pengaturan keamanan default, dan memiliki `deployment and configuration documentation <https://docs.openstack.org/horizon/latest/user/index.html>`_.

source: The Data Processing service (sahara) provides a platform for the provisioning and management of instance clusters using processing frameworks such as Hadoop and Spark. Through the OpenStack Dashboard, or REST API, users are able to upload and execute framework applications which may access data in object storage or external providers. The data processing controller uses the Orchestration service (heat) to create clusters of instances which may exist as long-running groups that can grow and shrink as requested, or as transient groups created for a single workload.
de: Der Data Processing Service (sahara) bietet eine Plattform für die Bereitstellung und Verwaltung von Instanzclustern mit Verarbeitungsgeräten wie Hadoop und Spark. Durch das OpenStack Dashboard oder die REST API können Benutzer Framework-Anwendungen hochladen und ausführen, die auf Daten im Objektspeicher oder externen Providern zugreifen können. Der Datenverarbeitungscontroller verwendet den Orchestrierungsdienst (Heat), um Cluster von Instanzen zu erzeugen, die als langlebige Gruppen existieren können, die wachsen und schrumpfen können, wie angefordert, oder als transiente Gruppen, die für eine einzelne Arbeitsbelastung erstellt wurden.
id: Layanan Pengolahan Data (sahara) menyediakan platform untuk penyediaan dan pengelolaan cluster instance menggunakan kerangka pemrosesan seperti Hadoop dan Spark. Melalui OpenStack Dashboard, atau REST API, pengguna dapat mengunggah dan menjalankan aplikasi kerangka yang dapat mengakses data di penyimpanan objek atau penyedia eksternal. Pengontrol pengolahan data menggunakan layanan Orchestration (heat) untuk membuat kumpulan instance yang mungkin ada sebagai long-running group yang dapat tumbuh dan menyusut sesuai permintaan, atau sebagai kelompok sementara yang dibuat untuk satu beban kerja.
tr_tr: Veri İşleme servisi (Sahara), Hadoop ve Spark gibi işlem çatılarını kullanarak örnek kümelerin sağlanması ve yönetimi için bir platform sağlar. OpenStack Panel veya REST API'sı sayesinde kullanıcılar, nesne depolama birimindeki veya harici sağlayıcılara erişebilen çerçeve uygulamalarını yükleyebilir ve çalıştırabilirler. Veri işleme denetleyicisi, Orkestrasyon servisini (heat) kullanarak, istendiği gibi büyüyüp küçülebilecek uzun süren gruplar halinde veya tek bir işyükü için geçici gruplar halinde oluşturulan örnek kümeleri oluşturmak için kullanır.

source: The Data Processing service is responsible for the deployment and management of several applications. For a complete understanding of the security options provided we recommend that operators have a general familiarity with these applications. The list of highlighted technologies is broken into two sections: first, high priority applications that have a greater impact on security, and second, supporting applications with a lower impact.
de: Der Data Processing Service ist verantwortlich für die Bereitstellung und Verwaltung mehrerer Applikationen. Für ein vollständiges Verständnis der Sicherheitsoptionen empfehlen wir, dass die Betreiber eine allgemeine Vertrautheit mit diesen Anwendungen haben. Die Liste der hervorgehobenen Technologien ist in zwei Abschnitte unterteilt: Erstens, Anwendungen mit hoher Priorität, die einen größeren Einfluss auf die Sicherheit haben und zweitens unterstützende Anwendungen mit geringerem Einfluss.
id: Layanan Data Processing bertanggung jawab atas pengerahan dan pengelolaan beberapa aplikasi. Untuk pemahaman lengkap tentang opsi keamanan yang diberikan, kami merekomendasikan agar operator memiliki keakraban umum dengan aplikasi ini. Daftar teknologi yang disorot dibagi menjadi dua bagian: pertama, aplikasi prioritas tinggi yang memiliki dampak lebih besar pada keamanan, dan kedua, mendukung aplikasi dengan dampak yang lebih rendah.
tr_tr: Veri İşleme servisi, çeşitli uygulamaların kurulumundan ve yönetiminden sorumludur. Sağlanan güvenlik seçeneklerini tam olarak anlamak için, operatörlerin bu uygulamalarla genel bir yakınlığa sahip olmalarını öneriyoruz. Vurgulanan teknolojilerin listesi iki bölüme ayrılır: Birincisi, güvenlik üzerinde daha büyük etkiye sahip yüksek öncelikli uygulamalar ve ikincisi, daha düşük bir etkiye sahip uygulamaları destekleme.

source: The Data processing service allows for the association of security groups with instances provisioned for its clusters. With no additional configuration the service will use the default security group for any project that provisions clusters. A different security group may be used if requested, or an automated option exists which instructs the service to create a security group based on ports specified by the framework being accessed.
de: Der Datenverarbeitungsdienst ermöglicht die Zuordnung von Sicherheitsgruppen mit Instanzen, die für seine Cluster bereitgestellt werden. Ohne zusätzliche Konfiguration verwendet der Service die Standard-Sicherheitsgruppe für jedes Projekt, das Cluster enthält. Eine andere Sicherheitsgruppe kann auf Wunsch verwendet werden, oder es erfolgt eine automatisierte Option, die den Dienst anweist, eine Sicherheitsgruppe zu erstellen, die auf Ports basiert, die von dem Framework angegeben werden, auf das zugegriffen wird.
id: Layanan pemrosesan data memungkinkan untuk asosiasi kelompok keamanan dengan instance yang ditetapkan (provisioned) untuk kelompoknya. Tanpa konfigurasi tambahan, layanan akan menggunakan grup keamanan default untuk setiap proyek yang menyediakan cluster. Kelompok keamanan yang berbeda dapat digunakan jika diminta, atau ada opsi otomatis yang menginstruksikan layanan untuk membuat grup keamanan berdasarkan port yang ditentukan oleh kerangka (framework) yang diakses.
tr_tr: Veri işleme hizmeti, güvenlik gruplarının kümeleri için hazırlanan örneklerle ilişkilendirilmesini sağlar. Ek yapılandırmayla hizmet, kümeleri sunan herhangi bir proje için varsayılan güvenlik grubunu kullanacaktır. İstenirse farklı bir güvenlik grubu kullanılabilir veya erişilen çatı tarafından belirtilen bağlantı noktalarına dayanan bir güvenlik grubu oluşturmak üzere hizmete talimat veren otomatik bir seçenek bulunur.

source: The Data processing service controller will be responsible for creating, maintaining, and destroying any instances created for its clusters. The controller will use the Networking service to establish network paths between itself and the cluster instances. It will also manage the deployment and life-cycle of user applications that are to be run on the clusters. The instances within a cluster contain the core of a framework's processing engine and the Data processing service provides several options for creating and managing the connections to these instances.
de: Der Data Processing Service Controller ist verantwortlich für die Erstellung, Pflege und Zerstörung von Instanzen, die für seine Cluster erstellt wurden. Der Controller verwendet den Networking-Dienst, um Netzwerkpfade zwischen sich und den Cluster-Instanzen herzustellen. Es wird auch die Bereitstellung und den Lebenszyklus von Benutzeranwendungen verwalten, die auf den Clustern ausgeführt werden sollen. Die Instanzen innerhalb eines Clusters enthalten den Kern einer Verarbeitungsmaschine eines Frameworks und der Data Processing Service bietet mehrere Möglichkeiten zum Erstellen und Verwalten der Verbindungen zu diesen Instanzen.
id: Pengontrol layanan pengolahan Data akan bertanggung jawab untuk menciptakan, memelihara, dan menghancurkan segala hal yang diciptakan untuk clusternya. Pengontrol akan menggunakan layanan Networking untuk membangun jalur jaringan antara dirinya dan cluster. Ini juga akan mengelola penyebaran dan siklus hidup aplikasi pengguna yang akan dijalankan di cluster. Instance dalam sebuah cluster berisi inti mesin pemrosesan kerangka dan layanan pemrosesan Data menyediakan beberapa opsi untuk membuat dan mengelola koneksi ke instance ini.
tr_tr: Veri işleme servis denetleyicisi, kümeleri için oluşturulan tüm örnekleri oluşturmak, korumak ve yok etmekle sorumlu olacaktır. Denetleyici, kendisi ve küme örnekleri arasında ağ yolları oluşturmak için Ağ hizmeti kullanır. Ayrıca, kümelerde çalıştırılacak kullanıcı uygulamalarının dağıtımını ve yaşam döngüsünü yönetir. Bir küme içindeki örnekler, bir çatının işlem motorunun çekirdeğini içerir ve Veri işleme hizmeti, bu örneklere bağlantıları oluşturmak ve yönetmek için çeşitli seçenekler sunar.

source: The Data processing service controller, like many other OpenStack controllers, can be configured to require TLS connections.
de: Der Data Processing Service Controller, wie viele andere OpenStack Controller, kann so konfiguriert werden, dass er TLS Verbindungen benötigt.
id: Pengontrol layanan pengolah data, seperti banyak pengendali OpenStack lainnya, dapat dikonfigurasi untuk meminta koneksi TLS.
tr_tr: Diğer birçok OpenStack denetleyicileri gibi Veri işleme servisi denetleyicisi, TLS bağlantıları gerektirecek şekilde yapılandırılabilir.

source: The Data processing service is deployed, like many other OpenStack services, as an application running on a host connected to the stack. As of the Kilo release, it has the ability to be deployed in a distributed manner with several redundant controllers. Like other services, it also requires a database to store information about its resources. See :doc:`../databases`. It is important to note that the Data processing service will need to manage several Identity service trusts, communicate directly with the Orchestration and Networking services, and potentially create users in a proxy domain. For these reasons the controller will need access to the control plane and as such we recommend installing it alongside other service controllers.
de: Der Data Processing Service wird wie viele andere OpenStack Services als Applikation eingesetzt, die auf einem Host läuft, der mit dem Stack verbunden ist. Ab dem Kilo-Release ist es möglich, mit mehreren redundanten Controllern verteilt zu deployen. Wie andere Dienste erfordert es auch eine Datenbank, um Informationen über ihre Ressourcen zu speichern. Siehe :doc:`../databases`. Es ist wichtig zu beachten, dass der Datenverarbeitungsdienst mehrere Identity Service Trusts verwalten muss, direkt mit den Orchestrierungs- und Netzwerkdiensten kommunizieren und möglicherweise Benutzer in einer Proxy-Domäne erstellen. Aus diesen Gründen benötigt der Regler Zugriff auf die Steuerungsebene und empfiehlt daher, neben anderen Service-Controllern zu installieren.
id: Layanan pengolahan Data dikerahkan, seperti banyak layanan OpenStack lainnya, sebagai aplikasi yang berjalan pada host yang terhubung ke stack. Pada rilis Kilo, ia memiliki kemampuan untuk ditempatkan secara terdistribusi dengan beberapa pengendali yang berlebihan. Seperti layanan lainnya, juga membutuhkan database untuk menyimpan informasi tentang sumber dayanya. Lihat :doc:`../databases`. Penting untuk dicatat bahwa layanan pemrosesan Data perlu mengelola beberapa kepercayaan layanan Identity, berkomunikasi langsung dengan layanan Orchestration dan Networking, dan berpotensi membuat pengguna di domain proxy. Untuk alasan ini pengendali akan memerlukan akses ke control plane (bidang) dan karena itu sebaiknya pasang di samping controller layanan lainnya.
tr_tr: Veri işleme servisi, birçok diğer OpenStack servisi gibi, yığına bağlı bir ana bilgisayarda çalışan bir uygulama olarak canlıya alınır. Kilo sürümü itibariyle, birkaç yedek denetleyici ile dağıtılmış bir şekilde yayına alınabilir. Diğer servisler gibi, kaynakları hakkında bilgi depolamak için bir veritabanı da gerektirir. Bakınız: doc:`../databases`. Veri işleme servisinin birkaç Kimlik hizmeti güvenini yönetmesi, Orkestrasyon ve Ağ hizmetleri ile doğrudan iletişim kurması ve potansiyel olarak bir vekil etki alanındaki kullanıcılar oluşturması gerekeceğini unutmamak önemlidir. Bu nedenlerden dolayı, kontrolörün kontrol düzlemine erişmesi gerekecek ve bu nedenle diğer servis kontrol cihazlarının yanına yerleştirilmelerini öneriyoruz.

source: The Data processing service makes heavy use of the Compute, Orchestration, Image, and Block Storage services during the provisioning of clusters. It will also use one or more networks, created by the Networking service, provided during cluster creation for administrative access to the instances. While users are running framework applications the controller and the clusters will be accessing the Object Storage service. Given these service usages, we recommend following the instructions outlined in :doc:`../documentation` for cataloging all the components of an installation.
de: Der Datenverarbeitungsdienst nutzt die Compute-, Orchestrierungs-, Abbild- und Blockspeicherdienste während der Bereitstellung von Clustern stark. Es wird auch ein oder mehrere Netzwerke verwenden, die von dem Networking-Dienst erstellt wurden, der während der Cluster-Erstellung für den administrativen Zugriff auf die Instanzen bereitgestellt wird. Während Benutzer Framework-Anwendungen ausführen, greift der Controller und die Cluster auf den Object Storage Service zu. Angesichts dieser Service-Nutzung empfehlen wir Ihnen die folgenden Hinweise :doc:`../documentation` für die Katalogisierung aller Komponenten einer Anlage.
id: Layanan pengolahan Data membuat penggunaan berat dari layanan Compute, Orchestration, Image, dan Block Storage selama penyediaan cluster. Ini juga akan menggunakan satu atau beberapa jaringan, yang diciptakan oleh layanan Networking, yang disediakan selama pembuatan cluster untuk akses administratif ke instance. Sementara pengguna menjalankan aplikasi framework controller dan cluster akan mengakses layanan Object Storage. Dengan penggunaan layanan ini, sebaiknya ikuti petunjuk yang diuraikan di :doc:`../documentation` untuk membuat katalog semua komponen instalasi.
tr_tr: Veri işleme hizmeti, Kümelerin sağlanması sırasında Hesaplama, Orkestrasyon, Görüntü ve Blok Depolama hizmetlerini yoğun bir şekilde kullanır. Ayrıca, örneklere yönetici erişimi sağlamak için küme oluşturma sırasında sağlanan Ağ hizmeti tarafından oluşturulan bir veya daha fazla ağ da kullanacaktır. Kullanıcılar çerçeve uygulamalarını çalıştırırken denetleyici ve kümeler Nesne Depolama hizmetine erişeceklerdir. Bu hizmet kullanımları göz önüne alındığinde, bir kurulumun tüm bileşenlerini kataloglamak için :doc:`../documentation` başlıklı talimatları izlemenizi öneririz.

source: The Data processing service uses a policy file, as described in :doc:`../identity/policies`, to configure role-based access control. Using the policy file an operator can restrict a group’s access to specific data processing functionality.
de: Der Datenverarbeitungsdienst verwendet eine Richtliniendatei, wie in :doc:`../ identity/policy` beschrieben, um eine rollenbasierte Zugriffskontrolle zu konfigurieren. Mit der Richtliniendatei kann ein Bediener den Zugriff einer Gruppe auf bestimmte Datenverarbeitungsfunktionen beschränken.
id: Layanan pemrosesan data menggunakan file kebijakan, seperti yang dijelaskan di :doc:`../identity/policies`, untuk mengkonfigurasi kontrol akses berbasis peran. Dengan menggunakan file kebijakan, operator dapat membatasi akses grup ke fungsionalitas pemrosesan data tertentu.
tr_tr: Veri işleme hizmeti, rol tabanlı erişim denetimini yapılandırmak için :doc:`./identity/policies` bölümünde açıklandığı gibi bir ilke dosyası kullanır. İlke dosyasını kullanarak operatör, bir grubun belirli veri işleme işlevlerine erişimini kısıtlayabilir.

source: The Defense Information Systems Agency (DISA) (part of the United States Department of Defense) publishes STIG content for various operating systems, applications, and hardware. The controls are published without any license attached.
de: Die Verteidigungsinformationssystem-Agentur (DISA) (Teil des Verteidigungsministeriums der USA) veröffentlicht STIG-Inhalte für verschiedene Betriebssysteme, Anwendungen und Hardware. Die Kontrollen werden ohne Lizenz veröffentlicht.
id: The Defense Information Systems Agency (DISA) (bagian dari United States Department of Defense) menerbitkan konten STIG untuk berbagai sistem operasi, aplikasi, dan perangkat keras. Kontrol diterbitkan tanpa lisensi apapun.
tr_tr: Savunma Bilişim Sistemleri Kurumu (DISA) (Birleşik Devletler Savunma Bakanlığı'nın bir bölümü), çeşitli işletim sistemleri, uygulamalar ve donanımlar için STIG içeriği yayınlamaktadır. Kontroller herhangi bir lisans olmadan yayınlanır.

source: The Dogtag secret store plugin is used to communicate with `Dogtag <http://pki.fedoraproject.org/wiki/PKI_Main_Page>`_. Dogtag is the upstream project corresponding to the Red Hat Certificate System, a Common Criteria/FIPS certified PKI solution that contains a Certificate Manager (CA) and a Key Recovery Authority (KRA) which is use to securely store secrets. The KRA stores secrets as encrypted blobs in its internal database, with the master encryption keys being stored either in a software-based NSS security database, or in a Hardware Security Module (HSM). The software-based NSS database configuration provides a secure option for deployments that do not wish to use a HSM. The KRA is a component of FreeIPA, therefore it is possible to configure the plugin with a FreeIPA server. More detailed instructions on how to set up Barbican with FreeIPA are provided `in the following blog post <https://vakwetu.wordpress.com/2015/11/30/barbican-and-dogtagipa/>`_.
de: Das Dogtag Secret Store Plugin wird verwendet, um mit `Dogtag <http://pki.fedoraproject.org/wiki/PKI_Main_Page>` _ zu kommunizieren. Dogtag ist das Upstream-Projekt, das dem Red Hat Certificate System entspricht, einer Common Criteria/FIPS-zertifizierten PKI-Lösung, die einen Certificate Manager und eine Key Recovery Authority (KRA) zur sicheren Speicherung von Geheimnissen enthält. Die KRA speichert Geheimnisse als verschlüsselte Blobs in ihrer internen Datenbank, wobei die Hauptverschlüsselungsschlüssel entweder in einer softwarebasierten NSS-Sicherheitsdatenbank oder in einem Hardware-Sicherheitsmodul (HSM) gespeichert werden. Die softwarebasierte NSS-Datenbankkonfiguration bietet eine sichere Option für Bereitstellungen, die kein HSM verwenden möchten. Der KRA ist eine Komponente von FreeIPA, daher ist es möglich, das Plugin mit einem FreeIPA Server zu konfigurieren. Ausführlichere Anweisungen zur Einrichtung von Barbican mit FreeIPA finden Sie im folgenden Blogbeitrag <https://vakwetu.wordpress.com/2015/11/30/barbican-and-dogtagipa/>`_.
id: Plugin penyimpanan rahasia Dogtag digunakan untuk berkomunikasi dengan `Dogtag <http://pki.fedoraproject.org/wiki/PKI_Main_Page>`_. Dogtag adalah proyek hulu yang sesuai dengan Red Hat Certificate System, Common Criteria / FIPS certified PKI solution yang berisi Certificate Manager (CA) dan Key Recovery Authority (KRA) yang digunakan untuk menyimpan rahasia dengan aman. KRA menyimpan rahasia sebagai gumpalan terenkripsi di database internalnya, dengan kunci enkripsi utama disimpan dalam basis data keamanan NSS berbasis perangkat lunak, atau di Hardware Security Module (HSM). Konfigurasi database NSS berbasis perangkat lunak menyediakan opsi aman untuk penerapan yang tidak ingin menggunakan HSM. KRA adalah komponen FreeIPA, oleh karena itu dimungkinkan untuk mengkonfigurasi plugin dengan server FreeIPA. Instruksi lebih rinci tentang cara mengatur Barbican dengan FreeIPA disediakan `in the following blog post <https://vakwetu.wordpress.com/2015/11/30/barbican-and-dogtagipa/>`_.

source: The Federal Information Security Management Act requires that government agencies create a comprehensive plan to implement numerous government security standards, and was enacted within the E-Government Act of 2002. FISMA outlines a process, which utilizing multiple NIST publications, prepares an information system to store and process government data.
de: Das Bundesgesetz für Informationssicherheitsgesetz verlangt, dass die Regierungsbehörden einen umfassenden Plan zur Umsetzung zahlreicher Sicherheitsstandards der Regierung schaffen und im Rahmen des E-Government-Gesetzes von 2002 verabschiedet wurden. Die FISMA beschreibt einen Prozess, der mehrere NIST-Veröffentlichungen verwendet, bereitet ein Informationssystem vor und verarbeiten Regierungsdaten.
id: The Federal Information Security Management Act mensyaratkan bahwa instansi pemerintah membuat rencana komprehensif untuk menerapkan banyak standar keamanan pemerintah, dan diundangkan dalam E-Government Act tahun 2002. FISMA menguraikan sebuah proses, yang memanfaatkan beberapa publikasi NIST, menyiapkan sebuah sistem informasi untuk menyimpan dan memproses data pemerintah.
tr_tr: Federal Bilgi Güvenliği Yönetim Yasası, devlet kurumlarının çok sayıda hükümet güvenlik standartlarını uygulamak için kapsamlı bir plan hazırlamasını ve 2002 yılının E-Devlet Yasasında çıkartılmasını gerektirir. FISMA, çok sayıda NIST yayını kullanan bir saklama prosedürü hazırlar ve hükümet verilerini işler.
