Repository: openstack/security-doc
Catalog: security-guide/source/locale/*/LC_MESSAGES/security-guide.po
Languages: de, id, tr_tr

source: The ``FilterScheduler`` is the default scheduler for OpenStack Compute, although other schedulers exist (see the section `Scheduling <https://docs.openstack.org/ocata/config-reference/compute/schedulers.html>`_ in the `OpenStack Configuration Reference <https://docs.openstack.org/ocata/config-reference/config-overview.html>`_ ). This works in collaboration with 'filter hints' to decide where an instance should be started. This process of host selection allows administrators to fulfill many different security and compliance requirements. Depending on the cloud deployment type for example, one could choose to have tenant instances reside on the same hosts whenever possible if data isolation was a primary concern. Conversely one could attempt to have instances for a tenant reside on as many different hosts as possible for availability or fault tolerance reasons.
id: The ``FilterScheduler`` adalah penjadwal default untuk OpenStack Compute, meskipun penjadwal lain ada (lihat bagian `Scheduling <https://docs.openstack.org/ocata/config-reference/compute/schedulers.html>`_ dalam `OpenStack Configuration Reference <https://docs.openstack.org/ocata/config-reference/config-overview.html>`_ ). Ini bekerja sama dengan 'filter hints' untuk memutuskan di mana instance harus dimulai. Proses pemilihan host ini memungkinkan administrator untuk memenuhi berbagai persyaratan keamanan dan kepatuhan. Bergantung pada jenis penyebaran cloud misalnya, seseorang dapat memilih untuk memiliki instance penyewa yang berada di host yang sama bila memungkinkan jika isolasi data menjadi perhatian utama. Sebaliknya seseorang dapat mencoba untuk memiliki instance untuk penyewa tinggal di sebanyak mungkin host yang berbeda untuk ketersediaan atau toleransi kesalahan (fault tolerance reason)..

source: The ``copy_from`` feature in Image Service API v1 supplied by Glance can allow an attacker to perform masked network port scans. If the v1 API is enabled, this policy should be set to a restricted value.
id: Fitur ``copy_from`` pada Image Service API v1 yang disuplai oleh Glance memungkinkan penyerang melakukan scan port jaringan bertopeng (masked). Jika API v1 diaktifkan, kebijakan ini harus ditetapkan ke nilai yang dibatasi.

source: The ``volume_clear`` parameter can be set to ``zero``. The ``zero`` argument will write a single pass of zeroes to the device.
id: Parameter ``volume_clear`` dapat disetel ke ``zero``. Argumen ``zero`` akan menulis single pass nol ke perangkat.

source: The service that provides a stable RESTful API. The service authenticates and routes requests throughout the Shared Filesystem service. There is python-manilaclient to interact with the API. For more details on the Shared File Systems API, see the `OpenStack Shared File Systems API <https://docs.openstack.org/api-ref/shared-file-system/>`_.
id: Layanan yang menyediakan RESTful API yang stabil. Layanan mengotentikasi dan merutekan permintaan di seluruh layanan Shared Filesystem. Ada python-manilaclient untuk berinteraksi dengan API. Untuk detail lebih lanjut tentang Shared File Systems API, lihat `OpenStack Shared File Systems API <https://docs.openstack.org/api-ref/shared-file-system/>`_.

source: There are several ways to wipe a block storage device. The traditional way is to set the ``lvm_type`` to ``thin``, and then use the ``volume_clear`` parameter if using the LVM backend. Alternatively, if the volume encryption feature is used, then volume wiping is not necessary if the volume encryption key is deleted. See the OpenStack Configuration Reference doc in the `Volume Encryption <https://docs.openstack.org/cinder/latest/configuration/block-storage/volume-encryption.html>`__ section for set up details and also the `Castellan usage <https://docs.openstack.org/castellan/latest/user/index.html>`__ document for key deletion.
id: Ada beberapa cara untuk menghapus perangkat penyimpan blok. Cara tradisional adalah dengan mengatur ``lvm_type`` ke ``thin``, lalu gunakan parameter ``volume_clear`` jika menggunakan backend LVM. Sebagai alternatif, jika fitur enkripsi volume digunakan, maka volume wiping tidak diperlukan jika kunci enkripsi volume dihapus. Lihat dokumentasi OpenStack Configuration Reference di bagian `Volume Encryption <https://docs.openstack.org/cinder/latest/configuration/block-storage/volume-encryption.html>` __ untuk mengatur rincian dan juga '`Castellan usage <https://docs.openstack.org/castellan/latest/user/index.html>`__ dokumen untuk penghapusan kunci.

source: This Book was produced in a 5 day book sprint. A book sprint is an intensely collaborative, facilitated process which brings together a group to produce a book in 3-5 days. It is a strongly facilitated process with a specific methodology founded and developed by Adam Hyde. For more information visit the book sprint web page at `BookSprints <http://www.booksprints.net>`__.
id: Buku ini diproduksi dalam sprint buku 5 hari. Sprint buku adalah proses yang sangat kolaboratif dan difasilitasi yang menyatukan kelompok untuk menghasilkan buku dalam 3-5 hari. Ini adalah proses yang sangat difasilitasi dengan metodologi khusus yang didirikan dan dikembangkan oleh Adam Hyde. Untuk informasi lebih lanjut, kunjungi halaman web sprint buku di `BookSprints <http://www.booksprints.net>`__.

source: This field sets the cipher and mode used to encrypt ephemeral storage. AES-XTS is recommended by NIST_ specifically for disk storage, and the name is shorthand for AES encryption using the XTS encryption mode. Available ciphers depend on kernel support. At the command line, type 'cryptsetup benchmark' to determine the available options (and see benchmark results), or go to */proc/crypto*
id: Bidang ini mengatur cipher dan mode yang digunakan untuk mengenkripsi penyimpanan singkat. AES-XTS direkomendasikan oleh NIST_ khusus untuk penyimpanan disk, dan namanya adalah singkatan untuk enkripsi AES menggunakan mode enkripsi XTS. Tersedia ciphers yang bergantung pada dukungan kernel. Pada baris perintah, ketik 'benchmark cryptsetup' untuk menentukan pilihan yang tersedia (dan lihat hasil benchmark), atau masuk ke */proc/crypto*

source: This guide was last updated during the Train release, documenting the OpenStack Train, Stein, and Rocky releases. It may not apply to EOL releases (for example Newton).
id: Panduan ini terakhir diperbarui selama rilis Train, mendokumentasikan rilis OpenStack Train, Stein, dan Rocky. Ini mungkin tidak berlaku untuk rilis EOL (misalnya Newton).

source: This item only applies to OpenStack releases Rocky and before as ``auth_strategy`` was deprecated in Stein.
id: Item ini hanya berlaku untuk rilis OpenStack Rocky dan sebelumnya karena ``auth_strategy`` sudah tidak digunakan lagi di Stein.

source: To reduce the chances for a rogue administrator to gain unauthorized access to data, the following security practices should accompany the use of SEV:
id: Untuk mengurangi peluang bagi administrator jahat untuk mendapatkan akses tidak sah ke data, praktik keamanan berikut ini harus menyertai penggunaan SEV:

source: Tokens can be revoked using the identity API.
id: Token dapat dicabut menggunakan identity API.

source: Two underlying reasons:
id: Dua alasan mendasar:

source: Unencrypted volume data makes volume-hosting platforms especially high-value targets for attackers, as it allows the attacker to read the data for many different VMs. In addition, the physical storage medium could be stolen, remounted, and accessed from a different machine. Encrypting volume data mitigates these risks and provides defense-in-depth to volume-hosting platforms. Block Storage (cinder) is able to encrypt volume data before it is written to disk, and we recommend that the volume encryption feature is enabled. See the `Volume Encryption <https://docs.openstack.org/cinder/latest/configuration/block-storage/volume-encryption.html>`__ section of the Openstack Cinder Service Configuration documentation for instructions.
id: Data volume yang tidak terenkripsi membuat platform volume-hosting terutama target high-value bagi penyerang, karena memungkinkan penyerang untuk membaca data untuk berbagai VM berbeda. Selain itu, media penyimpanan fisik bisa dicuri, di remount, dan diakses dari mesin yang berbeda. Encrypting volume data mengurangi risiko ini dan memberikan defense-in-depth ke platform volume-hosting. Block Storage (cinder) mampu mengenkripsi data volume sebelum ditulis ke disk, dan kami merekomendasikan agar fitur enkripsi volume diaktifkan. Lihat bagian `Volume Encryption <https://docs.openstack.org/cinder/latest/configuration/block-storage/volume-encryption.html>` __ dari dokumentasi Openstack Cinder Service Configuration untuk mendapatkan petunjuk.

source: Using SQL, the Shared File Systems service is similar to other OpenStack services and can be used with any OpenStack deployment. For more details on the API, see the `OpenStack Shared File Systems API <https://docs.openstack.org/api-ref/shared-file-system/>`_ description. For more details on the CLI usage and configuration, see `Shared File Systems Cloud Administrative Guide <https://docs.openstack.org/admin-guide/shared_file_systems.html>`_.
id: Menggunakan SQL, layanan Shared File Systems mirip dengan layanan OpenStack lainnya dan dapat digunakan dengan penyebaran OpenStack apa pun. Untuk detail lebih lanjut tentang API, lihat deskripsi `OpenStack Shared File Systems API <https://docs.openstack.org/api-ref/shared-file-system/>`_. Untuk detail lebih lanjut tentang penggunaan dan konfigurasi CLI, lihat `Shared File Systems Cloud Administrative Guide <https://docs.openstack.org/admin-guide/shared_file_systems.html>`_.

source: We recommend keeping up to date on security issues and advisories as they are published. The `OpenStack Security Portal <https://security.openstack.org>`_ is the central portal where advisories, notices, meetings, and processes can be coordinated. Additionally, the `OpenStack Vulnerability Management Team (VMT) portal <https://security.openstack.org/#openstack-vulnerability-management-team>`_ coordinates remediation within the OpenStack project, as well as the process of investigating reported bugs which are responsibly disclosed (privately) to the VMT, by marking the bug as 'This bug is a security vulnerability'. Further detail is outlined in the `VMT process page <https://security.openstack.org/vmt-process.html#process>`_ and results in an OpenStack Security Advisory (OSSA). This OSSA outlines the issue and the fix, as well as linking to both the original bug, and the location where the where the patch is hosted.
id: Kami menyarankan agar Anda selalu mengetahui masalah keamanan dan saran saat dipublikasikan. The `OpenStack Security Portal <https://security.openstack.org>`_ adalah portal pusat tempat nasihat, pemberitahuan, rapat, dan proses dapat dikoordinasikan. Selain itu, portal `OpenStack Vulnerability Management Team (VMT) <https://security.openstack.org/#openstack-vulnerability-management-team>` _ mengoordinasikan remediasi dalam proyek OpenStack, serta proses penyelidikan bug yang dilaporkan yang secara terbuka diungkapkan (secara pribadi) ke VMT, dengan menandai bug sebagai 'This bug is a security vulnerability'. Rincian lebih lanjut diuraikan dalam `VMT process page <https://security.openstack.org/vmt-process.html#process>` _ dan menghasilkan OpenStack Security Advisory (OSSA). OSSA ini menguraikan masalah dan perbaikannya, serta menautkan ke bug asli, dan lokasi tempat tambalan (patch) di-host.

source: We recommend that a minimum of TLS 1.2 be used. Older versions such as TLS 1.0, 1.1, and all versions of SSL (TLS's predecessor) are vulnerable to multiple publicly known attacks and therefore must not be used. TLS 1.2 may be used for broad client compatibility, however exercise caution when enabling this protocol. Only enable TLS version 1.1 if there is a mandatory compatibility requirement and you are aware of the risks involved.
id: Kami menyarankan minimum TLS 1.2 digunakan. Versi lama seperti TLS 1.0, 1.1, dan semua versi SSL (pendahulu TLS) rentan terhadap beberapa serangan yang diketahui publik dan karenanya tidak boleh digunakan. TLS 1.2 dapat digunakan untuk kompatibilitas klien yang luas, namun berhati-hatilah saat mengaktifkan protokol ini. Hanya aktifkan TLS versi 1.1 jika ada persyaratan kompatibilitas wajib dan Anda mengetahui risiko yang terlibat.

source: `Secure Encrypted Virtualization (SEV) <https://developer.amd.com/sev/>`_ is a technology from AMD which enables the memory for a VM to be encrypted with a key unique to the VM. SEV is available in the Train release as a technical preview with KVM guests on certain AMD-based machines for the purpose of evaluating the technology.
id: `Secure Encrypted Virtualization (SEV) <https://developer.amd.com/sev/>`_ adalah teknologi dari AMD yang memungkinkan memori untuk VM dienkripsi dengan kunci unik untuk VM. SEV tersedia dalam rilis Train sebagai pratinjau teknis dengan tamu KVM pada mesin berbasis AMD tertentu untuk tujuan mengevaluasi teknologi.
