Repository: openstack/security-doc
Catalog: security-guide/source/locale/*/LC_MESSAGES/security-guide.po
Languages: de, id, tr_tr

source: The Identity service supports token revocation. This manifests as an API to revoke a token, to list revoked tokens and individual OpenStack services that cache tokens to query for the revoked tokens and remove them from their cache and append the same to their list of cached revoked tokens.
de: Der Identitätsdienst unterstützt den Token-Widerruf. Dies manifestiert sich als API, um ein Token zu widerrufen, um widerrufene Token und einzelne OpenStack-Dienste aufzulisten, die Token für die aufgehobenen Token abschneiden und sie aus ihrem Cache abholen und sie an ihre Liste der zwischengespeicherten widerrufenen Token anhängen.
tr_tr: Kimlik servisi imza iptali işlevini desteklemektedir. Bu, bir belirteci iptal etmek, iptal edilmiş belirteçleri ve iptal edilen belirteçleri sorgulamak ve bunları önbellekten kaldırmak ve bunları önbellekta iptal edilen belirteçler listesine eklemek için belirteçleri önbelleğe alan tek tek OpenStack servislerini listelemek için bir API olarak kendini gösterir.

source: The International Traffic in Arms Regulations (ITAR) is a set of United States government regulations that control the export and import of defense-related articles and services on the United States Munitions List (USML) and related technical data. ITAR is often approached by cloud providers as an "operational alignment" rather than a formal certification. This typically involves implementing a segregated cloud environment following practices based on the NIST 800-53 framework, as per FISMA requirements, complemented with additional controls restricting access to "U.S. Persons" only and background screening.
de: Die International Traffic in Arms Regulations (ITAR) ist eine Reihe von Regulierungen der Vereinigten Staaten, die den Export und Import von verteidigungsrelevanten Artikeln und Dienstleistungen auf der United States Munition List (USML) und zugehörigen technischen Daten kontrollieren. ITAR wird oft von Cloud-Anbietern als "operative Ausrichtung" anstatt einer formalen Zertifizierung angesprochen. Dies beinhaltet in der Regel die Implementierung einer segregierten Cloud-Umgebung nach Praktiken auf der Grundlage des NIST 800-53 Framework, wie pro FISMA Anforderungen, ergänzt mit zusätzlichen Kontrollen, Beschränkung des Zugang nur durch "US-Personen" und Background-Screening.
id: The International Traffic in Arms Regulations (ITAR) adalah seperangkat peraturan pemerintah Amerika Serikat yang mengendalikan ekspor dan impor artikel dan layanan yang berkaitan dengan pertahanan di United States Munitions List (USML) dan data teknis terkait. ITAR sering didekati oleh penyedia awan sebagai "operational alignment" dan bukan sertifikasi formal. Ini biasanya melibatkan penerapan lingkungan awan terpisah mengikuti praktik berdasarkan kerangka NIST 800-53, sesuai persyaratan FISMA, dilengkapi dengan kontrol tambahan yang membatasi akses terhadap "U.S. Persons" saja dan pemutaran latar belakang.
tr_tr: Silah Düzenlemelerinde Uluslararası Trafik (ITAR), Birleşik Devletler Silahlı Kuvvetleri Listesinde (USML) ve ilgili teknik verilere ilişkin savunma ile ilgili makalelerin ve hizmetlerin ihracatını ve ithalini denetleyen bir dizi Birleşik Devletler hükümet düzenlemesidir. ITAR genellikle bulut sağlayıcıları tarafından resmi bir sertifika yerine "operasyonel uyum" olarak ele alınmaktadır. Bu, tipik olarak, yalnızca "ABD'li Kişiler" e erişimi kısıtlayan ilave kontrollerle ve arka plan taramayla tamamlanan, FISMA gerekliliklerine göre NIST 800-53 çerçevesine dayanan uygulamaları takiben ayrı bir bulut ortamının uygulanmasını içerir.

source: The KVM hypervisor has been Common Criteria certified through the U.S. Government and commercial distributions. These have been validated to separate the runtime environment of virtual machines from each other, providing foundational technology to enforce instance isolation. In addition to virtual machine isolation, KVM has been Common Criteria certified to...:
de: Der KVM-Hypervisor wurde durch die US-Regierung und kommerzielle Distributionen zertifiziert. Diese wurden validiert, um die Laufzeitumgebung von virtuellen Maschinen voneinander zu trennen, so dass die Basistechnologie die Instanzisolation erzwungen wird. Neben der Isolierung der virtuellen Maschine wurde KVM Common Criteria zertifiziert nach ...:
id: Hypervisor KVM telah menjadi kriteria umum (Common Criteria) yang disertifikasi melalui Pemerintah A.S. dan distribusi komersial. Ini telah divalidasi untuk memisahkan lingkungan runtime mesin virtual satu sama lain, menyediakan teknologi dasar untuk menerapkan isolasi misalnya. Selain isolasi mesin virtual, KVM telah menjadi Common Criteria yang disertifikasi untuk ...:
tr_tr: KVM hipervizör, ABD Hükümeti ve ticari dağıtımları aracılığıyla Yaygın Kriter sertifikasına sahiptir. Bunlar, sanal makinelerin çalışma zamanı ortamını birbirinden ayırmak, örnek izolasyonunu zorunlu kılmak için temel teknolojiyi sağlamak için doğrulandı. Sanal makine izolasyonuna ek olarak, KVM, Yaygın Kriter sertifikasına sahiptir ...:

source: The Key Manager service has a plugin architecture that allows the deployer to store secrets in one or more secret stores. Secret stores can be software-based, such as a software token, or hardware devices such as a hardware security module (HSM). This section describes the plugins that are currently available and discusses the security posture of each one. Plugins are enabled and configured with settings in the ``/etc/barbican/barbican.conf`` configuration file.
de: Der Key Manager-Dienst verfügt über eine Plugin-Architektur, mit der der Deployer Geheimnisse in einem oder mehreren geheimen Stores speichern kann. Geheimspeicher können softwarebasiert sein, beispielsweise ein Software-Token oder Hardware-Geräte, wie z. B. ein Hardware-Sicherheitsmodul (HSM). In diesem Abschnitt werden die Plugins beschrieben, die derzeit verfügbar sind, und bespricht die Sicherheitshaltung jedes einzelnen. Plugins sind aktiviert und mit Einstellungen in der Konfigurationsdatei ``/etc/barbican/barbican.conf`` konfiguriert.
id: Layanan Key Manager memiliki arsitektur plugin yang memungkinkan penyebar untuk menyimpan rahasia di satu atau lebih penyimpanan rahasia. Penyimpanan rahasia dapat berbasis perangkat lunak, seperti token perangkat lunak, atau perangkat keras seperti hardware security module (HSM). Bagian ini menjelaskan plugin yang tersedia saat ini dan membahas postur keamanan masing-masing. Plugin diaktifkan dan dikonfigurasi dengan pengaturan di file konfigurasi ``/etc/barbican/barbican.conf``.

source: The L3 router provides basic Network Address Translation (NAT) capabilities on *gateway* ports that uplink the router to external networks. This router SNATs (Static NAT) all traffic by default, and supports floating IPs, which creates a static one-to-one mapping from a public IP on the external network to a private IP on one of the other subnets attached to the router.
de: Der L3 Router bietet grundlegende Network Address Translation (NAT) Fähigkeiten auf *Gateway* Ports, die den Router auf externe Netzwerke verlagern. Dieser Router SNATs (Static NAT) ist standardmäßig standardmäßig und unterstützt schwimmende IPs, die eine statische Eins-zu-Eins-Zuordnung von einer öffentlichen IP auf dem externen Netzwerk zu einer privaten IP auf einem der anderen Subnetze, die an den Router angeschlossen sind, erstellt.
id: Router L3 menyediakan kemampuan Network Address Translation (NAT) dasar pada port *gateway * yang menghubungkan router ke jaringan eksternal. SNAT router ini (Static NAT) semua lalu lintas secara default, dan mendukung floating IP, yang menciptakan pemetaan one-to-one statis dari IP publik di jaringan eksternal ke IP private di salah satu subnet lainnya yang terhubung ke router.
tr_tr: L3 yönlendirici, yönlendiriciyi dış ağlara bağlayan *ağ geçidi* portlarında temel Ağ Adresi Çevirisi (NAT) yetenekleri sağlar. Bu yönlendirici, varsayılan olarak tüm trafiğe SNAT (Statik NAT) yapar ve dış ağdaki genel bir IP'den yönlendiriciye bağlı diğer alt ağlardan birindeki özel bir IP'ye statik bire bir eşleme oluşturan kayan IP'leri destekler.

source: The LBaaS (Load-Balancer-as-a-Service) feature of Neutron and the Octavia project need certificates and their private keys to provide load balancing for TLS connections. Barbican can be used to store this sensitive information.
de: Die Funktion LBaaS (Load-Balancer-as-a-Service) in Neutron und das Octavia Projekt brauchen Zertifikate und privaten Schlüssel, um Lastverteilung für TLS Verbindungen zur Verfügung zu stellen. Barbican kann zum Speichern der sensitiven Daten benutzt werden.
id: Fitur LBaaS (Load-Balancer-as-a-Service) dari Neutron dan proyek Octavia memerlukan sertifikat dan private key mereka untuk memberikan load balancing untuk koneksi TLS. Barbican bisa digunakan untuk menyimpan informasi sensitif ini.

source: The Lightweight Directory Access Protocol. An application protocol for accessing and maintaining distributed directory information services over an IP network.
de: Das Lightweight Directory Access Protocol. Ein Anwendungsprotokoll für den Zugriff und die Pflege von verteilten Verzeichnisinformationsdiensten über ein IP-Netzwerk.
id: The Lightweight Directory Access Protocol. Protokol aplikasi untuk mengakses dan memelihara layanan informasi direktori terdistribusi melalui jaringan IP.
tr_tr: Hafif Dizin Erişimi Protokolü. Bir IP ağı üzerinden dağıtılmış dizin bilgi servislerine erişmek ve bunları korumak için bir uygulama protokolü.

source: The Networking service (neutron) supports bandwidth-limiting QoS rules in Liberty and later. This QoS rule is named ``QosBandwidthLimitRule`` and it accepts two non-negative integers measured in kilobits per second:
de: Der Networking Service (Neutron) unterstützt bandbreitenbegrenzende QoS Regeln in Liberty und später. Diese QoS-Regel heißt `` QosBandwidthLimitRule``und akzeptiert zwei nicht-negative Ganzzahlen, gemessen in Kilobit pro Sekunde:
id: Layanan Networking (Netron) mendukung aturan QoS yang membatasi bandwidth di Liberty dan versi kemudian. Aturan QoS ini diberi nama `` QosBandwidthLimitRule`` dan menerima dua bilangan bulat non-negatif yang diukur dalam kilobit per detik:
tr_tr: Ağ hizmeti (neutron), Liberty ve sonrasında bant genişliği sınırlayıcı QoS kurallarını desteklemektedir. Bu QoS kuralı ``QosBandwidthLimitRule`` olarak adlandırılır ve saniye başına kilobit cinsinden ölçülen iki negatif olmayan tamsayı kabul eder:

source: The Networking service plays an important role in the provisioning of clusters. Prior to provisioning, the user is expected to provide one or more networks for the cluster instances. The action of associating networks is similar to the process of assigning networks when launching instances through the dashboard. These networks are used by the controller for administrative access to the instances and frameworks of its clusters.
de: Der Networking-Service spielt bei der Bereitstellung von Clustern eine wichtige Rolle. Vor der Bereitstellung wird erwartet, dass der Benutzer ein oder mehrere Netzwerke für die Cluster-Instanzen bereitstellt. Die Aktion der Assoziationsnetze ähnelt dem Prozess der Zuweisung von Netzwerken beim Start von Instanzen über das Dashboard. Diese Netzwerke werden vom Controller für den administrativen Zugriff auf die Instanzen und Frameworks seiner Cluster verwendet.
id: Layanan Networking memainkan peran penting dalam penyediaan cluster. Sebelum melakukan provisioning, pengguna diharapkan menyediakan satu atau lebih jaringan untuk cluster instance. Tindakan mengaitkan jaringan mirip dengan proses menugaskan jaringan saat meluncurkan instance melalui dasbor. Jaringan ini digunakan oleh pengendali untuk akses administratif terhadap instance dan kerangka clusternya.
tr_tr: Ağ servisi, kümelerin sağlanmasında önemli bir rol oynamaktadır. Hazırlık öncesi, kullanıcının küme örnekleri için bir veya daha fazla ağ sunması beklenir. Ağları ilişkilendirme eylemi, panel aracılığıyla örnekleri başlatırken şebeke atama işlemine benzer. Bu ağlar, denetleyicinin kümelerinin örneklerine ve çerçevelerine yönetimsel olarak erişmesi için kullanılır.

source: The Object Storage service is used by the Data processing service to store job binaries and data sources. Users wishing to have access to the full Data processing service functionality will need an object store in the projects they are using.
de: Der Objektspeicherdienst wird vom Datenverarbeitungsdienst zum Speichern von Jobbinärdateien und Datenquellen verwendet. Benutzer, die Zugang zu der vollständigen Datenverarbeitungsdienstfunktion haben möchten, benötigen einen Objektspeicher in den von ihnen verwendeten Projekten.
id: Layanan Object Storage digunakan oleh layanan pengolahan Data untuk menyimpan job binary dan data source. Pengguna yang ingin memiliki akses ke fungsionalitas pemrosesan Data penuh akan membutuhkan object store dalam proyek yang mereka gunakan.
tr_tr: Nesne Depolama servisi, veri işleme hizmeti tarafından iş ikili dosyalarını ve veri kaynaklarını depolamak için kullanılır. Tam Veri işleme servisi işlevselliğine erişmek isteyen kullanıcılar, kullandıkları projelerde bir nesne deposuna ihtiyaç duyacaktır.

source: The OpenStack :term:`Block Storage service (cinder)` provides persistent block storage for compute instances. The Block Storage service is responsible for managing the life-cycle of block devices, from the creation and attachment of volumes to instances, to their release.
de: Der OpenStack :term: Block Storage Service (Cinder)` bietet einen permanenten Blockspeicher für Compute Instances. Der Block Storage Service ist verantwortlich für die Verwaltung des Lebenszyklus von Blockgeräten, von der Erstellung und Anbindung von Volumes an Instanzen bis hin zur Freigabe.
id: OpenStack :term:`Block Storage service (cinder)` menyediakan penyimpanan blok persisten untuk komputasi instance. Layanan Block Storage bertanggung jawab untuk mengelola siklus hidup perangkat blok, mulai dari pembuatan dan pelekatan volume ke instance, hingga pembebasannya.
tr_tr: OpenStack :term:`Blok Depolama Servisi (cinder)`, hesaplama örnekleri için kalıcı blok deposu sağlar. Blok Depolama servisi, blok cihazların yaşam döngüsünü yönetirken, hacimlere, örneklere yapıştırılmasından, kopyalanmasına kadar sorumludur.

source: The OpenStack :term:`Dashboard (horizon)` provides a web-based interface for both cloud administrators and cloud tenants. Using this interface, administrators and tenants can provision, manage, and monitor cloud resources. The dashboard is commonly deployed in a public-facing manner with all the usual security concerns of public web portals.
de: Der OpenStack :term:Dashboard (Horizon) bietet eine webbasierte Schnittstelle für Cloud-Administratoren und Cloud-Tenants. Durch diese Schnittstelle können Administratoren und Tenants Cloud-Ressourcen bereitstellen, verwalten und überwachen. Das Dashboard Horizon wird häufig in einer öffentlich gemachten Weise mit allen üblichen Sicherheitsrisiko von öffentlichen Webportalen eingesetzt.
id: The OpenStack :term:`Dashboard (horizon)` menyediakan antarmuka berbasis web untuk administrator awan dan penyewa awan. Dengan menggunakan antarmuka ini, administrator dan penyewa dapat menyediakan, mengelola, dan memantau sumber daya awan. Dasbor biasanya dipasang dengan cara yang berhadapan dengan publik dengan semua masalah keamanan biasa dari portal web umum.

source: The OpenStack :term:`Identity service (keystone)` is a **shared service** that provides authentication and authorization services throughout the entire cloud infrastructure. The Identity service has pluggable support for multiple forms of authentication.
de: Der OpenStack :term:`Identity Service (Keystone)` ist ein **Shared Service**, der Authentifizierungs- und Autorisierungsdienste über die gesamte Cloud-Infrastruktur bereitstellt. Der Identity-Service verfügt über eine Plug-and-Unterstützung für mehrere Authentifizierungsformen.
id: The OpenStack :term:`Identity service (keystone)` adalah **shared service** yang menyediakan layanan autentikasi dan otorisasi di seluruh infrastruktur awan. Layanan Identitas memiliki dukungan pluggable untuk berbagai bentuk otentikasi.
tr_tr: OpenStack :term:`Kimlik servisi (keystone)` , tüm bulut altyapısı boyunca kimlik doğrulama ve yetkilendirme hizmetleri sağlayan **paylaşımlı bir servistir**. Kimlik servisi, birden çok kimlik doğrulama formu için takılabilir destek içerir.

source: The OpenStack :term:`Image service (glance)` provides disk-image management services, including image discovery, registration, and delivery services to the Compute service, as needed.
de: Der OpenStack :term:`Abbilddienst (glance)` stellt Verwaltungsdienste für Festplattenabbilder zur Verfügung, incl. Abbilduntersuchung, Registrierung und Auslieferungsdienste durch den Compute-Dienst.
id: The OpenStack :term:`Image service (glance)` menyediakan layanan pengelolaan disk-image, termasuk penemuan image, registrasi, dan layanan pengiriman ke layanan Compute, sesuai kebutuhan.

source: The OpenStack :term:`Networking service <Networking service (neutron)>` (neutron, previously called quantum) provides various networking services to cloud users (tenants) such as IP address management, DNS, DHCP, load balancing, and security groups (network access rules, like firewall policies). This service provides a framework for software defined networking (SDN) that allows for pluggable integration with various networking solutions.
de: Der OpenStack :term:`Networking service <Networking service (neutron)>` (Neutron, früher Quantum genannt) bietet Cloud-Nutzern (Tenants) verschiedeneNetzwerkdienste wie IP-Adressverwaltung, DNS, DHCP, Load Balancing und Sicherheitsgruppen (Netzwerkzugriffsregeln wie Firewall-Richtlinien).Es bietet einen Rahmen für Software-definierte Vernetzung (SDN), die eine steckbare Integration mit verschiedenen Netzwerklösungen ermöglicht.
id: The OpenStack :term:`Networking service <Networking service (neutron)>` (neutron, yang sebelumnya disebut quantum) menyediakan berbagai layanan jaringan untuk pengguna awan (penyewa) seperti manajemen alamat IP, DNS, DHCP, load balancing, dan kelompok keamanan (aturan akses jaringan, seperti kebijakan firewall). Layanan ini menyediakan framework untuk software defined networking (SDN) yang memungkinkan integrasi pluggable dengan berbagai solusi jaringan.

source: The OpenStack :term:`Object Storage service (swift)` provides support for storing and retrieving arbitrary data in the cloud. The Object Storage service provides both a native API and an Amazon Web Services S3-compatible API. The service provides a high degree of resiliency through data replication and can handle petabytes of data.
de: Der OpenStack :term:`Object Storage service (swift)` bietet Unterstützung für das Speichern und Abrufen von beliebigen Daten in der Cloud. Der Object Storage Service bietet sowohl eine native API als auch eine Amazon Web Services S3 kompatible API. Der Service bietet ein hohes Maß an Resilienz durch Datenreplikation und kann mit Petabyte Daten verarbeiten.
id: OpenStack :term:`Object Storage service (swift)` memberikan dukungan untuk menyimpan dan mengambil data secara acak di awan. Layanan Object Storage menyediakan native API dan Amazon Web Services S3-compatible API. Layanan ini memberikan tingkat ketahanan yang tinggi melalui replikasi data dan dapat menangani petabyte data.

source: The OpenStack API is a RESTful web service endpoint to access, provision and automate cloud-based resources. Operators and users typically access the API through command-line utilities (for example, ``nova`` or ``glance``), language-specific libraries, or third-party tools.
de: Die OpenStack API ist ein RESTful Web Service Endpunkt für den Zugriff, Bereitstellung und Automatisierung von Cloud-basierten Ressourcen. Operatoren und Benutzer greifen in der Regel über Befehlszeilenprogramme auf die API zu (z. B. ``nova``oder ``glance``), sprachspezifische Bibliotheken oder Tools von Drittanbietern.
id: API OpenStack adalah endpoint layanan Web RESTful untuk mengakses, menyediakan dan mengotomatisasi sumber daya berbasis awan. Operator dan pengguna biasanya mengakses API melalui utilitas command-line (misalnya, ``nova`` atau ``glance``), language-specific libraries, atau alat pihak ketiga.
tr_tr: OpenStack API, bulut tabanlı kaynaklara erişim, sağlama ve otomatikleştirme için RESTful bir web servisi uç noktasıdır. Operatörler ve kullanıcılar genellikle API'ya komut satırı araçları (örneğin, ``nova`` veya ``glance``), dile özel kütüphaneler veya üçüncü parti araçlar yoluyla erişirler.

source: The OpenStack Compute service (nova) runs in many locations throughout the cloud and interacts with a variety of internal services. The OpenStack Compute service offers a variety of configuration options which may be deployment specific.
de: Der OpenStack Compute Service (Nova) läuft an vielen Orten in der ganzen Cloud und interagiert mit einer Vielzahl von internen Services. Der OpenStack Compute Service bietet eine Vielzahl von Konfigurationsoptionen, die implementierungsspezifisch sein können.
id: Layanan OpenStack Compute (nova) berjalan di banyak lokasi di seluruh awan dan berinteraksi dengan berbagai layanan internal. Layanan OpenStack Compute menawarkan berbagai opsi konfigurasi yang mungkin spesifik untuk pemasangan.
tr_tr: OpenStack Hesaplama servisi (nova), bulut boyunca birçok yerde çalışır ve çeşitli dahili servislerle etkileşime girer. OpenStack Hesaplama servisi, dağıtıma özgü olabilecek çeşitli yapılandırma seçenekleri sunar.

source: The OpenStack Dashboard (horizon) can provide a VNC console for instances directly on the web page using the HTML5 noVNC client. This requires the ``nova-novncproxy`` service to bridge from the public network to the management network.
de: Das OpenStack Dashboard (Horizont) kann eine VNC-Konsole für Instanzen direkt auf der Webseite mit dem HTML5 noVNC Client bereitstellen. Dies erfordert, dass der ``nova-novncproxy``Service das öffentlichen Netz zum Management-Netzwerk überbrückt.
id: Dashboar OpenStack (horizon) dapat menyediakan konsol VNC untuk instance langsung di halaman web menggunakan klien HTML5 noVNC. Ini memerlukan layanan ``nova-novncproxy`` untuk menjembatani dari jaringan publik ke jaringan manajemen.
tr_tr: OpenStack Paneli (horizon), HTML5 noVNC istemcisini kullanarak doğrudan web sayfasında örnekler için bir VNC konsolu sağlayabilir. Bu, kamu ağından yönetim ağına köprü kurmak için "nova-novncproxy" hizmeti gerektirir.
