Repository: openstack/security-doc
Catalog: security-guide/source/locale/*/LC_MESSAGES/security-guide.po
Languages: de, id, tr_tr

source: The Payment Card Industry Data Security Standard (PCI DSS) is defined by the Payment Card Industry Standards Council, and created to increase controls around card holder data to reduce credit card fraud. Annual compliance validation is assessed by an external Qualified Security Assessor (QSA) who creates a Report on Compliance (ROC), or by a Self-Assessment Questionnaire (SAQ) dependent on volume of card-holder transactions.
de: Der Payment Card Industry Data Security Standard (PCI DSS) wird durch den Payment Card Industry Standards Council definiert und erstellt, um die Kontrollen um Karteninhaberdaten zu erhöhen und um Kreditkartenbetrug zu reduzieren. Die jährliche Compliance-Validierung wird von einem externen Qualified Security Assessor (QSA) beurteilt, der einen Bericht über Compliance (ROC) oder einen Self-Assessment Questionnaire (SAQ) erstellt, der vom Volumen der Karteninhaber-Transaktionen abhängig ist.
id: The Payment Card Industry Data Security Standard (PCI DSS) didefinisikan oleh Payment Card Industry Standards Council, dan dibuat untuk meningkatkan kontrol seputar data pemegang kartu untuk mengurangi kecurangan kartu kredit. Verifikasi kepatuhan tahunan dinilai oleh Qualified Security Assessor (QSA) eksternal yang membuat Report on Compliance (Compliance Comporiance / ROC), atau dengan Self Assessment Questionnaire (SAQ) tergantung pada volume transaksi card-holder.
tr_tr: Ödeme Kartı Endüstrisi Veri Güvenliği Standardı (PCI DSS), Ödeme Kartı Endüstrisi Standartları Konseyi tarafından tanımlanır ve kredi kartı dolandırıcılığını azaltmak için kart sahibi verileri etrafındaki denetimleri artırmak için oluşturulmuştur. Yıllık uyum geçerliliği, bir Uygunluk Raporu (ROC) oluşturan harici bir Nitelikli Güvenlik Testi Uzmanı (QSA) veya kart sahibinin işlem hacmine bağlı olarak bir Özdeğerlendirme Anketi (SAQ) tarafından değerlendirilir.

source: The Planning phase is typically performed two weeks to six months before Fieldwork begins. In this phase audit items such as the timeframe, timeline, controls to be evaluated, and control owners are discussed and finalized. Concerns about resource availability, impartiality, and costs are also resolved.
de: Die Planungsphase wird typischerweise in zwei Wochen bis sechs Monate durchgeführt, bevor die Feldarbeit beginnt. In dieser Phase werden Auditpositionen wie Zeitrahmen, Zeitleiste, zu bewertende Kontrollen und Kontrollbesitzer diskutiert und finalisiert. Bedenken hinsichtlich Ressourcenverfügbarkeit, Unparteilichkeit und Kosten sind ebenfalls gelöst.
id: Tahap Planning biasanya dilakukan dua minggu sampai enam bulan sebelum Fieldwork dimulai. Dalam item audit tahap ini seperti kerangka waktu, garis waktu, kontrol yang akan dievaluasi, dan pemilik kontrol dibahas dan diselesaikan. Kekhawatiran tentang ketersediaan sumber daya, ketidakberpihakan, dan biaya juga dipecahkan.
tr_tr: Planlama aşaması, genellikle Saha Çalışması başlamadan önce iki hafta ile altı ay arasında yapılır. Bu aşamada, zaman çerçevesi, zaman çizelgesi, değerlendirilecek kontroller ve kontrol sahipleri gibi denetim maddeleri tartışılarak sonuçlandırılır. Kaynak kullanılabilirliği, tarafsızlığı ve maliyetleri ile ilgili endişeler de çözülür.

source: The RO access level can be helpful in public shares when the administrator gives read and write (RW) access for some certain editors or contributors and gives read-only (RO) access for the rest of users (viewers).
de: Die RO-Zugriffsebene kann in öffentlichen Freigaben hilfreich sein, wenn der Administrator Lese- und Schreibzugriff (RW) für einige bestimmte Redakteure oder Mitwirkenden gibt und für den Rest der Benutzer (Zuschauer) schreibgeschützten Zugriff gewährt.
id: Tingkat akses RO dapat membantu dalam public share saat administrator memberikan akses read and write (RW) untuk beberapa editor atau kontributor tertentu dan memberikan akses read-only (RO) untuk pengguna lainnya (viewer).
tr_tr: Yönetici, bazı editörler veya katılımcılar için okuma ve yazma (RW) erişimi verdiğinde ve geri kalan kullanıcılar (izleyiciler) için salt okunur (RO) erişim verirse, RO erişim düzeyi kamu paylaşımlarında yardımcı olabilir.

source: The Reporting phase is where any issues that were identified during the Fieldwork phase will be validated by management. For logistics purposes, some activities such as issue validation may be performed during the Fieldwork phase. Management will also need to provide remediation plans to address the issues and ensure that they do not reoccur. A draft of the overall report will be circulated for review to the stakeholders and management. Agreed upon changes are incorporated and the updated draft is sent to senior management for review and approval. Once senior management approves the report, it is finalized and distributed to executive management. Any issues are entered into the issue tracking or risk tracking mechanism the organization uses.
de: In der Berichtsphase werden alle Themen, die während der Phasework-Phase identifiziert wurden, vom Management validiert. Für logistische Zwecke können während der Fieldwork-Phase einige Aktivitäten wie die Issue Validierung durchgeführt werden. Das Management muss auch Sanierungspläne vorlegen, um die Probleme zu lösen und sicherzustellen, dass sie nicht wieder auftauchen. Ein Entwurf des Gesamtberichts wird zur Überprüfung an die Stakeholder und das Management weitergegeben. Vereinbarte Änderungen werden eingearbeitet und der aktualisierte Entwurf wird an die Geschäftsleitung zur Überprüfung und Genehmigung übermittelt. Sobald das obere Management den Bericht genehmigt, ist er abgeschlossen und an die Geschäftsleitung verteilt. Irgendwelche Ausgaben werden in das Issue Tracking oder den Risiko-Tracking-Mechanismus eingegeben, den die Organisation nutzt.
id: Tahap Reporting adalah dimana setiap masalah yang diidentifikasi selama fase Fieldwork akan divalidasi oleh manajemen. Untuk keperluan logistik, beberapa kegiatan seperti validasi masalah dapat dilakukan selama fase kerja lapangan. Manajemen juga perlu memberikan rencana pemulihan untuk mengatasi masalah dan memastikan bahwa mereka tidak terulang kembali. Draft laporan keseluruhan akan diedarkan untuk ditinjau kembali kepada pemangku kepentingan dan manajemen. Menyetujui perubahan digabungkan dan draf yang diperbarui dikirim ke manajemen senior untuk diperiksa dan disetujui. Setelah manajemen senior menyetujui laporan tersebut, akhirnya diselesaikan dan didistribusikan ke manajemen eksekutif. Semua masalah dimasukkan ke dalam pelacakan masalah atau mekanisme pelacakan risiko yang digunakan organisasi.
tr_tr: Raporlama safhası, Saha Çalışması aşaması sırasında tespit edilen sorunların yönetim tarafından doğrulanacağı aşamadır. Lojistik amaçlar için, Saha Çalışması aşamasında sorun onaylama gibi bazı faaliyetler gerçekleştirilebilir. Yönetim ayrıca, sorunları çözmek ve yeniden ortaya çıkmamalarını sağlamak için iyileştirme planları sağlamalıdır. Genel rapordaki bir taslak, taraflara ve işletmelere gözden geçirilmek üzere dağıtılacaktır. Değişiklikler üzerine anlaşmaya varıldı ve güncellenmiş taslak inceleme ve onay için üst yönetime gönderildi. Üst düzey yönetim raporu onayladığında, sonuçlandırılır ve yönetici yönetimine dağıtılır. Herhangi bir sorun kuruluşun kullandığı sorun izleme veya risk izleme mekanizmasına girilir.

source: The Security Guide currently focuses on PostgreSQL and MySQL.
de: Der Security Guide konzentriert sich derzeit auf PostgreSQL und MySQL.
id: Security Guide saat ini fokus pada PostgreSQL dan MySQL.
tr_tr: Güvenlik Kılavuzu şu anda PostgreSQL ve MySQL üzerinde odaklanmaktadır.

source: The Shared File Systems service (manila) is intended to be ran on a single-node or across multiple nodes. The Shared File Systems service consists of four main services, which are similar to those of the Block Storage service:
de: Der Shared File Systems Service (Manila) soll auf einem Einzelknoten oder über mehrere Knoten laufen. Der Shared File Systems Service besteht aus vier Hauptdiensten, die denen des Block Storage Service ähneln:
id: Layanan Shared File Systems (manila) dimaksudkan untuk dijalankan pada node tunggal atau beberapa node. Layanan Shared File Systems terdiri dari empat layanan utama, yang serupa dengan layanan Block Storage:
tr_tr: Paylaşımlı Dosya Sistemleri servisi (manila), tek düğümde veya birden çok düğümde koştuğu düşünülmüştür. Paylaşılan Dosya Sistemleri servisi, Blok Depolama servisinkine benzer dört ana servisten oluşur:

source: The Shared File Systems service (manila) provides a set of services for management of shared file systems in a multi-tenant cloud environment. It is similar to how OpenStack provides block-based storage management through the OpenStack Block Storage service (cinder) project. With the Shared File Systems service, you can create a shared file system and manage its properties, such as visibility, accessibility and usage quotas.
de: Der Shared File Systems Service (Manila) bietet eine Reihe von Services für die Verwaltung von Shared File Systemen in einer Multi-Tenant Cloud Umgebung. Es ist ähnlich wie OpenStack blockbasierte Speicherverwaltung über das OpenStack Block Storage Service (Cinder) Projekt bietet. Mit dem Dienst Shared File Systems können Sie ein gemeinsam genutztes Dateisystem erstellen und seine Eigenschaften verwalten, z.B. Sichtbarkeit, Zugänglichkeit und Nutzungskontingente.
id: Layanan Shared File Systems (manila) menyediakan seperangkat layanan untuk pengelolaan sistem file bersama di lingkungan awan multi-tenant. Ini mirip dengan bagaimana OpenStack menyediakan manajemen penyimpanan berbasis blok melalui proyek layanan OpenStack Block Storage (cinder). Dengan layanan Shared File Systems, Anda dapat membuat sistem file bersama dan mengelola propertinya, seperti visibilitas, aksesibilitas dan kuota penggunaan.
tr_tr: Paylaşılan Dosya Sistemleri servisi (manila), çok kiracı bulut ortamında paylaşılan dosya sistemlerinin yönetimi için bir dizi servis sunmaktadır. OpenStack, OpenStack Blok Depolama Servisi (cinder) projesiyle nasıl blok tabanlı depolama yönetimi sağladığına benzer. Paylaşılan Dosya Sistemleri servisiyle, paylaşılan bir dosya sistemi oluşturabilir ve görünürlük, erişilebilirlik ve kullanım kotaları gibi özelliklerini yönetebilirsiniz.

source: The Shared File Systems service allows an administrator to grant or deny access to the *private* share types for tenants. It is also possible to get information about access for a specified private share type.
de: Der Shared File Systems Service ermöglicht es einem Administrator, den Zugriff auf die *privaten* Freigabetypen für Tenant zu gewähren oder zu verweigern. Es ist auch möglich, Informationen über den Zugriff auf einen bestimmten privaten Anteilstyp zu erhalten.
id: Layanan Shared File Systems memungkinkan administrator untuk memberikan atau menolak akses ke tipe share *private* untuk penyewa. Hal ini juga memungkinkan untuk mendapatkan informasi tentang akses untuk jenis share pribadi tertentu.
tr_tr: Paylaşımlı Dosya Sistemleri servisi, bir yönetici tarafından kiracılar için *gizli* paylaşım türlerine erişim izni verilmesine veya bu öğelere erişimi reddetmesine izin verir. Belirli bir gizli paylaşım türü erişimiyle ilgili bilgi almak da mümkündür.

source: The Shared File Systems service allows to grant or deny access to different entities of the service for other clients.
de: Der Dienst Shared File Systems ermöglicht es, den Zugriff auf verschiedene Entitäten des Dienstes für andere Clients zu gewähren oder zu verweigern.
id: Layanan Shared File Systems memungkinkan untuk memberikan atau menolak akses ke entitas layanan yang berbeda untuk klien lain.
tr_tr: Paylaşımlı Dosya Sistemleri servisi, diğer istemciler için servisin farklı varlıklarına erişim izni vermeyi veya bunlara erişimi reddetmeyi sağlar.

source: The Shared File Systems service allows to work with different types of a network:
de: Der Shared File Systems Service ermöglicht es, mit verschiedenen Arten von Netzwerken zu arbeiten:
id: Layanan Shared File Systems memungkinkan untuk bekerja dengan berbagai jenis jaringan:
tr_tr: Paylaşımlı Dosya Sistemleri servisi, farklı türde bir ağ ile çalışmanıza izin verir:

source: The Shared File Systems service allows you to configure a security service with these options:
de: Mit dem Dienst Shared File Systems können Sie einen Sicherheitsdienst mit diesen Optionen konfigurieren:
id: Layanan Shared File Systems memungkinkan Anda mengkonfigurasi layanan keamanan dengan opsi ini:
tr_tr: Paylaşımlı Dosya Sistemleri hizmeti, bir güvenlik servisini bu seçeneklerle yapılandırmanıza izin verir:

source: The Shared File Systems service architecture defines an abstraction layer for network resource provisioning. It allows administrators to choose from different options for how network resources are assigned to their tenants’ networked storage. There are several network plug-ins that provide a variety of integration approaches with the network services that are available with OpenStack.
de: Die Dienstarchitektur für freigegebene Dateisysteme definiert eine Abstraktionsschicht für die Bereitstellung von Netzwerkressourcen. Es erlaubt den Administratoren, aus verschiedenen Optionen zu wählen, wie Netzwerkressourcen dem vernetzten Speicher der Tenants zugewiesen werden. Es gibt mehrere Netzwerk-Plug-Ins, die eine Vielzahl von Integrationsansätzen mit den Netzwerkdiensten bieten, die mit OpenStack verfügbar sind.
id: Arsitektur layanan Shared File Systems mendefinisikan lapisan abstraksi untuk penyediaan sumber daya jaringan. Hal ini memungkinkan administrator untuk memilih dari pilihan yang berbeda untuk bagaimana sumber daya jaringan ditugaskan ke penyimpanan jaringan penyewa mereka. Ada beberapa plug-in jaringan yang menyediakan berbagai pendekatan integrasi dengan layanan jaringan yang tersedia dengan OpenStack.
tr_tr: Paylaşımlı Dosya Sistemleri servis mimarisi, ağ kaynaklarının sağlanması için bir soyutlama katmanı tanımlar. Yöneticilerin, ağ kaynaklarının kiracıların ağa bağlı depolamasına nasıl atandığına ilişkin farklı seçenekler arasından seçim yapmalarına izin verir. OpenStack ile kullanılabilen ağ servisleri ile çeşitli entegrasyon yaklaşımları sağlayan çeşitli ağ eklentileri bulunmaktadır.

source: The Shared File Systems service can work with different network types: flat, VLAN, VXLAN, or GRE, and supports segmented networking. There are also different :ref:`network plug-ins <shared_fs_network_plugins>` that provide a variety of integration approaches with the network services that are available with OpenStack.
de: Der Shared File Systems Service kann mit verschiedenen Netzwerktypen arbeiten: flat, VLAN, VXLAN oder GRE und unterstützt segmentierte Netzwerke. Es gibt auch anders :ref:`network plug-ins <shared_fs_network_plugins>` , die eine Vielzahl von Integrationsansätzen mit den Netzwerkdiensten bieten, die mit OpenStack verfügbar sind.
id: Layanan Shared File Systems dapat bekerja dengan berbagai jenis jaringan: flat, VLAN, VXLAN, atau GRE, dan mendukung jaringan tersegmentasi. Ada juga jenis yang berbeda :ref:`network plug-ins <shared_fs_network_plugins>` yang menyediakan berbagai pendekatan integrasi dengan layanan jaringan yang tersedia dengan OpenStack.
tr_tr: Paylaşımlı Dosya Sistemleri servisi farklı ağ türleri ile çalışabilir: düz, VLAN, VXLAN veya GRE ve segmentli ağları destekler. Ayrıca, farklı :ref:`ağ eklentileri <shared_fs_network_plugins>`, OpenStack ile kullanılabilen ağ servisleri ile çeşitli entegrasyon yaklaşımları sağlar.

source: The Shared File Systems service is merely keeping the information about networks in the database, and real networks are provided by the network provider. In OpenStack it can be Legacy networking (nova-network) or Networking (neutron) services, but the Shared File Systems service can work even out of OpenStack. That is allowed by ``StandaloneNetworkPlugin`` that can be used with any network platform and does not require some specific network services in OpenStack like Networking or Legacy networking services. You can set the network parameters in its configuration file.
de: Der Shared File Systems Service hält lediglich die Informationen über Netzwerke in der Datenbank und echte Netzwerke werden vom Netzbetreiber bereitgestellt. In OpenStack kann es sich um Legacy Networking (nova- network) oder Networking (Neutron) Dienste handeln, aber der Shared File Systems Service kann sogar aus OpenStack arbeiten. Das ist erlaubt von `` StandaloneNetworkPlugin``, die mit jeder Netzwerkplattform verwendet werden kann und keine bestimmten Netzwerkdienste in OpenStack wie Networking oder Legacy Networking Services benötigt. Sie können die Netzwerkparameter in der Konfigurationsdatei einstellen.
id: Layanan Shared File Systems hanya menyimpan informasi tentang jaringan di database, dan jaringan nyata disediakan oleh penyedia jaringan. Di OpenStack, hal itu dapat terjadi di layanan Legacy networking (nova-network) atau Networking (neutron), namun layanan Shared File Systems dapat bekerja bahkan bekerja di luar OpenStack. Itu diperbolehkan oleh ``StandaloneNetworkPlugin`` yang dapat digunakan dengan platform jaringan dan tidak memerlukan beberapa layanan jaringan tertentu di OpenStack seperti layanan Networking atau Legacy networking. Anda dapat mengatur parameter jaringan dalam file konfigurasinya.
tr_tr: Paylaşımlı Dosya Sistemleri servisi, yalnızca ağlardaki bilgileri veritabanında tutmakta ve gerçek ağlar ağ sağlayıcısı tarafından sağlanmaktadır. OpenStack'de Eski ağ (nova-network) veya Ağ (neutron) servisler olabilir, ancak Paylaşımlı Dosya Sistemleri servisi OpenStack'ten bile çalışabilir. Bu, herhangi bir ağ platformuyla kullanılabilen ve OpenStack'te Ağ veya Eski ağ servisleri gibi bazı belirli ağ servislerini gerektirmeyen ``StandaloneNetworkPlugin`` tarafından izin verilir. Ağ parametrelerini yapılandırma dosyasında ayarlayabilirsiniz.

source: The Shared File Systems service serves the same purpose as Amazon Elastic File System (EFS).
de: Der Shared File Systems Service dient dem gleichen Zweck wie Amazon Elastic File System (EFS).
id: Layanan Shared File Systems melayani tujuan yang sama seperti Amazon Elastic File System (EFS).
tr_tr: Paylaşılan Dosya Sistemleri servisi, Amazon Elastik Dosya Sistemi (EFS) ile aynı amaca hizmet eder.

source: The Shared File Systems service uses an SQL-based central database that is shared by all Shared File Systems services in the system. It can use any SQL dialect supported by ORM SQLALchemy, but is tested only with MySQL and PostgreSQL data bases.
de: Der Shared File Systems-Dienst verwendet eine SQL-basierte zentrale Datenbank, die von allen Shared File Systems-Diensten im System gemeinsam genutzt wird. Es kann jeden SQL-Dialekt verwenden, der von ORM SQLALchemy unterstützt wird, aber nur mit MySQL- und PostgreSQL-Datenbanken getestet wird.
id: Layanan Shared File Systems menggunakan basis data berbasis SQL yang dibagi oleh semua layanan Shared File Systems di sistem. Hal ini dapat menggunakan dialek SQL yang didukung oleh ORM SQLALchemy, namun hanya diuji dengan basis data MySQL dan PostgreSQL.
tr_tr: Paylaşımlı Dosya Sistemleri servisi, sistemdeki tüm Paylaşımlı Dosya Sistemleri servisleri tarafından paylaşılan bir SQL tabanlı merkezi veritabanı kullanır. ORM SQLALchemy tarafından desteklenen herhangi bir SQL lehçesini kullanabilir, ancak yalnızca MySQL ve PostgreSQL veri tabanlarıyla test edilir.

source: The Shared File Systems service works with various storage providers that use the following shared file system protocols: :term:`NFS <Network File System (NFS)>`, :term:`CIFS <Common Internet File System (CIFS)>`, :term:`GlusterFS`, and :term:`HDFS <Hadoop Distributed File System (HDFS)>`.
de: Der Shared File Systems Service arbeitet mit verschiedenen Speicheranbietern, die die folgenden gemeinsamen Dateisystemprotokolle verwenden: :term:`NFS <Network File System (NFS)>`, :term:`CIFS <Common Internet File System (CIFS)>`, :term:`GlusterFS` und :term:`HDFS <Hadoop Distributed File System (HDFS)> "
id: Layanan Shared File Systems bekerja dengan berbagai penyedia penyimpanan yang menggunakan protokol sistem file bersama berikut: :term:`NFS <Network File System (NFS)>`, :term:`CIFS <Common Internet File System (CIFS)>`, :term:`GlusterFS`, dan :term:`HDFS <Hadoop Distributed File System (HDFS)>`.
tr_tr: Paylaşılan Dosya Sistemleri servisi, aşağıdaki paylaşımlı dosya sistemi protokollerini kullanan çeşitli depolama sağlayıcıları ile birlikte çalışır: :term:`NFS <Ağ Dosya Sistemi (NFS)>`, :term:`CIFS <Ortak İnternet Dosya Sistemi (CIFS)>`, :term:`GlusterFS` ve :term:` HDFS <Hadoop Dağıtılmış Dosya Sistemi (HDFS)>`.

source: The Virtio RNG is a random number generator that uses ``/dev/random`` as the source of entropy by default, however can be configured to use a hardware RNG or a tool such as the entropy gathering daemon (`EGD <http://egd.sourceforge.net>`_) to provide a way to fairly and securely distribute entropy through a distributed system. The Virtio RNG is enabled using the ``hw_rng`` property of the metadata used to create the instance.
de: Der Virtio RNG ist ein Zufallszahlengenerator, der standardmäßig ``/dev/ random``als Entropiequelle verwendet, kann jedoch so konfiguriert werden, dass er ein Hardware-RNG oder ein Tool wie den Entropie-Sammel-Daemon (`EGD <http://egd.sourceforge.net>`_), um einen Weg zu schaffen, um die Entropie durch ein verteiltes System fair und sicher zu verteilen. Das Virtio RNG wird mit der ``hw_rng``Eigenschaft der Metadaten aktiviert, die zum Erstellen der Instanz verwendet wird.
id: Virtio RNG adalah generator bilangan acak yang menggunakan ``/dev/random`` sebagai sumber entropi secara default, namun dapat dikonfigurasi untuk menggunakan perangkat keras RNG atau alat seperti entropy gathering daemon (`EGD <http: //egd.sourceforge.net>`_) untuk menyediakan cara mendistribusikan distribusi entropi secara adil dan aman melalui sistem terdistribusi. Virtio RNG diaktifkan menggunakan properti ``hw_rng`` dari metadata yang digunakan untuk membuat instance.
tr_tr: Virtio RNG, varsayılan olarak entropinin kaynağı olarak ``/dev/random`` kullanan rasgele sayı üreteci olmasına rağmen, bir donanım RNG veya entropi toplama daemonu gibi bir araç ('EGD <http: //egd.sourceforge.net>`_), entropiyi dağıtılmış bir sistem yoluyla adil ve güvenli bir şekilde dağıtmanın bir yolunu sunmak için yapılandırılabilir. Virtio RNG, örneği oluşturmak için kullanılan metaverilerin ``hw_rng`` özelliği kullanılarak etkinleştirilir.

source: The Wrap-up phase is where the audit is officially spun down. Management will begin remediation activities at this point. Processes and notifications are used to ensure that any audit related information is moved to a secure repository.
de: In der Nachbearbeitungsphase ist das Audit offiziell abgeschlossen. Das Management wird zu diesem Zeitpunkt mit Sanierungsmaßnahmen beginnen. Prozesse und Meldungen werden verwendet, um sicherzustellen, dass alle auditbezogenen Informationen in ein sicheres Repository verschoben werden.
id: Tahap Wrap-up adalah tempat audit secara resmi diputar mundur. Manajemen akan memulai kegiatan remediasi pada saat ini. Proses dan notifikasi digunakan untuk memastikan bahwa informasi terkait audit dipindahkan ke repositori yang aman.
tr_tr: Tasfiye aşaması, denetimin resmen indirildiği aşamadır. Yönetim bu noktada iyileştirme faaliyetlerine başlayacaktır. Süreçler ve bildirimler, denetim ile ilgili bilgilerin güvenli bir depoya taşınmasını sağlamak için kullanılır.
