Repository: openstack/security-doc
Catalog: security-guide/source/locale/*/LC_MESSAGES/security-guide.po
Languages: de, id, tr_tr

source: Using the Shared File Systems service, you can grant or deny access to a share by specifying one of these supported share access levels:
de: Mit dem Dienst Shared File Systems können Sie den Zugriff auf eine Freigabe erteilen oder verweigern, indem Sie eine dieser unterstützten Zugriffsstufen angeben:
id: Dengan menggunakan layanan Shared File System, Anda dapat memberikan atau menolak akses ke share dengan menentukan salah satu tingkat akses share yang didukung ini:
tr_tr: Paylaşımlı Dosya Sistemleri servisini kullanarak, şu desteklenen paylaşım erişim düzeylerinden birini belirleyerek bir paylaşıma erişim izni verebilir veya bunlara erişiminizi engelleyebilirsiniz:

source: VLAN configuration complexity depends on your OpenStack design requirements. In order to allow OpenStack Networking to efficiently use VLANs, you must allocate a VLAN range (one for each tenant) and turn each compute node physical switch port into a VLAN trunk port.
de: Die VLAN-Konfigurationskomplexität hängt von Ihren OpenStack-Designanforderungen ab. Um OpenStack Networking effizient zu nutzen, um VLANs effizient zu nutzen, müssen Sie einen VLAN-Bereich (einen für jeden Tenant) zuordnen und jeden Compute-Knoten physikalischen Switch-Port in einen VLAN-Trunk-Port umwandeln.
id: Kompleksitas konfigurasi VLAN bergantung pada persyaratan desain OpenStack Anda. Untuk memungkinkan OpenStack Networking menggunakan VLAN secara efisien, Anda harus mengalokasikan rentang VLAN (satu untuk setiap penyewa) dan mengubah masing-masing compute node physical switch port menjadi VLAN trunk port.
tr_tr: VLAN yapılandırma karmaşıklığı OpenStack tasarım gereksinimlerinize bağlıdır. OpenStack Ağ'ın VLAN'ları verimli bir şekilde kullanmasına izin vermek için, bir VLAN aralığı (her kiracıda bir tane için bir tane) tahsis etmeniz ve her hesaplama düğümünün fiziksel geçiş portunu VLAN gövde portuna çevirmeniz gerekir.

source: VLANs are realized as packets on a specific physical network containing IEEE 802.1Q headers with a specific VLAN ID (VID) field value. VLAN networks sharing the same physical network are isolated from each other at L2, and can even have overlapping IP address spaces. Each distinct physical network supporting VLAN networks is treated as a separate VLAN trunk, with a distinct space of VID values. Valid VID values are 1 through 4094.
de: VLANs werden als Pakete auf einem bestimmten physischen Netzwerk mit IEEE 802.1Q-Headern mit einem bestimmten VLAN-ID (VID) Feldwert realisiert. VLAN-Netzwerke, die das gleiche physikalische Netzwerk teilen, sind bei L2 voneinander getrennt und können sogar überlappende IP-Adressräume aufweisen. Jedes einzelne physikalische Netzwerk, das VLAN-Netzwerke unterstützt, wird als separater VLAN-Trunk behandelt, mit einem deutlichen Raum von VID-Werten. Gültige VID-Werte sind 1 bis 4094.
id: VLAN direalisasikan sebagai paket pada jaringan fisik tertentu yang berisi header IEEE 802.1Q dengan nilai field VLAN ID (VID) tertentu. Jaringan VLAN yang berbagi jaringan fisik yang sama diisolasi satu sama lain di L2, dan bahkan bisa memiliki ruang alamat IP yang tumpang tindih. Setiap jaringan fisik yang berbeda yang mendukung jaringan VLAN diperlakukan sebagai VLAN trunk yang terpisah, dengan ruang nilai VID yang berbeda. Nilai VID yang valid adalah 1 sampai 4094.
tr_tr: VLAN'lar, belirli bir VLAN ID (VID) alan değeri olan IEEE 802.1Q üstbilgileri içeren belirli bir fiziksel ağdaki paketler halinde gerçekleştirilir. Aynı fiziksel ağı paylaşan VLAN ağları birbirinden L2'de izole edilir ve üst üste binen IP adres alanlarına bile sahip olabilirler. VLAN ağlarını destekleyen her ayrı fiziksel ağ, ayrı bir VID değerlerine sahip ayrı bir VLAN gövdesi olarak ele alınır. Geçerli VID değerleri 1 ile 4094 arasındadır.

source: Various
de: Verschiedene
tr_tr: Çeşitli

source: Various components of the OpenStack Networking services use either the messaging queue or database connections to communicate with other components in OpenStack Networking.
de: Verschiedene Komponenten der OpenStack Networking-Dienste verwenden entweder die Messaging-Warteschlange oder Datenbankverbindungen, um mit anderen Komponenten in OpenStack Networking zu kommunizieren.
id: Berbagai komponen layanan OpenStack Networking menggunakan antrian pesan atau koneksi database untuk berkomunikasi dengan komponen lain di OpenStack Networking.
tr_tr: OpenStack Ağ servislerinin çeşitli bileşenleri, OpenStack Ağında diğer bileşenlerle iletişim kurmak için mesajlaşma kuyruğu veya veritabanı bağlantılarını kullanır.

source: Verification of image signatures assures that an image is not replaced or changed since the time of original upload. The image signature verification feature uses Castellan as its key manager for storing cryptographic signatures. An image signature and certificate UUID is uploaded along with the image to the Image (glance) service. Glance verifies the signature after retrieving the certificate from the key manager. When the image is booted, the Compute service (nova) verifys the signature after it retrieves the certificate from the key manager.
de: Die Überprüfung von Abbild-Signaturen stellt sicher, dass ein Abbild seit dem Zeitpunkt des ursprünglichen Uploads nicht ersetzt oder geändert wird. Die Abbildsignaturüberprüfungsfunktion verwendet Castellan als Schlüsselmanager zum Speichern kryptografischer Signaturen. Eine Abbildsignatur und eine Zertifikat-UUID werden zusammen mit dem Abbild in den Image-Dienst (glance) hochgeladen. Glance überprüft die Signatur nach dem Abrufen des Zertifikats vom Schlüsselmanager. Beim Starten des Abbildes überprüft der Compute-Dienst (nova) die Signatur, nachdem das Zertifikat vom Schlüsselmanager abgerufen wurde.
id: Verifikasi image signature memastikan bahwa image tidak diganti atau diganti sejak saat upload asli. Fitur verifikasi image signature menggunakan Castellan sebagai manajer kunci untuk menyimpan cryptographic signature. Image signature dan certificate UUID diunggah bersamaan dengan image ke layanan Image (glance). Glance memverifikasi signature setelah mengambil sertifikat dari manajer kunci. Saat image di-boot, layanan Compute (nova) memverifikasi signature setelah mengambil sertifikat dari manajer kunci.

source: Verified boot
de: Verifizierter Boot
id: Boot terverifikasi
tr_tr: Doğrulanmış önyükleme

source: Vibha Fauver, GWEB, CISSP, PMP, has over fifteen years of experience in Information Technology. Her areas of specialization include software engineering, project management and information security. She has a B.S. in Computer & Information Science and a M.S. in Engineering Management with specialization and a certificate in Systems Engineering.
de: Vibha Fauver, GWEB, CISSP, PMP, hat über 15 Jahre Erfahrung in der Informationstechnologie. Zu ihren Spezialisierungsgebieten gehören Software Engineering, Projektmanagement und Informationssicherheit. Sie hat einen BS in Computer & Information Science und ein MS in Engineering Management mit Spezialisierung und ein Zertifikat in Systems Engineering.
id: Vibha Fauver, GWEB, CISSP, PMP, memiliki pengalaman lebih dari lima belas tahun di bidang Teknologi Informasi. Bidang spesialisasi termasuk rekayasa perangkat lunak, manajemen proyek dan keamanan informasi. Dia memiliki B.S. di Ilmu Komputer & Informasi dan M.S. di bidang Teknik Manajemen dengan spesialisasi dan sertifikat di bidang Systems Engineering.
tr_tr: Vibha Fauver, GWEB, CISSP, PMP, Bilgi Teknolojisinde on beş yılı aşkın tecrübeye sahiptir. Uzmanlık alanları yazılım mühendisliği, proje yönetimi ve bilgi güvenliği konularını içermektedir. Bilgisayar ve Enformasyon Biliminde B.S. derecesi ve Mühendislik Yönetimi alanında ihtisaslaşmış M.S. derecesi ve Sistem Mühendisliğinde bir sertifikası vardır.

source: Virtual Machine (multi-tenant) threats
de: Virtual Machine (Multi-Tenant) Bedrohungen
id: Ancaman Virtual Machine (multi-tenant)
tr_tr: Sanal Makine (çok kiracılı) tehditler

source: Virtual hardware (QEMU)
de: Virtuelle Hardware (QEMU)
tr_tr: Sanal donanım (QEMU)

source: Virtual machine images in the Image service
de: Abbilder von virtuellen Maschinen im Abbilddienst
id: Image mesin virtual dalam layanan Image
tr_tr: İmaj servisindeki Sanal makine imajları

source: Volume data contained within iSCSI packets is encrypted
de: Die in iSCSI-Paketen enthaltenen Datenträgerdaten werden verschlüsselt
id: Data volume yang terkandung dalam paket iSCSI dienkripsi
tr_tr: ISCSI paketleri içerisindeki hacim verileri şifrelenir

source: Volume encryption
de: Volumenverschlüsselung
id: Enkripsi volume
tr_tr: Hacim şifrelemesi

source: Volume encryption is supported by back-end key storage for enhanced security (for example, a Hardware Security Module (HSM) or a KMIP server can be used as a barbican back-end secret store)
de: Die Volume-Verschlüsselung wird von Back-End-Schlüsselspeichern für eine verbesserte Sicherheit unterstützt (z.B. ein Hardware Security Module (HSM) oder ein KMIP-Server kann als barbican Back-End-Geheimladen verwendet werden)
id: Enkripsi volume didukung oleh penyimpanan kunci back-end untuk keamanan yang ditingkatkan (misalnya, Hardware Security Module (HSM) atau server KMIP dapat digunakan sebagai penyimpanan rahasia back-end barbican)
tr_tr: Hacim şifreleme, gelişmiş güvenlik için arka uç anahtar depolaması ile desteklenir (örneğin, bir Donanım Güvenlik Modülü (HSM) veya bir KMIP sunucusu barbican arka uç gizli mağaza olarak kullanılabilir)

source: Vulnerability awareness
de: Anfälligkeitsbewusstsein
id: Kesadaran akan kerentanan
tr_tr: Güvenlik Açığı Bilinci

source: Vulnerability management
de: Schwachstellenmanagement
id: Manajemen Kerentanan
tr_tr: Güvenlik açığı yönetimi

source: We advise that you read this at your own discretion when planning on implementing security measures for your OpenStack cloud.
de: Wir empfehlen Ihnen, dies nach eigenem Ermessen bei der Umsetzung von Sicherheitsmaßnahmen für Ihre OpenStack Cloud zu lesen.
id: Kami menyarankan agar Anda membaca ini berdasarkan pertimbangan Anda sendiri saat merencanakan penerapan langkah keamanan untuk awan OpenStack Anda.
tr_tr: OpenStack bulutunuz için güvenlik önlemlerini uygulamayı planlarken bunu kendi takdirinize bağlı olarak okumanızı öneririz.

source: We also recommend the following additional steps for production nodes:
de: Wir empfehlen auch folgende zusätzliche Schritte für Produktionsknoten:
id: Kami juga merekomendasikan langkah-langkah tambahan berikut untuk node produksi:
tr_tr: Canlı ortam düğümleri için aşağıdaki ek adımları da öneriyoruz:

source: We briefly introduce the kinds of clouds (private, public, and hybrid) before presenting an overview of the OpenStack components and their related security concerns in the remainder of the chapter.
de: Wir stellen kurz die Arten von Clouds vor (privat, öffentlich und hybrid), bevor wir im weiteren Verlauf des Kapitels einen Überblick über die OpenStack-Komponenten und die damit verbundenen Sicherheitsbedenken geben.
id: Kami secara singkat memperkenalkan jenis awan (private, public, and hybrid) sebelum menyajikan ikhtisar komponen OpenStack dan masalah keamanan terkait mereka di sisa bab ini.

source: We consider entropy to refer to the quality and source of random data that is available to an instance. Cryptographic technologies typically rely heavily on randomness, requiring a high quality pool of entropy to draw from. It is typically hard for a virtual machine to get enough entropy to support these operations, which is referred to as entropy starvation. Entropy starvation can manifest in instances as something seemingly unrelated. For example, slow boot time may be caused by the instance waiting for ssh key generation. Entropy starvation may also motivate users to employ poor quality entropy sources from within the instance, making applications running in the cloud less secure overall.
de: Wir betrachten Entropie, um auf die Qualität und Quelle der zufälligen Daten zu verweisen, die für eine Instanz verfügbar sind. Kryptographische Technologien beruhen typischerweise stark auf Zufälligkeit und erfordern einen qualitativ hochwertigen Entropiepool. Es ist in der Regel schwer für eine virtuelle Maschine, um genug Entropie zu erhalten, um diese Operationen zu unterstützen, die als Entropie-Hunger bezeichnet wird. Entropie-Hunger kann sich in Fällen als etwas scheinbar nicht verwandtes manifestieren. Zum Beispiel kann eine langsame Bootzeit durch die Instanz verursacht werden, die auf die ssh-Schlüsselgenerierung wartet. Entropie-Hunger kann auch dazu beitragen, dass Benutzer qualitativ schlechte Entropie-Quellen aus der Instanz verwenden, so dass Anwendungen in der Cloud insgesamt weniger sicher laufen.
id: Kami mempertimbangkan entropi untuk mengacu pada kualitas dan sumber data acak yang tersedia untuk sebuah instance. Teknologi kriptografi biasanya sangat bergantung pada keacakan, membutuhkan kolam entropi berkualitas tinggi untuk menariknya. Biasanya sulit bagi mesin virtual untuk mendapatkan entropi yang cukup untuk mendukung operasi ini, yang disebut sebagai entropy starvation. Kelainan entropi dapat bermanifestasi dalam instance sebagai sesuatu yang tampaknya tidak terkait. Misalnya, waktu boot yang lambat mungkin disebabkan oleh instance menunggu generasi kunci ssh. Entropy starvation juga dapat memotivasi pengguna untuk menggunakan sumber entropi berkualitas buruk dari dalam instance, membuat aplikasi berjalan di awan kurang aman secara keseluruhan.
tr_tr: Entropi, bir örnek için mevcut rastgele verilerin kalitesine ve kaynağına atıfta bulunmayı düşünüyoruz. Şifreleme teknolojileri genellikle rastgeleğe dayanır; bunun sonucunda yüksek kaliteli bir entropi havuzu oluşturulur. Sanal makinenin, entropi açlığı olarak adlandırılan bu işlemleri desteklemek için yeterli entropi elde etmesi genellikle zor. Entropi açlığı görünüşte ilgisiz bir şey olarak ortaya çıkabilir. Örneğin, yavaş önyükleme zamanı, ssh anahtarının oluşturulmasını bekleyen örneğe bağlı olabilir. Entropi açlığı, kullanıcıları, örnek içindeki kalitesiz entropi kaynaklarını kullanmaya yönlendirerek, genel olarak uygulamaları bulutta daha az güvende kılıyor.

source: We define integrity life cycle as a deliberate process that provides assurance that we are always running the expected software with the expected configurations throughout the cloud. This process begins with :term:`secure bootstrapping <secure boot>` and is maintained through configuration management and security monitoring. This chapter provides recommendations on how to approach the integrity life-cycle process.
de: Wir definieren den Integritätslebenszyklus als bewussten Prozess, der versichert, dass wir immer die erwartete Software mit den erwarteten Konfigurationen in der gesamten Cloud ausführen. Dieser Vorgang beginnt mit :term: `sicheres Bootstrapping <secure boot>` und wird durch Konfigurationsmanagement und Sicherheitsüberwachung beibehalten. In diesem Kapitel finden Sie Empfehlungen, wie Sie den Integritätslebenszyklus verfolgen können.
id: Kami mendefinisikan siklus hidup integritas sebagai proses yang disengaja yang memberikan kepastian bahwa kami selalu menjalankan perangkat lunak yang diharapkan dengan konfigurasi yang diharapkan di seluruh awan. Proses ini dimulai dengan :term:`secure bootstrapping <secure boot>` dan dikelola melalui manajemen konfigurasi dan pemantauan keamanan. Bab ini memberikan rekomendasi bagaimana mendekati proses siklus hidup integritas.
tr_tr: Bütünlük ömrü döngüsünü, beklenen yazılımları bulut boyunca beklenen yapılandırmalarla her zaman çalıştırdığımızı garanti eden kasıtlı bir süreç olarak tanımlıyoruz. Bu işlem :term:`güvenli önyükleme <güvenli önyükleme>` ile başlar ve yapılandırma yönetimi ve güvenlik izlemesi ile korunur. Bu bölüm, bütünlük ömrü döngüsü sürecine nasıl yaklaşılabileceği konusunda öneriler sağlar.

source: We do not recommend using front-end caching tools with the dashboard. The dashboard is rendering dynamic content resulting directly from OpenStack API requests and front-end caching layers such as varnish can prevent the correct content from being displayed. In Django, static media is directly served from Apache or :term:`Nginx` and already benefits from web host caching.
de: Wir empfehlen nicht, Front-End-Caching-Tools mit dem Dashboard zu verwenden. Das Dashboard stellt dynamischen Inhalt dar, der direkt aus OpenStack-API-Anfragen resultiert und Front-End-Caching-Layer wie Lack kann verhindern, dass der richtige Inhalt angezeigt wird. In Django werden statische Medien direkt von Apache bedient oder :term:`Nginx` und profitiert bereits von Web-Host-Caching.
id: Kami tidak merekomendasikan penggunaan alat caching front-end dengan dasbor. Dasbor menampilkan konten dinamis yang dihasilkan langsung dari permintaan API OpenStack dan lapisan caching front-end seperti lapisan pernis dapat mencegah konten yang benar ditampilkan. Di Django, media statis langsung dilayani dari Apache atau :term:`Nginx` dan sudah mendapat manfaat dari caching host web.
tr_tr: Ön yüz önbellekleme araçlarını panelle kullanmanızı önermiyoruz. Gösterge tablosu, doğrudan OpenStack API isteklerinden kaynaklanan dinamik içeriği üretiyor ve vernik gibi ön yüz önbelleğe alma katmanları, doğru içeriğin görüntülenmesini engelleyebiliyor. Django'da statik medya doğrudan Apache'den sunulur veya :term: `Nginx` ve zaten web ana bilgisayar önbelleklemesinden yararlanır.

source: We highly recommend enabling transport-level cryptography for your message queue. Using TLS for the messaging client connections provides protection of the communications from tampering and eavesdropping in-transit to the messaging server. Below is guidance on how TLS is typically configured for the two popular messaging servers Qpid and RabbitMQ. When configuring the trusted certificate authority (CA) bundle that your messaging server uses to verify client connections, it is recommended that this be limited to only the CA used for your nodes, preferably an internally managed CA. The bundle of trusted CAs will determine which client certificates will be authorized and pass the client-server verification step of the setting up the TLS connection. Note, when installing the certificate and key files, ensure that the file permissions are restricted, for example using ``chmod 0600``, and the ownership is restricted to the messaging server daemon user to prevent unauthorized access by other processes and users on the messaging server.
de: Wir empfehlen dringend, die Kryptographie der Transport-Ebene für Ihre Nachrichtenwarteschlange zu aktivieren. Die Verwendung von TLS für die Messaging-Client-Verbindungen bietet den Schutz der Kommunikation von Manipulation und Abhören von In-Transit zum Messaging-Server. Im Folgenden finden Sie Anleitungen, wie TLS in der Regel für die beiden beliebten Messaging-Server Qpid und RabbitMQ konfiguriert ist. Bei der Konfiguration des Bündels der vertrauenswürdigen Zertifizierungsstelle (CA), die Ihr Messaging-Server zur Überprüfung von Clientverbindungen verwendet, empfiehlt es sich, dass nur die für Ihre Knoten verwendete CA, vorzugsweise eine intern verwaltete CA, beschränkt ist. Das Bündel von vertrauenswürdigen CAs bestimmt, welche Client-Zertifikate autorisiert werden sollen, und übergeben den Client-Server-Bestätigungsschritt für die Einrichtung der TLS-Verbindung. Beachten Sie bei der Installation des Zertifikats und der Schlüsseldateien, dass die Dateiberechtigungen eingeschränkt sind, z. B. mit ``chmod 0600``, und das Eigentum ist auf den Messaging-Server-Daemonbenutzer beschränkt, um den unbefugten Zugriff durch andere Prozesse und Benutzer auf der Messaging-Server.
id: Kami sangat menyarankan mengaktifkan kriptografi tingkat transportasi untuk antrean pesan Anda. Menggunakan TLS untuk koneksi klien pesan memberi perlindungan terhadap komunikasi dari gangguan dan penyadapan transit ke server pesan. Berikut adalah panduan tentang bagaimana TLS biasanya dikonfigurasi untuk dua server pesan populer Qpid dan RabbitMQ. Saat mengkonfigurasi bundle certificate authority (CA) terpercaya dimana server pesan Anda memverifikasi koneksi klien, kami sarankan agar ini hanya terbatas pada CA yang digunakan untuk nodus Anda, sebaiknya CA dikelola secara internal. Paket CA yang tepercaya akan menentukan sertifikat klien mana yang akan diberi otorisasi dan melewati langkah verifikasi klien-server untuk menyiapkan koneksi TLS. Catatan, saat menginstal sertifikat dan file kunci, pastikan hak akses file dibatasi, misalnya menggunakan ``chmod 0600``, dan kepemilikan dibatasi pada pengguna daemon server pesan untuk mencegah akses yang tidak sah oleh proses dan pengguna lain di server pesan
tr_tr: Mesaj kuyruğunuz için taşıma düzeyinde şifrelemeyi etkinleştirmenizi şiddetle öneririz. Mesajlaşma istemcisi bağlantıları için TLS'i kullanmak, iletişimin mesajlaşma sunucusuna geçişte müdahale ve dinlemesini önler. TLS'nin tipik olarak iki popüler mesajlaşma sunucusu Qpid ve RabbitMQ için nasıl yapılandırıldığı hakkında rehberlik aşağıda verilmektedir. Mesajlaşma sunucunuzun istemci bağlantılarını doğrulamak için kullandığı güvenilir sertifika yetkilisi (CA) paketini yapılandırırken, bunun yalnızca düğümleriniz için kullanılan CA ile sınırlandırılması önerilir, tercihen de dahili olarak yönetilen bir CA'dır. Güvenilen CA'ların paketi, hangi istemci sertifikalarının yetkili olacağını belirleyecek ve TLS bağlantısını kurma istemci-sunucu doğrulama adımını iletecektir. Sertifika ve anahtar dosyalarını yüklerken, dosya izinlerinin sınırlandırıldığına, örneğin ``chmod 0600`` kullanarak kısıtlandığına ve sahipliğin mesajlaşma sunucusundaki diğer süreçler ve kullanıcılar tarafından yetkisiz erişimi önlemek adına mesajlaşma sunucusu servis programı kullanıcısı olduğuna dikkat edin.

source: We recommend configuring X.509 client certificates on all the OpenStack service nodes for client connections to the messaging queue and where possible (currently only Qpid) perform authentication with X.509 client certificates. When using user names and passwords, accounts should be created per-service and node for finer grained auditability of access to the queue.
de: Wir empfehlen die Konfiguration von X.509-Clientzertifikaten auf allen OpenStack-Dienstknoten für Clientverbindungen zur Messaging-Warteschlange und wo möglich (derzeit nur Qpid) die Authentifizierung mit X.509-Clientzertifikaten durchzuführen. Bei der Verwendung von Benutzernamen und Passwörtern sollten Konten pro Service und Knoten für feinere körnige Auditierbarkeit des Zugriffs auf die Warteschlange erstellt werden.
id: Sebaiknya konfigurasikan sertifikat klien X.509 pada semua node layanan OpenStack untuk koneksi klien ke antrian pesan dan jika mungkin (saat ini hanya Qpid) melakukan otentikasi dengan sertifikat klien X.509. Bila menggunakan nama pengguna dan kata sandi, akun harus dibuat per-service dan node untuk mendapatkan aksesibilitas yang lebih halus terhadap antrian.
tr_tr: Mesajlaşma sırasına istemci bağlantıları için tüm OpenStack servis düğümlerinde X.509 istemci sertifikalarını yapılandırmayı ve mümkün olan yerlerde (şu an sadece Qpid) X.509 istemci sertifikalarıyla kimlik doğrulama gerçekleştirmenizi öneririz. Kullanıcı adlarını ve parolaları kullanırken, kuyruğa erişimin daha hassas bir şekilde denetlenebilmesi için hesaplar servis başına ve düğüm başına oluşturulmalıdır.
