Repository: openstack/security-doc
Catalog: security-guide/source/locale/*/LC_MESSAGES/security-guide.po
Languages: de, id, tr_tr

source: OpenStack Compute has a soft-delete feature, which enables an instance that is deleted to be in a soft-delete state for a defined time period. The instance can be restored during this time period. To disable the soft-delete feature, edit the ``etc/nova/nova.conf`` file and leave the ``reclaim_instance_interval`` option empty.
de: OpenStack Compute verfügt über eine Soft-Delete-Funktion, die eine Instanz ermöglicht, die für einen definierten Zeitraum in einem Soft-Delete-Zustand gelöscht wird. Die Instanz kann während dieses Zeitraums wiederhergestellt werden. Um die Soft-Delete-Funktion zu deaktivieren, bearbeiten Sie die `` etc/nova/nova.conf``Datei und lassen die ``reclaim_instance_interval`` Option leer.
id: OpenStack Compute memiliki fitur soft-delete, yang memungkinkan sebuah instance yang dihapus berada dalam keadaan soft-delete untuk jangka waktu yang ditentukan. Instance dapat dipulihkan selama periode ini. Untuk menonaktifkan fitur soft-delete, edit file ``etc/nova/nova.conf`` dan biarkan opsi ``reclaim_instance_interval``` kosong.
tr_tr: OpenStack Hesaplama, silinen bir örneği tanımlı bir zaman diliminde yumuşak silme durumunda etkinleştiren bir yumuşak silme özelliğine sahiptir. Örnek, bu zaman diliminde geri yüklenebilir. Yumuşak silme özelliğini devre dışı bırakmak için, ``/etc/nova/nova.conf`` dosyasını düzenleyin ve `` reclaim_instance_interval`` seçeneğini boş bırakın.

source: OpenStack Compute offers a sub-service called nova-conductor which proxies database connections, with the primary purpose of having the nova compute nodes interfacing with nova-conductor to meet data persistence needs as opposed to directly communicating with the database.
de: OpenStack Compute bietet einen Sub-Service namens nova-conductor an, der die Datenbankverbindungen projiziert, wobei der primäre Zweck darin besteht, dass die nova-Compute-Knoten mit dem nova-conductor verbunden sind, um die Datenpersistenz zu erfüllen, im Gegensatz zur direkten Kommunikation mit der Datenbank.
id: OpenStack Compute menawarkan sub-service yang disebut nova-conductor yang menghubungkan koneksi database, dengan tujuan utama memiliki nova compute node yang berinteraksi dengan nova-conductor untuk memenuhi kebutuhan persistensi data yang bertentangan dengan komunikasi langsung dengan database.
tr_tr: OpenStack Hesaplama, veritabanıyla doğrudan iletişim kurmanın aksine, veri kalıcılık gereksinimlerini karşılamak için nova hesaplama düğümlerinin nova iletkeniyle etkileşime girmesini temel amacı ile veritabanı bağlantılarını temsil eden bir alt-servis sunar.

source: OpenStack Compute supports tenant network traffic access controls directly when deployed with the legacy nova-network service, or may defer access control to the OpenStack Networking service.
de: OpenStack Compute unterstützt die Direktzugriffskontrolle von Tenantnetzwerken direkt, wenn sie mit dem Legacy-Nova-Netzwerkdienst bereitgestellt wird, oder die Zugriffskontrolle auf den OpenStack Networking-Dienst verschieben.
id: OpenStack Compute mendukung kontrol akses lalu lintas jaringan tenant secara langsung saat digunakan dengan layanan nova-network legacy (lawas), atau dapat menunda kontrol akses ke layanan OpenStack Networking.
tr_tr: OpenStack Hesaplama, eski nova-network servisiyle konuşlandırıldığında doğrudan kiracı şebeke trafiği erişim kontrollerini destekler veya OpenStack Ağ servisine erişim denetimini erteleyebilir.

source: OpenStack Identity service provides ``uuid`` and ``fernet`` as token providers. The ``uuid`` tokens must be persisted and is considered as insecure.
de: OpenStack Identity Dienst stellt ``uuid`` und ``fernet`` als Token-Dienstleister. Die ``uuid`` Token müssen persistiert sein und gelten als unsicher.
id: Layanan OpenStack Identity menyediakan ``uuid`` dan ``fernet`` sebagai token provider. Token ``uuid`` harus tetap bertahan dan dianggap tidak aman.

source: OpenStack Image Storage (glance) is a service where users can upload and discover data assets that are meant to be used with other services. This currently includes images and metadata definitions.
de: OpenStack Image Storage (Glance) ist ein Service, bei dem Benutzer Datenkomponenten hochladen und ergründenn können, die für andere Dienste gedacht sind. Dies beinhaltet derzeit Abbilder und Metadatendefinitionen.
id: OpenStack Image Storage (glance) adalah layanan dimana pengguna dapat mengunggah dan menemukan aset data yang dimaksudkan untuk digunakan dengan layanan lainnya. Ini mencakup definisi image dan metadata.
tr_tr: OpenStack İMaj Depolama Alanı (glance), kullanıcıların diğer servisler ile kullanılmak üzere verilerin bulunduğu öğeleri yükleyebildiği ve keşfedebildiği bir servistir. Bu şu anda imajları ve metaveri tanımlarını içerir.

source: OpenStack Image service has a delayed delete feature, which will pend the deletion of an image for a defined time period. It is recommended to disable this feature if it is a security concern, by editing the ``etc/glance/glance-api.conf`` file and setting the ``delayed_delete`` option as False.
de: Der OpenStack Abbilddienst verfügt über eine verzögerte Löschfunktion, die das Löschen eines Abbildes für einen definierten Zeitraum beendet. Es empfiehlt sich, diese Funktion zu deaktivieren, wenn es sich um eine Sicherheitsbedeutung handelt, indem Sie die ``etc/glance/glance- api.conf``Datei bearbeiten und die Option ``delayed_delete``als False einstellen.
id: Layanan OpenStack Image memiliki fitur hapus tertunda, yang akan menunggu penghapusan image untuk jangka waktu yang ditentukan. Dianjurkan untuk menonaktifkan fitur ini jika ini adalah masalah keamanan, dengan mengedit file ``etc/glance/glance-api.conf`` dan menetapkan opsi ``delayed_delete`` ke False.
tr_tr: OpenStack İmaj servisi, belirli bir süre boyunca bir imajın silinmesini bekleyecek gecikmeli silme özelliğine sahiptir. Bir güvenlik endişesi varsa, bu özelliği ``/etc/glance/glance-api.conf`` dosyasını düzenleyerek ve ``delayed_delete`` seçeneğini False olarak ayarlayarak devre dışı bırakmanız önerilir.

source: OpenStack Mailing List, [OpenStack] nova-novnc SSL configuration - Havana. 2014. `OpenStack nova-novnc SSL Configuration <http://lists.openstack.org/pipermail/openstack/2014-February/005357.html>`_
de: OpenStack Mailing List, [OpenStack] nova-novnc SSL Konfiguration - Havanna. 2014. `OpenStack nova-novnc SSL-Konfiguration <http://lists.openstack.org/pipermail/openstack/2014-February/005357.html> `_
tr_tr: OpenStack Eposta Listesi, [OpenStack] nova-novnc SSL yapılandırması - Havana. 2014. `OpenStack nova-novnc SSL Yapılandırması <http://lists.openstack.org/pipermail/openstack/2014-February/005357.html>`_

source: OpenStack Networking adds a layer of virtualized network services which gives tenants the capability to architect their own virtual networks. Currently, these virtualized services are not as mature as their traditional networking counterparts. Consider the current state of these virtualized services before adopting them as it dictates what controls you may have to implement at the virtualized and traditional network boundaries.
de: OpenStack Networking fügt eine Ebene von virtualisierten Netzwerkdiensten hinzu, die den Tenants die Möglichkeit gibt, ihre eigenen virtuellen Netzwerke zu entwerfen. Derzeit sind diese virtualisierten Dienstleistungen nicht so reif wie ihre traditionellen Networking-Pendants. Betrachten Sie den aktuellen Stand dieser virtualisierten Dienste, bevor Sie sie annehmen, da sie diktiert, welche Kontrollen Sie an den virtualisierten und traditionellen Netzwerkgrenzen implementieren müssen.
id: OpenStack Networking menambahkan lapisan layanan jaringan virtual yang memberi penyewa kemampuan untuk membuat arsitek jaringan virtual mereka sendiri. Saat ini, layanan virtual ini tidak semewah jaringan jejaring tradisional mereka. Pertimbangkan keadaan saat ini dari layanan virtual ini sebelum mengadopsi mereka karena menentukan kontrol apa yang mungkin harus Anda terapkan di network boundary (batas jaringan) virtual dan tradisional.
tr_tr: OpenStack Ağ, kiracılara kendi sanal ağlarını tasarlama imkânı veren sanallaştırılmış ağ servisleri katmanını ekler. Şu anda, bu sanallaştırılmış servisler, geleneksel ağ eşdeğerlerine göre olgun değiller. Bu sanallaştırılmış servislerin mevcut durumunu, onları sanallaştırılmış ve geleneksel ağ sınırlarında uygulamak zorunda olduğunuz kontrolleri belirlediğinde kabul etmeden önce düşünün.

source: OpenStack Networking allows cloud tenants to manage their guest network configurations. Security concerns with the networking service include network traffic isolation, availability, integrity, and confidentiality.
de: OpenStack Networking ermöglicht es Cloud-Tenants, ihre Gast-Netzwerk-Konfigurationen zu verwalten. Um die Sicherheit kümmert sich der Netzwerk-Service incl. Netzwerkverkehr Isolation, Verfügbarkeit, Integrität und Vertraulichkeit.
id: OpenStack Networking memungkinkan penyewa awan mengelola konfigurasi jaringan tamu mereka. Masalah keamanan dengan layanan jaringan meliputi isolasi lalu lintas jaringan, ketersediaan, integritas, dan kerahasiaan.

source: OpenStack Networking also supports per-project quotas limit through a quota extension API. To enable per-project quotas, you must set the ``quota_driver`` option in ``neutron.conf``.
de: OpenStack Networking unterstützt auch pro-Projekt-Kontingente durch eine Quotaerweiterungs-API. Um pro Projektkontingente zu aktivieren, müssen Sie die ``quota_driver``Option in ``neutron.conf``setzen.
id: OpenStack Networking juga mendukung batas kuota per proyek melalui API ekstensi kuota. Untuk mengaktifkan kuota per proyek, Anda harus mengatur opsi ``quota_driver`` di ``neutron.conf``.
tr_tr: OpenStack Ağ, kota genişletme API'si aracılığıyla proje başına kota sınırını da desteklemektedir. Proje başına kotaları etkinleştirmek için, ``neutron.conf`` dosyasındaki ``quota_driver`` seçeneğini ayarlamanız gerekir.

source: OpenStack Networking can employ two different mechanisms for traffic segregation on a per tenant/network combination: VLANs (IEEE 802.1Q tagging) or L2 tunnels using GRE encapsulation. The scope and scale of your OpenStack deployment determines which method you should utilize for traffic segregation or isolation.
de: OpenStack Networking kann zwei verschiedene Mechanismen für die Verkehrssegregation auf einer pro Tenant/Netzwerk-Kombination einsetzen: VLANs (IEEE 802.1Q Tagging) oder L2-Tunnel mit GRE-Kapselung. Das Ziel und der Umfang Ihrer OpenStack-Bereitstellung bestimmen, welche Methode Sie für die Verkehrssegregation oder die Isolation nutzen sollten.
id: Jaringan OpenStack dapat menggunakan dua mekanisme yang berbeda untuk segregasi lalu lintas pada kombinasi per tenant/network: VLAN (IEEE 802.1Q tagging) atau L2 tunnel menggunakan enkapsulasi GRE. Ruang lingkup dan skala penyebaran OpenStack Anda menentukan metode mana yang harus Anda gunakan untuk segregasi lalu lintas atau isolasi.
tr_tr: OpenStack Ağ, trafik ayrımı için kiracı/ağ kombinasyonunda iki farklı mekanizma istihdam edebilir: VLAN'lar (IEEE 802.1Q etiketleme) veya GRE kapsüllemeyi kullanan L2 tünelleri. OpenStack dağıtımınızın kapsamı ve ölçeği, trafik ayrımı veya izolasyon için hangi yöntemi kullanmanız gerektiğini belirler.

source: OpenStack Networking currently supports both GRE and VXLAN encapsulation.
de: OpenStack Networking unterstützt derzeit sowohl die GRE- als auch die VXLAN-Kapselung.
id: OpenStack Networking saat ini mendukung enkapsulasi GRE dan VXLAN.
tr_tr: OpenStack Ağ şu anda hem GRE hem de VXLAN kapsüllemeyi desteklemektedir.

source: OpenStack Networking has the following known limitations:
de: OpenStack Networking hat folgende bekannte Einschränkungen:
id: OpenStack Networking memiliki keterbatasan yang diketahui berikut ini:
tr_tr: OpenStack Networking aşağıdaki bilinen sınırlamaları içerir:

source: OpenStack Networking is a standalone service that often deploys several processes across a number of nodes. These processes interact with each other and other OpenStack services. The main process of the OpenStack Networking service is *neutron-server*, a Python daemon that exposes the OpenStack Networking API and passes tenant requests to a suite of plug-ins for additional processing.
de: OpenStack Networking ist ein eigenständiger Service, der oft mehrere Prozesse über mehrere Knoten hinweg einsetzt. Diese Prozesse interagieren miteinander und andere OpenStack-Dienste. Der Hauptprozess des OpenStack Networking-Dienstes ist *Neutron Server*, ein Python-Daemon, der die OpenStack Networking API enthüllt und die Tenantanforderungen an eine Suite von Plug-Ins zur weiteren Verarbeitung übergibt.
id: OpenStack Networking adalah layanan standalone yang sering kali deploy (mengerahkan) beberapa proses ke sejumlah node. Proses ini saling berinteraksi satu sama lain dan layanan OpenStack lainnya. Proses utama layanan OpenStack Networking adalah *neutron-server*, sebuah daemon Python yang mengekspos OpenStack Networking API dan melewati permintaan penyewa ke rangkaian plug-in untuk pemrosesan tambahan.
tr_tr: OpenStack Ağ, birçok düğümde birçok işlemi dağıtan bağımsız bir servistir. Bu süreçler birbirleriyle ve diğer OpenStack servisleri ile etkileşime girer. OpenStack Ağ servisinin asıl süreci *neutron-server*, OpenStack Ağ API'ını ortaya çıkaran ve kiracı taleplerini ilave işleme için bir eklentilere götüren bir Python servisidir.

source: OpenStack Networking provides users self services of network resources and configurations. It is important that cloud architects and operators evaluate their design use cases in providing users the ability to create, update, and destroy available network resources.
de: OpenStack Networking bietet Benutzern selbst Dienste von Netzwerkressourcen und Konfigurationen. Es ist wichtig, dass Cloud-Architekten und Betreiber ihre Design-Use-Cases bewerten, indem sie den Nutzern die Möglichkeit bieten, verfügbare Netzwerkressourcen zu erstellen, zu aktualisieren und zu zerstören.
id: OpenStack Networking menyediakan pengguna layanan jaringan dan sumber daya jaringan. Adalah penting bahwa arsitek dan operator awan mengevaluasi kasus penggunaan desain mereka dalam memberikan pengguna kemampuan untuk membuat, memperbarui, dan menghancurkan sumber daya jaringan yang tersedia.
tr_tr: OpenStack Ağ, kullanıcılara ağ kaynaklarının ve yapılandırmalarının kendi kendine servis sunmaktadır. Bulut mimarlarının ve operatörlerinin, kullanıcılara mevcut ağ kaynaklarını oluşturma, güncelleme ve yok etme yeteneği kazandırmada tasarım kullanma durumlarını değerlendirmeleri önemlidir.

source: OpenStack Networking routers can connect multiple L2 networks, and can also provide a *gateway* that connects one or more private L2 networks to a shared *external* network, such as a public network for access to the Internet.
de: OpenStack Networking Router können mehrere L2 Netzwerke anschließen und können auch ein *Gateway* bereitstellen, das ein oder mehrere private L2 Netzwerke mit einem freigegebenen *externen* Netzwerk verbindet, z. B. einem öffentlichen Netzwerk für den Zugriff auf das Internet.
id: Router OpenStack Networking dapat menghubungkan beberapa jaringan L2, dan juga dapat menyediakan *gateway* yang menghubungkan satu atau beberapa jaringan L2 pribadi ke jaringan *external* bersama, seperti jaringan publik untuk akses ke Internet.
tr_tr: OpenStack Ağ yönlendiricileri, birden fazla L2 ağını bağlayabilir ve ayrıca bir veya daha fazla özel L2 ağını, İnternet erişimi için ortak bir ağ gibi paylaşılan bir *harici* ağa bağlayan bir *ağ geçidi* sağlayabilir.

source: OpenStack Networking service configuration
de: OpenStack Networking Service Konfiguration
id: Konfigurasi layanan OpenStack Networking
tr_tr: OpenStack Ağ servisi yapılandırması

source: OpenStack Networking service placement on physical servers
de: OpenStack Networking Service Platzierung auf physischen Servern
id: Penyediaan layanan OpenStack Networking pada server fisik
tr_tr: Fiziksel sunuculardaki OpenStack Ağ servisi yerleşimi

source: OpenStack Networking supports multiple L3 and DHCP agents with load balancing. However, tight coupling of the location of the virtual machine is not supported. In other words, the default Virtual Machine scheduler will not take the location of the agents into account when creating virtual machines.
de: OpenStack Networking unterstützt mehrere L3- und DHCP-Agenten mit Lastverteilung. Eine enge Kopplung des Standortes der virtuellen Maschine wird jedoch nicht unterstützt. Mit anderen Worten, der Standard-Virtual Machine-Scheduler wird den Standort der Agenten bei der Erstellung virtueller Maschinen nicht berücksichtigen.
id: OpenStack Networking mendukung beberapa agen L3 dan DHCP dengan load balancing. Namun, coupling yang ketat dari lokasi mesin virtual tidak didukung. Dengan kata lain, penjadwal Virtual Machine default tidak akan mempertimbangkan lokasi agen saat membuat mesin virtual.
tr_tr: OpenStack Ağ, yük dengeleme özelliğine sahip birden fazla L3 ve DHCP aracını destekler. Bununla birlikte, sanal makinenin yerinin sıkı bağlanması desteklenmemektedir. Başka bir deyişle, varsayılan Sanal Makine zamanlayıcı, sanal makineler oluştururken aracıların konumunu dikkate almaz.

source: OpenStack Networking was designed with a plug-in architecture that provides extensibility of the API through open source community or third-party services. As you evaluate your architectural design requirements, it is important to determine what features are available in OpenStack Networking core services, any additional services that are provided by third-party products, and what supplemental services are required to be implemented in the physical infrastructure.
de: OpenStack Networking wurde mit einer Plug-In-Architektur entworfen, die eine Erweiterbarkeit der API durch Open-Source-Community oder Drittanbieter bietet. Wenn Sie Ihre architektonischen Konstruktionsanforderungen bewerten, ist es wichtig zu ermitteln, welche Funktionen in den Kerndiensten von OpenStack Networking verfügbar sind, alle zusätzlichen Dienste, die von Drittanbieterprodukten bereitgestellt werden und welche ergänzenden Dienste in der physischen Infrastruktur implementiert werden müssen.
id: OpenStack Networking dirancang dengan arsitektur plug-in yang memberikan perluasan API melalui komunitas open source atau layanan pihak ketiga. Saat Anda mengevaluasi persyaratan disain arsitektural Anda, penting untuk menentukan fitur apa yang tersedia di layanan inti OpenStack Networking, layanan tambahan yang disediakan oleh produk pihak ketiga, dan layanan tambahan apa yang harus diimplementasikan di infrastruktur fisik.
tr_tr: OpenStack Ağ, açık kaynak topluluğu veya üçüncü taraf hizmetleri vasıtasıyla API'nin genişletilebilirliğini sağlayan eklenti bir mimari ile tasarlanmıştır. Mimari tasarım gereksinimlerinizi değerlendirirken, OpenStack Ağ çekirdek sevislerindeki hangi özelliklerin, üçüncü parti ürünler tarafından sağlanan ek servislerin ve fiziki altyapıda hangi ilave servislerin uygulanması gerektiğinin belirlenmesi önemlidir.

source: OpenStack Object Storage (swift) service provides software that stores and retrieves data over HTTP. Objects (blobs of data) are stored in an organizational hierarchy that offers anonymous read-only access, ACL defined access, or even temporary access. Object Storage supports multiple token-based authentication mechanisms implemented via middleware.
de: OpenStack Object Storage (Swift) Service bietet Software, die Daten über HTTP speichert und abruft. Objekte (Blobs of Data) werden in einer organisatorischen Hierarchie gespeichert, die anonymen Nur-Lese-Zugriff, ACL-definierten Zugriff oder sogar temporären Zugriff bietet. Object Storage unterstützt mehrere Token-basierte Authentifizierungsmechanismen, die über Middleware implementiert werden.
id: Layanan OpenStack Object Storage (swift) menyediakan perangkat lunak yang menyimpan dan mengambil data melalui HTTP. Objek (blobs of data) disimpan dalam hirarki organisasi yang menawarkan akses anonymous read-only, akses yang ditentukan ACL, atau bahkan akses sementara. Object Storage mendukung beberapa mekanisme otentikasi berbasis token yang diimplementasikan melalui middleware.
tr_tr: OpenStack Nesne Depolama (swift) servisi, HTTP üzerinden veri depolayan ve alana yazılım getiren bir yazılım sağlar. Nesneler (verilerin blob'ları), anonim salt okunur erişim, ACL tanımlı erişim veya hatta geçici erişim sunan bir kuruluş hiyerarşisinde saklanır. Nesne Depolama Alanı, katman üzerinden uygulanan birden çok belirteç tabanlı kimlik doğrulama mekanizmasını desteklemektedir.

source: OpenStack Object Storage account
de: OpenStack Object Storage-Konto
id: Akun OpenStack Object Storage
tr_tr: OpenStack Nesne Depolama hesabı

source: OpenStack Object Storage containers
de: OpenStack Object Storage Container
id: Kontainer OpenStack Object Storage
tr_tr: OpenStack Nesne Depolama kapsayıcıları.

source: OpenStack Object Storage objects
de: OpenStack Object Speicherobjekte
id: Obyek OpenStack Object Storage
tr_tr: OpenStack Nesne Depolama nesneleri

source: OpenStack Security Advisories (OSSA) are created by the OpenStack Vulnerability Management Team (VMT). They pertain to security holes in core OpenStack services. More information on the VMT can be found in `Vulnerability Management Process <https://security.openstack.org/vmt-process.html>`_.
de: OpenStack Security Advisories (OSSA) werden vom OpenStack Vulnerability Management Team (VMT) erstellt. Sie beziehen sich auf Sicherheitslücken in Kern-OpenStack-Diensten. Weitere Informationen zum VMT finden Sie im `Vulnerability Management Process <https://security.openstack.org/vmt-process.html>`_.
id: OpenStack Security Advisories (OSSA) dibuat oleh OpenStack Vulnerability Management Team (VMT). Mereka terkait dengan lubang keamanan di layanan inti OpenStack. Informasi lebih lanjut tentang VMT dapat ditemukan di `Vulnerability Management Process <https://security.openstack.org/vmt-process.html>`_.
tr_tr: OpenStack Güvenlik Açıklamaları (OSSA), OpenStack Güvenlik Açığı Yönetimi Ekibi (VMT) tarafından oluşturulmuştur. Bunlar çekirdek OpenStack servislerindeki güvenlik açıkları ile ilgilidir. VMT hakkında daha fazla bilgi `Güvenlik Açığı Yönetimi Süreci <https://security.openstack.org/vmt-process.html>`_ nde bulunabilir.

source: OpenStack Security Guide
de: OpenStack Sicherheitshandbuch
id: Panduan Keamanan OpenStack
tr_tr: OpenStack Güvenlik Kılavuzu

source: OpenStack Security Notes (OSSN) are created by the OpenStack Security Group (OSSG) to support the work of the VMT. OSSN address issues in supporting software and common deployment configurations. They are referenced throughout this guide. Security Notes are archived at https://wiki.openstack.org/wiki/OSSN
de: OpenStack Security Notes (OSSN) werden von der OpenStack Security Group (OSSG) erstellt, um die Arbeit der VMT zu unterstützen. OSSN-Adresse Probleme bei der Unterstützung von Software und gemeinsame Bereitstellung Konfigurationen. Sie werden in diesem Leitfaden referenziert. Sicherheitsnotizen werden unter https://wiki.openstack.org/wiki/OSSN/ archiviert.
