Repository: openstack/security-doc
Catalog: security-guide/source/locale/*/LC_MESSAGES/security-guide.po
Languages: de, id, tr_tr

source: When creating custom topologies for network access it can be necessary to allow non-root users the ability to run the proxy commands. For these situations the oslo rootwrap package is used to provide a facility for non-root users to run privileged commands. This configuration requires the user associated with the data processing controller application to be in the sudoers list and for the option to be enabled in the configuration file. Optionally, an alternative rootwrap command can be provided.
de: Beim Erstellen von benutzerdefinierten Topologien für den Netzwerkzugriff kann es notwendig sein, dass Nicht-Root-Benutzer die Möglichkeit haben, die Proxy-Befehle auszuführen. Für diese Situationen wird das oslo-Rootwrap-Paket verwendet, um eine Möglichkeit für Nicht-Root-Benutzer bereitzustellen, um privilegierte Befehle auszuführen. Diese Konfiguration erfordert, dass der Benutzer, der mit der Datenverarbeitungscontroller-Anwendung verknüpft ist, sich in der Sudoers-Liste befindet und die Option in der Konfigurationsdatei aktiviert werden soll. Optional kann ein alternativer Rootwrap-Befehl bereitgestellt werden.
id: Saat membuat topologi kustom untuk akses jaringan, diperlukan kemampuan pengguna non-root untuk menjalankan perintah proxy. Untuk situasi ini, paket rootwrap oslo digunakan untuk menyediakan fasilitas bagi pengguna non-root untuk menjalankan privileged commands. Konfigurasi ini memerlukan pengguna yang terkait dengan aplikasi pengontrol pengolah data agar berada dalam daftar sudoers dan untuk opsi yang akan diaktifkan pada file konfigurasi. Secara opsional, sebuah perintah rootwrap alternatif dapat diberikan.
tr_tr: Ağa erişim için özel topolojiler oluştururken, root olmayan kullanıcıların vekil komutlarını çalıştırmasına izin vermesi gerekebilir. Bu gibi durumlarda oslo rootwrap paketi, root olmayan kullanıcılar için ayrıcalıklı komutlar çalıştıran bir olanak sağlamak için kullanılır. Bu yapılandırma, veri işleme denetleyicisi uygulamasıyla ilişkili kullanıcıyı sudoers listesinde ve yapılandırma dosyasında etkin kılınmasını gerektirir. İsteğe bağlı olarak, alternatif bir rootwrap komutu sağlanabilir.

source: When enabling the operating system, OpenStack Volume Encryption performance can be enhanced by using the hardware acceleration features currently available in both Intel and AMD processors. Both the OpenStack Volume Encryption feature and the OpenStack Ephemeral Disk Encryption feature use ``dm-crypt`` to secure volume data. ``dm-crypt`` is a transparent disk encryption capability in Linux kernel versions 2.6 and later. When the Volume Encryption is enabled, encrypted data is sent over iSCSI to Block Storage, securing data in transit and data at rest simultaneously. When using hardware acceleration, the performance impact of both of the encryption features is minimized.
de: Bei der Aktivierung des Betriebssystems kann die OpenStack Volume Encryption Leistung durch die Hardwarebeschleunigungsfunktionen erweitert werden, die derzeit sowohl in Intel als auch in AMD-Prozessoren verfügbar sind. Sowohl die OpenStack Volume Encryption Funktion als auch die OpenStack Ephemeral Disk Encryption Funktion verwenden ``dm-crypt``, um Datenträger zu sichern. ``dm-crypt``ist eine transparente Festplattenverschlüsselungsfunktion in Linux Kernel Versionen 2.6 und höher. Wenn die Volume Encryption aktiviert ist, werden verschlüsselte Daten über iSCSI gesendet, um den Speicher zu sperren, die Daten im Transit und die Daten gleichzeitig in Ruhe zu sichern. Bei der Hardwarebeschleunigung wird die Leistungseinschränkung beider Verschlüsselungsmerkmale minimiert.
id: Saat mengaktifkan sistem operasi, kinerja OpenStack Volume Encryption dapat ditingkatkan dengan menggunakan fitur akselerasi perangkat keras yang saat ini tersedia di prosesor Intel dan AMD. Baik fitur OpenStack Volume Encryption dan fitur OpenStack Ephemeral Disk Encryption menggunakan ``dm-crypt`` untuk mengamankan data volume. ``dm-crypt`` adalah kemampuan enkripsi disk transparan di kernel Linux versi 2.6 dan yang lebih baru. Ketika Volume Encryption diaktifkan, data terenkripsi dikirim melalui iSCSI ke Block Storage, mengamankan data dalam transit dan data saat istirahat bersamaan. Saat menggunakan akselerasi perangkat keras, dampak kinerja kedua fitur enkripsi diminimalkan.
tr_tr: İşletim sistemini etkinleştirirken OpenStack Hacim Şifreleme performansı hem Intel hem de AMD işlemcilerinde mevcut donanım hızlandırma özelliklerini kullanarak geliştirilebilir. Hem OpenStack Hacim Şifreleme özelliği hem de OpenStack Geçici Disk Şifreleme özelliği, hacim verilerini güvence altına almak için ``dm-crypt`` kullanır. ``dm-crypt``, Linux çekirdeği 2.6 ve sonrası sürümlerinde saydam bir disk şifreleme kabiliyetidir. Hacim Şifrelemesi etkinleştirildiğinde, şifrelenmiş veriler, iSCSI üzerinden Blok Depolama Alanı'na gönderilir, böylece veri aktarımı güvenli olur ve veriler aynı anda dinlenir. Donanım hızlandırması kullanıldığında, şifreleme özelliklerinin her ikisinin de performans etkisi en aza indirgenir.

source: When evaluating base hypervisor technologies, consider if the hypervisor has been certified against FIPS 140-2. Not only is conformance against FIPS 140-2 mandated per U.S. Government policy, formal certification indicates that a given implementation of a cryptographic algorithm has been reviewed for conformance against module specification, cryptographic module ports and interfaces; roles, services, and authentication; finite state model; physical security; operational environment; cryptographic key management; electromagnetic interference/electromagnetic compatibility (EMI/EMC); self-tests; design assurance; and mitigation of other attacks.
de: Bei der Bewertung von Basis-Hypervisor-Technologien ist zu prüfen, ob der Hypervisor gegen FIPS 140-2 zertifiziert wurde. Nicht nur die Konformität gegen die FIPS 140-2, die pro US-Regierungspolitik beauftragt ist, zeigt die formale Zertifizierung an, dass eine gegebene Implementierung eines kryptographischen Algorithmus auf Übereinstimmung mit der Modulspezifikation, den kryptographischen Modulhäfen und den Schnittstellen überprüft wurde; Rollen, Dienste und Authentifizierung; endliches Statusmodell; physische Sicherheit; Betriebsumfeld; kryptographisches Schlüsselmanagement; elektromagnetische Störung/elektromagnetische Verträglichkeit (EMI/EMV); Selbsttests; Designversicherung; und Abschwächung anderer Angriffe.
id: Saat mengevaluasi teknologi hypervisor dasar, pertimbangkan apakah hypervisor telah disertifikasi dengan FIPS 140-2. Tidak hanya kesesuaian dengan FIPS 140-2 yang dimandatkan per kebijakan Pemerintah A.S., sertifikasi formal menunjukkan bahwa penerapan algoritma kriptografi tertentu telah ditinjau untuk kesesuaian terhadap spesifikasi modul, port modul kriptografi dan antarmuka; peran, layanan, dan otentikasi; finite state model; keamanan fisik; lingkungan operasional; cryptographic key management; electromagnetic interference/electromagnetic compatibility (EMI / EMC); self-tests; jaminan desain; dan mitigasi serangan lainnya.
tr_tr: Temel hipervizör teknolojilerini değerlendirirken, hipervizörün FIPS 140-2'ye karşı sertifikalı olup olmadığını değerlendirin. ABD Hükümeti politikasına göre FIPS 140-2'ye uyma sadece formal kanıtlama, bir şifreleme algoritmasının verilen bir uygulamanın modül belirtimi, kriptografik modül bağlantı noktaları ve arabirimlerine uygunluk açısından gözden geçirildiğini gösterir; roller, servisler ve kimlik doğrulama; sonlu durum modeli; fiziksel güvenlik; operasyonel çevre; kriptografik anahtar yönetimi; elektromanyetik girişim / elektromanyetik uyumluluk (EMI/EMC); Kendi kendine testler; tasarım güvencesi; ve diğer saldırıların azaltılması.

source: When implementing OpenStack, one of the core decisions is which hypervisor to utilize. We recommend being informed of advisories pertaining to the hypervisor(s) you have chosen. Several common hypervisor security lists are below:
de: Bei der Implementierung von OpenStack ist eine der Kernentscheidungen welcher Hypervisor genutzt wird. Wir empfehlen Ihnen, sich über die von Ihnen gewählten Hypervisoren zu informieren. Mehrere gemeinsame Hypervisor Sicherheitslisten sind unten:
id: Saat mengimplementasikan OpenStack, salah satu keputusan utamanya adalah hypervisor mana yang akan digunakan. Kami merekomendasikan untuk diberitahu tentang nasihat yang berkaitan dengan hypervisor yang telah Anda pilih. Beberapa daftar keamanan hypervisor yang umum ada di bawah ini:
tr_tr: OpenStack'i uygularken ana kararlardan hangisi hangi hipervizör'un kullanacağıdır. Seçtiğiniz hipervizör(ler) ile ilgili tavsiyeleri öğrenmenizi öneririz. Birkaç genel hipervizör güvenlik listesi aşağıda belirtilmiştir:

source: When installing the certificate and key files, ensure that the file permissions are restricted, for example ``chmod 0600``, and the ownership is restricted to the database daemon user to prevent unauthorized access by other processes and users on the database server.
de: Wenn Sie das Zertifikat und die Schlüsseldateien installieren, stellen Sie sicher, dass die Dateiberechtigungen eingeschränkt sind, z. B. ``chmod 0600``, und das Eigentum ist auf den Datenbank-Daemon-Benutzer beschränkt, um unbefugten Zugriff durch andere Prozesse und Benutzer auf dem Datenbankserver zu verhindern.
id: Saat menginstal sertifikat dan file kunci, pastikan hak akses file dibatasi, misalnya ``chmod 0600``, dan kepemilikannya dibatasi pada pengguna daemon database untuk mencegah akses yang tidak sah oleh proses dan pengguna lain di server database.
tr_tr: Sertifika ve anahtar dosyaları yüklerken, dosya izinlerinin sınırlandırıldığından emin olun, örneğin ``chmod 0600`` ve sahiplik veritabanı sunucusu kullanıcısı tarafından, diğer işlemler ve kullanıcıların veritabanı sunucusu üzerindeki yetkisiz erişimi önlemek için sınırlandırılmıştır.

source: When provisioning clusters each instance will be given an IP address in the networks provided by the user. The first network is often referred to as the data processing management network and instances can use the fixed IP address assigned by the Networking service for this network. The controller can also be configured to use floating IP addresses for the instances in addition to their fixed address. When communicating with the instances the controller will prefer the floating address if enabled.
de: Bei der Bereitstellung von Clustern erhält jede Instanz eine IP-Adresse in den vom Benutzer bereitgestellten Netzwerken. Das erste Netzwerk wird oft als das Datenverarbeitungs-Management-Netzwerk bezeichnet und Instanzen können die feste IP-Adresse verwenden, die dem Networking-Dienst für dieses Netzwerk zugewiesen ist. Der Controller kann auch so konfiguriert werden, dass er neben der festen Adresse auch Floating-IP-Adressen für die Instanzen verwendet. Bei der Kommunikation mit den Instanzen wird der Controller die Floating-Adresse bevorzugen, wenn aktiviert.
id: Saat menentukan cluster masing-masing instance akan diberi alamat IP di jaringan yang disediakan oleh pengguna. Jaringan pertama sering disebut sebagai jaringan manajemen pengolahan data dan instance dapat menggunakan alamat IP tetap yang ditetapkan oleh layanan Networking untuk jaringan ini. Kontroler juga dapat dikonfigurasi untuk menggunakan alamat IP mengambang untuk instance di samping alamat tetap mereka. Saat berkomunikasi dengan instance, controller akan lebih memilih alamat mengambang jika diaktifkan.
tr_tr: Kümeleri hazırlarken her örneğe kullanıcı tarafından sağlanan ağlarda bir IP adresi verilir. İlk ağ genellikle veri işleme yönetimi ağı olarak adlandırılır ve örnekler bu ağ için Ağ servisi tarafından atanan sabit IP adresini kullanabilir. Denetleyici, sabit adreslerine ek olarak örnekler için kayan IP adresleri kullanacak şekilde de yapılandırılabilir. Örneklerle iletişim kurarken, denetleyici, etkinleştirilirse kayan adresi tercih eder.

source: When running a virtual machine, virtual hardware is a software layer that provides the hardware interface for the virtual machine. Instances use this functionality to provide network, storage, video, and other devices that may be needed. With this in mind, most instances in your environment will exclusively use virtual hardware, with a minority that will require direct hardware access. The major open source hypervisors use :term:`QEMU <Quick EMUlator (QEMU)>` for this functionality. While QEMU fills an important need for virtualization platforms, it has proven to be a very challenging software project to write and maintain. Much of the functionality in QEMU is implemented with low-level code that is difficult for most developers to comprehend. The hardware virtualized by QEMU includes many legacy devices that have their own set of quirks. Putting all of this together, QEMU has been the source of many security problems, including hypervisor breakout attacks.
de: Beim Ausführen einer virtuellen Maschine ist virtuelle Hardware eine Software-Schicht, die die Hardware-Schnittstelle für die virtuelle Maschine bereitstellt. Instanzen verwenden diese Funktionalität, um Netzwerk-, Speicher-, Video- und andere Geräte bereitzustellen, die benötigt werden können. In diesem Sinne werden die meisten Instanzen in Ihrer Umgebung ausschließlich virtuelle Hardware verwenden, mit einer Minderheit, die einen direkten Hardwarezugriff erfordert. Die wichtigsten Open-Source-Hypervisoren :term:`QEMU <Quick EMUlator (QEMU)>`für diese Funktionalität. Während QEMU einen wichtigen Bedarf an Virtualisierungsplattformen erfüllt, hat es sich als ein sehr anspruchsvolles Softwareprojekt erwiesen, was zuschreiben und zu pflegen ist. Ein Großteil der Funktionalität in QEMU wird mit Low-Level-Code implementiert, der für die meisten Entwickler schwer zu verstehen ist. Die Hardware, die von QEMU virtualisiert wird, enthält viele ältere Geräte, die ihren eigenen Satz von Macken haben. Das alles zusammen, QEMU war die Quelle für viele Sicherheitsprobleme, einschließlich Hypervisor Breakout-Angriffe.
id: Saat menjalankan mesin virtual, perangkat keras virtual adalah lapisan perangkat lunak yang menyediakan antarmuka perangkat keras untuk mesin virtual. Instance menggunakan fungsi ini untuk menyediakan jaringan, penyimpanan, video, dan perangkat lain yang mungkin diperlukan. Dengan pemikiran ini, sebagian besar Instance di lingkungan Anda secara eksklusif akan menggunakan perangkat keras virtual, dengan minoritas yang memerlukan akses perangkat keras langsung. Penggunaan hypervisor utama open source :term: `QEMU <Quick EMUlator (QEMU)>` untuk fungsi ini. Sementara QEMU memenuhi kebutuhan penting akan platform virtualisasi, namun terbukti menjadi proyek perangkat lunak yang sangat menantang untuk ditulis dan dipelihara. Sebagian besar fungsi di QEMU diimplementasikan dengan kode tingkat rendah yang sulit dipahami oleh sebagian besar pengembang. Perangkat keras yang di virtualisasi oleh QEMU mencakup banyak perangkat lawas yang memiliki kebiasaan mereka sendiri. Menempatkan semua ini bersama-sama, QEMU telah menjadi sumber banyak masalah keamanan, termasuk serangan pembobolan hypervisor.
tr_tr: Sanal makine çalıştırırken, sanal donanım, sanal makine için donanım arayüzü sağlayan bir yazılım katmanıdır. Örnekler, ağ, depolama, video ve ihtiyaç duyulabilecek diğer cihazları sağlamak için bu işlevi kullanıyor. Bunu göz önünde bulundurarak, çevrenizdeki çoğu örnek, yalnızca doğrudan donanım erişimi gerektiren bir azınlıkla sanal donanım kullanır. Büyük açık kaynaklı hypervisors şu işlevleri kullanır :term:`QEMU <Quick EMUlator (QEMU)> `. QEMU, sanallaştırma platformları için önemli bir ihtiyacı karşılamakla birlikte, yazmak ve korumak için çok zorlu bir yazılım projesi olduğu kanıtlanmıştır. QEMU'daki işlevselliğin çoğu, geliştiricilerin çoğu tarafından anlaşılması zor olan düşük düzey koduyla uygulanmaktadır. QEMU tarafından sanallaştırılan donanım, kendi tiksinti grubuna sahip birçok eski aygıtı içerir. Bunların hepsini bir araya getiren QEMU, hipervizör koparma saldırıları da dahil olmak üzere birçok güvenlik sorununun kaynağı olmuştur.

source: When scoping OpenStack deployments for compliance purposes, prioritize controls around sensitive services, such as command and control functions and the base virtualization technology. Compromises of these facilities may impact an OpenStack environment in its entirety.
de: Beim Scoping von OpenStack-Implementierungen für Compliance-Zwecke, Priorisierung von Kontrollen um sensible Dienste wie Befehls- und Steuerungsfunktionen und die Basis-Virtualisierungstechnologie. Kompromisse dieser Einrichtungen können sich auf eine OpenStack-Umgebung in ihrer Gesamtheit auswirken.
id: Saat menentukan lingkup penerapan OpenStack untuk tujuan kepatuhan, memprioritaskan kontrol di sekitar layanan sensitif, seperti fungsi perintah dan kontrol dan teknologi virtualisasi dasar. Kompromi fasilitas ini dapat mempengaruhi lingkungan OpenStack secara keseluruhan.
tr_tr: OpenStack dağıtımlarını uyumluluk amacıyla tararken, kontrol ve kontrol işlevleri ve temel sanallaştırma teknolojisi gibi hassas hizmetlerin çevresindeki denetimleri önceliklendirin. Bunlardan ödün vermek, bir OpenStack ortamını tamamen etkileyebilir.

source: When using :term:`Nginx`, we recommend `gunicorn <http://docs.gunicorn.org/en/latest/deploy.html>`_ as the WSGI host with an appropriate number of synchronous workers. When using Apache, we recommend ``mod_wsgi`` to host the dashboard.
de: Bei Verwendung :term:`Nginx` empfehlen wir `gunicorn <http://docs.gunicorn.org/en/latest/deploy.html>`_ als WSGI-Host mit einer entsprechenden Anzahl von synchronen Workern. Bei der Verwendung von Apache empfehlen wir ``mod_wsgi``, um das Dashboard zu hosten.
id: Ketika menggunakan :term:`Nginx`, we recommend `gunicorn <http://docs.gunicorn.org/en/latest/deploy.html>`_ sebagai WSGI host dengan jumlah pekerja sinkron yang sesuai. Bila menggunakan Apache, sebaiknya ``mod_wsgi`` untuk meng-host dasbor.
tr_tr: :term:`Nginx` kullanırken `gunicorn <http://docs.gunicorn.org/en/latest/deploy.html>`_ WSGI sunucusuna uygun senkron işçi sayısıyla öneririz. Apache'yi kullanırken, paneli barındırmak için ``mod_wsgi`` öneririz.

source: When using LVM backed ephemeral storage, which is block-based, it is necessary that the OpenStack Compute software securely erases blocks to prevent information disclosure. There have in the past been information disclosure vulnerabilities related to improperly erased ephemeral block storage devices.
de: Bei der Verwendung von LVM-unterstützten, kurzlebigen Speicher, der blockbasiert ist, ist es notwendig, dass die OpenStack Compute Software die Blöcke sicher löscht, um die Offenlegung von Informationen zu verhindern. Es gab in der Vergangenheit Informationen Offenlegung Schwachstellen im Zusammenhang mit unsachgemäß gelöschten Ephemer-Block-Speichergeräte.
id: Bila menggunakan penyimpanan sementara yang didukung LVM, yang berbasis blok, perlu perangkat lunak OpenStack Compute menghapus blokir dengan aman untuk mencegah pengungkapan informasi. Sebelumnya ada kerentanan pengungkapan informasi terkait dengan perangkat penyimpan blok sementara yang terhapus secara tidak benar.
tr_tr: Blok tabanlı olan LVM destekli geçici depolama birimini kullanırken, OpenStack Hesaplama yazılımının bilginin açığa çıkmasını önlemek için blokları güvenli bir şekilde silmesinin gerekmesi gerekir. Geçmişte, yanlışlıkla silinen kısa ömürlü blok depolama aygıtlarıyla ilgili bilginin açığa çıkması güvenlik açığı var.

source: When using ZeroMQ messaging, each host must run at least one ZeroMQ message receiver to receive messages from the network and forward messages to local processes through IPC. It is possible and advisable to run an independent message receiver per project within an IPC namespace, along with other services within the same project.
de: Bei der Verwendung von ZeroMQ-Messaging muss jeder Host mindestens einen ZeroMQ-Nachrichtenempfänger ausführen, um Nachrichten aus dem Netzwerk zu empfangen und Nachrichten über IPC an lokale Prozesse weiterzuleiten. Es ist möglich und ratsam, einen unabhängigen Nachrichtenempfänger pro Projekt innerhalb eines IPC-Namespaces zusammen mit anderen Diensten innerhalb desselben Projekts auszuführen.
id: Saat menggunakan pesan ZeroMQ, setiap host harus menjalankan setidaknya satu penerima pesan ZeroMQ untuk menerima pesan dari jaringan dan meneruskan pesan ke proses lokal melalui IPC. Adalah mungkin dan disarankan untuk menjalankan penerima pesan independen per proyek dalam ruang nama IPC, bersama dengan layanan lainnya dalam proyek yang sama.
tr_tr: ZeroMQ mesajlaşmasını kullanırken, her sunucu, ağdan mesaj almak ve mesajları IPC aracılığıyla yerel süreçlere yönlendirmek için en az bir ZeroMQ mesaj alıcısı çalıştırmalıdır. Aynı proje içindeki diğer servisler ile birlikte, bir IPC ad alanında bir proje için bağımsız bir ileti alıcısı çalıştırmak mümkündür ve önerilir.

source: When using ZeroMQ messaging, each project should run a separate ZeroMQ receiver process on a port dedicated to services belonging to that project. This is equivalent to the AMQP concept of control exchanges.
de: Bei der Verwendung von ZeroMQ-Messaging sollte jedes Projekt einen separaten ZeroMQ-Empfängerprozess auf einem Port ausführen, der für Dienste gedacht ist, die zu diesem Projekt gehören. Dies entspricht dem AMQP-Konzept des Kontrollaustausches.
id: Saat menggunakan pesan ZeroMQ, setiap proyek harus menjalankan proses penerima ZeroMQ terpisah di port yang didedikasikan untuk layanan yang termasuk dalam proyek itu. Ini setara dengan konsep AMQP tentang pertukaran kontrol.
tr_tr: ZeroMQ mesajlaşmasını kullanırken, her proje, o projeye ait servisler için ayrılmış bir portta ayrı bir ZeroMQ alıcı işlemi çalıştırmalıdır. Bu, kontrol alışverişlerinin AMQP konseptine eşdeğerdir.

source: When using flat networking, you cannot assume that projects which share the same layer 2 network (or broadcast domain) are fully isolated from each other. These projects may be vulnerable to ARP spoofing, risking the possibility of man-in-the-middle attacks.
de: Bei der Verwendung von flachen Netzwerken können Sie nicht davon ausgehen, dass Projekte, die das gleiche Layer 2 Netzwerk (oder Broadcast Domain) teilen, vollständig voneinander getrennt sind. Diese Projekte können anfällig für ARP-Spoofing sein und riskieren die Möglichkeit von Man-in-the-Middle-Attacken.
id: Saat menggunakan jaringan flat (datar), Anda tidak dapat mengasumsikan bahwa proyek yang berbagi layer 2 network yang sama (atau broadcast domain) sepenuhnya terisolasi satu sama lain. Proyek ini mungkin rentan terhadap spoofing ARP, mempertaruhkan kemungkinan serangan man-in-the-middle.
tr_tr: Düz ağ kullanırken, aynı katman 2 şebekesini (veya yayın alanını) paylaşan projelerin birbirlerinden tamamen bağımsız olduğunu varsayamazsınız. Bu projeler, ARP sızdırma durumuna karşı savunmasız olabilir ve insan-içi saldırı olasılığını riske atabilir.

source: When using the Networking service, we recommend that you enable security groups in this service and disable it in the Compute service.
de: Wenn Sie den Networking-Dienst verwenden, empfehlen wir Ihnen, Sicherheitsgruppen in diesem Dienst zu aktivieren und im Compute-Dienst zu deaktivieren.
id: Saat menggunakan layanan Networking, sebaiknya Anda mengaktifkan grup keamanan di layanan ini dan menonaktifkannya di layanan Compute.
tr_tr: Ağ servisi kullanırken, bu serviste güvenlik gruplarını etkinleştirmenizi ve Hesaplama servisinden devre dışı bırakmanızı öneririz.
