Repository: openstack/security-doc
Catalog: security-guide/source/locale/*/LC_MESSAGES/security-guide.po
Languages: de, id, tr_tr

source: There is no current solution to obfuscate these passwords. It is recommended that these files be appropriately secured by file permissions.
de: Es gibt keine aktuelle Lösung, um diese Passwörter zu verschleiern. Es wird empfohlen, dass diese Dateien durch Dateiberechtigungen ordnungsgemäß gesichert werden.
id: Tidak ada solusi saat ini untuk mengaburkan password ini. Disarankan agar file-file ini sesuai dengan hak akses file.

source: Therefore, we recommend that clear ownership of virtual machines be assigned, and that those owners be responsible for the hardening, deployment, and continued functionality of the virtual machines. We also recommend that updates be deployed on a regular schedule. These patches should be tested in an environment as closely resembling production as possible to ensure both stability and resolution of the issue behind the patch.
de: Daher empfiehlt es sich, eindeutige Besitz von virtuellen Maschinen zuzuordnen, und dass diese Eigentümer für das Hardening, den Einsatz und die fortlaufende Funktionalität der virtuellen Maschinen verantwortlich sind. Wir empfehlen auch, dass Updates regelmäßig bereitgestellt werden. Diese Patches sollten in einer Umgebung getestet werden, die der Produktion möglichst ähnlich ist, um sowohl die Stabilität als auch die Auflösung des Problems hinter dem Patch zu gewährleisten.
id: Oleh karena itu, kami merekomendasikan agar kepemilikan mesin virtual yang jelas diberikan, dan bahwa pemiliknya bertanggung jawab atas pengerasan, penerapan, dan fungsionalitas lanjutan dari mesin virtual. Kami juga merekomendasikan bahwa pembaruan akan diterapkan pada jadwal reguler. Patch ini harus diuji di lingkungan yang menyerupai produksi semaksimal mungkin untuk memastikan stabilitas dan penyelesaian masalah di balik patch.
tr_tr: Bu nedenle, sanal makinelerin sahipliğinin atanmasını ve bu sahiplerin sanal makinelerin sıkılaştırılmasından, kurulumundan ve işlevselliğinden sorumlu olmasını öneririz. Ayrıca, güncellemelerin düzenli bir programda dağıtılmasını öneriyoruz. Bu yamalar, yamanın istikrar ve sorun çözülmesini sağlamak için olabildiğince canlıya benzeyen bir ortamda test edilmelidir.

source: These control mappings will help identify common control criteria across certifications, and provide visibility to both auditors and auditees on problem areas within control sets for particular compliance certifications and attestations.
de: Diese Control-Mappings werden dazu beitragen, gemeinsame Kontrollkriterien in allen Zertifizierungen zu identifizieren und sowohl Auditoren als auch Geauditierte auf Problembereichen innerhalb von Kontrollsätzen für bestimmte Compliance-Zertifizierungen und Bescheinigungen zugänglich zu machen.
id: Pemetaan kontrol ini akan membantu mengidentifikasi kriteria kontrol bersama di seluruh sertifikasi, dan memberikan visibilitas kepada auditor dan auditee di area masalah di dalam kumpulan kontrol untuk sertifikasi kepatuhan dan pengesahan tertentu.
tr_tr: Bu kontrol eşlemeleri, sertifikalardaki ortak kontrol kriterlerinin belirlenmesine yardımcı olur ve belirli uyumluluk sertifikaları ve tasdikleri için denetim setleri içindeki sorunlu alanlardaki hem denetçiler hem de denetlenen kişilere görünürlük sağlar.

source: These filters will create an instance based on the utilizations of the hypervisor host sets and can trigger on free or used properties such as RAM, IO, or CPU utilization.
de: Diese Filter erstellen eine Instanz basierend auf den Auslastungen der Hypervisor-Host-Sets und können auf freie oder gebrauchte Eigenschaften wie RAM, IO oder CPU-Auslastung auslösen.
id: Filter ini akan membuat sebuah instance berdasarkan utilisasi dari set host hypervisor dan dapat memicu pada properti bebas atau bekas seperti utilisasi RAM, IO, atau CPU.
tr_tr: Bu filtreler, hipervizör ana bilgisayar kümelerinin kullanımına dayalı bir örnek oluşturur ve durduk yere veya RAM, GÇ veya CPU kullanımı gibi özellikleri tetikleyebilir.

source: These include:
de: Diese beinhalten:
id: Ini termasuk:
tr_tr: Bunlardan bazıları:

source: These logs should be reviewed at a regular cadence such as a live view by a network operations center (NOC), or if the environment is not large enough to necessitate a NOC, then logs should undergo a regular log review process.
de: Diese Protokolle sollten bei einer regelmäßigen Kadenz wie einer Live-Ansicht durch ein Network Operation Center (NOC) überprüft werden, oder wenn die Umgebung nicht groß genug ist, um einen NOC zu erfordern, dann sollten sich die Protokolle einem regelmäßigen Log-Review-Prozess unterziehen.
id: Log ini harus ditinjau ulang pada irama reguler seperti live view oleh network operations center (NOC), atau jika lingkungannya tidak cukup besar untuk memerlukan NOC, maka log harus menjalani proses peninjauan log reguler.
tr_tr: Bu günlükler, bir ağ operasyon merkezi (NOC) tarafından canlı bir görünüm gibi düzenli bir kademede gözden geçirilmelidir veya ortam NOC gerektirecek kadar büyük değilse, günlükler düzenli bir günlük inceleme sürecinden geçmelidir.

source: These policies can be modified or updated by the cloud administrator to control the access to the various resources. Ensure that any changes to the access control policies do not unintentionally weaken the security of any resource. Also note that changes to the ``policy.json`` file become effective immediately and do not require the service to be restarted.
de: Diese Richtlinien können vom Cloud-Administrator geändert oder aktualisiert werden, um den Zugriff auf die verschiedenen Ressourcen zu steuern. Stellen Sie sicher, dass Änderungen an den Zutrittskontrollrichtlinien die Sicherheit einer Ressource nicht unbeabsichtigt schwächen. Beachten Sie auch, dass Änderungen an der ``policy.json``Datei sofort wirksam werden und nicht verlangen, dass der Dienst neu gestartet wird.
id: Kebijakan ini dapat dimodifikasi atau diperbarui oleh administrator awan untuk mengontrol akses ke berbagai sumber. Pastikan bahwa setiap perubahan pada kebijakan kontrol akses tidak secara tidak sengaja melemahkan keamanan sumber daya apapun. Perhatikan juga bahwa perubahan pada file `policy.json` menjadi efektif dan tidak memerlukan layanan untuk di-restart.
tr_tr: Bu ilkeler, çeşitli kaynaklara erişimi denetlemek için bulut yöneticisi tarafından değiştirilebilir veya güncellenebilir. Erişim denetim ilkelerindeki herhangi bir değişikliğin herhangi bir kaynağın güvenliğini zayıflatmadığından emin olun. Ayrıca, ``policy.json`` dosyasındaki değişikliklerin hemen geçerli hale geldiğini ve servisin yeniden başlatılmasını gerektirmediğini unutmayın.

source: These security controls are best applied via automated methods. Automation ensures that the controls are applied the same way each time for each system and they also provide a quick method for auditing an existing system. There are multiple options for automation:
de: Diese Sicherheitskontrollen werden am besten über automatisierte Methoden angewendet. Die Automatisierung sorgt dafür, dass die Bedienelemente für jedes System jeweils gleich angewendet werden und sie bieten auch eine schnelle Methode zur Auditierung eines bestehenden Systems. Es gibt mehrere Möglichkeiten der Automatisierung:
id: Kontrol keamanan ini paling baik diterapkan melalui metode otomatis. Otomasi memastikan bahwa kontrol diterapkan dengan cara yang sama setiap saat untuk setiap sistem dan mereka juga menyediakan metode cepat untuk mengaudit sistem yang ada. Ada beberapa pilihan untuk otomasi:
tr_tr: Bu güvenlik kontrolleri en iyi otomatik yöntemlerle uygulanır. Otomasyon, her sistem için denetimlerin her seferinde aynı şekilde uygulanmasını sağlar ve mevcut bir sistemi denetlemek için hızlı bir yöntem de sağlar. Otomasyon için birden fazla seçenek vardır:

source: These should be put in place to monitor and report on changes to system, hypervisor, and application configuration files such as ``/etc/pam.d/system-auth`` and ``/etc/keystone/keystone.conf``, as well as kernel modules (such as virtio). Best practice is to use the :command:`lsmod` command to show what is regularly being loaded on a system to help determine what should or should not be included in FIM checks.
de: Diese sollten eingerichtet werden, um Änderungen an System-, Hypervisor- und Anwendungskonfigurationsdateien wie ``/etc/pam.d/system-auth``und `` /etc/keystone/keystone.conf``zu überwachen und zu melden , sowie Kernelmodule (wie virtio). Best Practice ist es, den Befehl :command:`lsmod` zu verwenden, um zu zeigen, was regelmäßig auf ein System geladen wird, um zu bestimmen, was in FIM-Prüfungen enthalten sein soll oder nicht.
id: Ini harus diletakkan di tempat untuk memantau dan melaporkan perubahan pada sistem, hypervisor, dan file konfigurasi aplikasi seperti ``/etc/pam.d/system-auth`` dan ``/etc/keystone/keystone.conf``, serta modul kernel (seperti virtio). Praktik terbaik adalah dengan menggunakan perintah :command:`lsmod` untuk menunjukkan apa yang secara teratur dimasukkan ke sistem untuk membantu menentukan apa yang seharusnya atau tidak boleh disertakan dalam pemeriksaan FIM.
tr_tr: Bunlar, sistem, hipervizör, ``/etc/pam.d/system-auth``, ``/etc/keystone/keystone.conf`` ve çekirdek modülleri (virtio gibi) gibi uygulama yapılandırma dosyalarındaki değişiklikleri izlemek ve raporlamak için uygulanmalıdır. En iyi uygulama, :command:`lsmod` komutunu kullanarak FIM kontrollerine dahil edilmesinin veya verilmemesi gerektiğini belirlemenize yardımcı olması için düzenli olarak bir sistemde yüklü olanı göstermektir.

source: These technologies comprise the core of the frameworks that are deployed with the Data processing service. In addition to these technologies, the service also includes bundled frameworks provided by third party vendors. These bundled frameworks are built using the same core pieces described above plus configurations and applications that the vendors include. For more information on the third party framework bundles please see the following links:
de: Diese Technologien umfassen den Kern der Frameworks, die mit dem Data Processing Service eingesetzt werden. Zusätzlich zu diesen Technologien umfasst der Service auch gebündelte Frameworks, die von Drittanbietern zur Verfügung gestellt werden. Diese gebündelten Frameworks werden unter Verwendung der gleichen Kernstücke aufgebaut, die oben beschrieben wurden, sowie Konfigurationen und Anwendungen, die die Anbieter enthalten. Weitere Informationen zu den Drittanbieter-Rahmenbündeln finden Sie unter den folgenden Links:
id: Teknologi ini terdiri dari inti kerangka kerja yang digunakan dengan layanan pengolahan Data. Selain teknologi ini, layanan ini juga mencakup kerangka kerja yang disediakan oleh vendor pihak ketiga. Kerangka bundel ini dibuat dengan menggunakan potongan inti yang sama seperti yang dijelaskan di atas ditambah konfigurasi dan aplikasi yang disertakan vendor. Untuk informasi lebih lanjut tentang kumpulan kerangka pihak ketiga, silakan lihat link berikut ini:
tr_tr: Bu teknolojiler Veri işleme hizmeti ile dağıtılan çatıların çekirdeğini oluşturur. Bu teknolojilere ek olarak, servis üçüncü parti sağlayıcıların sağladığı paket çatılarını da içeriyor. Bu paket çatılar, yukarıda tarif edilen aynı çekirdek parçalar ile sağlayıcıların içerdiği yapılandırmalar ve uygulamalar kullanılarak oluşturulmuştur. Üçüncü taraf çerçeve paketleri hakkında daha fazla bilgi için lütfen aşağıdaki bağlantılara bakın:

source: This :term:`Nginx` example requires TLS v1.1 or v1.2 for maximum security. The ``ssl_ciphers`` line can be tweaked based on your needs, however this is a reasonable starting place. The default configuration file is ``/etc/nginx/nginx.conf``.
de: Dieses :term:`Nginx` Beispiel erfordert TLS v1.1 oder v1.2 für maximale Sicherheit. Die ``ssl_ciphers``Linie kann nach Ihren Bedürfnissen angepasst werden, aber das ist ein vernünftiger Ausgangspunkt. Die Standardkonfigurationsdatei lautet ``/etc/nginx/nginx.conf``.
id: Contoh :term:`Nginx` ini memerlukan TLS v1.1 atau v1.2 untuk keamanan maksimal. Baris ``ssl_ciphers`` dapat di-tweak berdasarkan kebutuhan Anda, namun ini adalah tempat awal yang masuk akal. File konfigurasi defaultnya adalah ``/etc/nginx/nginx.conf``.
tr_tr: Bu :term:`Nginx` örneği, maksimum güvenlik için TLS v1.1 veya v1.2 gerektirir. ``ssl_ciphers`` satırı gereksinimlerinize göre uyarlanabilir, ancak bu makul bir başlangıç noktasıdır. Varsayılan yapılandırma dosyası ``/etc/nginx/nginx.conf`` dir.

source: This Book was produced in a 5 day book sprint. A book sprint is an intensely collaborative, facilitated process which brings together a group to produce a book in 3-5 days. It is a strongly facilitated process with a specific methodology founded and developed by Adam Hyde. For more information visit the book sprint web page at http://www.booksprints.net.
de: Dieses Buch wurde in einem 5-tägigen Buchsprint produziert. Ein Buchsprint ist ein intensiv kollaborativer, erleichterter Prozess, der eine Gruppe zusammenbringt, um ein Buch in 3-5 Tagen zu produzieren. Es ist ein stark erleichterter Prozess mit einer spezifischen Methodik, die von Adam Hyde gegründet und entwickelt wurde. Für weitere Informationen besuchen Sie die Buch-Sprint-Webseite unter http://www.booksprints.net.

source: This Pound example enables ``AES-NI`` acceleration, which helps to improve performance on systems with processors that support this feature. The default configuration file is ``/etc/pound/pound.cfg`` on Ubuntu, ``/etc/pound.cfg`` on RHEL, CentOS, openSUSE, and SUSE Linux Enterprise.
de: Dieses Pound-Beispiel ermöglicht ``AES-NI``Beschleunigung, die dazu beiträgt, die Leistung auf Systemen mit Prozessoren zu verbessern, die diese Funktion unterstützen. Die Standardkonfigurationsdatei lautet ``/etc/ pound/pound.cfg``auf Ubuntu, ``/etc/pound.cfg``auf RHEL, CentOS, openSUSE und SUSE Linux Enterprise.
id: Contoh Pound ini memungkinkan akselerasi ``AES-NI``, yang membantu meningkatkan kinerja pada sistem dengan prosesor yang mendukung fitur ini. File konfigurasi defaultnya adalah ``/etc/pound/pound.cfg`` di Ubuntu, ``/etc/pound.cfg`` di RHEL, CentOS, openSUSE, dan SUSE Linux Enterprise.
tr_tr: Bu Pound örneği, bu özelliği destekleyen işlemciler bulunan sistemlerde performansı artırmaya yardımcı olan ``AES-NI`` hızlandırmayı etkinleştirir. Varsayılan yapılandırma dosyası Ubuntu'da ``/etc/pound/pound.cfg``, RHEL, CentOS, openSUSE ve SUSE Linux Enterprise'da ``/etc/pound.cfg`` dir.

source: This abstraction offers the advantage of restricting services to executing methods with parameters, similar to stored procedures, preventing a large number of systems from directly accessing or modifying database data. This is accomplished without having these procedures stored or executed within the context or scope of the database itself, a frequent criticism of typical stored procedures.
de: Diese Abstraktion bietet den Vorteil der Beschränkung von Diensten zur Ausführung von Methoden mit Parametern, ähnlich wie bei gespeicherten Prozeduren, wodurch verhindert wird, dass eine große Anzahl von Systemen direkt auf Daten zugreifen oder diese ändern kann. Dies geschieht, ohne dass diese Prozeduren im Kontext oder Umfang der Datenbank selbst gespeichert oder ausgeführt werden, eine häufige Kritik an typischen gespeicherten Prozeduren.
id: Abstraksi ini menawarkan keuntungan untuk membatasi layanan terhadap metode eksekusi dengan parameter, mirip dengan prosedur tersimpan, mencegah sejumlah besar sistem untuk mengakses atau memodifikasi data database secara langsung. Hal ini dilakukan tanpa prosedur yang tersimpan atau dijalankan dalam konteks atau ruang lingkup database itu sendiri, sering mengkritik prosedur tersimpan yang umum.
tr_tr: Bu soyutlama, servisleri çok sayıda sistemin doğrudan erişmesini veya veri tabanını değiştirmesini engelleyerek, saklı yordamlara benzer şekilde, parametreleri yöntemlerle yürütme işlemlerine kısıtlama avantajını sunar. Bu, bu prosedürlerin, tipik saklanan prosedürlerin sıkça eleştirildiği veritabanının içeriği veya kapsamı içerisinde saklanması veya yürütülmesine gerek kalmadan gerçekleştirilir.

source: This book provides best practices and conceptual information about securing an OpenStack cloud.
de: Dieses Buch bietet Best Practices und konzeptionelle Informationen zur Sicherung einer OpenStack Cloud.
id: Buku ini memberikan praktik terbaik dan informasi konseptual tentang mengamankan awan OpenStack.
tr_tr: Bu kitap, bir OpenStack bulutunu güvence altına alma konusunda en iyi yöntemleri ve kavramsal bilgileri sağlar.

source: This chapter covers issues related to network communications to and from the database server. This includes IP address bindings and encrypting network traffic with TLS.
de: Dieses Kapitel behandelt Fragen im Zusammenhang mit der Netzwerkkommunikation zum und vom Datenbankserver. Dazu gehören IP-Adressbindungen und die Verschlüsselung des Netzwerkverkehrs mit TLS.
id: Bab ini membahas isu-isu yang berkaitan dengan komunikasi jaringan ke dan dari server database. Ini termasuk binding alamat IP dan mengenkripsi lalu lintas jaringan dengan TLS.
tr_tr: Bu bölümde, veritabanı sunucusuyla olan ağ iletişimi ile ilgili konular ele alınmaktadır. Buna IP adresi bağlamaları ve ağ trafiğini TLS ile şifrelemek dahildir.

source: This chapter has several objectives:
de: Dieses Kapitel hat mehrere Ziele:
id: Bab ini memiliki beberapa tujuan:
tr_tr: Bu bölümün birkaç amacı vardır:

source: This chapter recommends security enhancements for both public and private-facing API endpoints.
de: Dieses Kapitel empfiehlt Sicherheitsverbesserungen sowohl für öffentliche als auch für private API-Endpunkte.
id: Bab ini merekomendasikan penyempurnaan keamanan untuk API endpoint publik dan private-facing API .
tr_tr: Bu bölüm, hem genel hem de özel API uç noktaları için güvenlik iyileştirmeleri önerir.

source: This chapter will review several features around configuring TLS to secure both internal and external resources, and will call out specific categories of systems that should be given specific attention.
de: In diesem Kapitel werden einige Funktionen beschrieben, um TLS zu konfigurieren, um sowohl interne als auch externe Ressourcen zu sichern und spezifische Kategorien von Systemen aufzurufen, die besondere Aufmerksamkeit erhalten sollten.
id: Bab ini akan meninjau beberapa fitur seputar konfigurasi TLS untuk mengamankan sumber daya internal dan eksternal, dan akan memanggil kategori spesifik sistem yang harus diberi perhatian khusus.
tr_tr: Bu bölüm, hem dahili hem de harici kaynakları güvenli hale getirmek için TLS'yi yapılandırma ile ilgili çeşitli özellikleri inceleyecek ve özel dikkat gösterilmesi gereken belirli kategorilerdeki sistemleri kategorize edecektir.

source: This configuration can only be enabled while defining the node group templates that will make up the data processing clusters. It is provided as a run time option to be enabled during the cluster provisioning process.
de: Diese Konfiguration kann nur aktiviert werden, während die Knotengruppenvorlagen definiert werden, die die Datenverarbeitungscluster bilden. Es wird als Laufzeitoption zur Verfügung gestellt, die während des Cluster-Bereitstellungsprozesses aktiviert werden kann.
id: Konfigurasi ini hanya dapat diaktifkan saat menentukan template grup simpul yang akan membentuk cluster pengolahan data. Ini disediakan sebagai opsi run time untuk diaktifkan selama proses pembuatan klaster.
tr_tr: Bu yapılandırma, yalnızca veri işleme kümelerini oluşturacak düğüm grubu şablonlarını tanımlarken etkinleştirilebilir. Küme hazırlama işlemi sırasında etkinleştirilecek bir çalışma zamanı seçeneği olarak sağlanmıştır.

source: This delegates instance creation based on the image used, such as the operating system of the VM or type of image used.
de: Dies delegiert die Instanzerstellung basierend auf dem verwendeten Abbild, wie z.B. dem Betriebssystem der VM oder dem verwendeten Abbildtyp.
id: Hal ini mendelegasikan pembuatan instance berdasarkan image yang digunakan, seperti sistem operasi VM atau jenis image yang digunakan.
tr_tr: Bu, örnek oluşturmayı, VM'nin işletim sistemi ya da hangi tür imaj kullanıldığı gibi imaj özelliklerine devreder.

source: This does introduce new challenges around protecting that identity. However, this is a worthwhile tradeoff given the greater control, and fewer credential databases that come with a centralized common identity store.
de: Dies stellt neue Herausforderungen für den Schutz dieser Identität dar. Dies ist jedoch ein lohnender Kompromiss bei der größeren Kontrolle und weniger Credential-Datenbanken, die mit einem zentralisierten gemeinsamen Identitätsspeicher kommen.
tr_tr: Bu, o kimliği korumak için yeni zorluklar ortaya koyuyor. Bununla birlikte, bu, daha fazla kontrol ve merkezi bir ortak kimlik deposu ile gelen daha az kimlik bilgisi veritabanı göz önüne alındığında, değerli bir takas alanıdır.

source: This domain should always be considered *untrusted*.
de: Diese Domain sollte immer als *nicht vertrauenswürdig* betrachtet werden.
id: Domain ini harus selalu dianggap *untrusted *.
tr_tr: Bu alan her zaman *güvenilmez* olarak değerlendirilmelidir.

source: This ensures that placement of both code and data regions will be randomized. Enabled by the kernel (all modern Linux kernels support ASLR), when the executable is built with PIE.
de: Dadurch wird sichergestellt, dass die Platzierung von Code- und Datenregionen randomisiert wird. Aktiviert durch den Kernel (alle modernen Linux-Kernel unterstützen ASLR), wenn die ausführbare Datei mit PIE erstellt wird.
id: Ini memastikan penempatan kedua kode dan data daerah akan diacak. Diaktifkan oleh kernel (semua kernel Linux modern mendukung ASLR), saat eksekusi dilakukan dengan PIE.
tr_tr: Bu, hem kod hem de veri bölgelerinin yerleşiminin rastgele seçilmesini sağlar. Çalıştırılabilir dosya PIE ile kurulduğunda çekirdek tarafından etkinleştirilir (tüm modern Linux çekirdeği ASLR'yi destekler).

source: This example shows the barbican architecture diagram:
de: Dieses Beispiel zeigt das barbikanische Architekturdiagramm:
id: Contoh ini menunjukkan diagram arsitektur barbican:
tr_tr: Bu örnek, barbican mimari diyagramı gösterir:

source: This example shows the sVirt category identifier:
de: Dieses Beispiel zeigt die sVirt Kategorie Kennung:
id: Contoh ini menunjukkan pengenal kategori sVirt:
tr_tr: Bu örnek sVirt kategori tanımlayıcısını gösterir:

source: This filter will create an instance based on external details such as in a specific IP range, across availability zones, or on the same host as another instance.
de: Dieser Filter erstellt eine Instanz, die auf externen Details basiert, z. B. in einem bestimmten IP-Bereich, über Verfügbarkeitszonen oder auf demselben Host wie eine andere Instanz.
id: Filter ini akan membuat sebuah instance berdasarkan rincian eksternal seperti pada kisaran IP tertentu, di seluruh zona ketersediaan, atau pada host yang sama seperti instance lainnya.
tr_tr: Bu filtre, belirli bir IP aralığında, kullanılabilirlik bölgeleri arasında veya başka bir örnekle aynı ana bilgisayardaki gibi harici ayrıntılara dayalı bir örnek oluşturacaktır.

source: This filter will delegate instance creation based on user or administrator provided criteria such as trusts or metadata parsing.
de: Dieser Filter delegiert die Instanzerstellung basierend auf Benutzer oder Administrator, sofern Kriterien wie Trusts oder Metadaten-Parsing bereitgestellt werden.
id: Filter ini akan mendelegasikan pembuatan instance berdasarkan kriteria yang diberikan pengguna atau administrator seperti penguraian atau parsing metadata.
tr_tr: Bu filtre, kullanıcı veya yönetici tarafından güven veya metaveri ayrıştırması gibi ölçütlere dayalı olarak örnek oluşturma yetkisi verir.
