Repository: openstack/security-doc
Catalog: security-guide/source/locale/*/LC_MESSAGES/security-guide.po
Languages: de, id, tr_tr

source: Guest
de: Gast
tr_tr: Misafir

source: Guest VMs
de: Gast-VMs
tr_tr: Konuk VMler

source: Guest network
de: Gastnetzwerk
id: Guest network (jaringan tamu)
tr_tr: Misafir ağ

source: HIPAA is not a certification, rather a guide for protecting healthcare data. Similar to the PCI-DSS, the most important issues with both PCI and HIPPA is that a breach of credit card information, and health data, does not occur. In the instance of a breach, the cloud provider will be scrutinized for compliance with PCI and HIPPA controls. If proven compliant, the provider can be expected to immediately implement remedial controls, breach notification responsibilities, and significant expenditure on additional compliance activities. If not compliant, the cloud provider can expect on-site audit teams, fines, potential loss of merchant ID (PCI), and massive reputation impact.
de: HIPAA ist keine Zertifizierung, sondern ein Leitfaden zum Schutz der Gesundheitsdaten. Ähnlich wie bei der PCI-DSS sind die wichtigsten Probleme bei PCI und HIPPA, dass ein Verstoß gegen Kreditkarteninformationen und Gesundheitsdaten nicht auftritt. Im Falle eines Einbruchs wird der Cloud-Provider für die Einhaltung von PCI- und HIPPA-Kontrollen geprüft. Wenn er nachweislich konform ist, kann davon ausgegangen werden, dass der Anbieter sofort Abhilfemaßnahmen umsetzt, Notifizierungspflichten verletzt und erhebliche Ausgaben für zusätzliche Compliance-Aktivitäten ausführt. Wenn nicht kompatibel, hat der Cloud-Provider vor Ort Audit-Teams, Geldstrafen, potenziellen Verlust der Händler-ID (PCI) und massive Reputation Auswirkungen zu erwarten.
id: HIPAA bukan sertifikasi, melainkan panduan untuk melindungi data kesehatan. Serupa dengan PCI-DSS, masalah yang paling penting dengan PCI dan HIPPA adalah pelanggaran informasi kartu kredit, dan data kesehatan, tidak terjadi. Dalam kasus pelanggaran, penyedia awan akan diteliti untuk mematuhi kontrol PCI dan HIPPA. Jika terbukti memenuhi syarat, provider dapat diharapkan segera menerapkan remedial controls, melanggar notifikasi pemberitahuan, dan pengeluaran yang signifikan untuk kegiatan kepatuhan tambahan. Jika tidak memenuhi syarat, penyedia awan dapat terancam on-site audit team, denda, potensi kehilangan merchant ID (PCI), dan dampak reputasi besar.
tr_tr: HIPAA bir belgelendirme değil, sağlık verilerinin korunması için bir rehberdir. PCI-DSS'ye benzer şekilde hem PCI hem de HIPPA ile ilgili en önemli hususlar, kredi kartı bilgilerinin ve sağlık verilerinin ihlal edilmemesidir. Bir ihlal durumunda, bulut sağlayıcı PCI ve HIPPA kontrollerine uyum için incelenecek. Uyumlu olduğu ispatlanırsa, sağlayıcının düzeltici kontrolleri derhal uygulamasını, bildirim sorumluluklarını ihlal etmesini ve ek uygunluk faaliyetlerinde önemli miktarda harcamayı beklemesi beklenebilir. Uyumlu değilse, bulut sağlayıcısı, yerinde denetim ekipleri, cezalar, olası ticari kimliğini kaybetme (PCI) ve büyük itibar etkisi içerebilir.

source: HTTP listening port
de: HTTP-Listener-Ports
tr_tr: HTTP dinleme portu

source: HTTPS, HSTS, XSS, and SSRF
de: HTTPS, HSTS, XSS und SSRF
tr_tr: HTTPS, HSTS, XSS, ve SSRF

source: Harden QEMU using compiler hardening options. Modern compilers provide a variety of compile time options to improve the security of the resulting binaries. These features include relocation read-only (RELRO), stack canaries, never execute (NX), position independent executable (PIE), and address space layout randomization (ASLR).
de: QEMU härten mit Compiler-Härtungsoptionen. Moderne Compiler bieten eine Vielzahl von Kompilierzeitoptionen, um die Sicherheit der resultierenden Binärdateien zu verbessern. Zu diesen Merkmalen gehören Relocation-Read-only (RELRO), Stack-Canaries, never execute (NX), position independent executable (PIE) und address space layout randomization (ASLR).
id: Harden QEMU menggunakan opsi pengerasan kompiler. Kompiler modern menyediakan berbagai opsi waktu kompilasi untuk meningkatkan keamanan binari yang dihasilkan. Fitur-fitur ini termasuk relocation read-only (RELRO), stack canaries, never execute (NX), position independent executable (PIE), dan address space layout randomization (ASLR).
tr_tr: Derleyici sıkılaştırma seçeneklerini kullanarak QEMU'yu sıkılaştırın. Modern derleyiciler, oluşturulan ikili dosyaların güvenliğini artırmak için çeşitli derleme zamanı seçenekleri sunar. Bu özelliklere salt okunur yer değiştirme (RELRO), yığın kanaryaları, asla çalıştırma (NX), konumdan bağımsız yürütülebilir (PIE) ve adres alanı düzenini rasgeleliği (ASLR) dahildir.

source: Hardening the virtualization layers
de: Hardening der Virtualisierungsschichten
id: Pengerasan lapisan virtualisasi
tr_tr: Sanallaştırma katmanlarını sıkılaştırma

source: Hardens the data sections of an executable. Both full and partial RELRO modes are supported by gcc. For QEMU full RELRO is your best choice. This will make the global offset table read-only and place various internal data sections before the program data section in the resulting executable.
de: Hardening der Datenabschnitte einer ausführbaren Datei. Beide Voll- und Teil-RELRO-Modi werden von gcc unterstützt. Für QEMU ist RELRO Ihre beste Wahl. Dadurch wird die globale Offset-Tabelle schreibgeschützt und platziert verschiedene interne Datenabschnitte vor dem Programmdatenabschnitt in der resultierenden ausführbaren Datei.
id: Hardens bagian data dari executable. Baik mode RELRO penuh maupun parsial didukung oleh gcc. Untuk QEMU full RELRO adalah pilihan terbaik anda. Ini akan membuat tabel offset global hanya bisa dibaca dan menempatkan berbagai bagian data internal sebelum bagian data program dieksekusi.
tr_tr: Bir yürütülebilir dosyanın veri bölümlerini sıkılaştırır. Tam ve kısmi RELRO modları gcc tarafından desteklenir. QEMU için tam RELRO en iyi seçimdir. Bu, genel ofset tablosunu salt okunur hale getirecek ve çeşitli iç veri bölümlerini sonuçtaki yürütülebilir dosyanın program veri bölümünden önce yerleştirecektir.

source: Hardware concerns
de: Hardware-Sorgen
id: Masalah perangkat keras
tr_tr: Donanım endişeleri

source: Having a share as remote mountable instance of a file system, you can manage access to a specified share, and list permissions for a specified share.
de: Wenn Sie eine Freigabe als Remote-installierbare Instanz eines Dateisystems haben, können Sie den Zugriff auf eine angegebene Freigabe verwalten und Berechtigungen für eine angegebene Freigabe auflisten.
id: Dengan memiliki share sebagai instance sistem file yang dapat di mount jauh, Anda dapat mengatur akses ke bagian tertentu, dan mendaftarkan perizinan untuk bagian tertentu.
tr_tr: Bir dosya sisteminin uzaktan takılabilir örneği olarak bir paylaşıma sahip olduğunuzda, belirtilen bir paylaşıma erişimi yönetebilir ve belirtilen bir paylaşım için izinleri listeleyebilirsiniz.

source: Here are a few important use cases to consider when implementing log aggregation, analysis and monitoring. These use cases can be implemented and monitored through various applications, tools or scripts. There are open source and commercial solutions and some operators develop their own in-house solutions. These tools and scripts can generate events that can be sent to administrators through email or viewed in the integrated dashboard. It is important to consider additional use cases that may apply to your specific network and what you may consider anomalous behavior.
de: Hier sind einige wichtige Anwendungsfälle bei der Implementierung von Log Aggregation, Analyse und Monitoring zu berücksichtigen. Diese Anwendungsfälle können durch verschiedene Anwendungen, Werkzeuge oder Skripte implementiert und überwacht werden. Es gibt Open Source und kommerzielle Lösungen und einige Betreiber entwickeln ihre eigenen internen Lösungen. Diese Tools und Scripts können Ereignisse generieren, die an Administratoren per E-Mail gesendet werden können oder im integrierten Dashboard angezeigt werden. Es ist wichtig, zusätzliche Anwendungsfälle zu berücksichtigen, die für Ihr spezifisches Netzwerk gelten können und was Sie anomales Verhalten betrachten können.
id: Berikut adalah beberapa kasus penggunaan penting yang perlu dipertimbangkan saat menerapkan agregasi, analisis dan pemantauan log. Kasus penggunaan ini dapat diimplementasikan dan dipantau melalui berbagai aplikasi, peralatan atau skrip. Ada solusi open source dan komersial dan beberapa operator mengembangkan solusi in-house mereka sendiri. Alat dan skrip ini dapat menghasilkan event (kejadian) yang dapat dikirim ke administrator melalui email atau dilihat di dasbor terpadu. Penting untuk mempertimbangkan kasus penggunaan tambahan yang mungkin berlaku untuk jaringan spesifik Anda dan apa yang mungkin Anda anggap sebagai perilaku anomali.
tr_tr: Aşağıda, günlük toplama, analiz ve izleme uygularken dikkate alınması gereken birkaç önemli kullanım durumu bulunmaktadır. Bu kullanım durumları, çeşitli uygulamalar, araçlar veya komut dosyaları aracılığıyla uygulanabilir ve izlenebilir. Açık kaynak ve ticari çözümler var ve bazı operatörler kendi şirket içi çözümlerini geliştiriyorlar. Bu araçlar ve komut dosyaları yöneticilere e-posta yoluyla gönderilebilecek veya tümleşik panelde görüntülenecek olaylar oluşturabilir. Belirli ağınız için geçerli olabilecek ek kullanım durumlarını ve anormal davranışları neyi göz önüne almanız gerektiğini göz önüne almak önemlidir.

source: High
de: Hoch
tr_tr: Yüksek

source: Higher impact
de: Höhere Auswirkungen
id: Dampak lebih tinggi
tr_tr: Daha yüksek etki

source: Highlight security concerns and potential mitigations in present day OpenStack
de: Hervorhebung von Sicherheitsbedenken und möglichen Abschwächungen im heutigen OpenStack
id: Sorot (highlight) masalah keamanan dan potensi mitigasi di OpenStack saat ini
tr_tr: Günümüz OpenStack'inde güvenlik kaygılarından ve olası hafifleticileri vurgulayın

source: Highly capable and financially driven groups of attackers. Able to fund in-house exploit development and target research. In recent years the rise of organizations such as the Russian Business Network, a massive cyber-criminal enterprise, has demonstrated how cyber attacks have become a commodity. Industrial espionage falls within the serious organized crime group.
de: Hochfähige und finanziell getriebene Gruppen von Angreifern. In der Lage, eigene Entwicklung und Zielforschung zu finanzieren. In den letzten Jahren hat der Aufstieg von Organisationen wie dem russischen Business Network, einem massiven Cyber-Criminal-Unternehmen, gezeigt, wie Cyber-Attacken zu einer Ware geworden sind. Industriespionage fällt in die schwere organisierte Kriminalität.
id: Kelompok penyerang yang sangat mampu dan digerakkan secara finansial. Mampu mendanai pengembangan eksploitasi in house dan target penelitian. Dalam beberapa tahun terakhir, bangkitnya organisasi seperti Russian Business Network, sebuah perusahaan cyber-criminal masif, telah menunjukkan bagaimana serangan maya telah menjadi komoditas. Spionase industri berada di dalam kelompok kejahatan terorganisasi serius.
tr_tr: Son derece yetenekli ve finansal olarak tahrik edilen saldırgan grupları. Şirket içi sömürge geliştirme ve hedef araştırmaları için fonlama olanağı. Son yıllarda büyük bir siber suç örgütü olan Russian Business Network gibi örgütlerin yükselişi, siber saldırıların nasıl bir mal haline geldiğini gösterdi. Endüstriyel casusluk ciddi organize suç gruplarına giriyor.

source: Highly capable groups
de: Hochfähige Gruppen
id: Kelompok yang sangat mampu
tr_tr: Oldukça yetenekli gruplar

source: Horizon image upload
de: Horizont Abbilder hochladen
id: Upload image Horizon
tr_tr: Horizon resim yükleme

source: Hortonworks, Hortonworks. 2016. `Hortonworks Data Platform documentation <http://docs.hortonworks.com>`__
de: Hortonworks, Hortonworks. 2016. `Hortonworks Datenplattform Dokumentation <http://docs.hortonworks.com>`__
tr_tr: Hortonworks, Hortonworks. 2016. `Hortonworks Veri Platformu belgelendirmesi <http://docs.hortonworks.com>`__

source: Host key fingerprints
de: Host-Schlüssel Fingerabdrücke
tr_tr: Sunucu anahtar parmak izleri

source: Host platform configuration
de: Host-Plattform-Konfiguration
id: Konfigurasi platform host
tr_tr: Sunucu platformu yapılandırması

source: Host platform manufacturer control
de: Host-Plattform-Hersteller-Steuerung
id: Kontrol pabrikan platform host
tr_tr: Sunucu platformu üreticisi kontrolü

source: Host-based intrusion detection tools are also useful for automated validation of the cloud internals. There are a wide variety of host-based intrusion detection tools available. Some are open source projects that are freely available, while others are commercial. Typically these tools analyze data from a variety of sources and produce security alerts based on rule sets and/or training. Typical capabilities include log analysis, file integrity checking, policy monitoring, and rootkit detection. More advanced -- often custom -- tools can validate that in-memory process images match the on-disk executable and validate the execution state of a running process.
de: Host-basierte Intrusion Detection Tools sind auch nützlich für die automatisierte Validierung der Cloud Internals. Es gibt eine Vielzahl von Host-basierten Intrusion Detection Tools zur Verfügung. Einige sind Open-Source-Projekte, die frei verfügbar sind, während andere kommerziell sind. Typischerweise analysieren diese Werkzeuge Daten aus einer Vielzahl von Quellen und erzeugen Sicherheitsalarme basierend auf Regelsätzen und/oder Schulungen. Typische Fähigkeiten umfassen Log-Analyse, Dateiintegritätsprüfung, Richtlinienüberwachung und Rootkit-Erkennung. Fortgeschrittene - oft benutzerdefinierte Werkzeuge können bestätigen, dass In-Memory-Prozessbilder mit der ausführbaren Datei übereinstimmen und den Ausführungszustand eines laufenden Prozesses validieren.
id: Alat deteksi intrusi berbasis host juga berguna untuk validasi otomatis internal awan. Ada berbagai alat deteksi intrusi berbasis host yang tersedia. Beberapa proyek open source yang tersedia secara bebas, sementara yang lainnya bersifat komersial. Biasanya alat ini menganalisis data dari berbagai sumber dan menghasilkan peringatan keamanan berdasarkan rangkaian aturan dan / atau pelatihan. Kemampuan khas meliputi analisis log, pengecekan integritas berkas, pemantauan kebijakan, dan deteksi rootkit. Lebih alat -- often custom -- yang canggih dapat memvalidasi bahwa image proses in-memory sesuai dengan on-disk yang dapat dieksekusi dan memvalidasi keadaan eksekusi dari proses yang sedang berjalan.
tr_tr: Sunucu tabanlı saldırı tespit araçları, bulut içlerinin otomatik olarak doğrulanması için de yararlıdır. Çok çeşitli barındırma tabanlı saldırı tespit aletleri mevcuttur. Bazıları serbestçe temin edilebilen, diğerleri ise ticari olan açık kaynaklı projelerdir. Genellikle bu araçlar, çeşitli kaynaklardan gelen verileri analiz eder ve kural setleri ve/veya eğitim temelinde güvenlik uyarıları üretir. Tipik yetenekler arasında günlük analizi, dosya bütünlüğü denetimi, ilke izleme ve kök dizin algılama bulunur. Daha gelişmiş -- çoğunlukla özel araçlar --, bellek içi işlem görüntülerinin disk üzerindeki çalıştırılabilirle eşleştiğini doğrulayabilir ve çalışan bir işlemin yürütme durumunu doğrulayabilir.

source: How
de: Wie
id: Bagaimana
tr_tr: Nasıl

source: How are users granted access to build systems?
de: Wie haben Benutzer Zugriff auf Build-Systeme?
id: Bagaimana pengguna diberi akses untuk membangun sistem?
tr_tr: Kullanıcıların inşa sistemlerine izni nasıl sağlanır?

source: How can I use Vault, Keywhiz, Custodia etc ...?
de: Wie kann ich Vault, Keywhiz, Custodia usw. verwenden?
id: Bagaimana cara menggunakan Vault, Keywhiz, Custodia dll ...?

source: How data travels between components of the system
de: Wie Daten zwischen Komponenten des Systems reisen
id: Bagaimana data bergerak antar komponen sistem
tr_tr: Verinin sistemin bileşenleri arasında nasıl dolaştığı

source: How is source code management performed?
de: Wie wird das Quellcode-Management durchgeführt?
id: Bagaimana pengelolaan kode sumber dilakukan?
tr_tr: Kaynak kodu yönetimi nasıl gerçekleştirilir?

source: How the project interacts with external dependencies
de: Wie das Projekt mit externen Abhängigkeiten interagiert
id: Bagaimana proyek berinteraksi dengan dependensi eksternal
tr_tr: Proje dış bağımlılıklar ile nasıl etkileşim kurar?

source: How to contribute to this book
de: Wie kann ich zu diesem Buch beitragen?
id: Bagaimana berkontribusi pada buku ini
tr_tr: Bu kitaba nasıl katkıda bulunulur

source: How to select virtual consoles
de: So wählen Sie virtuelle Konsolen aus
id: Cara memilih konsol virtual
tr_tr: Sanal konsollar nasıl seçilecek

source: However, as this book does not intend to be a thorough reference on cryptography we do not wish to be prescriptive about what specific algorithms or cipher modes you should enable or disable in your OpenStack services. There are some authoritative references we would like to recommend for further information:
de: Jedoch, da dieses Buch nicht beabsichtigt, eine gründliche Bezugnahme auf die Kryptographie zu sein, möchten wir nicht vorschreiben, welche spezifischen Algorithmen oder Chiffrierungsmodi Sie in Ihren OpenStack-Diensten aktivieren oder deaktivieren sollten. Es gibt einige maßgebliche Referenzen, die wir für weitere Informationen empfehlen möchten:
id: Namun, karena buku ini tidak bermaksud menjadi referensi menyeluruh tentang kriptografi, kami tidak ingin menjadi preskriptif tentang algoritma atau mode cipher tertentu yang harus Anda aktifkan atau nonaktifkan di layanan OpenStack Anda. Ada beberapa referensi terpercaya yang ingin kami rekomendasikan untuk informasi lebih lanjut:
tr_tr: Bununla birlikte, bu kitap kriptografi hakkında kapsamlı bir referans olmayı amaçlamadığından, OpenStack servislerinizde hangi algoritmaları veya şifre modlarını etkinleştirmeniz veya devre dışı bırakmanız gerektiğine ilişkin kurallar vermek istemiyoruz. Daha fazla bilgi için tavsiye etmek istediğimiz bazı otoriter referanslar var:

source: Hypervisor mailinglists
de: Hypervisor Mailinglisten
id: Hypervisor milis
tr_tr: Hipervisor eposta listesi

source: Hypervisor memory optimization
de: Hypervisor Speicheroptimierung
id: Pengoptimalan memori hypervisor
tr_tr: Hipervizör bellek eniyileştirmesi

source: Hypervisor selection
de: Hypervisor Auswahl
id: Seleksi hypervisor
tr_tr: Hipervizör seçimi

source: Hypervisor threats
de: Hypervisor-Bedrohungen
id: Ancaman hypervisor
tr_tr: Hipervizör tehditleri

source: Hypervisor versus bare metal
de: Hypervisor gegen Bare Metal
tr_tr: Hipervizör mü düz mü

source: Hypervisors in OpenStack
de: Hypervisor in OpenStack
id: Hypervisors di OpenStack
tr_tr: OpenStack'te Hipervizörler

source: IP addresses of users
de: IP-Adressen der Benutzer
id: Alamat IP pengguna
tr_tr: Kullanıcılar için IP adresleri

source: IPL code configuration and data
de: IPL-Code-Konfiguration und Daten
id: Konfigurasi dan data kode IPL
tr_tr: IPL kod yapılandırma ve veri

source: Ideally, to test that the Identity Provider and the Identity service are communicating, navigate to the protected URL and attempt to sign in. If you get a response back from keystone, even if it is a wrong response, indicates the communication.
de: Idealerweise, um zu testen, dass der Identity Provider und der Identity Service kommunizieren, navigieren Sie zu der geschützten URL und versuchen Sie sich zu melden. Wenn Sie eine Antwort von Keystone erhalten, auch wenn es eine falsche Antwort ist, zeigt die Kommunikation an.
tr_tr: İdeal olarak, Kimlik Sağlayıcı'nın ve Kimlik servisinin iletişim kurduğunu test etmek için korunan URL'ye gidin ve oturum açmayı deneyin. Hatalı bir yanıt olsa bile keystone'dan bir yanıt alırsanız, iletişimi gösterir.

source: Identification and Authentication
de: Identifizierung und Authentifizierung
id: Identification dan Authentication
tr_tr: Tanımlama ve Kimlik Doğrulama

source: Identification and authentication using pluggable authentication modules (PAM) based upon user passwords. The quality of the passwords used can be enforced through configuration options.
de: Identifizierung und Authentifizierung mit Pluggable Authentication Modules (PAM) basierend auf Benutzerpasswörtern. Die Qualität der verwendeten Passwörter kann durch Konfigurationsoptionen erzwungen werden.
id: Identification dan authentication menggunakan pluggable authentication modules (PAM) berdasarkan password pengguna. Kualitas kata kunci yang digunakan bisa ditegakkan melalui pilihan konfigurasi.
tr_tr: Kullanıcı parolalarına dayanan takılabilir kimlik doğrulama modülleri (PAM) kullanarak tanımlama ve kimlik doğrulama. Kullanılan parolaların kalitesi yapılandırma seçenekleri aracılığıyla uygulanabilir.

source: Identification and authentication, protected data transfer
de: Identifizierung und Authentifizierung, geschützte Datenübertragung
id: Identifikasi dan otentikasi, transfer data yang dilindungi
tr_tr: Tanımlama ve kimlik doğrulama, korumalı veri aktarımı

source: Identify the security domains in OpenStack
de: Identifizieren Sie die Sicherheitsdomänen in OpenStack
id: Identifikasi domain keamanan di OpenStack
tr_tr: OpenStack'teki güvenlik alanlarını tanımlayın
