Repository: openstack/security-doc
Catalog: security-guide/source/locale/*/LC_MESSAGES/security-guide.po
Languages: de, id, tr_tr

source: The volume encryption and ephemeral disk encryption features rely on a key management service (for example, barbican) for the creation and secure storage of keys. The key manager is pluggable to facilitate deployments that need a third-party Hardware Security Module (HSM) or the use of the Key Management Interchange Protocol (KMIP), which is supported by an open-source project called PyKMIP.
de: Die Volumenverschlüsselung und die ephemeren Festplattenverschlüsselungsmerkmale beruhen auf einem Schlüsselverwaltungsdienst (z.B. barbican) für die Erstellung und sichere Speicherung von Schlüsseln. Der Schlüsselmanager ist steuerbar, um Bereitstellungen zu erleichtern, die ein Hardware-Sicherheitsmodul (HSM) eines Drittanbieters benötigen oder die Verwendung des Key Management Interchange Protocol (KMIP), das von einem Open-Source-Projekt namens PyKMIP unterstützt wird.
id: Enkripsi volume dan fitur enkripsi disk sesaat menggunakan layanan manajemen kunci (misalnya barbecue) untuk pembuatan dan penyimpanan kunci yang aman. Manajer kunci pluggable untuk memfasilitasi pengerahan yang memerlukan Hardware Security Module (HSM) pihak ketiga atau penggunaan Key Management Interchange Protocol (KMIP), yang didukung oleh proyek open-source yang disebut PyKMIP.
tr_tr: Hacim şifreleme ve geçici disk şifreleme özellikleri, anahtarların oluşturulması ve güvenli bir şekilde depolanması için bir anahtar yönetim servisine (örneğin, barbican) güveniyor. Anahtar yöneticisi, bir üçüncü taraf Donanım Güvenlik Modülü'ne (HSM) veya PyKMIP adlı bir açık kaynak projesi tarafından desteklenen Anahtar Yönetim Değişim Protokolü'nün (KMIP) kullanılmasına ihtiyaç duyan dağıtımları kolaylaştıracak şekilde takılabilir.

source: The volume encryption feature provides encryption of data-at-rest using Castellan. When a user creates an encrypted volume type, and creates a volume using that type, the Block Storage (cinder) service requests the key manager to create a key to be associated with that volume. When the volume is attached to an instance, nova retrieves the key.
de: Die Volume-Verschlüsselungsfunktion ermöglicht die Verschlüsselung von Daten in Ruhe mithilfe von Castellan. Wenn ein Benutzer einen verschlüsselten Datenträgertyp erstellt und ein Datenträger mit diesem Datentyp erstellt, fordert der Dienst Block Storage (cinder) den Schlüsselverwalter auf, einen Schlüssel zu erstellen, der diesem Datenträger zugeordnet werden soll. Wenn der Datenträger an eine Instanz angehängt ist, ruft nova den Schlüssel ab.
id: Fitur enkripsi volume memberikan enkripsi data saat beristirahat menggunakan Castellan. Saat pengguna membuat jenis volume terenkripsi, dan membuat volume menggunakan jenis itu, layanan Block Storage (cinder) meminta manajer kunci untuk membuat kunci yang terkait dengan volume tersebut. Bila volume terpasang pada sebuah instance, nova mengambil kuncinya.

source: The web server that hosts the dashboard should be configured for TLS to ensure data is encrypted.
de: Der Webserver, der das Dashboard hostet, sollte für TLS konfiguriert sein, um sicherzustellen, dass Daten verschlüsselt sind.
id: Server web yang menghosting dasbor harus dikonfigurasi untuk TLS untuk memastikan data dienkripsi.
tr_tr: Gösterge tablosunu barındıran web sunucusu, verilerin şifrelenmesini sağlamak için TLS için yapılandırılmalıdır.

source: The “HTTPONLY” cookie attribute instructs web browsers not to allow scripts (e.g. JavaScript or VBscript) an ability to access the cookies via the DOM ``document.cookie`` object. This session ID protection is mandatory to prevent session ID stealing through XSS attacks.
de: Das Cookie-Attribut \"HTTPONLY\" weist Webbrowsern an, keine Skripts (z.B. JavaScript oder VBscript) zuzulassen, die Möglichkeit, über das DOM `` document.cookie``Objekt auf die Cookies zuzugreifen. Dieser Sitzungs-ID- Schutz ist zwingend erforderlich, um die Sitzungs-ID zu stehlen, die durch XSS-Angriffe gestohlen wird.

source: There are a few important security considerations for network and host-based intrusion detection systems.
de: Es gibt einige wichtige Sicherheitsüberlegungen für Netzwerk- und Host-basierte Intrusion Detection Systeme.
id: Ada beberapa pertimbangan keamanan penting untuk sistem deteksi intrusi berbasis jaringan dan host.
tr_tr: Ağ ve sunucu tabanlı saldırı tespit sistemleri için birkaç önemli güvenlik önlemi vardır.

source: There are a large number of share drivers created by different vendors which support different hardware storage solutions, for example, NetApp Clustered Data ONTAP (cDOT) Driver, Huawei NAS Driver or GlusterFS Driver. Each share driver is a Python class that can be set for a back end and run in the back end to manage share operations, some of which can be vendor-specific. The back end is an instance of the manila-share service.
de: Es gibt eine große Anzahl von Freigabe-Treiber, die von verschiedenen Anbietern erstellt werden, die unterschiedliche Hardware-Speicherlösungen unterstützen, z.B. NetApp Clustered Data ONTAP (cDOT) Treiber, Huawei NAS Driver oder GlusterFS Driver. Jeder Share-Treiber ist eine Python-Klasse, die für ein Back-End gesetzt werden kann und im Back-End ausgeführt wird, um Share-Operationen zu verwalten, von denen einige herstellerspezifisch sein können. Das Backend ist eine Instanz des Manila-Share Service.
id: Ada sejumlah besar driver share yang dibuat oleh vendor yang berbeda yang mendukung solusi penyimpanan perangkat keras yang berbeda, misalnya NetApp Clustered Data ONTAP (cDOT) Driver, Driver NAS Huawei atau Driver GlusterFS. Setiap driver share adalah kelas Python yang bisa diatur untuk back end dan berjalan di back end untuk mengelola operasi share, beberapa di antaranya bisa menjadi vendor-specific. Back end adalah instance dari layanan manila-share.
tr_tr: NetApp Kümeli Veri ONTAP (cDOT) Sürücüsü, Huawei NAS Sürücüsü veya GlusterFS Sürücüsü gibi farklı donanım depolama çözümlerini destekleyen farklı satıcılar tarafından oluşturulan çok sayıda paylaşım sürücüsü vardır. Her bir paylaşım sürücüsü, bir arka uç için ayarlanabilen ve bazıları satıcıya özgü olan paylaşım işlemlerini yönetmek için arka uçta çalıştırılabilen bir Python sınıfıdır. Arka uç, manila-share servisinin bir örneğidir.

source: There are a number of standard activities that will greatly assist with the compliance process. This chapter outlines some of the most common compliance activities. These are not specific to OpenStack, however references are provided to relevant sections in this book as useful context.
de: Es gibt eine Reihe von Standard-Aktivitäten, die den Compliance-Prozess erheblich unterstützen. In diesem Kapitel werden einige der häufigsten Compliance-Aktivitäten beschrieben. Diese sind nicht spezifisch für OpenStack, aber Referenzen werden zu relevanten Abschnitten in diesem Buch als nützlicher Kontext bereitgestellt.
id: Ada sejumlah kegiatan standar yang akan sangat membantu proses kepatuhan. Bab ini menguraikan beberapa aktivitas kepatuhan yang paling umum. Ini tidak spesifik untuk OpenStack, namun referensi diberikan ke bagian yang relevan dalam buku ini sebagai konteks yang berguna.
tr_tr: Uyum sürecinde büyük ölçüde yardımcı olacak bir dizi standart etkinlik vardır. Bu bölüm, en yaygın uyum etkilnliklerinden bazılarını özetlemektedir. Bunlar OpenStack'a özgü değildir, ancak bu kitapta ilgili bölümlere yararlı içerik olarak referanslar verilmektedir.

source: There are a variety of technologies that enable verification of these early boot stages. These typically require hardware support such as the :term:`trusted platform module (TPM)`, Intel Trusted Execution Technology (TXT), dynamic root of trust measurement (DRTM), and Unified Extensible Firmware Interface (UEFI) secure boot. In this book, we will refer to all of these collectively as *secure boot technologies*. We recommend using secure boot, while acknowledging that many of the pieces necessary to deploy this require advanced technical skills in order to customize the tools for each environment. Utilizing secure boot will require deeper integration and customization than many of the other recommendations in this guide. TPM technology, while common in most business class laptops and desktops for several years, and is now becoming available in servers together with supporting BIOS. Proper planning is essential to a successful secure boot deployment.
de: Es gibt eine Vielzahl von Technologien, die die Überprüfung dieser frühen Bootstufen ermöglichen. Diese benötigen typischerweise eine Hardwareunterstützung wie :term:`trusted platform module (TPM)`, die Intel Trusted Execution Technology (TXT), die dynamische Wurzel der Vertrauensmessung (DRTM) und das vereinfachte Extensible Firmware Interface (UEFI) In diesem Buch werden wir alle diese gemeinsam als *sichere Boot-Technologien* verweisen. Wir empfehlen, einen sicheren Boot zu verwenden, während wir anerkennen, dass viele der notwendigen Teile für die Bereitstellung von fortgeschrittenen technischen Fähigkeiten erforderlich sind, um die Werkzeuge für jede Umgebung anzupassen. Die Verwendung eines sicheren Boots erfordert eine tiefere Integration und Anpassung als viele der anderen Empfehlungen in diesem Leitfaden. TPM-Technologie, während in den letzten Jahren nur in Business-Class-Laptops und Desktops vorhanden, und wird nun in Servern zusammen mit unterstützenden BIOS eingesetzt. Eine ordnungsgemäße Planung ist für eine erfolgreiche sichere Boot-Bereitstellung unerlässlich.
id: Ada berbagai teknologi yang memungkinkan verifikasi tahap boot awal ini. Ini biasanya memerlukan dukungan perangkat keras sepert :term:`trusted platform module (TPM)`, Intel Trusted Execution Technology (TXT), dynamic root of trust measurement (DRTM), dan booting aman Unified Extensible Firmware Interface (UEFI). Dalam buku ini, kita akan mengacu pada semua ini secara kolektif sebagai teknologi secure boot. Sebaiknya gunakan boot aman, sambil mengakui bahwa banyak dari potongan yang diperlukan untuk menerapkan ini memerlukan ketrampilan teknis lanjutan untuk menyesuaikan alat untuk setiap lingkungan. Memanfaatkan boot yang aman akan memerlukan integrasi dan penyesuaian yang lebih dalam daripada banyak rekomendasi lainnya dalam panduan ini. Teknologi TPM, meski umum ada di kebanyakan laptop kelas bisnis dan desktop selama beberapa tahun, dan kini mulai tersedia di server bersamaan dengan BIOS pendukung. Perencanaan yang tepat sangat penting untuk penerapan booting aman yang berhasil.
tr_tr: Bu erken önyükleme aşamalarını doğrulamayı sağlayan çeşitli teknolojiler vardır. Bunlar genellikle :term:`güvenilir platform modülü (TPM)`, Intel Güvenilir Yürütme Teknolojisi (TXT), güven ölçümünün dinamik kökü (DRTM) ve Birleşik Genişletilebilir Ürün Yazılımı Arabirimi (UEFI) güvenli önyükleme gibi bir donanım desteği gerektirir. Bu kitapta, bunların hepsini toplu olarak *güvenli önyükleme teknolojileri * olarak ele alacağız. Güvenli önyüklemeyi kullanmanızı öneririz, ancak bunu dağıtmak için gerekli olan birçok parçanın, araçları her ortam için özelleştirmek için gelişmiş teknik becerilere ihtiyaç duyduğunu kabul ediyoruz. Güvenli önyükleme kullanmak, bu kılavuzdaki diğer önerilerden çok daha derin entegrasyon ve özelleştirme gerektirir. TPM teknolojisi, birçok iş seviyesi dizüstü bilgisayarı ve masaüstünde birkaç yıldır ortak olsa da, artık destekleyen BIOS'la birlikte sunucularda da kullanılmaya başlandı. Başarılı bir güvenli önyükleme dağıtımı için doğru planlama şarttır.

source: There are four main services that interact with OpenStack Networking. In a typical OpenStack deployment these services map to the following security domains:
de: Es gibt vier Hauptdienste, die mit OpenStack Networking interagieren. In einer typischen OpenStack-Bereitstellung werden diese Dienste den folgenden Sicherheitsdomänen zugeordnet:
id: Ada empat layanan utama yang berinteraksi dengan OpenStack Networking. Dalam pengerahan OpenStack tipikal, layanan ini dipetakan ke domain keamanan berikut:
tr_tr: OpenStack Ağ ile etkileşime giren dört temel servis var. Tipik bir OpenStack dağıtımında bu servisler aşağıdaki güvenlik alanlarına eşlenir:

source: There are management, policy, and technical challenges around creating and signing certificates. This is an area where cloud architects or operators may wish to seek the advice of industry leaders and vendors in addition to the guidance recommended here.
de: Es gibt Management-, Politik- und technische Herausforderungen bei der Erstellung und Signierung von Zertifikaten. Dies ist ein Bereich, in dem Cloud-Architekten oder Betreiber vielleicht den Rat von Branchenführern und Anbietern zusätzlich zu den hier empfohlenen Anleitungen suchen möchten.
id: Ada tantangan manajemen, kebijakan, dan teknis seputar pembuatan dan penandatanganan sertifikat. Ini adalah area dimana arsitek awan atau operator mungkin ingin mencari saran dari pemimpin industri dan vendor disamping panduan yang direkomendasikan di sini.
tr_tr: Sertifika oluşturma ve imzalama konusunda yönetimsel, politik ve teknik zorluklar vardır. Bu, bulut mimarlarının veya operatörlerin, burada önerilen rehberliğin yanı sıra endüstri liderleri ve tedarikçilerinin tavsiyelerini almak isteyebilecekleri bir alandır.

source: There are many configuration management solutions; at the time of this writing there are two in the marketplace that are robust in their support of OpenStack environments: :term:`Chef` and :term:`Puppet`. A non-exhaustive listing of tools in this space is provided below:
de: Es gibt viele Konfigurationsmanagementlösungen. Zum Zeitpunkt dieses Schreibens gibt es zwei auf dem Markt, die in ihrer Unterstützung von OpenStack-Umgebungen robust sind: :term:`Chef` und :term:`Puppet`. Eine nicht erschöpfende Auflistung der Werkzeuge in diesem Raum ist unten angegeben:
id: Ada banyak solusi manajemen konfigurasi; Pada saat penulisan ini ada dua di pasar yang kuat dalam mendukung lingkungan OpenStack: :term:`Chef` dan :term:`Puppet`. Daftar alat yang tidak lengkap (non-exhaustive) di ruang ini disediakan di bawah ini:
tr_tr: Birçok yapılandırma yönetimi çözümü vardır; Bu yazının yazıldığı tarihte, piyasada OpenStack ortamlarını destekleyen iki güçlü araç var: :term:`Puppet` ve :term:`Puppet`. Bu alandaki kapsamlı olmayan bir liste aşağıda sunulmuştur:

source: There are no general provisions for granular control of database operations in OpenStack. Access and privileges are granted simply based on whether a node has access to the database or not. In this scenario, nodes with access to the database may have full privileges to DROP, INSERT, or UPDATE functions.
de: Es gibt keine allgemeinen Bestimmungen für die granulare Kontrolle der Datenbankoperationen in OpenStack. Zugriff und Privilegien werden einfach darauf gelegt, ob ein Knoten Zugriff auf die Datenbank hat oder nicht. In diesem Szenario können Knoten mit Zugriff auf die Datenbank über volle Berechtigungen für DROP-, INSERT- oder UPDATE-Funktionen verfügen.
id: Tidak ada ketentuan umum untuk pengendalian operasi database di OpenStack. Akses dan hak istimewa diberikan hanya berdasarkan apakah node memiliki akses ke database atau tidak. Dalam skenario ini, node dengan akses ke database mungkin memiliki hak penuh untuk fungsi DROP, INSERT, atau UPDATE.
tr_tr: OpenStack'te veritabanı işlemlerinin ayrıntılı kontrolü için genel bir hüküm bulunmamaktadır. Erişim ve ayrıcalıklar yalnızca bir düğümün veritabanına erişimi olup olmadığına bağlı olarak verilir. Bu senaryoda, veritabanına erişimi olan düğümler, DROP, INSERT veya UPDATE işlevlerine tam ayrıcalıklara sahip olabilir.

source: There are several configuration options and deployment strategies that can improve security in the Data processing service. The service controller is configured through a main configuration file and one or more policy files. Installations that are using the data-locality features will also have two additional files to specify the physical location of Compute and Object Storage nodes.
de: Es gibt mehrere Konfigurationsoptionen und Bereitstellungsstrategien, die die Sicherheit im Datenverarbeitungsdienst verbessern können. Der Service-Controller wird über eine Haupt-Konfigurationsdatei und eine oder mehrere Policy-Dateien konfiguriert. Installationen, die die Data-Locality-Funktionen verwenden, haben außerdem zwei zusätzliche Dateien, um den physischen Speicherort von Compute- und Object Storage-Knoten anzugeben.
id: Ada beberapa pilihan konfigurasi dan strategi pengerahan yang dapat meningkatkan keamanan dalam layanan pengolahan data. Pengontrol layanan dikonfigurasi melalui file konfigurasi utama dan satu atau beberapa file kebijakan. Instalasi yang menggunakan fitur data-locality juga akan memiliki dua file tambahan untuk menentukan lokasi fisik dari node Compute dan Object Storage.
tr_tr: Veri işleme hizmetinde güvenliği artırabilecek birkaç yapılandırma seçeneği ve yayına alma stratejisi vardır. Servis denetleyicisi bir ana yapılandırma dosyası ve bir veya daha fazla ilke dosyası aracılığıyla yapılandırılmıştır. Veri yerellik özelliklerini kullanan yüklemelerde, Hesaplama ve Nesne Depolama düğümlerinin fiziksel konumunu belirlemek için iki ek dosyaya sahip olacaksınız.

source: There are several methods to mitigate some of the risk associated with live migrations, the following list details some of these:
de: Es gibt mehrere Methoden, um einige der Risiken mit Live-Migrationen zu verringern, die folgenden Liste detailiert einige von diesen:
id: Ada beberapa metode untuk mengurangi beberapa risiko yang terkait dengan migrasi langsung, beberapa rincian berikut ini:
tr_tr: Canlı göçlerle ilişkili bazı riskleri hafifletmek için birkaç yöntem vardır, aşağıdaki liste bazılarının ayrıntılarını vermektedir:

source: There are several ways to wipe a block storage device. The traditional way is to set the ``lvm_type`` to ``thin``, and then use the ``volume_clear`` parameter. Alternatively, if the volume encryption feature is used, then volume wiping is not necessary if the volume encryption key is deleted. See the OpenStack Configuration Reference doc in the `Volume Encryption <https://docs.openstack.org/ocata/config-reference/block-storage/volume-encryption.html>`__ section for set up details and also the `Castellan usage <https://docs.openstack.org/castellan/latest/user/index.html>`__ document for key deletion.
de: Es gibt verschiedene Wege ein Blockspeichergerät zu löschen. Der traditionelle Weg ist, den ``lvm_type`` auf ``thin`` zu setzen, und dann den ``volume_clear`` Parameter zu benutzen. Alternativ, wenn die Funktion der Datenträgerverschlüsselung benutzt wurde, ist ein Löschen des Datenträgers nicht erforderlich, wenn der Schlüssel für die Datenträgerverschlüsselung gelöscht wurde. Sehen Sie die OpenStack Configuration Reference doc im `Volume Encryption <https://docs.openstack.org/ocata/config-reference/block-storage/volume-encryption.html>`__ Abschnitt für Details und auch das `Castellan usage <https://docs.openstack.org/castellan/latest/user/index.html>`__ Dokument für Löschen der Schlüssel.

source: There are situations where there is a security requirement to assure the confidentiality or integrity of network traffic in an OpenStack deployment. This is generally achieved using cryptographic measures, such as the Transport Layer Security (TLS) protocol.
de: Es gibt Situationen, in denen es eine Sicherheitsanforderung gibt, um die Vertraulichkeit oder Integrität des Netzwerkverkehrs in einer OpenStack-Bereitstellung zu gewährleisten. Dies wird in der Regel mit kryptographischen Maßnahmen wie dem Transport Layer Security (TLS) Protokoll erreicht.
id: Ada situasi di mana ada persyaratan keamanan untuk memastikan kerahasiaan atau integritas lalu lintas jaringan dalam penerapan OpenStack. Hal ini umumnya dicapai dengan menggunakan ukuran kriptografi, seperti protokol Transport Layer Security (TLS).
tr_tr: Bir OpenStack dağıtımında ağ trafiğinin gizliliğini veya bütünlüğünü sağlamak için bir güvenlik gereksinimi olduğu durumlar vardır. Bu genellikle Taşıma Katmanı Güvenliği (TLS) protokolü gibi şifreleme önlemleri kullanılarak gerçekleştirilir.

source: There are some key sections to the architecture page, which are explained in more detail below:
de: Es gibt einige wichtige Abschnitte zur Architekturseite, die im Folgenden näher erläutert werden:
id: Ada beberapa bagian kunci pada halaman arsitektur, yang dijelaskan lebih rinci di bawah ini:
tr_tr: Mimari sayfada bazı önemli bölümler bulunmaktadır. Bunlar aşağıda daha ayrıntılı olarak açıklanmıştır:

source: There are two routes that an OpenStack project may take to complete a security review:
de: Es gibt zwei Routen, die ein OpenStack-Projekt ergreifen kann, um eine Sicherheitsüberprüfung abzuschließen:
id: Ada dua rute yang dibutuhkan proyek OpenStack untuk menyelesaikan tinjauan keamanan:
tr_tr: Bir OpenStack projesinin bir güvenlik incelemesi tamamlayabileceği iki yol vardır:

source: There are two types of SOC 1 reports:
de: Es gibt zwei Arten von SOC 1 reports:
id: Ada dua jenis laporan SOC 1:
tr_tr: 2 tür SOC 1 raporu vardır:

source: There are two types of SOC 2 reports:
de: Es gibt zwei Arten von SOC 2 Reports:
id: Ada dua jenis laporan SOC 2:
tr_tr: İki tür SOC 2 raporu vardır:

source: There are two types of plugins: crypto plugins and secret store plugins.
de: Es gibt zwei Arten von Plugins: crypto plugins und secret store plugins.
id: Ada dua jenis plugin: plugin kripto dan plugin penyimpanan rahasia.

source: There is an OpenStack Security Note pertaining to the `Use of LXC in Compute <https://bugs.launchpad.net/ossn/+bug/1098582>`_.
de: Es gibt einen OpenStack-Sicherheitshinweis, der sich auf die Verwendung von LXC in Compute bezieht <https://bugs.launchpad.net/ossn/+bug/1098582>`_.
id: Ada OpenStack Security Note yang berkaitan dengan `Use of LXC in Compute <https://bugs.launchpad.net/ossn/+bug/1098582>`_.
tr_tr: `LXC'nin Hesaplamada Kullanımı <https://bugs.launchpad.net/ossn/+bug/1098582>` ile ilgili bir OpenStack Güvenlik Notu var.

source: There is an `OpenStack Security Note (OSSN) regarding keystone.conf permissions <https://bugs.launchpad.net/ossn/+bug/1168252>`__.
de: Es gibt einen `OpenStack Security Note (OSSN) in Bezug auf keystone.conf Berechtigungen <https://bugs.launchpad.net/ossn/+bug/1168252>`__.
id: Ada `OpenStack Security Note (OSSN) regarding keystone.conf permissions <https://bugs.launchpad.net/ossn/+bug/1168252>`__.
tr_tr: `keystone.conf izinleriyle ilgili bir OpenStack Güvenlik Notu (OSSN) <https://bugs.launchpad.net/ossn/+bug/1168252>`__ var.

source: There is an `OpenStack Security Note (OSSN) regarding potential DoS attacks <https://bugs.launchpad.net/ossn/+bug/1155566>`__.
de: Es gibt einen `OpenStack Security Note (OSSN) in Bezug auf potenzielle DoS-Angriffe <https://bugs.launchpad.net/ossn/+bug/1155566>`__.
id: Ada `OpenStack Security Note (OSSN) regarding potential DoS attacks <https://bugs.launchpad.net/ossn/+bug/1155566>`__.
tr_tr: `Potansiyel DoS saldırılarına ilişkin bir OpenStack Güvenlik Notu (OSSN) <https://bugs.launchpad.net/ossn/+bug/1155566>`__ var.

source: There is currently an effort underway to store these secrets in a Castellan back-end and then have oslo.config use Castellan to retrieve these secrets.
de: Es gibt derzeit eine Anstrengung, diese Geheimnisse in einem Castellan-Back-End zu speichern, und dann kann oslo.config Castellan verwendet, um diese Geheimnisse abzurufen.
id: Saat ini ada usaha untuk menyimpan rahasia ini di Castellan back-end dan kemudian menggunakan oslo.config menggunakan Castellan untuk mengambil kembali rahasia ini.
