Repository: openstack/security-doc
Catalog: security-guide/source/locale/*/LC_MESSAGES/security-guide.po
Languages: de, id, tr_tr

source: FW-as-a-Service (FWaaS) is considered an experimental feature for the Kilo release of OpenStack Networking. FWaaS addresses the need to manage and leverage the rich set of security features provided by typical firewall products which are typically far more comprehensive than what is currently provided by security groups. Both Freescale and Intel developed third-party plug-ins as extensions in OpenStack Networking to support this component in the Kilo release. For more details on the administration of FWaaS, see `Firewall-as-a-Service (FWaaS) overview <https://docs.openstack.org/admin-guide/networking-introduction.html#firewall-as-a-service-fwaas-overview>`__ in the OpenStack Administrator Guide.
de: FW-as-a-Service (FWaaS) gilt als experimentell für die Kilo-Version von OpenStack Networking. FWaaS adressiert die Notwendigkeit, die umfangreichen Sicherheitsmerkmale zu verwalten und zu nutzen, die von typischen Firewall-Produkten bereitgestellt werden, die typischerweise weit umfassender sind als das, was derzeit von Sicherheitsgruppen bereitgestellt wird. Sowohl Freescale als auch Intel entwickelten Drittanbieter-Plug-Ins als Erweiterungen in OpenStack Networking, um diese Komponente in der Kilo-Version zu unterstützen. Weitere Informationen zur Verwaltung von FWaaS finden Sie unter `Firewall-as-a-Service (FWaaS) Übersicht <https://docs.openstack.org/admin-guide/networking-introduction.html#firewall-as-a-service-fwaas-overview>`__ im OpenStack Administrator Guide.
id: FW-as-a-Service (FWaaS) dianggap sebagai fitur eksperimental untuk rilis Kilo OpenStack Networking. FWaaS menangani kebutuhan untuk mengelola dan memanfaatkan sekumpulan fitur keamanan yang kaya yang disediakan oleh produk firewall biasa yang biasanya jauh lebih komprehensif daripada yang saat ini disediakan oleh kelompok keamanan. Baik Freescale dan Intel mengembangkan plug-in pihak ketiga sebagai ekstensi di OpenStack Networking untuk mendukung komponen ini dalam rilis Kilo. Untuk rincian lebih lanjut tentang administrasi FWaaS, lihat ikhtisar "Firewall-as-a-Service (FWaaS) <https://docs.openstack.org/admin-guide/networking-introduction.html#firewall-as-a-service -fwaas-overview> `__ di OpenStack Administrator Guide.
tr_tr: FW-as-a-Service (FWaaS), OpenStack Ağ'ın Kilo sürümü için deneysel bir özellik olarak düşünülür. FWaaS, tipik olarak güvenlik grupları tarafından sağlananlardan çok daha kapsamlı olan tipik güvenlik duvarı ürünleri tarafından sağlanan zengin güvenlik özelliklerini yönetme ve kullanma ihtiyacına cevap verir. Hem Freescale hem de Intel, bu bileşeni Kilo sürümünde desteklemek için OpenStack Ağ'da üçüncü parti eklentileri geliştirmiştir. FWaaS yönetimiyle ilgili daha ayrıntılı bilgi için, OpenStack Yönetici Kılavuzu'ndaki `Hizmet Olarak Güvenlik Duvarları (FWaaS) genel bakış <https://docs.openstack.org/admin-guide/networking-introduction.html#firewall-as-a-service -Fwaas-overview>`__ belgesine bakın.

source: Fail securely
de: Sicher fehlschlagen
id: Gagal dengan aman
tr_tr: Güvenli başarısız olma

source: False positives occur when the security monitoring tool produces a security alert for a benign event. Due to the nature of security monitoring tools, false positives will most certainly occur from time to time. Typically a cloud administrator can tune security monitoring tools to reduce the false positives, but this may also reduce the overall detection rate at the same time. These classic trade-offs must be understood and accounted for when setting up a security monitoring system in the cloud.
de: Falsche Positive treten auf, wenn das Sicherheitsüberwachungsgerät einen Sicherheitsalarm für ein gutartiges Ereignis erzeugt. Aufgrund der Natur der Sicherheitsüberwachungsinstrumente werden von Zeit zu Zeit sicherlich falsche Positives auftreten. Typischerweise kann ein Cloud-Administrator Sicherheits-Monitoring-Tools, um die falschen Positiven zu reduzieren, aber dies kann auch die gesamte Erkennungsrate gleichzeitig reduzieren. Diese klassischen Kompromisse müssen bei der Einrichtung eines Sicherheitsüberwachungssystems in der Cloud verstanden und berücksichtigt werden.
id: Positif palsu ((false positive) terjadi saat alat pemantau keamanan menghasilkan peringatan keamanan untuk peristiwa jinak. Karena sifat alat pemantauan keamanan, false positive pasti terjadi dari waktu ke waktu. Biasanya administrator awan dapat menyetel alat pemantauan keamanan untuk mengurangi false positive, namun ini juga dapat mengurangi tingkat deteksi keseluruhan secara bersamaan. Trade-off klasik ini harus dipahami dan dipertanggungjawabkan saat membuat sistem pemantauan keamanan di awan.
tr_tr: Yanlış pozitiflikler, güvenlik izleme aracı iyi huylu bir olay için bir güvenlik alarmı ürettiğinde ortaya çıkar. Güvenlik izleme araçlarının doğası gereği yanlış pozitiflikler kesinlikle zaman zaman ortaya çıkacaktır. Tipik olarak bir bulut yöneticisi, yanlış pozitiflikleri azaltmak için güvenlik izleme araçlarını ayarlayabilir, ancak aynı zamanda genel algılama oranını da düşürebilir. Bulutta bir güvenlik izleme sistemi kurarken bu klasik dengeler anlaşılmalı ve açıklanmalıdır.

source: Features in this table might not be applicable to all hypervisors or directly mappable between hypervisors.
de: Die in dieser Tabelle enthaltenen Funktionen gelten möglicherweise nicht für alle Hypervisoren oder direkt zwischen Hypervisoren.
id: Fitur dalam tabel ini mungkin tidak berlaku untuk semua hypervisors atau secara langsung dapat dipetakan di antara hypervisors.
tr_tr: Bu tablodaki özellikler tüm hipervizörler için geçerli olmayabilir veya doğrudan hipervizörler arasında dolaşılabilir olabilir.

source: Federated Identity provides a way to securely use existing credentials to access cloud resources such as servers, volumes, and databases, across multiple endpoints provided in multiple authorized clouds using a single set of credentials, without having to provision additional identities or log in multiple times. The credential is maintained by the user's Identity Provider.
de: Föderierte Identität bietet einen Weg, um vorhandene Anmeldeinformationen sicher zu nutzen, um auf Cloud-Ressourcen wie Server, Volumes und Datenbanken zuzugreifen, und zwar über mehrere Endpunkte hinweg, die in mehreren autorisierten Clouds mit einem einzigen Satz von Anmeldeinformationen bereitgestellt werden, ohne dass zusätzliche Identitäten bereitgestellt oder mehrmals angemeldet werden müssen. Die Berechtigung wird vom Identity Provider des Benutzers gepflegt.
tr_tr: Federe Kimlik, birden fazla yetkili bulutta sağlanan birden çok uç nokta arasında, ek kimliklerin sağlanmasına veya birden fazla kez oturum açılmasına gerek kalmadan tek bir kimlik bilgisi seti kullanarak sunucular, birimler ve veri tabanları gibi bulut kaynaklara erişmek için mevcut kimlik bilgilerini güvenli bir şekilde kullanmanın bir yolunu sağlar. Kimlik bilgisi kullanıcının Kimlik Sağlayıcısı tarafından saklanır.

source: Federated users are not mirrored in the Identity service back end (for example, using the SQL driver). The external IdP is responsible for authenticating users, and communicates the result of the authentication to Identity service using SAML assertions. Identity service maps the SAML assertions to keystone user groups and assignments created in Identity service.
de: Föderierte Benutzer werden nicht im Identity-Service-Backend gespiegelt (z. B. mit dem SQL-Treiber). Die externe IDP ist für die Authentifizierung von Benutzern zuständig und überträgt das Ergebnis der Authentifizierung an den Identity Service mit SAML-Assertionen. Identity Service ordnet die SAML-Assertionen zu Keystone-Benutzergruppen und Zuweisungen im Identity Service zu.
tr_tr: Federe kullanıcılar, Kimlik hizmeti arka ucunda yansıtılmaz (örneğin, SQL sürücüsünü kullanarak). Harici IdP, kullanıcıların kimliğini doğrulamaktan sorumludur ve kimlik doğrulama sonucunu SAML onaylarını kullanarak Kimlik hizmetine bildirir. Kimlik hizmeti, SAML bildirilerini, Kimlik servisinde oluşturulan keystone kullanıcı gruplarına ve atamalara eşleştirir.

source: Fernet tokens
de: Fernet-Token
id: Token Fernet
tr_tr: Fernet belirteçleri

source: File integrity management (FIM)
de: Dateiintegritätsmanagement (FIM)
tr_tr: Dosya bütünlüğü yönetimi (FIM)

source: File integrity management (FIM) is the method of ensuring that files such as sensitive system or application configuration files are not corrupted or changed to allow unauthorized access or malicious behavior. This can be done through a utility such as Samhain that will create a checksum hash of the specified resource and then validate that hash at regular intervals, or through a tool such as DMVerity that can take a hash of block devices and will validate those hashes as they are accessed by the system before they are presented to the user.
de: File Integrity Management (FIM) ist die Methode, um sicherzustellen, dass Dateien wie sensible System- oder Anwendungskonfigurationsdateien nicht beschädigt oder geändert werden, um unbefugten Zugriff oder böswilliges Verhalten zu ermöglichen. Dies kann durch ein Dienstprogramm wie Samhain, die eine Prüfsumme Hash der angegebenen Ressource zu erstellen und dann validieren, dass Hash in regelmäßigen Abständen oder durch ein Werkzeug wie DMVerity, das einen Hash von Block-Geräte nehmen kann und diese Hashes validiert werden, wenn sie vom System angesprochen werden, bevor sie dem Benutzer präsentiert werden.
id: File integrity management (FIM) adalah metode untuk memastikan bahwa file seperti sistem sensitif atau file konfigurasi aplikasi tidak rusak atau diubah untuk memungkinkan akses yang tidak sah atau perilaku jahat. Hal ini dapat dilakukan melalui utilitas seperti Samhain yang akan membuat hash checksum dari sumber daya yang ditentukan dan kemudian memvalidasi hash secara berkala, atau melalui tool seperti DMVerity yang dapat mengambil hash dari perangkat blok dan akan memvalidasi hash tersebut sebagai mereka diakses oleh sistem sebelum dipresentasikan kepada pengguna.
tr_tr: Dosya bütünlüğü yönetimi (FIM), hassas sistem veya uygulama yapılandırma dosyaları gibi dosyaların bozulmaması veya yetkisiz erişime veya kötü amaçlı davranışa izin vermek üzere değiştirilmemesine ilişkin yöntemdir. Bu, belirtilen kaynağın bir sağlama toplamı özeti yaratacak ve ardından düzenli aralıklarla bu özeti doğrulamak üzere Samhain gibi bir yardımcı program aracılığıyla gerçekleştirilebilir veya DMVerity gibi bir blok aygıtların özeti alabilen ve bu özetleri geçerli olarak doğrulayacak bir araçla kullanıcıya sunulmadan önce sistem tarafından erişilir.

source: File permissions
de: Dateirechte
id: Izin file
tr_tr: Dosya izinleri

source: File system objects, memory, and IPC objects are cleared before they can be reused by a process belonging to a different user.
de: Dateisystemobjekte, Speicher und IPC-Objekte werden gelöscht, bevor sie von einem Prozess, der zu einem anderen Benutzer gehört, wiederverwendet werden können.
id: Objek sistem file, memori, dan objek IPC dihapus sebelum dapat digunakan kembali oleh proses yang dimiliki oleh pengguna yang berbeda.
tr_tr: Dosya sistemi nesneleri, bellek ve IPC nesneleri, farklı bir kullanıcıya ait bir işlem tarafından kullanılmadan önce temizlenir.

source: Filesystem storage is a more secure solution for ephemeral block storage devices than LVM as dirty extents cannot be provisioned to users. However, it is important to be mindful that user data is not destroyed, so it is suggested to encrypt the backing filesystem.
de: Filesystem Storage ist eine sicherere Lösung für kurzlebige Blockspeichergeräte als LVM, da verschmutzte Extents nicht für Benutzer bereitgestellt werden können. Allerdings ist es wichtig zu beachten, dass Benutzerdaten nicht zerstört werden, so dass es vorgeschlagen wird, das Backing-Dateisystem zu verschlüsseln.
id: Penyimpanan filesystem adalah solusi yang lebih aman untuk perangkat penyimpanan blok sementara daripada LVM karena luapan limbah (dirty extent) tidak dapat disediakan oleh pengguna. Namun, penting untuk diperhatikan bahwa data pengguna tidak dihancurkan, jadi disarankan untuk mengenkripsi filesystem backing.
tr_tr: Dosya sistemi depolama, kirli alanlar kullanıcılara verilemediğinden, geçici blok depolama aygıtları için LVM'den daha güvenli bir çözümdür. Bununla birlikte, kullanıcı verisinin yok olmadığına dikkat etmek önemlidir, bu nedenle destekleyen dosya sistemini şifrelemek önerilir.

source: Filter schedulers fall under four main categories:
de: Filter-Scheduler fallen unter vier Hauptkategorien:
id: Penjadwal filter termasuk dalam empat kategori utama:
tr_tr: Zamanlayıcıları filtreleme dört ana kategoride toplanır:

source: Finally, the node kernel should have a mechanism to validate that the rest of the node starts in a known good state. This provides the necessary link from the boot validation process to validating the entire system. The steps for doing this will be deployment specific. As an example, a kernel module could verify a hash over the blocks comprising the file system before mounting it using `dm-verity <https://gitlab.com/cryptsetup/cryptsetup/wikis/DMVerity>`__.
de: Schließlich sollte der Knotenkernel einen Mechanismus haben, um zu bestätigen, dass der Rest des Knotens in einem bekannten guten Zustand beginnt. Dies stellt die notwendige Verbindung vom Boot-Validierungsprozess zur Validierung des gesamten Systems zur Verfügung. Die Schritte dafür sind Einsatzspezifisch. Als Beispiel könnte ein Kernel-Modul einen Hash über die Blöcke, die das Dateisystem enthalten, verifizieren, bevor es mit `dm-verity` installiert wird <https://gitlab.com/cryptsetup/cryptsetup/wikis/DMVerity>`__.
id: Akhirnya, kernel node harus memiliki mekanisme untuk memvalidasi bahwa sisa node dimulai dalam keadaan baik yang diketahui. Ini menyediakan link yang diperlukan dari proses validasi booting untuk memvalidasi keseluruhan sistem. Langkah-langkah untuk melakukan hal ini adalah penerapan yang spesifik. Sebagai contoh, modul kernel dapat memverifikasi hash di atas blok yang terdiri dari sistem file sebelum memasangnya `dm-verity <https://gitlab.com/cryptsetup/cryptsetup/wikis/DMVerity>`__.
tr_tr: Son olarak, düğüm çekirdeğinin, düğümün geri kalanının bilinen iyi durumda başladığını doğrulamak için bir mekanizması olmalıdır. Bu, tüm sistemi doğrulamak için önyükleme doğrulama işleminden gerekli bağlantıyı sağlar. Bunu yapmanın adımları dağıtıma özgü olacaktır. Örnek olarak, bir çekirdek modülü `dm-verity <https://gitlab.com/cryptsetup/cryptsetup/wikis/DMVerity>`__ kullanılarak dosya sistemini oluşturan bloklar üzerinde bir özeti doğrulayabilir.

source: Firewalls and other host-based security controls
de: Firewalls und andere Host-basierte Sicherheitskontrollen
id: Firewall dan kontrol keamanan berbasis host lainnya
tr_tr: Güvenlik duvarları ve diğer sunucu tabanlı güvenlik kontrolleri

source: Flat network in *share servers* back-end mode
de: Flat-Netzwerk in *share servers* Back-End-Modus
id: Jaringan datar di *share servers* mode back-end
tr_tr: **paylaşım sunucusu* arka uç kipinde düz ağ

source: Flat vs segmented networking
de: Flache vs. segmentierte Vernetzung
id: Jaringan datar vs tersegmentasi
tr_tr: Düz mü bölünmüş ağ mı

source: For SQL, in ``/etc/keystone/keystone.conf`` , set:
de: Für SQL, in ``/etc/keystone/keystone.conf``, setzen Sie:
tr_tr: SQL için, ``/etc/keystone/keystone.conf`` dosyasında ayarlayın:

source: For ``memcached``, in ``/etc/keystone/keystone.conf``, set:
de: Für ``memcached``, in ``/etc/keystone/keystone.conf``, set:
tr_tr: ``/etc/keystone/keystone.conf`` altındaki ``memcached`` ayarlanması için:

source: For a distribution appropriate place, it should probably be copied to ``/usr/share/openstack/keystone/httpd/keystone.py``.
de: Für einen Platz in einer Distribution sollte es wahrscheinlich auf ``/usr/share/openstack/keystone/httpd/keystone.py``kopiert werden.
tr_tr: Uygun bir dağıtım için, ``/usr/share/openstack/keystone/httpd/keystone.py`` olarak kopyalanmalıdır.

source: For additional configuration information see:
de: Weitere Konfigurationsinformationen finden Sie unter:
id: Untuk informasi konfigurasi tambahan lihat:
tr_tr: Ek yapılandırma bilgisi için bkz.:

source: For additional information see the `OpenStack Administrator Guide <https://docs.openstack.org/admin-guide/networking.html>`__.
de: Weitere Informationen finden Sie im `OpenStack Administrator Guide <https://docs.openstack.org/admin-guide/networking.html>`__.
id: Untuk informasi tambahan lihat `OpenStack Administrator Guide <https://docs.openstack.org/admin-guide/networking.html>`__.
tr_tr: Daha fazla bilgi için bkz. `OpenStack Yönetici Kılavuzu <https://docs.openstack.org/admin-guide/networking.html>`__.

source: For announcements regarding security relevant changes, subscribe to the `OpenStack Announce mailing list <http://lists.openstack.org/cgi-bin/mailman/listinfo/openstack-announce>`__. The security notifications are also posted through the downstream packages, for example, through Linux distributions that you may be subscribed to as part of the package updates.
de: Für Ankündigungen bezüglich sicherheitsrelevanter Änderungen, abonnieren Sie die `OpenStack Announce mailing list <http://lists.openstack.org/cgi-bin/mailman/listinfo/openstack-announce>`__. Die Sicherheitsbenachrichtigungen werden auch über die Downstream-Pakete gebucht, zum Beispiel über Linux-Distributionen, die Sie als Teil der Paketaktualisierungen abonniert haben.
id: Untuk pengumuman terkait perubahan keamanan yang relevan, berlangganan ke `OpenStack Announce mailing list <http://lists.openstack.org/cgi-bin/mailman/listinfo/openstack-announce>`__. Pemberitahuan keamanan juga diposting melalui paket hilir, misalnya melalui distribusi Linux yang mungkin Anda andalkan sebagai bagian dari pembaruan paket.
tr_tr: Güvenlikle ilgili değişikliklere ilişkin duyurular için, `OpenStack Duyuru eposta listesi <http://lists.openstack.org/cgi-bin/mailman/listinfo/openstack-announce>`__ ne abone olun. Güvenlik bildirimleri ayrıca, paket güncellemelerinin bir parçası olarak abone olabileceğiniz Linux dağıtımı gibi, aşağı doğru paketler yoluyla da gönderilir.

source: For authentication and authorization of clients, the Shared File Systems Storage service can optionally be configured with different network authentication protocols. Supported authentication protocols are LDAP, Kerberos, and Microsoft Active directory authentication service.
de: Für die Authentifizierung und Autorisierung von Clients kann der Shared File Systems Storage Service optional mit unterschiedlichen Netzwerkauthentifizierungsprotokollen konfiguriert werden. Unterstützte Authentifizierungsprotokolle sind LDAP-, Kerberos- und Microsoft Active Directory-Authentifizierungsdienst.
id: Untuk otentikasi dan otorisasi klien, layanan Shared File Systems Storage dapat dikonfigurasi secara opsional dengan protokol otentikasi jaringan yang berbeda. Protokol otentikasi yang didukung adalah layanan otentikasi direktori LDAP, Kerberos, dan Microsoft Active.
tr_tr: Kimlik doğrulama ve istemcilerin yetkilendirilmesi için, Paylaşımlı Dosya Sistemleri Depolama servisi isteğe bağlı olarak farklı ağ kimlik doğrulama protokolleriyle yapılandırılabilir. Desteklenen kimlik doğrulama protokolleri LDAP, Kerberos ve Microsoft Active Directory doğrulama servisidir.

source: For commercial deployments of OpenStack, we recommend SOC 1/2 is combined with ISO 2700 1/2 to be considered as a starting point for OpenStack certification activities. The required security activities mandated by these certifications facilitate a foundation of security best practices and common control criteria that can assist in achieving more stringent compliance activities, including government attestations and certifications.
de: Für kommerzielle Einsätze von OpenStack empfehlen wir SOC 1/2 mit ISO 2700 1/2 kombiniert als Ausgangspunkt für OpenStack-Zertifizierungsaktivitäten. Die erforderlichen Sicherheitsaktivitäten, die von diesen Zertifizierungen beauftragt werden, erleichtern die Festlegung von bewährten Best Practices und gemeinsamen Kontrollkriterien, die bei der Erreichung strengerer Compliance-Aktivitäten, einschließlich staatlicher Bescheinigungen und Zertifizierungen, helfen können.
id: Untuk penyebaran komersial OpenStack, kami merekomendasikan SOC 1/2 dikombinasikan dengan ISO 2700 1/2 untuk dianggap sebagai titik awal untuk kegiatan sertifikasi OpenStack. Kegiatan keamanan yang dibutuhkan yang diamanatkan oleh sertifikasi ini memfasilitasi landasan praktik terbaik keamanan dan kriteria kontrol bersama yang dapat membantu dalam mencapai aktivitas kepatuhan yang lebih ketat, termasuk pengesahan dan sertifikasi pemerintah.
tr_tr: OpenStack'in ticari dağıtımları için, OpenStack sertifikasyon faaliyetleri için bir başlangıç noktası olarak düşünülmesi için SOC 1/2 ürününün ISO 2700 1/2 ile birleşimini öneriyoruz. Bu sertifikalardan zorunlu olarak istenen güvenlik faaliyetleri, devlet envanteri ve sertifikaları da dahil olmak üzere daha sıkı uyum faaliyetlerine ulaşılmasına yardımcı olabilecek en iyi güvenlik uygulamaları ve ortak kontrol kriterlerinin temelini kolaylaştırır.

source: For configuration information see:
de: Für Konfigurationsinformationen siehe:
id: Untuk informasi konfigurasi, lihat:
tr_tr: Yapılandırma bilgisi için bkz:

source: For details of managing security services via API, see the `Security services API <https://developer.openstack.org/api-ref-share-v2.html#share-security-services>`_. You also can manage security services via python-manilaclient, see `Security services CLI managing <https://docs.openstack.org/admin-guide/shared_file_systems_security_services.html>`_.
de: Weitere Informationen zum Verwalten von Sicherheitsdiensten über API finden Sie in der `Security services API <https://developer.openstack.org/api-ref-share-v2.html#share-security-services>`_. Sie können auch Sicherheitsdienste über Python-Manilaclient verwalten, siehe `Security Services CLI Managing <https://docs.openstack.org/admin-guide/shared_file_systems_security_services.html>`_.

source: For example,
de: Beispielsweise,
tr_tr: Örneğin,

source: For example, in ``/etc/neutron/plugins/ml2/openvswitch_agent.ini``:
de: Zum Beispiel in ``/etc/neutron/plugins/ml2/openvswitch_agent.ini``:
id: Misalnya, di ``/etc/neutron/plugins/ml2/openvswitch_agent.ini``:
tr_tr: Örneğin, ``/etc/neutron/plugins/ml2/openvswitch_agent.ini`` dosyasında:

source: For example, the following URL would be considered protected by ``mod_shib`` and Apache, as such a request made to the URL would be redirected to the Identity Provider, to start the SAML authentication procedure.
de: Beispielsweise würde die folgende URL als ``mod_shib`` und Apache betrachtet, da eine solche Anforderung an die URL an den Identity Provider weitergeleitet wird, um die SAML-Authentifizierungsprozedur zu starten.
tr_tr: Örneğin, aşağıdaki URL ``mod_shib`` ve Apache tarafından korunmuş sayılır; çünkü SAML kimlik doğrulama prosedürünü başlatmak için URL'ye yapılan bir talep Kimlik Sağlayıcı'ya yönlendirilir.

source: For example:
de: Beispielsweise:
id: Sebagai contoh:
tr_tr: Örneğin:

source: For further details, see the `Django documentation <https://docs.djangoproject.com/>`_.
de: Weitere Informationen finden Sie in der `Django Dokumentation <https://docs.djangoproject.com/>`_.
id: Untuk keterangan lebih lanjut, lihat `Django documentation <https://docs.djangoproject.com/>`_.
tr_tr: Daha fazla detay için, `Django belgelendirmesine <https://docs.djangoproject.com/>` bakın_.
