Repository: openstack/security-doc
Catalog: security-guide/source/locale/*/LC_MESSAGES/security-guide.po
Languages: de, id, tr_tr

source: As is the case for VNC, at this time we recommend using SPICE from the management network in addition to limiting use to few individuals.
de: Wie es bei VNC der Fall ist, empfehlen wir derzeit, SPICE aus dem Management-Netzwerk zu verwenden, zusätzlich zur Begrenzung der Nutzung auf wenige Personen.
id: Seperti kasus VNC, saat ini kami merekomendasikan penggunaan SPICE dari jaringan manajemen selain membatasi penggunaan beberapa individu.
tr_tr: VNC için olduğu gibi, şu anda kullanım sayısını birkaç kişiye sınırlamanın yanı sıra yönetim ağından SPICE kullanmanızı öneriyoruz.

source: As part of your hypervisor selection process, you must consider a number of important factors to help increase your security posture. Specifically, you must become familiar with these areas:
de: Als Teil Ihres Hypervisor-Auswahlprozesses müssen Sie eine Reihe wichtiger Faktoren berücksichtigen, um Ihre Sicherheitsposition zu erhöhen. Im Einzelnen müssen Sie sich mit diesen Bereichen vertraut machen:
id: Sebagai bagian dari proses seleksi hypervisor Anda, Anda harus mempertimbangkan sejumlah faktor penting untuk membantu meningkatkan postur keamanan Anda. Secara khusus, Anda harus terbiasa dengan area ini:
tr_tr: Hipervizör seçim sürecinizin bir parçası olarak, güvenlik durumunuzu artırmanıza yardımcı olması için bir dizi önemli faktörü düşünmelisiniz. Özellikle, bu alanlarla aşina olmalısınız:

source: As technology has advanced the number of secret things that need to be protected has increased beyond key materials to include certificate pairs, API keys, system passwords, signing keys and so on. This increase has created a need for a more scalable approach to key management, and resulted in the creation of a number of software services that provide scalable dynamic key management. This chapter describes the services that exist today and focus on those that are able to be integrated into OpenStack clouds.
de: Mit der fortschreitenden Technologie hat sich die Anzahl der geheimen Dinge, die geschützt werden müssen, über Schlüsselmaterialien hinaus erhöht, um Zertifikatspaare, API-Schlüssel, Systemkennwörter, Signaturschlüssel usw. einzuschließen. Diese Zunahme hat zu einem Bedarf nach einem skalierbareren Ansatz für das Schlüsselmanagement und zur Schaffung einer Reihe von Softwarediensten geführt, die ein skalierbares dynamisches Schlüsselmanagement bereitstellen. In diesem Kapitel werden die Dienste beschrieben, die heute existieren, und konzentrieren sich auf solche, die in OpenStack-Clouds integriert werden können.
id: Sebagai teknologi telah maju, jumlah hal rahasia yang perlu dilindungi telah meningkat melampaui materi kunci untuk memasukkan pasangan sertifikat, kunci API, password sistem, kunci tanda tangan dan sebagainya. Peningkatan ini telah menciptakan kebutuhan akan pendekatan yang lebih terukur untuk manajemen kunci, dan menghasilkan pembuatan sejumlah layanan perangkat lunak yang memberikan manajemen kunci dinamis terukur. Bab ini menjelaskan layanan yang ada saat ini dan berfokus pada perangkat yang dapat diintegrasikan ke dalam awan OpenStack.

source: As the security requirements of organizations deploying this service will vary based on their specific needs, we recommend that operators focus on data privacy, cluster management, and end-user applications as a starting point for evaluating the needs of their users. These decisions will help guide the process of configuring user access to the service. For an expanded discussion on data privacy see :doc:`../tenant-data`.
de: Da die Sicherheitsanforderungen von Organisationen, die diesen Dienst einsetzen, auf der Grundlage ihrer spezifischen Bedürfnisse variieren, empfehlen wir, dass die Betreiber sich auf Datenschutz, Clusterverwaltung und Endbenutzeranwendungen als Ausgangspunkt für die Bewertung der Bedürfnisse ihrer Nutzer konzentrieren. Diese Entscheidungen werden dazu beitragen, den Prozess der Konfiguration des Benutzerzugriffs auf den Dienst zu führen. Für eine erweiterte Diskussion zum Datenschutz siehe: doc: `../ tenant-data`.
id: Karena persyaratan keamanan dari organisasi yang menerapkan layanan ini akan bervariasi berdasarkan kebutuhan spesifik mereka, kami merekomendasikan agar operator fokus pada privasi data, pengelolaan cluster, dan aplikasi pengguna akhir sebagai titik awal untuk mengevaluasi kebutuhan pengguna mereka. Keputusan ini akan membantu memandu proses konfigurasi akses pengguna ke layanan. Untuk diskusi yang diperluas tentang privasi data lihat :doc:`../tenant-data`.
tr_tr: Bu servisi sunan organizasyonların güvenlik gereksinimleri kendi özel ihtiyaçlarına bağlı olarak değişeceğinden, operatörlerin kullanıcıların ihtiyaçlarını değerlendirmek için başlangıç noktası olarak veri gizliliği, küme yönetimi ve son kullanıcı uygulamaları üzerine odaklanmasını öneririz. Bu kararlar, servise kullanıcı erişimini yapılandırma sürecini yönlendirmeye yardımcı olacaktır. Veri gizliliği ile ilgili genişletilmiş bir tartışma için bkz :doc:`../tenant-data '.

source: As with hardware, all software components within the OpenStack deployment should be documented. Examples include:
de: Wie bei der Hardware sollten alle Softwarekomponenten innerhalb der OpenStack-Implementierung dokumentiert werden. Beispiele beinhalten:
id: Seperti perangkat keras, semua komponen perangkat lunak dalam penyebaran OpenStack harus didokumentasikan. Contohnya meliputi:
tr_tr: Donanımla olduğu gibi, OpenStack dağıtımındaki tüm yazılım bileşenleri belgelendirilmelidir. Örnekler şunlardır:

source: As with most things, there are trade-offs. The main trade-off is going to be between security and performance. Encryption has a cost, but so does being hacked. The security and performance requirements are going to be different for every deployment, so how SSL/TLS is used will ultimately be an individual decision.
de: Wie bei den meisten Dingen gibt es Kompromisse. Der Hauptkompromiss wird zwischen Sicherheit und Leistung liegen. Verschlüsselung hat eine Kosten, aber auch wird gehackt. Die Sicherheits- und Leistungsanforderungen werden für jeden Einsatz unterschiedlich sein, also wie SSL/TLS verwendet wird, wird letztlich eine individuelle Entscheidung sein.
id: Seperti kebanyakan hal, ada trade-off. Trade-off utama akan terjadi antara keamanan dan kinerja. Enkripsi memiliki biaya, tapi begitu juga diretas. Persyaratan keamanan dan kinerja akan berbeda untuk setiap penyebaran, jadi bagaimana SSL/TLS digunakan pada akhirnya akan menjadi keputusan individual.
tr_tr: Çoğu şeyde olduğu gibi, bazı ödünler vardır. Temel ödün, güvenlik ve performans arasında olacak. Şifrelemenin bir maliyeti var, ancak saldırı da kesiliyor. Güvenlik ve performans gereksinimleri her dağıtım için farklı olacak, bu nedenle SSL/TLS nasıl kullanılır sonuçta bireysel bir karar olacaktır.

source: As with the OpenStack Operations Guide, we followed the book sprint methodology. The book sprint process allows for rapid development and production of large bodies of written work. Coordinators from the OpenStack Security Group re-enlisted the services of Adam Hyde as facilitator. Corporate support was obtained and the project was formally announced during the OpenStack summit in Portland, Oregon.
de: Wie beim OpenStack Operations Guide folgten wir der Buchsprint-Methodik. Der Buchsprint-Prozess ermöglicht eine schnelle Entwicklung und Produktion von großen der schriftlichen Arbeit. Die Koordinatoren der OpenStack Security Group haben die Dienste von Adam Hyde als Moderator wieder aufgenommen. Corporate Support wurde erreicht und das Projekt wurde offiziell während des OpenStack Gipfels in Portland, Oregon, bekannt gegeben.
id: Seperti halnya OpenStack Operations Guide, kami mengikuti metodologi sprint buku ini. Proses sprint buku memungkinkan perkembangan pesat dan produksi benda besar karya tulis. Koordinator dari OpenStack Security Group kembali mendaftarkan layanan Adam Hyde sebagai fasilitator. Dukungan perusahaan diperoleh dan proyek tersebut diumumkan secara resmi saat KTT OpenStack di Portland, Oregon.
tr_tr: OpenStack Operasyon Kılavuzunda olduğu gibi, sprint metodolojisini takip ettik. Kitap sprint işlemi, geniş bir yazılı çalışma vücutlarının hızlı bir şekilde geliştirilmesini ve üretilmesini sağlar. OpenStack Güvenlik Grubu'ndan koordinatörler, Adam Hyde'in kolaylaştırıcı olarak hizmetlerine yeniden katıldı. Kurumsal destek alındı ve proje Portland, Oregon'daki OpenStack zirvesi sırasında resmi olarak ilan edildi.

source: Assets in flight
de: Vermögenswerte im Überblick
tr_tr: Hareket halindeki varlıklar

source: Assets in flight: User keystone credentials, plaintext secrets, HTTP verb, secret ID, path
de: Vermögenswerte im Überblick: User Keystone Anmeldeinformationen, Plaintext Geheimnisse, HTTP Verb, geheime ID, Pfad
id: Assets in flight: Kredensial keystone pengguna, rahasia plaintext, kata kerja HTTP, ID rahasia, jalur
tr_tr: Uçuştaki varlıklar: Kullanıcı keystone kimlik bilgileri, düz metin gizli bilgiler, HTTP fiilleri, gizli kimlik, yol

source: At each level, you have ACLs that dictate who has what type of access. ACLs are interpreted based on what authentication system is in use. The two most common types of authentication providers used are Identity service (keystone) and TempAuth. Custom authentication providers are also possible. See :ref:`object_storage_authentication` for more information.
de: Auf jeder Ebene haben Sie ACLs, die diktieren, wer welche Art von Zugriff hat. ACLs werden auf der Grundlage des Authentifizierungssystems interpretiert. Die beiden häufigsten Arten von Authentifizierungsanbietern sind Identity Service (Keystone) und TempAuth. Benutzerdefinierte Authentifizierungsanbieter sind auch möglich. Siehe :ref:`object_storage_authentication` für weitere Informationen.
id: Pada setiap tingkat, Anda memiliki ACL yang mendikte siapa yang memiliki jenis akses apa. ACL ditafsirkan berdasarkan sistem autentikasi yang digunakan. Dua jenis penyedia otentikasi yang paling umum digunakan adalah layanan Identity (keystone) dan TempAuth. Penyedia otentikasi kustom juga dimungkinkan. Lihat :ref: `object_storage_authentication` untuk informasi lebih lanjut.
tr_tr: Her seviyede, hangi erişim türünün kime ait olduğunu belirleyen ACL'leriniz vardır. ACL'ler, hangi kimlik doğrulama sisteminin kullanıldığı temel alınarak yorumlanır. En yaygın olarak kullanılan iki kimlik doğrulama sağlayıcı türü Kimlik servisi (keystone) ve TempAuth'dur. Özel kimlik doğrulama sağlayıcıları da mümkündür. Daha fazla bilgi için bkz :ref:`object_storage_authentication`.

source: At its most basic, authentication is the process of confirming identity - that a user is actually who they claim to be. A familiar example is providing a username and password when logging in to a system.
de: Grundsätzlich gilt, Authentifizierung ist der Prozess der Bestätigung der Identität - dass ein Benutzer tatsächlich ist, wer er behaupten zu sein. Ein bekanntes Beispiel ist die Bereitstellung eines Benutzernamens und Passwortes bei der Anmeldung in einem System.
id: Yang paling dasar, autentikasi adalah proses konfirmasi identitas - bahwa pengguna sebenarnya adalah orang yang mereka klaim. Contoh yang familiar adalah menyediakan username dan password saat login ke sebuah sistem.
tr_tr: En temelde, kimlik doğrulama, kimliği doğrulama süreci - bir kullanıcının gerçekte iddia ettiği kişidir. Bilinen bir örnek, bir sisteme giriş yaparken bir kullanıcı adı ve parola sağlamaktır.

source: At the opposite end of the spectrum is the private cloud. As NIST defines it, a private cloud is provisioned for exclusive use by a single organization comprising multiple consumers, such as business units. The cloud may be owned, managed, and operated by the organization, a third-party, or some combination of them, and it may exist on or off premises. Private-cloud use cases are diverse and, as such, their individual security concerns vary.
de: Am anderen Ende des Spektrums befindet sich die Private Cloud. Wie NIST es definiert, wird eine private Cloud für die ausschließliche Verwendung durch eine einzelne Organisation bereitgestellt, die mehrere Konsumenten umfasst, beispielsweise Geschäftseinheiten. Die Cloud kann Eigentum der Organisation, eines Drittanbieters oder einer Kombination von ihnen sein, von ihr verwaltet und betrieben werden und in oder außerhalb der Geschäftsräume bestehen. Private-Cloud-Anwendungsfälle sind vielfältig und daher variieren ihre individuellen Sicherheitsbedenken.
id: Di ujung spektrum (opposite end) yang berlawanan adalah awan pribadi. Sebagai NIST mendefinisikannya, awan pribadi ditetapkan untuk penggunaan eksklusif oleh satu organisasi yang terdiri dari beberapa konsumen, seperti unit bisnis. Awan dapat dimiliki, dikelola, dan dioperasikan oleh organisasi, pihak ketiga, atau beberapa kombinasi dari keduanya, dan mungkin ada di dalam atau di luar lokasi. Kasus penggunaan awan pribadi beragam dan, karena itu, masalah keamanan individual mereka beragam.

source: At the time of this writing, very few clouds are using secure boot technologies in a production environment. As a result, these technologies are still somewhat immature. We recommend planning carefully in terms of hardware selection. For example, ensure that you have a TPM and Intel TXT support. Then verify how the node hardware vendor populates the PCR values. For example, which values will be available for validation. Typically the PCR values listed under the software context in the table above are the ones that a cloud architect has direct control over. But even these may change as the software in the cloud is upgraded. Configuration management should be linked into the PCR policy engine to ensure that the validation is always up to date.
de: Zum Zeitpunkt dieses Schreibens verwenden nur wenige Clouds sichere Boot-Technologien in einer Produktionsumgebung. Damit sind diese Technologien noch etwas unreif. Wir empfehlen, die Hardwareauswahl sorgfältig zu planen. Zum Beispiel, stellen Sie sicher, dass Sie eine TPM und Intel TXT Unterstützung haben. Überprüfen Sie dann, wie der Knoten-Hardware-Hersteller die PCR-Werte füllt. Zum Beispiel, welche Werte für die Validierung zur Verfügung stehen. Typischerweise sind die unter dem Software-Kontext in der obigen Tabelle aufgeführten PCR-Werte diejenigen, die ein Cloud-Architekt direkt kontrolliert hat. Aber auch diese können sich ändern, wenn die Software in der Cloud aktualisiert wird. Das Konfigurationsmanagement sollte in die PCR-Richtlinien-Engine verknüpft werden, um sicherzustellen, dass die Validierung immer aktuell ist.

source: At this point the SAML Assertion can be sent to the Service Provider keystone, and a valid OpenStack token, issued by a Service Provider keystone, will be returned.
de: An dieser Stelle kann die SAML-Assertion an den Keystone des Service Providers gesendet werden, und ein gültiges OpenStack-Token, das von einem Service Provider Keystone ausgegeben wird, wird zurückgegeben.
tr_tr: Bu noktada, SAML Belirtmesi Servis Sağlayıcı keystone'a gönderilebilir ve bir Servis Sağlayıcı keystone tarafından verilen geçerli bir OpenStack belirteci geri gönderilecektir.

source: At this point we know that the node has booted with the correct kernel and underlying components. The next step is to harden the operating system and it starts with a set of industry-accepted hardening controls. The following guides are good examples:
de: An diesem Punkt wissen wir, dass der Knoten mit dem richtigen Kernel und zugrunde liegenden Komponenten gebootet hat. Der nächste Schritt ist, das Betriebssystem zu härten und es beginnt mit einer Reihe von Industrie-akzeptierten Härtungskontrollen. Die folgenden Guides sind gute Beispiele:
id: Pada titik ini kita tahu bahwa node telah boot dengan kernel yang benar dan komponen yang mendasarinya. Langkah selanjutnya adalah mengeraskan sistem operasi dan dimulai dengan seperangkat kontrol pengerasan yang diterima industri. Panduan berikut adalah contoh yang baik:
tr_tr: Bu noktada, düğümün doğru çekirdek ve alttaki bileşenlerle önyüklendiğini biliyoruz. Bir sonraki adım, işletim sistemini sıkılaştırmaktır ve sektörde kabul görmüş bir dizi sıkılaştırma denetimi ile başlar. Aşağıdaki kılavuzlar iyi örneklerdir:

source: At this time, live migration is enabled in OpenStack by default. Live migrations can be disabled by adding the following lines to the nova ``policy.json`` file:
de: Zu diesem Zeitpunkt ist die Live-Migration standardmäßig in OpenStack aktiviert. Live-Migrationen können deaktiviert werden, indem Sie die folgenden Zeilen zur Datei Nova ``policy.json`` hinzufügen:
id: Pada saat ini, migrasi langsung diaktifkan di OpenStack secara default. Migrasi langsung dapat dinonaktifkan dengan menambahkan baris berikut ke file nova `policy.json``:
tr_tr: Şu anda, canlı göç, varsayılan olarak OpenStack'da etkinleştirilmiştir. Canlı göç işlemleri, nova ``policy.json`` dosyasına aşağıdaki satırları ekleyerek devre dışı bırakılabilir:

source: At various stages of the live migration process the contents of an instances run time memory and disk are transmitted over the network in plain text. Thus there are several risks that need to be addressed when using live migration. The following in-exhaustive list details some of these risks:
de: In verschiedenen Stadien des Live-Migrationsprozesses werden die Inhalte eines Instanzen Laufzeitspeichers und Festplatte über das Netzwerk im Klartext übertragen. So gibt es mehrere Risiken, die bei der Live-Migration angesprochen werden müssen. Die folgenden unvollständige Liste enthält einige dieser Risiken:
id: Pada berbagai tahap proses migrasi langsung, isi instance menjalankan memori dan disk waktu dikirimkan melalui jaringan dalam teks biasa. Dengan demikian ada beberapa risiko yang perlu diperhatikan saat menggunakan migrasi langsung. Berikut daftar lengkap rincian beberapa dari risiko ini:
tr_tr: Canlı geçiş sürecinin çeşitli aşamalarında örneklerin içeriği çalışma zamanı belleği ve disk ağ üzerinden düz metin halinde iletilir. Dolayısıyla canlı göç kullanıldığında ele alınması gereken çeşitli riskler vardır. Aşağıdaki ayrıntılı liste, bu risklerden bazılarını ayrıntılarıyla açıklamaktadır:

source: Attack types
de: Angriffstypen
id: Jenis serangan
tr_tr: Saldırı türleri

source: Attacker position / Privilege level
de: Attacker Position/Privileg Ebene
id: Posisi penyerang / tingkat privilege
tr_tr: Saldırgan konumu / Ayrıcalık seviyesi

source: Audit reference
de: Prüfungsreferenz
id: Referensi Audit
tr_tr: Denetim referansı

source: Auth services
de: Auth Dienstleistungen
id: Layanan Auth
tr_tr: Kimlik doğrulama servisleri

source: Authenticate externally and generate an :term:`unscoped token` in Identity service.
de: Authentifizieren Sie extern und erzeugen Sie einen :term:`unscoped token` in Identity service.
tr_tr: Harici olarak kimlik doğrulama yapın ve Kimlik servisinde :term:`kapsamsız belirteç` üretin.

source: Authentication
de: Authentifizierung
id: Otentikasi
tr_tr: Doğrulama

source: Authentication and authorization policy in OpenStack may be delegated to another service. A typical use case is an organization that seeks to deploy a private cloud and already has a database of employees and users in an LDAP system. Using this as the authentication authority, requests to the Identity service are delegated to the LDAP system, which will then authorize or deny based on its policies. Upon successful authentication, the Identity service then generates a token that is used for access to authorized services.
de: Die Authentifizierungs- und Berechtigungsrichtlinie in OpenStack kann an einen anderen Dienst delegiert werden. Ein typischer Anwendungsfall ist eine Organisation, die eine private Cloud bereitstellen will und bereits eine Datenbank von Mitarbeitern und Benutzern in einem LDAP-System hat. Wenn Sie dies als Authentifizierungsstelle verwenden, werden Anfragen an den Identitätsdienst an das LDAP-System delegiert, das dann basierend auf seinen Richtlinien autorisiert oder verweigert wird. Nach erfolgreicher Authentifizierung generiert der Identitätsdienst dann ein Token, das für den Zugriff auf autorisierte Dienste verwendet wird.
id: Kebijakan otentikasi dan otorisasi di OpenStack dapat didelegasikan ke layanan lain. Kasus penggunaan yang khas adalah organisasi yang berusaha menyebarkan awan pribadi dan sudah memiliki database karyawan dan pengguna dalam sistem LDAP. Dengan menggunakan ini sebagai otoritas otentikasi, permintaan ke layanan Identitas didelegasikan ke sistem LDAP, yang kemudian akan memberi otorisasi atau menolak berdasarkan kebijakannya. Setelah otentikasi berhasil, layanan Identitas kemudian menghasilkan token yang digunakan untuk akses ke layanan resmi.
tr_tr: OpenStack'teki kimlik doğrulama ve yetkilendirme politikası başka bir servise devredilebilir. Tipik bir kullanım durumu, özel bir bulut dağıtmayı amaçlayan ve zaten bir LDAP sistemindeki çalışanların ve kullanıcıların bir veritabanına sahip bir organizasyondur. Bunu kimlik doğrulama yetkilisi olarak kullanarak Kimlik servisine verilen talepler LDAP sistemine devredilir; bu LDAP sistemi politikalarına dayanarak yetkilendirir veya reddeder. Kimlik doğrulama işlemi başarıyla tamamlandıktan sonra, Kimlik servisi yetkili servislere erişmek için kullanılan bir belirteç üretir.

source: Authentication configuration example: Qpid
de: Authentifizierungskonfigurationsbeispiel: Qpid
id: Contoh konfigurasi otentikasi: Qpid
tr_tr: Kimlik doğrulama yapılandırma örneği: Qpid

source: Authentication configuration example: RabbitMQ
de: Authentifizierungskonfigurationsbeispiel: RabbitMQ
id: ​Contoh konfigurasi otentikasi: RabbitMQ
tr_tr: Kimlik doğrulama yapılandırma örneği: RabbitMQ

source: Authentication does not take place at the storage nodes. If you are able to connect to a storage node on one of these ports, you can access or modify data without authentication. In order to secure against this issue you should follow the recommendations given previously about using a private storage network.
de: Die Authentifizierung findet nicht an den Speicherknoten statt. Wenn Sie in der Lage sind, eine Verbindung zu einem Speicherknoten auf einem dieser Ports herzustellen, können Sie Daten ohne Authentifizierung aufrufen oder ändern. Um diese Frage zu sichern, sollten Sie die Empfehlungen über die Verwendung eines privaten Speichersystems beachten.
id: Otentikasi tidak terjadi pada node penyimpanan. Jika Anda dapat terhubung ke node penyimpanan di salah satu port ini, Anda dapat mengakses atau memodifikasi data tanpa otentikasi. Untuk mengatasi masalah ini, Anda harus mengikuti rekomendasi yang diberikan sebelumnya tentang penggunaan jaringan penyimpanan pribadi.
tr_tr: Kimlik doğrulama, depolama düğümlerinde gerçekleşmez. Bu bağlantı noktalarından birinde bir depolama düğümüne bağlanabiliyorsanız, kimlik doğrulaması olmadan verilere erişebilir veya bunları değiştirebilirsiniz. Bu sorundan korunmak için daha önce özel bir depolama ağı kullanma konusunda verilen önerilere uymalısınız.
