Repository: openstack/security-doc
Catalog: security-guide/source/locale/*/LC_MESSAGES/security-guide.po
Languages: de, id, tr_tr

source: A *bridge* is a component that exists inside more than one security domain. Any component that bridges security domains with different trust levels or authentication requirements must be carefully configured. These bridges are often the weak points in network architecture. A bridge should always be configured to meet the security requirements of the highest trust level of any of the domains it is bridging. In many cases the security controls for bridges should be a primary concern due to the likelihood of attack.
de: Eine *Brücke* ist eine Komponente, die in mehr als einer Sicherheitsdomäne existiert. Jede Komponente, die Sicherheitsdomänen mit unterschiedlichen Vertrauensstufen oder Authentifizierungsanforderungen überbrückt, muss sorgfältig konfiguriert werden. Diese Brücken sind oft die Schwachstellen in der Netzwerkarchitektur. Eine Brücke sollte immer so konfiguriert sein, dass sie die Sicherheitsanforderungen der höchsten Vertrauensstufe eines der Domänen erfüllt, die sie überbrückt. In vielen Fällen sollten die Sicherheitskontrollen für Brücken aufgrund der Wahrscheinlichkeit des Angriffs ein Hauptanliegen sein.
id: *bridge* adalah komponen yang ada di dalam lebih dari satu domain keamanan. Setiap komponen yang menjembatani domain keamanan dengan tingkat kepercayaan atau persyaratan otentikasi yang berbeda harus dikonfigurasi dengan saksama. Jembatan ini sering menjadi titik lemah dalam arsitektur jaringan. Jembatan harus selalu dikonfigurasi untuk memenuhi persyaratan keamanan tingkat kepercayaan tertinggi dari domain mana pun yang menjembataninya. Dalam banyak kasus, kontrol keamanan untuk jembatan harus menjadi perhatian utama karena kemungkinan serangan.
tr_tr: Bir *köprü* birden fazla güvenlik alanının içinde bulunan bir bileşendir. Güvenlik etki alanlarını farklı güven düzeyleri veya kimlik doğrulama gereksinimleri ile köprüleyen her bileşen dikkatle yapılandırılmalıdır. Bu köprüler genelde ağ mimarisindeki zayıf noktalardır. Bir köprü, köprü kuran herhangi bir etki alanının en yüksek güven düzeyinin güvenlik gereksinimlerini karşılayacak şekilde daima yapılandırılmalıdır. Çoğu durumda, köprü güvenlik kontrolleri, saldırı olasılığı nedeniyle birincil bir husustur.

source: A *security service* is the Shared File Systems service (manila) entity that abstracts a set of options that defines a security domain for a particular shared file system protocol, such as an Active Directory domain or a Kerberos domain. The security service contains all of the information necessary for the Shared File Systems to create a server that joins a given domain.
de: Ein *Sicherheitsdienst* ist die Shared File Systems Service (Manila) Entity, die eine Reihe von Optionen abstrahiert, die eine Sicherheitsdomäne für ein bestimmtes Dateisystemprotokoll definiert, z. B. eine Active Directory Domain oder eine Kerberos Domain. Der Sicherheitsdienst enthält alle Informationen, die für die freigegebenen Dateisysteme erforderlich sind, um einen Server zu erstellen, der eine bestimmte Domäne verbindet.
id: A *security service * adalah entitas Shared File Systems (manila) yang abstract (memisahkan) satu set pilihan yang mendefinisikan domain keamanan untuk protokol sistem file bersama tertentu, seperti domain Active Directory atau domain Kerberos. Layanan keamanan berisi semua informasi yang diperlukan untuk Shared File Systems untuk membuat server yang bergabung dengan domain tertentu.
tr_tr: Bir *güvenlik servisi*, Active Directory etki alanı veya Kerberos etki alanı gibi belirli bir paylaşılan dosya sistemi protokolü için bir güvenlik etki alanı tanımlayan seçenekler grubunu özetleyen Paylaşımlı Dosya Sistemleri servisi (manila) varlığıdır. Güvenlik servisi, Paylaşımlı Dosya Sistemleri'nin belirli bir alana katılan bir sunucu oluşturması için gerekli tüm bilgileri içerir.

source: A Certificate Revocation List (CRL) is a list of certificate serial numbers that have been revoked. End entities presenting these certificates should not be trusted in a PKI model. Revocation can happen because of several reasons for example, key compromise, CA compromise.
de: Eine Zertifikatsperrliste (CRL) ist eine Liste der Zertifikats-Seriennummern, die widerrufen wurden. Endentitäten, die diese Zertifikate vorstellen, sollten nicht in einem PKI-Modell vertraut werden. Widerruf kann passieren aus mehreren Gründen passieren, zum Beispiel Schlüsselkompromiss, CA Kompromiss.
id: Certificate Revocation List (CRL) adalah daftar nomor seri sertifikat yang telah dicabut. Entitas akhir yang mempresentasikan sertifikat ini tidak boleh dipercaya dalam model PKI. Pencabutan bisa terjadi karena beberapa alasan misalnya, kompromi kunci, kompromi CA.
tr_tr: Bir Sertifika İptal Listesi (CRL), iptal edilen sertifika seri numaralarının bir listesidir. Bu sertifikaları sunan uç birimler bir PKI modelinde güvenilmemelidir. İptal, örneğin çeşitli nedenlerle, kilit ödünleme, CA açık vermesi nedeniyle olabilir.

source: A DNS IP address that is used inside the tenant network.
de: Eine DNS-IP-Adresse, die im Tenantnetzwerk verwendet wird.
id: Alamat IP DNS yang digunakan di dalam jaringan penyewa.
tr_tr: Kiracı ağı içinde kullanılan bir DNS IP adresi.

source: A bare metal server driver for Compute was under development and has since moved into a separate project called `ironic <https://wiki.openstack.org/wiki/Ironic>`__. At the time of this writing, ironic does not appear to address sanitization of tenant data resident the physical hardware.
de: Ein Bare-Metal-Server-Treiber für Compute war in der Entwicklung und hat sich seitdem in ein separates Projekt namens `ironic` verschoben <https://wiki.openstack.org/wiki/Ironic>`__. Zum Zeitpunkt dieses Schreibens scheint Ironie nicht die Sanierung von Tenantdaten, die die physikalische Hardware resident sind, zu adressieren.
id: Driver server bare metal untuk Compute sedang dalam pengembangan dan sejak pindah ke proyek terpisah yang disebut 'ironis <https://wiki.openstack.org/wiki/Ironic> `__. Pada saat penulisan ini, ironis nampaknya tidak membahas sanitasi data penyewa yang menampung perangkat keras fisik.
tr_tr: Hesaplama için düz bir sunucu sürücüsü geliştirme aşamasındaydı ve o zamandan beri `ironik <https://wiki.openstack.org/wiki/Ironic>`__ adlı ayrı bir projeye taşındı. Bu yazı hazırlanırken, ironik, fiziksel donanıma sahip kiracı verilerin temizlenmesini ele almaz.

source: A brief description of the purpose of the interface.
de: Eine kurze Beschreibung des Zweckes der Schnittstelle.
id: Uraian singkat tentang tujuan antarmuka.
tr_tr: Arayüzün amacını anlatan bir özet açıklama.

source: A cloud architect should decide what devices to make available to cloud users. Anything that is not needed should be removed from QEMU. This step requires recompiling QEMU after modifying the options passed to the QEMU configure script. For a complete list of up-to-date options simply run :command:`./configure --help` from within the QEMU source directory. Decide what is needed for your deployment, and disable the remaining options.
de: Ein Cloud-Architekt sollte entscheiden, welche Geräte für Cloud-User zur Verfügung stehen. Alles, was nicht benötigt wird, sollte aus QEMU entfernt werden. Dieser Schritt erfordert das Neukompilieren von QEMU nach dem Ändern der an das QEMU-Skript übergebenen Optionen. Für eine vollständige Liste der aktuellen Optionen starten Sie einfach :command:`./configure --help` aus dem QEMU-Quellverzeichnis. Entscheiden Sie, was für Ihre Bereitstellung benötigt wird, und deaktivieren Sie die verbleibenden Optionen.
id: Arsitek awan harus menentukan perangkat apa yang tersedia bagi pengguna cloud. Apa pun yang tidak dibutuhkan harus dihapus dari QEMU. Langkah ini memerlukan rekam ulang QEMU setelah memodifikasi opsi yang dilewatkan ke skrip konfigurasi QEMU. Untuk daftar opsi up-to-date yang lengkap, cukup jalankan :command:`./configure --help` dari dalam direktori sumber QEMU. Tentukan apa yang dibutuhkan untuk penerapan Anda, dan nonaktifkan opsi yang tersisa.
tr_tr: Bir bulut mimarının bulut kullanıcılarına hangi cihazları sunacaklarına karar vermeleri gerekir. Gerekli olmayan her şey QEMU'dan kaldırılmalıdır. Bu adım, QEMU yapılandırma komut dosyasına iletilen seçenekleri değiştirdikten sonra QEMU'yu yeniden derlemeyi gerektirir. Güncel opsiyonların tam listesi için: komutu: `./configure --help` QEMU kaynak dizininden çalıştırın. Dağıtımınız için neyin gerekli olduğuna karar verin ve kalan seçenekleri devre dışı bırakın.

source: A cloud can be abstracted as a collection of logical components by virtue of their function, users, and shared security concerns, which we call security domains. Threat actors and vectors are classified based on their motivation and access to resources. Our goal is to provide you a sense of the security concerns with respect to each domain depending on your risk/vulnerability protection objectives.
de: Eine Cloud kann als eine Sammlung von logischen Komponenten durch ihre Funktion, Benutzer und gemeinsame Sicherheitsbedenken, die wir Sicherheitsdomänen nennen, abstrahiert werden. Bedrohungsakteure und Vektoren werden aufgrund ihrer Motivation und des Zugangs zu Ressourcen klassifiziert. Unser Ziel ist es, Ihnen ein Gefühl der Sicherheitsbedenken zu geben in Bezug auf jede Domain in Abhängigkeit von Ihrem Risiko/Verwundbarkeit, Schutz und Ziele.
id: Awan dapat diabstraksikan sebagai kumpulan komponen logis berdasarkan fungsi, pengguna, dan masalah keamanan bersama, yang disebut domain keamanan. Aktor dan vektor ancaman digolongkan berdasarkan motivasi dan akses terhadap sumber daya. Tujuan kami adalah memberi Anda rasa kekhawatiran keamanan sehubungan dengan setiap domain tergantung pada tujuan perlindungan risiko/kerentanan Anda.
tr_tr: Bir bulut, işlevleri, kullanıcıları ve paylaşılan güvenlik kaygıları nedeniyle, güvenlik alanları olarak adlandırdığımız mantıksal bileşen topluluğu olarak soyutlanabilir. Tehdit aktörleri ve vektörleri motivasyonlarına ve kaynaklara erişimi temel alarak sınıflandırılır. Hedefimiz, risk/güvenlik açığı koruma hedeflerine bağlı olarak her etki alanı ile ilgili güvenlik endişeleri duygusu sunmaktır.

source: A cloud deployment is a living system. Machines age and fail, software becomes outdated, vulnerabilities are discovered. When errors or omissions are made in configuration, or when software fixes must be applied, these changes must be made in a secure, but convenient, fashion. These changes are typically solved through configuration management.
de: Ein Cloud-Deployment ist ein lebendes System. Maschinen altern und fallen aus, Software wird veraltet, Schwachstellen werden entdeckt. Wenn Fehler oder Auslassungen in der Konfiguration vorgenommen werden oder wenn Software-Fixes angewendet werden müssen, müssen diese Änderungen in einer sicheren, aber bequemen Weise gemacht werden. Diese Änderungen werden in der Regel durch das Konfigurationsmanagement gelöst.
id: Pengerahan awan merupakan sistem kehidupan. Mesin menjadi menua dan gagal, perangkat lunak menjadi usang, kerentanan akan ditemukan. Bila terjadi kesalahan atau kelalaian dalam konfigurasi, atau bila perbaikan perangkat lunak harus diterapkan, perubahan ini harus dilakukan dengan cara yang aman namun nyaman. Perubahan ini biasanya diselesaikan melalui manajemen konfigurasi.
tr_tr: Bulut dağıtımı yaşayan bir sistemdir. Makineler yaşlanır ve başarısız olur, yazılım güncelliğini yitirir, güvenlik açıkları keşfedilir. Yapılandırma sırasında hatalar veya eksiklikler yapıldığında veya yazılım düzeltmeleri uygulandığında, bu değişiklikler güvenli ancak kullanışlı bir şekilde yapılmalıdır. Bu değişiklikler genellikle yapılandırma yönetimi ile çözülür.

source: A cloud will always have bugs. Some of these will be security problems. For this reason, it is critically important to be prepared to apply security updates and general software updates. This involves smart use of configuration management tools, which are discussed below. This also involves knowing when an upgrade is necessary.
de: Eine Cloud hat immer Bugs. Einige davon sind Sicherheitsprobleme. Aus diesem Grund ist es entscheidend wichtig, Sicherheitsupdates und allgemeine Software-Updates anzuwenden. Hierbei handelt es sich um eine intelligente Verwendung von Konfigurationsmanagement-Tools, die nachfolgend erläutert werden. Dies beinhaltet auch das Wissen, wann ein Upgrade notwendig ist.
id: Awan akan selalu memiliki bug. Beberapa di antaranya akan menjadi masalah keamanan. Untuk alasan ini, sangat penting untuk bersiap menerapkan pembaruan keamanan dan pembaruan perangkat lunak umum. Ini melibatkan penggunaan alat manajemen konfigurasi yang cerdas, yang akan dibahas di bawah ini. Ini juga melibatkan mengetahui kapan upgrade diperlukan.
tr_tr: Bulutun her zaman hataları olacaktır. Bunlardan bazıları güvenlik sorunları olacaktır. Bu nedenle, güvenlik güncelleştirmelerini ve genel yazılım güncelleştirmelerini uygulamak için hazırlıklı olunması çok önemlidir. Bu, aşağıda tartışılan yapılandırma yönetimi araçlarının akıllıca kullanılmasını gerektirir. Bu aynı zamanda bir yükseltmenin ne zaman gerekli olduğunu bilmeyi de içerir.

source: A cloud will host many virtual instances, and monitoring these instances goes beyond hardware monitoring and log files which may just contain CRUD events.
de: Eine Cloud wird viele virtuelle Instanzen hosten, und die Überwachung dieser Instanzen geht über Hardware-Monitoring und Log-Dateien, die nur CRUD-Ereignisse enthalten können.
id: Awan akan meng-host banyak instance virtual, dan memantau instance ini melampaui pemantauan perangkat keras dan file log yang mungkin berisi kejadian CRUD.
tr_tr: Bir bulut birçok sanal örneğe ev sahipliği yapacak ve bu örnekleri izleme yalnızca donanım izleme ve CRUD olaylarını içerebilen günlük dosyalarının ötesine geçecektir.

source: A common reason to perform a security review on an OpenStack project is to enable that project to achieve the *vulnerability:managed* governance tag. The OpenStack Vulnerability Management Team (VMT) applies the `vulnerability:managed tag <https://governance.openstack.org/reference/tags/vulnerability_managed.html>`_ to projects where the report reception and disclosure of vulnerabilities is managed by the VMT. One of the requirements for gaining the tag is that some form of security review, audit or threat analysis has been performed on the project.
de: Ein gemeinsamer Grund für die Durchführung einer Sicherheitsüberprüfung an einem OpenStack-Projekt ist es, dieses Projekt zu ermöglichen, um die *vulnerability:managed* governance tag zu erreichen. Das OpenStack Vulnerability Management Team (VMT) wendet das `vulnerability:managed tag` an <https://governance.openstack.org/reference/tags/vulnerability_managed.html> `_ zu Projekten, bei denen der Bericht zu Empfang und die Offenlegung von Schwachstellen von der VMT verwaltet wird. Eine der Voraussetzungen für die Gewinnung des Tags ist, dass irgendeine Form von Sicherheitsüberprüfung, Audit- oder Bedrohungsanalyse auf dem Projekt durchgeführt wurde.
id: Alasan umum untuk melakukan tinjauan keamanan pada proyek OpenStack adalah untuk memungkinkan proyek tersebut mencapai tag pengelolaan *vulnerability:managed* . OpenStack Vulnerability Management Team (VMT) menerapkan `vulnerability:managed tag <https://governance.openstack.org/reference/tags/vulnerability_managed.html>`_ untuk proyek di mana laporan penerimaan dan pengungkapan kerentanan dikelola oleh VMT. Salah satu persyaratan untuk mendapatkan tag adalah beberapa bentuk tinjauan keamanan, audit atau analisis ancaman telah dilakukan pada proyek.
tr_tr: Bir OpenStack projesi üzerinde güvenlik incelemesi yapmak için ortak bir neden, o projenin *vulnerability: managed* yönetişim etiketi elde etmesini sağlamaktır. OpenStack Güvenlik Açığı Yönetimi Ekibi (VMT), `vulnerability: managed etiketi <https://governance.openstack.org/reference/tags/vulnerability_managed.html>`_ raporların alınması ve güvenlik açıklarının bildiriminin VMT tarafından yapıldığı projelere uygulanır. Etiket kazanma gereksinimlerinden biri, proje üzerinde bazı güvenlik incelemesi, denetim veya tehdit analizi uygulanmış olmasıdır.

source: A complete tutorial on secure boot deployment is beyond the scope of this book. Instead, here we provide a framework for how to integrate secure boot technologies with the typical node provisioning process. For additional details, cloud architects should refer to the related specifications and software configuration manuals.
de: Ein vollständiges Tutorial zur sicheren Boot-Bereitstellung geht über den Rahmen dieses Buches hinaus. Stattdessen bieten wir hier einen Rahmen für die Integration von sicheren Boot-Technologien mit dem typischen Knoten-Provisioning-Prozess. Für weitere Details verweisen wir Cloud-Architekten auf die zugehörigen Spezifikationen und Software-Konfigurationshandbücher.
id: Tutorial lengkap tentang penerapan booting aman berada di luar cakupan buku ini. Sebagai gantinya, di sini kami menyediakan kerangka kerja bagaimana mengintegrasikan teknologi boot aman dengan proses penyediaan node tipikal. Untuk rincian tambahan, arsitek awan harus mengacu pada spesifikasi dan manual konfigurasi perangkat lunak yang terkait.
tr_tr: Güvenli önyükleme dağıtımı hakkında eksiksiz bir kılavuz bu kitabın kapsamı dışındadır. Bunun yerine, burada, güvenli önyükleme teknolojilerini tipik düğüm hazırlama süreciyle nasıl bütünleştireceğinizin bir çerçevesi sunuyoruz. Ek ayrıntılar için, bulut mimarları ilgili özelliklere ve yazılım yapılandırma kılavuzlarına bakmalıdır.

source: A compromised application running within a VM attacks the hypervisor to access or control another virtual machine and its resources. This is a threat vector unique to virtualization and represents considerable risk as a multitude of virtual machine file images could be compromised due to vulnerability in a single application. This virtual network attack is a major concern as the administrative techniques for protecting real networks do not directly apply to the virtual environment.
de: Eine kompromittierte Anwendung, die innerhalb einer VM läuft, greift den Hypervisor an, um auf eine andere virtuelle Maschine und ihre Ressourcen zuzugreifen oder sie zu steuern. Dies ist ein Bedrohungsvektor, der für die Virtualisierung einzigartig ist und ein beträchtliches Risiko darstellt, da eine Vielzahl von virtuellen Maschinen-Dateibildern aufgrund einer Anfälligkeit in einer einzigen Anwendung beeinträchtigt werden könnte. Dieser virtuelle Netzwerkangriff ist ein wichtiges Anliegen, da die administrativen Techniken zum Schutz von realen Netzwerken nicht direkt auf die virtuelle Umgebung zutreffen.
id: Aplikasi yang disusupi yang berjalan di dalam VM menyerang hypervisor untuk mengakses atau mengendalikan mesin virtual lain dan sumber dayanya. Ini adalah vektor ancaman yang unik untuk virtualisasi dan merupakan risiko yang cukup besar karena banyak image file mesin virtual dapat dikompromikan karena kerentanan dalam satu aplikasi. Serangan jaringan virtual ini menjadi perhatian utama karena teknik administratif untuk melindungi jaringan sebenarnya tidak langsung diterapkan ke lingkungan virtual.
tr_tr: Bir VM içinde çalışan ve tehlike altındaki bir uygulama, başka bir sanal makineye ve kaynaklarına erişmek veya kontrol etmek için hipervizöre saldırır. Bu, sanallaştırmaya özgü bir tehdit vektörüdür ve tek bir uygulamadaki savunmasızlıktan ötürü çok sayıda sanal makine dosyası görüntüsü tehlikeye atılacağı için önemli risk oluşturmaktadır. Gerçek ağları korumaya yönelik yönetim teknikleri doğrudan sanal ortama uygulanmadığından, bu sanal ağ saldırısı büyük bir endişe kaynağıdır.

source: A compromised application running within a virtual machine attacks the hypervisor to access underlying resources. For example, when a virtual machine is able to access the hypervisor OS, physical devices, or other applications. This threat vector represents considerable risk as a compromise on a hypervisor can infect the physical hardware as well as exposing other virtual machines and network segments.
de: Eine kompromittierte Anwendung, die innerhalb einer virtuellen Maschine läuft, greift den Hypervisor an, um auf zugrunde liegende Ressourcen zuzugreifen. Wenn zum Beispiel eine virtuelle Maschine auf das Hypervisor-Betriebssystem, physikalische Geräte oder andere Anwendungen zugreifen kann. Dieser Bedrohungsvektor stellt ein beträchtliches Risiko dar, da ein Kompromiss auf einem Hypervisor die physikalische Hardware infizieren und andere virtuelle Maschinen und Netzwerksegmente aussetzen kann.
id: Aplikasi yang disusupi yang berjalan di dalam mesin virtual menyerang hypervisor untuk mengakses sumber daya yang mendasarinya. Misalnya, ketika mesin virtual mampu mengakses hypervisor OS, perangkat fisik, atau aplikasi lainnya. Vektor ancaman ini merupakan risiko yang cukup besar karena kompromi pada hypervisor dapat menginfeksi perangkat keras fisik serta membeberkan mesin virtual dan segmen jaringan lainnya.
tr_tr: Bir sanal makine içinde çalışan ve güvenliği ihlal edilmiş bir uygulama, alttaki kaynakları erişmek için hipervizöre saldırır. Örneğin, bir sanal makine, hipervizör işletim sistemine, fiziksel aygıtlara veya diğer uygulamalara erişebildiğinde. Bu tehdit vektörü, bir hypervisor üzerinde uzlaşmanın fiziksel donanıma bulaşabileceği ve diğer sanal makinelerin ve ağ bölümlerinin ortaya çıkmasının ciddi risk oluşturduğunu belirtir.

source: A directory service that Microsoft developed for Windows domain networks. Uses LDAP, Microsoft's version of Kerberos, and DNS.
de: Ein Verzeichnisdienst, den Microsoft für Windows-Domänennetzwerke entwickelt hat. Verwendet LDAP, Microsoft-Version von Kerberos und DNS.
id: Layanan direktori yang dikembangkan Microsoft untuk domain Windows. Menggunakan LDAP, versi Microsoft Kerberos, dan DNS.
tr_tr: Microsoft'un Windows etki alanı ağları için geliştirdiği bir dizin hizmeti. LDAP, Microsoft'un Kerberos sürümünü ve DNS'yi kullanır.

source: A directory service, such as LDAP, RADIUS and Active Directory, which allows users to login with a user name and password, is a typical source of authentication tokens (e.g. passwords) at an :term:`identity provider`.
de: Ein Verzeichnisdienst wie LDAP, RADIUS und Active Directory, der es Benutzern ermöglicht, sich mit einem Benutzernamen und Passwort anzumelden, ist eine typische Quelle von Authentifizierungs-Token (z.B. Passwörter) unter:term:`identity provider`.
id: Layanan direktori, seperti LDAP, RADIUS dan Active Directory, yang memungkinkan pengguna masuk dengan nama pengguna dan kata sandi, merupakan sumber khas token otentikasi (misalnya kata sandi) pada sebuah :term:`identity provider`.
tr_tr: Kullanıcıların bir kullanıcı adı ve parola ile oturum açmasına izin veren LDAP, RADIUS ve Active Directory gibi bir dizin servisi, :term:`kimlik sağlayıcısı` gibi bir kimlik doğrulama belirteçlerinin (örn. parolalar) tipik bir kaynağıdır.

source: A domain of a security service.
de: Eine Domain eines Sicherheitsdienstes.
id: Sebuah domain dari sebuah layanan keamanan.
tr_tr: Güvenlik servisi için bir etki alanı
