Repository: openstack/security-doc
Catalog: security-guide/source/locale/*/LC_MESSAGES/security-guide.po
Languages: de, id, tr_tr

source: Configure the ``ALLOWED_HOSTS`` setting with the fully qualified host name(s) that are served by the OpenStack dashboard. Once this setting is provided, if the value in the "Host:" header of an incoming HTTP request does not match any of the values in this list an error will be raised and the requestor will not be able to proceed. Failing to configure this option, or the use of wild card characters in the specified host names, will cause the dashboard to be vulnerable to security breaches associated with fake HTTP Host headers.
de: Konfigurieren Sie die ``ALLOWED_HOSTS``-Einstellung mit dem vollqualifizierten Hostnamen, der vom OpenStack-Dashboard bedient wird. Sobald diese Einstellung zur Verfügung gestellt wird, wird der Fehler, wenn der Wert im Header \Host:\ einer eingehenden HTTP-Anforderung nicht mit einem der Werte in dieser Liste übereinstimmt, ein Fehler erhoben und der Anforderer kann nicht fortfahren. Wenn Sie diese Option nicht konfigurieren oder die Verwendung von Platzhalterzeichen in den angegebenen Hostnamen verwenden, wird das Dashboard anfällig für Sicherheitsverletzungen sein, die mit gefälschten HTTP-Host-Headern verknüpft sind.
id: Konfigurasikan pengaturan ``ALLOWED_HOSTS` dengan nama host yang memenuhi syarat yang dilayani oleh dasbor OpenStack. Setelah pengaturan ini diberikan, jika nilai pada header "Host:" dari permintaan HTTP yang masuk tidak sesuai dengan salah satu nilai dalam daftar ini, kesalahan akan diajukan dan peminta tidak dapat melanjutkan. Gagal mengkonfigurasi opsi ini, atau penggunaan karakter wild card dalam nama host yang ditentukan, akan menyebabkan dasbor rentan terhadap pelanggaran keamanan yang terkait dengan header Host HTTP palsu.
tr_tr: ``ALLOWED_HOSTS`` ayarını, OpenStack paneli tarafından sunulan tam nitelikli ana makine(lar) ile yapılandırın. Bu ayar sağlandıktan sonra, gelen bir HTTP isteğinin "Host:" başlığındaki değer bu listedeki herhangi bir değerle eşleşmiyorsa hata oluşur ve istekte bulunamaz. Bu seçeneği yapılandırmadığınızda veya belirtilen ana bilgisayar adlarında joker karakter kullanıldığında, panelin sahte HTTP Host üstbilgileriyle ilişkili güvenlik açıklarına karşı savunmasız kalmasına neden olur.

source: Configure your Service Provider by editing ``/etc/shibboleth/shibboleth2.xml``.
de: Konfigurieren Sie Ihren Dienstanbieter durch Bearbeiten von ``/etc/shibboleth/shibboleth2.xml``.
tr_tr: ``/etc/shibboleth/shibboleth2.xml`` dosyasını düzenleyerek Servis Sağlayıcınızı yapıladırın.

source: Configure your web server to send a restrictive CORS header with each response, allowing only the dashboard domain and protocol:
de: Konfigurieren Sie Ihren Webserver, um einen restriktiven CORS-Header mit jeder Antwort zu senden, so dass nur die Dashboard-Domäne erlaubt ist und das Protokoll:
id: Konfigurasikan server web Anda untuk mengirim header CORS yang terbatas dengan setiap respons, sehingga hanya mengizinkan protokol dan domain dasbor:
tr_tr: Web sunucunuzu, her tepki ile sınırlı bir CORS üstbilgisi göndermek üzere yapılandırın ve yalnızca panel alan adına ve protokolüne izin verin:

source: Configuring Federation
de: Föderation konfigurieren
tr_tr: Federasyonu Yapılandırma

source: Configuring Identity service for Federation
de: Konfigurieren des Identitätsdienstes für Föderation
tr_tr: Federasyon için kimlik hizmetini yapılandırma

source: Configuring TLS servers for perfect forward secrecy requires careful planning around key size, session IDs, and session tickets. In addition, for multi-server deployments, shared state is also an important consideration. The example configurations for Apache and :term:`Nginx` above disable the session tickets options to help mitigate some of these concerns. Real-world deployments may desire to enable this feature for improved performance. This can be done securely, but would require special consideration around key management. Such configurations are beyond the scope of this guide. We suggest reading `How to botch TLS forward secrecy by ImperialViolet <https://www.imperialviolet.org/2013/06/27/botchingpfs.html>`_ as a starting place for understanding the problem space.
de: Das Konfigurieren von TLS-Servern für eine perfect forward secrecy erfordert eine sorgfältige Planung um Schlüsselgröße, Sitzungs-IDs und Session-Tickets. Darüber hinaus ist für Share-Server-Implementierungen der Shared State auch eine wichtige Überlegung. Die Beispielkonfigurationen für Apache und :term:`Nginx` oben deaktivieren die Session-Ticket-Optionen, um dazu beizutragen, einige dieser Bedenken zu mildern. Real-world-Implementierungen können diese Funktion für eine verbesserte Leistung ermöglichen. Dies kann sicher erfolgen, würde aber eine besondere Berücksichtigung der Schlüsselverwaltung erfordern. Solche Konfigurationen gehen über den Rahmen dieses Leitfadens hinaus. Wir schlagen vor, wie man das TLS-Geheimnis von ImperialViolet verletzen kann <https://www.imperialviolet.org/2013/06/27/botchingpfs.html>`_ als Ausgangspunkt für das Verständnis des Problemraums.
id: Mengkonfigurasi server TLS untuk kerahasiaan baik yang sempurna memerlukan perencanaan yang hati-hati seputar ukuran kunci, ID sesi, dan tiket sesi. Selain itu, untuk penyebaran multi-server, shared state (keadaan berbagi) juga merupakan pertimbangan penting. Contoh konfigurasi untuk Apache dan :term:`Nginx` di atas menonaktifkan pilihan tiket sesi untuk membantu mengurangi beberapa masalah ini. Penyebaran dunia nyata mungkin ingin mengaktifkan fitur ini untuk meningkatkan kinerja. Hal ini dapat dilakukan dengan aman, namun memerlukan pertimbangan khusus seputar manajemen kunci. Konfigurasi seperti itu berada di luar jangkauan panduan ini. Kami menyarankan untuk membaca `How to botch TLS forward secrecy by ImperialViolet <https://www.imperialviolet.org/2013/06/27/botchingpfs.html>`_ sebagai tempat awal untuk memahami masalah ruang.
tr_tr: Kusursuz iletme gizliliği için TLS sunucularını yapılandırmak, anahtar boyutu, oturum kimlikleri ve oturum biletleri etrafında dikkatli bir planlama yapmayı gerektirir. Buna ek olarak, çoklu sunucu dağıtımları için paylaşılan durum da önemli bir husustur. Yukarıdaki Apache ve :term:`Nginx` için örnek yapılandırmalar bu kaygılardan bazılarını hafifletmek için oturum biletleri seçeneklerini devre dışı bırakır. Gerçek dünya dağıtımları, bu özelliği gelişmiş performans için etkinleştirmek isteyebilir. Bu güvenli bir şekilde yapılabilir, ancak anahtar yönetim konusunda özel bir dikkat gerektirir. Bu yapılandırmalar bu kılavuzun kapsamı dışındadır. Sorun alanı anlayabilmek için `ImperialViolet tarafından TLS ileri gizliliğini nasıl küçümseneceğinizi <https://www.imperialviolet.org/2013/06/27/botchingpfs.html>`_ okumanızı öneririz.

source: Consider the supportability of the hardware on which the software will run. Additionally, consider the additional features available in the hardware and how those features are supported by the software you choose.
de: Betrachten Sie die Unterstützung der Hardware, auf der die Software läuft. Darüber hinaus betrachten die zusätzlichen Funktionen in der Hardware und wie diese Features von der Software, die Sie wählen unterstützt werden.
id: Pertimbangkan dukungan perangkat keras yang akan dijalankan perangkat lunak. Selain itu, pertimbangkan fitur tambahan yang tersedia di perangkat keras dan bagaimana fitur tersebut didukung oleh perangkat lunak yang Anda pilih.
tr_tr: Yazılımın çalışacağı donanımın desteklenebilirliğini düşünün. Ayrıca, donanımda bulunan ek özellikleri ve bu özelliklerin seçtiğiniz yazılım tarafından nasıl desteklendiğini göz önünde bulundurun.

source: Considered by this guide as the most capable adversary. Intelligence services and other state actors can bring tremendous resources to bear on a target. They have capabilities beyond that of any other actor. It is very difficult to defend against these actors without incredibly stringent controls in place, both human and technical.
de: Von diesem Guide als der fähigste Gegner betrachtet. Intelligenzdienste und andere staatliche Akteure können enorme Ressourcen auf ein Ziel bringen. Sie haben Fähigkeiten jenseits eines anderen Akteurs. Es ist sehr schwierig, sich gegen diese Akteure ohne unglaublich strenge Kontrollen zu verteidigen, sowohl menschliche als auch technische.
id: Dianggap oleh panduan ini sebagai musuh yang paling cakap. Layanan intelijen (intelligence service) dan aktor negara lainnya dapat membawa sumber daya yang luar biasa untuk menghasilkan target. Mereka memiliki kemampuan di luar kemampuan aktor lainnya. Sangat sulit untuk mempertahankan diri terhadap aktor-aktor ini tanpa kontrol yang sangat ketat, baik manusia maupun teknis.
tr_tr: Bu rehber tarafından en yetenekli düşman olarak görülüyor. İstihbarat servisleri ve diğer devlet aktörleri bir hedef üzerinde muazzam miktarda kaynak getirebilir. Diğer aktörlerin yeteneklerinin ötesinde yeteneklere sahipler. Hem insan hem de teknik olarak inanılmaz sıkı denetimler yapılmaksızın bu aktörlere karşı savunma yapmak çok zordur.

source: Container service
de: Container-Dienst
id: Layanan Container
tr_tr: Kapsayıcı servisi

source: Contains information about a user as provided by an IdP. It is an indication that a user has been authenticated.
de: Enthält Informationen über einen Benutzer, wie er von einem IdP bereitgestellt wird. Es ist ein Hinweis darauf, dass ein Benutzer authentifiziert wurde.
tr_tr: IdP tarafından sağlanan bir kullanıcı hakkında bilgi içerir. Bu, bir kullanıcının kimlik doğrulamasının yapıldığının bir göstergesidir.

source: Contains information that dictates which Mapping rules to use for an incoming request made by an IdP. An IdP may support multiple protocols. There are three major protocols for :term:`federated identity`: OpenID, SAML, and OAuth.
de: Enthält Informationen, die diktieren, welche Mapping-Regeln für eine eingehende Anfrage von einem IdP verwendet werden sollen. Ein IdP kann mehrere Protokolle unterstützen. Es gibt drei Hauptprotokolle für: Begriff: "föderierte Identität": OpenID, SAML und OAuth.
tr_tr: Bir IdP tarafından gelen bir istek için hangi Eşleştirme kurallarının kullanılacağını belirten bilgiler içerir. Bir IdP, birden fazla protokolü destekleyebilir. Şu üç ana protokol vardır :term:`federe kimlik`: OpenID, SAML ve OAuth.

source: Contents
de: Inhalt
id: Isi
tr_tr: İçerik

source: Context
de: Kontext
tr_tr: Bağlam

source: Continuous systems management
de: Kontinuierliches Systemmanagement
id: Manajemen sistem kontinu
tr_tr: Sürekli sistem yönetimi

source: Control plane
de: Steuerebene
tr_tr: Denetim Paneli

source: Control selection:
de: Kontrollauswahl:
id: Pilihan kontrol:
tr_tr: Kontrol seçimi:

source: Controller network access to clusters
de: Controller-Netzwerkzugriff auf Cluster
id: Akses jaringan pengontrol ke cluster
tr_tr: Denetleyicinin, kümelere ağ erişimi

source: Copy the ``httpd/wsgi-keystone.conf`` file to the appropriate location for your Apache server, for example, ``/etc/httpd/conf.d/wsgi-keystone.conf`` file.
de: Kopieren der ``httpd/wsgi-keystone.conf`` Datei an die entsprechende Stelle für Ihren Apache Server, z.B. ``/etc/httpd/conf.d/wsgi- keystone.conf``Datei.
tr_tr: ``httpd/wsgi-keystone.conf`` dosyasını Apache sunuunuzun uygun konumuna kopyalayın, örneğin, ``/etc/httpd/conf.d/wsgi-keystone.conf``.

source: Core Root of Trust Measurement (CRTM), BIOS code, Host platform extensions
de: Core Root of Trust Measurement (CRTM), BIOS-Code, Host-Plattform-Erweiterungen
tr_tr: Güven Ölçümünün Çekirdek Kökü (CRTM), BIOS kodu, Sunucu platformu uzantıları

source: Create Identity groups and assign roles.
de: Identitätsgruppen erstellen und Rollen zuordnen.
tr_tr: Kimlik grupları oluşturun ve rol atayın.

source: Create a VM:
de: Erstellen einer VM:
id: Buat VM:
tr_tr: Sanal Makine oluştur:

source: Create a new region for the :term:`service provider`, for example, create a new region with an ``ID`` of BETA, and ``URL`` of https://beta.com/Shibboleth.sso/SAML2/POST. This URL will be used when creating a :term:`SAML assertion` for BETA, and signed by the current keystone Identity Provider.
de: Erstellen Sie eine neue Region für :term:`service provider`, z.B. eine neue Region mit einer` `ID``von BETA und` `URL``von https://beta.com/Shibboleth.sso/SAML2/POST. Diese URL wird beim Erstellen eines :term:`SAML assertion` für BETA verwendet und von dem aktuellen Keystone Identity Provider signiert.
tr_tr: :term:`servis sağlayıcı` için yeni bir bölge oluşturun,, örneğin, BETA'nın bir "KIMLIĞI" ve https://beta.com/Shibboleth.sso/ adresinin ``URL`` si olan yeni bir bölge oluşturun SAML2 / POST. Bu URL, BETA için bir :term:`SAML önergesi` oluştururken kullanılır ve geçerli anahtar taşı Kimlik Sağlayıcısı tarafından imzalanır.

source: Create a region for the Service Provider
de: Erstellen Sie eine Region für den Dienstanbieter
tr_tr: Servis Sağlayıcı için bir bölge oluşturun

source: Create an encrypted volume and attach it to your VM:
de: Erstellen Sie ein verschlüsseltes Volume und fügen Sie es Ihrem VM hinzu:
id: Buat volume terenkripsi dan tempelkan ke VM Anda:
tr_tr: Şifrelenmiş hacim oluştur ve sanal makineye bağla:

source: Create and manage security groups through dashboard. The security groups allows L3-L4 packet filtering for security policies to protect virtual machines.
de: Erstellen und Verwalten von Sicherheitsgruppen über Dashboard. Die Sicherheitsgruppen ermöglichen die L3-L4-Paketfilterung für Sicherheitsrichtlinien zum Schutz virtueller Maschinen.
id: Buat dan kelola grup keamanan melalui dasbor. Kelompok keamanan memungkinkan penyaringan paket L3-L4 untuk kebijakan keamanan guna melindungi mesin virtual.
tr_tr: Güvenlik tablolarını kullanarak güvenlik grupları oluşturun ve yönetin. Güvenlik grupları, güvenlik ilkeleri için sanal makineleri korumak için L3-L4 paket filtrelemesine izin verir.

source: Create the Federation extension tables if using the provided SQL back end. For example:
de: Erstellen Sie die Erweiterungstabellen der Föderation, wenn Sie das bereitgestellte SQL-Backend verwenden. Beispielsweise:
tr_tr: SQL arka uç kullanılıyorsa, Federasyon uzantısı tablolarını oluşturun. Örneğin:

source: Create the directory ``/var/www/cgi-bin/keystone/``. Then link the files ``main`` and ``admin`` to the ``keystone.py`` file in this directory.
de: Erstellen Sie das Verzeichnis ``/var/www/cgi-bin/keystone/``. Dann verknüpfen Sie die Dateien ``main`` und ``admin`` mit der ``keystone.py`` Datei in diesem Verzeichnis.
tr_tr: ``/var/www/cgi-bin/keystone/`` dizinini oluşturun. Daha sonra ``main`` ve ``admin`` dosyalarını ``keystone.py`` dosyasına bağlayın.

source: Creating unique database user accounts per OpenStack service endpoint (illustrated below)
de: Erstellen von eindeutigen Datenbankbenutzerkonten pro OpenStack-Dienstendpunkt (siehe unten)
id: Membuat akun pengguna database unik per endpoint layanan OpenStack (diilustrasikan di bawah)
tr_tr: Her OpenStack servis uç noktası için ayrı özel veritabanı kullanıcı hesapları oluşturmak (aşağıda örneklendirilmiştir)

source: Creation and usage of encrypted LVM ephemeral disks (note: At this time OpenStack Compute service only supports encrypting ephemeral disks in the LVM format)
de: Erstellung und Nutzung von verschlüsselten LVM-Ephemer-Festplatten (Hinweis: Zu diesem Zeitpunkt unterstützt der OpenStack Compute-Service nur die Verschlüsselung von kurzlebigen Datenträgern im LVM-Format)
id: Penciptaan dan penggunaan disk fana LVM yang dienkripsi (catatan: Saat ini layanan OpenStack Compute hanya mendukung penyandian disk fana dalam format LVM)
tr_tr: Şifrelenmiş LVM kısa ömürlü disklerin oluşturulması ve kullanımı (Not: Şu anda OpenStack Hesaplama servisi yalnızca kısa ömürlü diskleri LVM formatında şifrelemeyi desteklemektedir)

source: Creation and usage of encrypted volume types, initiated through the dashboard or a command line interface
de: Erstellung und Verwendung von verschlüsselten Datenträgern, die über das Dashboard oder eine Befehlszeilenschnittstelle initiiert werden
id: Penciptaan dan penggunaan tipe volume terenkripsi, dimulai melalui dasbor atau antarmuka command line.
tr_tr: Panel veya bir komut satırı arabirimi aracılığıyla başlatılan şifreli hacim türlerinin oluşturulması ve kullanılması

source: Critical
de: Kritisch
tr_tr: Kritik

source: Critical / high
de: Kritisch/hoch
tr_tr: Kritik / yüksek

source: Crypto plugins store secrets as encrypted blobs within the Barbican database. The plugin is invoked to encrypt the secret on secret storage, and decrypt the secret on secret retrieval. There are two flavors of storage plugins currently available: the Simple Crypto plugin and the PKCS#11 crypto plugin.
de: Crypto-Plugins speichern Geheimnisse als verschlüsselte Blobs innerhalb der Barbican-Datenbank. Das Plugin wird aufgerufen, um das Geheimnis des geheimen Speichers zu verschlüsseln und das Geheimnis beim geheimen Abruf zu entschlüsseln. Derzeit gibt es zwei Varianten von Speicher-Plugins: das Simple Crypto-Plugin und das PKCS # 11-Crypto-Plugin.
id: Plugin Crypto menyimpan rahasia sebagai gumpalan terenkripsi di dalam database Barbican. Plugin ini dipanggil untuk mengenkripsi rahasia pada penyimpanan rahasia, dan mendekripsi rahasia pada pengambilan kembali secara rahasia. Ada dua atribut plugin penyimpanan yang tersedia saat ini: plugin Simple Crypto dan plugin kripto PKCS # 11.

source: Cryptographic algorithms, cipher modes, and protocols
de: Kryptographische Algorithmen, Chiffriermodi und Protokolle
id: Algoritma kriptografi, mode cipher, dan protokol
tr_tr: Kriptografik algoritmalar, şifreleme kipleri, ve protokoller

source: Cryptographic separation of external and internal environments
de: Kryptographische Trennung von externen und internen Umgebungen
id: Pemisahan kriptografi lingkungan eksternal dan internal
tr_tr: Harici ve dahili ortamların kriptografik ayrımı

source: Cryptography standards
de: Kryptographie-Standards
id: Standar kriptografi
tr_tr: Kriptografi standartları

source: Currently, Barbican is the only available back-end for Castellan. There are, however, several back-ends that are being developed, including KMIP, Dogtag, Hashicorp Vault and Custodia. For those deployers who do not wish to deploy Barbican and have relatively simple key management needs, using one of these back-ends could be a viable alternative. What would be lacking though is multi-tenancy and tenant-policy enforcement when retrieving the secrets, as well as any of the extra features mentioned above.
de: Derzeit ist Barbican das einzige verfügbare Back-End für Castellan. Es gibt jedoch mehrere Backends, die entwickelt werden, darunter KMIP, Dogtag, Hashicorp Vault und Custodia. Für diejenigen Bereitsteller, die Barbican nicht einsetzen möchten und relativ einfache Schlüsselmanagement-Anforderungen haben, könnte die Verwendung eines dieser Backends eine gangbare Alternative sein. Was jedoch fehlt, ist die Durchsetzung der Multi-Tenant- und Tenant-Policy beim Abrufen der Geheimnisse sowie aller oben genannten zusätzlichen Merkmale.
id: Saat ini, Barbican adalah satu-satunya back-end yang tersedia untuk Castellan. Namun ada beberapa back-end yang sedang dikembangkan, termasuk KMIP, Dogtag, Hashicorp Vault and Custodia. Bagi para pelaksana yang tidak ingin menerapkan Barbican dan memiliki kebutuhan pengelolaan kunci yang relatif sederhana, gunakan salah satu dari back-end ini bisa menjadi alternatif yang tepat. Bagaimanapun ada yang kurang seperti penegakan tenant-policy dan multi-tenancy ketika mengambil rahasia, serta fitur tambahan yang disebutkan di atas.

source: Currently, Vault and Custodia plugins are being developed for the Queens cycle.
de: Derzeit werden Vault- und Custodia-Plugins für den Queens-Zyklus entwickelt.
id: Saat ini, plugin Vault dan Custodia sedang dikembangkan untuk siklus Queens.

source: Currently, the CLI supports the Enhanced Client or Proxy (ECP), (the non-browser) support for ``keystoneclient`` from an API perspective. So, if you are using the ``keystoneclient``, you can create a client instance and use the SAML authorization plugin. There is no support for dashboard available presently. With the upcoming OpenStack releases, Federated Identity should be supported with both CLI and the dashboard.
de: Derzeit unterstützt die CLI den erweiterten Client oder Proxy (ECP), (die Nicht-Browser) Unterstützung für ``keystoneclient``aus einer API- Perspektive. Also, wenn Sie den ``keystoneclient``benutzt haben, können Sie eine Clientinstanz erstellen und das SAML Autorisierungs-Plugin verwenden. Es steht noch keine Unterstützung für Dashboard zur Verfügung. Mit den kommenden OpenStack-Releases sollte Federated Identity sowohl mit CLI als auch mit dem Dashboard unterstützt werden.
tr_tr: Şu anda CLI, API perspektifinden ``keystoneclient`` için Geliştirilmiş İstemci veya Vekil (ECP) (tarayıcı dışı) desteğini desteklemektedir. Yani, ``keystoneclient`` kullanıyorsanız, bir müşteri örneği oluşturabilir ve SAML yetkilendirme eklentisini kullanabilirsiniz. Şu anda panel desteklenmiyor. Yakında çıkacak olan OpenStack yayınları ile Federe Kimlik hem CLI hem de paneli ile destekleyecektir.

source: Custom criteria
de: Benutzerdefinierte Kriterien
id: Kriteria khusus
tr_tr: Özel kriter

source: Custom network topologies
de: Benutzerdefinierte Netzwerk-Topologien
id: Topologi jaringan kustom
tr_tr: Özel ağ topolojileri

source: DEB packages:
de: DEB-Pakete:
tr_tr: DEB paketleri:

source: DNS services
de: DNS-Dienste
tr_tr: DNS servisleri

source: Dashboard indication of volume encryption status. Includes indication that a volume is encrypted, and includes the encryption parameters such as algorithm and key size
de: Dashboard-Anzeige des Volume-Verschlüsselungsstatus. Enthält die Angabe, dass ein Volume verschlüsselt ist und die Verschlüsselungsparameter wie Algorithmus und Schlüsselgröße enthält
id: Indikasi status enkripsi volume Dashboard. Termasuk indikasi bahwa volume dienkripsi, dan termasuk parameter enkripsi seperti algoritma dan ukuran kunci
tr_tr: Hacim seviyesi şifreleme durumunun Panel göstergesi. Bir hacimin şifrelendiği ve şifre ve anahtar boyutu gibi şifreleme parametrelerini içerir
