Repository: openstack/security-doc
Catalog: security-guide/source/locale/*/LC_MESSAGES/security-guide.po
Languages: de, id, tr_tr

source: Comprehensive privacy management requires significant preparation, thought and investment. Additional complications are introduced when building global OpenStack clouds, for example navigating the differences between U.S. and more restrictive E.U. privacy laws. In addition, extra care needs to be taken when dealing with sensitive PII that may include information such as credit card numbers or medical records. This sensitive data is not only subject to privacy laws but also regulatory and governmental regulations. By deferring to established best practices, including those published by governments, a holistic privacy management policy may be created and practiced for OpenStack deployments.
de: Umfassende Privatsphäre-Management erfordert erhebliche Vorbereitung, Gedanken und Investitionen. Zusätzliche Komplikationen werden beim Aufbau globaler OpenStack-Clouds eingeführt, zum Beispiel die Unterschiede zwischen den USA und den restriktiveren EU-Datenschutzgesetzen. Darüber hinaus ist besondere Sorgfalt bei der Behandlung mit sensiblen PII, die Informationen wie Kreditkartennummern oder medizinische Aufzeichnungen enthalten können genommen werden. Diese sensiblen Daten unterliegen nicht nur den Datenschutzbestimmungen, sondern auch den regulatorischen und staatlichen Vorschriften. Durch die Verschiebung zu etablierten Best Practices, einschließlich der von Regierungen veröffentlichten, kann eine ganzheitliche Datenschutzrichtlinie für OpenStack-Implementierungen erstellt und praktiziert werden.
id: Manajemen privasi yang komprehensif memerlukan persiapan, pemikiran dan investasi yang signifikan. Komplikasi tambahan diperkenalkan saat membangun awan OpenStack global, misalnya menavigasi perbedaan hukum privasi antara A.S. dan E.U yang lebih ketat. Selain itu, perhatian ekstra perlu dilakukan saat menangani PII sensitif yang mungkin mencakup informasi seperti nomor kartu kredit atau catatan medis. Data sensitif ini tidak hanya tunduk pada hukum privasi tapi juga regulasi dan peraturan pemerintah. Dengan menunda praktik terbaik yang telah ditetapkan, termasuk yang dipublikasikan oleh pemerintah, kebijakan pengelolaan privasi holistik dapat dibuat dan dipraktekkan untuk penerapan OpenStack.
tr_tr: Kapsamlı gizlilik yönetimi, önemli bir hazırlık, düşünce ve yatırım gerektirir. Küresel OpenStack bulutları oluştururken, örneğin ABD ve daha kısıtlayıcı E.U gizlilik kanunları arasındaki farkları belirlemek için ek zorluklar ortaya çıkıyor. Buna ek olarak, kredi kartı numaraları veya tıbbi kayıtlar gibi bilgileri içerebilecek duyarlı bilgilerle uğraşırken ekstra özen gösterilmelidir. Bu hassas veriler yalnızca gizlilik yasalarına değil, aynı zamanda düzenleyici ve resmi düzenlemelere de tabidir. Hükümetler tarafından yayınlananlar da dahil olmak üzere kurulu en iyi uygulamalara uymak, OpenStack dağıtımları için bütüncül bir gizlilik yönetimi politikası oluşturulabilir ve uygulanabilir.

source: Compute API SSL endpoint in Apache, which you must pair with a short WSGI script.
de: Compute API-SSL-Endpunkt in Apache, den Sie mit einem kurzen WSGI-Skript paaren müssen.
id: Komputasi endpoint SSL API di Apache, yang harus Anda pasangkan dengan skrip WSGI singkat.
tr_tr: Kısa bir WSGI betiği ile eşleştirmeniz gereken Apache'deki Hesaplama API'si SSL uç noktası.

source: Compute API endpoints
de: Compute API-Endpunkte
tr_tr: Hesaplama API uç noktaları

source: Compute instance ephemeral filesystem storage
de: Compute Instanz ephemeren Dateisystemspeicher
id: Komputasi instance penyimpanan filesystem fana
tr_tr: Hesaplama örneği geçici dosya sistemi depolaması

source: Compute instance ephemeral storage
de: Compute Instanz kurzlebiger Speicher
id: Komputasi instance penyimpanan sementara
tr_tr: Hesaplama örneği geçici deplama

source: Compute instance memory
de: Compute-Instanzspeicher
id: Komputasi memori instance
tr_tr: Hesaplama örneği belleği

source: Compute instances store and retrieve block storage via industry-standard storage protocols such as iSCSI, ATA over Ethernet, or Fibre-Channel. These resources are managed and configured via OpenStack native standard HTTP RESTful API. For more details on the API see the `OpenStack Block Storage documentation <http://developer.openstack.org/api-ref-blockstorage-v2.html>`__.
de: Compute Instanzen können Blockspeicher über branchenübliche Speicherprotokolle wie iSCSI, ATA über Ethernet oder Fibre Channel speichern und abrufen. Diese Ressourcen werden über OpenStack native Standard HTTP RESTful API verwaltet und konfiguriert. Weitere Informationen zur API finden Sie in der `OpenStack Block Storage Dokumentation <http://developer.openstack.org/api-ref-blockstorage-v2.html>`__.

source: Compute security is critical for an OpenStack deployment. Hardening techniques should include support for strong instance isolation, secure communication between Compute sub-components, and resiliency of public-facing API endpoints.
de: Die Sicherheit von Compute ist für eine OpenStack-Implementierung entscheidend. Härtungstechniken sollten Unterstützung für eine starke Instanzisolation, eine sichere Kommunikation zwischen Compute-Subkomponenten und eine Resilienz von öffentlich zugänglichen API-Endpunkten beinhalten.
id: Keamanan Compute sangat penting untuk pengerahan OpenStack. Teknik pengerasan (hardening) harus mencakup dukungan untuk isolasi instance yang kuat, komunikasi yang aman antara sub-komponen Compute, dan ketahanan endpoint API yang dihadapi publik.

source: Compute soft delete feature
de: Funktion Compute Soft-Delete
id: Komputasi fitur penghapusan soft
tr_tr: Hesaplama yumuşak silme özelliği

source: Compute, storage, or other resource nodes
de: Compute, storage, oder andere Ressourcenknoten
id: Compute, storage, atau node sumber daya lainnya
tr_tr: Hesaplama, depolama ya da diğer kaynak düğümleri

source: Computer Security Resource Centre. Guide to Security for Full Virtualization Technologies. 2011. `http://csrc.nist.gov/publications/nistpubs/800-125/SP800-125-final.pdf <http://csrc.nist.gov/publications/nistpubs/800-125/SP800-125-final.pdf>`_
de: Computer Security Resource Center. Leitfaden für Sicherheit für vollständige Virtualisierungstechnologien. 2011. `http://csrc.nist.gov/publications/nistpubs/800-125/SP800-125-final.pdf <http://csrc.nist.gov/publications/nistpubs/800-125/SP800-125-final.pdf>`_
tr_tr: Bilgisayar güvenlik kaynak merkezi. Tam Sanallaştırma Teknolojileri Güvenliği Rehberi. `http://csrc.nist.gov/publications/nistpubs/800-125/SP800-125-final.pdf <http://csrc.nist.gov/publications/nistpubs/800-125/SP800-125 -final.pdf>`_

source: Confidentiality Failure Impact: An attacker could add new tasks to the queue which would be executed by workers. User quotas could be exhausted by an attacker. DoS. User would be unable to create genuine secrets.
de: Confidentiality Failure Impact: Ein Angreifer könnte neue Aufgaben der Warteschlange hinzufügen, die von den Workern ausgeführt werden würde. Benutzerkontingente könnten von einem Angreifer ausgeschöpft werden. DOS. Benutzer wäre nicht in der Lage, echte Geheimnisse zu schaffen.
id: Confidentiality Failure Impact: Seorang penyerang bisa menambahkan tugas baru ke antrian yang akan dilakukan oleh pekerja. Kuota pengguna bisa habis oleh penyerang. DoS. Pengguna tidak akan bisa menciptakan rahasia asli.
tr_tr: Gizlilik Başarısızlığı Etkisi: Bir saldırgan, sıraya worker'lar tarafından uygulanacak yeni görevler ekleyebilir. Kullanıcı kotaları bir saldırgan tarafından tüketilebilir. DoS. Kullanıcı gerçek sırları oluşturamaz.

source: Confidentially Failure Impact: A malicious user might be able to abuse other OpenStack services (depending on keystone role configurations) but barbican is unaffected. If the service account for token validation also has barbican admin privileges, then a malicious user could manipulate barbican admin functions.
de: Confidentially Failure Impact: Ein böswilliger Benutzer könnte andere OpenStack-Dienste missbrauchen (abhängig von Keystone-Rollenkonfigurationen), aber barbican ist unberührt. Wenn das Dienstkonto für Token-Validierung auch barbican Admin-Privilegien hat, dann könnte ein böswilliger Benutzer barbican admin-Funktionen manipulieren.
id: Confidentially Failure Impact: Pengguna jahat mungkin dapat menyalahgunakan layanan OpenStack lainnya (tergantung pada konfigurasi peran keystone) namun barbican tidak terpengaruh. Jika akun layanan untuk validasi token juga memiliki hak adminican admin, maka pengguna jahat dapat memanipulasi fungsi admin barbican.
tr_tr: Gizlilik Başarısızlığı Etkisi: Kötü niyetli bir kullanıcı diğer OpenStack servislerini kötüye kullanabilir (keystone rolü yapılandırmalarına bağlı olarak) ancak barbican etkilenmez. Belirteç onaylaması için servis hesabı aynı zamanda barbican yönetici ayrıcalıklarına sahipse, kötü niyetli bir kullanıcı barbican yönetim işlevlerini değiştirebilir.

source: Configuration and hardening
de: Konfiguration und Hardening
id: Konfigurasi dan pengerasan
tr_tr: Yapılandırma ve sıkılaştırma

source: Configuration example #1: (MySQL)
de: Konfigurationsbeispiel #1: (MySQL)
tr_tr: Yapılandırma örneği #1: (MySQL)

source: Configuration example #1: nova
de: Konfigurationsbeispiel #1: nova
id: Contoh konfigurasi #1: nova
tr_tr: Yapılandırma örneği #1: nova

source: Configuration example #2: (PostgreSQL)
de: Konfigurationsbeispiel #2: (PostgreSQL)
tr_tr: Yapılandırma örneği #2: (PostgreSQL)

source: Configuration example #2: cinder
de: Konfigurationsbeispiel #2: cinder
id: Contoh konfigurasi #2: cinder
tr_tr: Yapılandırma örneği #2: cinder

source: Configuration files contain critical parameters and information required for smooth functioning of the component. If an unprivileged user, either intentionally or accidentally modifies or deletes any of the parameters or the file itself then it would cause severe availability issues causing a denial of service to the other end users. Thus user and group ownership of such critical configuration files must be set to that component owner.
de: Konfigurationsdateien enthalten kritische Parameter und Informationen, die für ein reibungsloses Funktionieren der Komponente erforderlich sind. Wenn ein unprivilegierter Benutzer entweder vorsätzlich oder versehentlich irgendwelche Parameter oder die Datei selbst verändert oder löscht, dann würde es zu schweren Verfügbarkeitsproblemen führen, die den anderen Endbenutzern eine Denial-of-Service verursachen. Somit muss Benutzer- und Gruppeneigentum für solche kritischen Konfigurationsdateien auf diesen Komponenteneigentümer gesetzt sein.

source: Configuration files contain critical parameters and information required for smooth functioning of the component. If an unprivileged user, either intentionally or accidentally modifies or deletes any of the parameters or the file itself then it would cause severe availability issues causing a denial of service to the other end users. Thus user ownership of such critical configuration files must be set to root and group ownership must be set to horizon.
de: Konfigurationsdateien enthalten kritische Parameter und Informationen, die für ein reibungsloses Funktionieren der Komponente erforderlich sind. Wenn ein unprivilegierter Benutzer entweder vorsätzlich oder versehentlich irgendwelche Parameter oder die Datei selbst verändert oder löscht, dann würde es zu schweren Verfügbarkeitsproblemen führen, die den anderen Endbenutzern eine Denial-of-Service verursachen. So muss das Benutzereigentum an solchen kritischen Konfigurationsdateien auf root gesetzt sein und die Gruppeneigentümer müssen auf den horizon gesetzt sein.
id: File konfigurasi berisi parameter dan informasi penting yang diperlukan untuk kelancaran fungsi komponen. Jika pengguna yang tidak berpengalaman, baik sengaja atau tanpa sengaja memodifikasi atau menghapus parameter atau file itu sendiri maka akan menyebabkan masalah ketersediaan yang menyebabkan penolakan layanan kepada end user lainnya. Dengan demikian kepemilikan pengguna terhadap file konfigurasi kritis tersebut harus disetel ke kepemilikan root dan grup harus disetel ke horizon.
tr_tr: Yapılandırma dosyaları, bileşenin düzgün çalışması için gereken kritik parametreleri ve bilgileri içerir. İzinsiz bir kullanıcı ya kasıtlı olarak veya yanlışlıkla herhangi bir parametreyi veya dosyayı değiştirirse veya silerse, diğer son kullanıcılara hizmet reddine neden olan ciddi kullanılabilirlik sorunlarına neden olur. Böylece, bu kritik yapılandırma dosyalarının kullanıcı sahipliği root olarak ayarlanmalı ve grup sahipliği horizon olarak ayarlanmalıdır.

source: Configuration files contain critical parameters and information required for smooth functioning of the component. If an unprivileged user, either intentionally or accidentally modifies or deletes any of the parameters or the file itself then it would cause severe availability issues causing a denial of service to the other end users. Thus user ownership of such critical configuration files must be set to root and group ownership must be set to neutron.
de: Konfigurationsdateien enthalten kritische Parameter und Informationen, die für ein reibungsloses Funktionieren der Komponente erforderlich sind. Wenn ein unprivilegierter Benutzer entweder vorsätzlich oder versehentlich irgendwelche Parameter oder die Datei selbst verändert oder löscht, dann würde es zu schweren Verfügbarkeitsproblemen führen, die den anderen Endbenutzern eine Denial-of-Service verursachen. So muss das Benutzereigentum an solchen kritischen Konfigurationsdateien auf root gesetzt sein und das Gruppeneigentum muss auf neutron gesetzt sein.

source: Configuration files contain critical parameters and information required for smooth functioning of the component. If an unprivileged user, either intentionally or accidentally, modifies or deletes any of the parameters or the file itself then it would cause severe availability issues causing a denial of service to the other end users. User ownership of such critical configuration files must be set to ``root`` and group ownership must be set to ``nova``.
de: Konfigurationsdateien enthalten kritische Parameter und Informationen, die für ein reibungsloses Funktionieren der Komponente erforderlich sind. Wenn ein unprivilegierter Benutzer entweder vorsätzlich oder versehentlich irgendwelche der Parameter oder die Datei selbst ändert oder löscht, dann würde es zu schweren Verfügbarkeitsproblemen führen, die eine Verweigerung des Dienstes für die anderen Endbenutzer verursachen. Die Eigentumsrechte an solchen kritischen Konfigurationsdateien müssen auf ``root` gesetzt sein und das Gruppeneigentum muss auf ``nova` gesetzt sein.

source: Configuration files contain critical parameters and information required for smooth functioning of the component. If an unprivileged user, either intentionally or accidentally, modifies or deletes any of the parameters or the file itself then it would cause severe availability issues resulting in a denial of service to the other end users. Therefore, user ownership of such critical configuration files must be set to ``root`` and group ownership must be set to ``glance``.
de: Konfigurationsdateien enthalten kritische Parameter und Informationen, die für ein reibungsloses Funktionieren der Komponente erforderlich sind. Wenn ein unprivilegierter Benutzer entweder vorsätzlich oder versehentlich irgendwelche der Parameter oder die Datei selbst ändert oder löscht, dann würde es zu schweren Verfügbarkeitsproblemen kommen, was zu einer Denial-of- Service für die anderen Endbenutzer führt. Daher muss das Benutzereigentum an solchen kritischen Konfigurationsdateien auf ``root` gesetzt sein und das Gruppeneigentum muss auf ``glance`` gesetzt sein.

source: Configuration files contain critical parameters and information required for smooth functioning of the component. If an unprivileged user, either intentionally or accidentally, modifies or deletes any of the parameters or the file itself then it would cause severe availability issues resulting in a denial of service to the other end users. Thus user ownership of such critical configuration files must be set to root and group ownership must be set to cinder.
de: Konfigurationsdateien enthalten kritische Parameter und Informationen, die für ein reibungsloses Funktionieren der Komponente erforderlich sind. Wenn ein unprivilegierter Benutzer entweder vorsätzlich oder versehentlich irgendwelche der Parameter oder die Datei selbst ändert oder löscht, dann würde es zu schweren Verfügbarkeitsproblemen führen, was zu einer Denial-of-Service für die anderen Endbenutzer führt. So muss der Eigentümer von solchen kritischen Konfigurationsdateien auf root gesetzt werden und Gruppeneigentum muss auf cinder gesetzt sein.

source: Configuration files contain critical parameters and information required for smooth functioning of the component. If an unprivileged user, either intentionally or accidentally, modifies or deletes any of the parameters or the file itself then it would cause severe availability issues resulting in a denial of service to the other end users. Thus user ownership of such critical configuration files must be set to root and group ownership must be set to manila.
de: Konfigurationsdateien enthalten kritische Parameter und Informationen, die für ein reibungsloses Funktionieren der Komponente erforderlich sind. Wenn ein unprivilegierter Benutzer entweder vorsätzlich oder versehentlich irgendwelche der Parameter oder die Datei selbst ändert oder löscht, dann würde es zu schweren Verfügbarkeitsproblemen führen, was zu einer Denial-of-Service für die anderen Endbenutzer führt. So muss der Benutzer Besitz von solchen kritischen Konfigurationsdateien auf root gesetzt werden und Gruppeneigentum muss auf manila gesetzt werden.

source: Configuration files contain critical parameters and information required for smooth functioning of the component. If an unprivileged user, either intentionally or accidentally, modifies or deletes any of the parameters or the file itself then it would cause severe availability issues resulting in a denial of service to the other end users. User ownership of such critical configuration files must be set to root and group ownership must be set to barbican.
de: Konfigurationsdateien enthalten kritische Parameter und Informationen, die für eine reibungslose Funktion der Komponente erforderlich sind. Wenn ein unprivilegierter Benutzer absichtlich oder zufällig einen der Parameter oder die Datei selbst modifiziert oder löscht, würde dies zu schwerwiegenden Verfügbarkeitsproblemen führen, die zu einer Denial-of-Service-Funktion für die anderen Endbenutzer führen würden. Der Besitz von Benutzern für solche kritischen Konfigurationsdateien muss auf root festgelegt werden, und die Gruppenzugehörigkeit muss auf barbican gesetzt werden.

source: Configuration management
de: Konfigurationsmanagement
id: Manajemen konfigurasi
tr_tr: Yapılandırma yönetimi

source: Configuration management and security auditing tools will introduce another layer of complexity into the cloud. This complexity brings additional security concerns with it. We view this as an acceptable risk trade-off, given their security benefits. Securing the operational use of these tools is beyond the scope of this guide.
de: Konfigurationsmanagement und Security Auditing Tools werden eine weitere Schicht von Komplexität in die Cloud einführen. Diese Komplexität bringt zusätzliche Sicherheitsbedenken mit sich. Wir sehen dies als einen akzeptablen Risiko-Kompromiss, da ihre Sicherheitsvorteile. Die Sicherung der betrieblichen Nutzung dieser Werkzeuge geht über den Rahmen dieses Leitfadens hinaus.
id: Alat manajemen konfigurasi dan keamanan audit akan mengenalkan lapisan kompleksitas lain ke dalam awan. Kompleksitas ini membawa masalah keamanan tambahan dengannya. Kami menganggap ini sebagai trade-off risiko yang dapat diterima, mengingat manfaat keamanan mereka. Mengamankan penggunaan operasional alat ini berada di luar cakupan panduan ini.
tr_tr: Yapılandırma yönetimi ve güvenlik denetim araçları, bulut içine başka bir karmaşıklık katmanı sunacak. Bu karmaşıklık, bununla birlikte ek güvenlik kaygıları getiriyor. Bunları, güvenlik avantajları göz önüne alındığında, kabul edilebilir bir risk dengelemesi olarak görüyoruz. Bu araçların operasyonel kullanımını sağlamak bu kılavuzun kapsamı dışındadır.

source: Configuration options
de: Konfigurationsoptionen
tr_tr: Yapılandırma seçenekleri

source: Configure Apache to use a Federation capable authentication method.
de: Konfigurieren Sie Apache, um eine föderationsfähige Authentifizierungsmethode zu verwenden.
tr_tr: Apache'yi Federasyona uyumlu bir kimlik doğrulama yöntemi kullanacak şekilde yapılandırın.

source: Configure HTTP requests to the dashboard domain to redirect to the fully qualified HTTPS URL.
de: Konfigurieren Sie HTTP-Anfragen an die Dashboard-Domäne, um die vollständig qualifizierte HTTPS-URL umzuleiten.
id: Konfigurasikan permintaan HTTP ke domain dasbor untuk mengalihkan ke URL HTTPS yang memenuhi syarat.
tr_tr: Panel'e gelen HTTP isteklerini, tam HTTPS URL'lerine yönlendirecek şekilde yapılandırın.

source: Configure applications for internal URLs
de: Konfigurieren von Anwendungen für interne URLs
id: Konfigurasikan aplikasi untuk URL internal
tr_tr: İç URL'ler için uygulamaları yapılandırın

source: Configure internal URLs in the Identity service catalog
de: Konfigurieren Sie interne URLs im Identity Service Katalog
id: Konfigurasikan URL internal dalam katalog layanan Identitas
tr_tr: İç URL'leri kimlik servis kataloğunda yapılandır

source: Configure the Identity service virtual host and adjust the config to properly handle SAML2 workflow.
de: Konfigurieren Sie den virtuellen Host des Identity-Dienstes und passen Sie die config an, um den SAML2-Workflow ordnungsgemäß zu behandeln.
tr_tr: Kimlik hizmeti sanal konuğu yapılandırın ve yapılandırmayı, SAML2 iş akışını düzgün şekilde işleyecek şekilde ayarlayın.
