Repository: openstack/security-doc
Catalog: security-guide/source/locale/*/LC_MESSAGES/security-guide.po
Languages: de, id, tr_tr

source: In this chapter we will call out general best practice around Compute security as well as specific known configurations that can lead to security issues. The ``nova.conf`` file and the ``/var/lib/nova`` locations should be secured. Controls like centralized logging, the ``policy.json`` file, and a mandatory access control framework should be implemented.
de: In diesem Kapitel werden wir allgemeine bewährte Verfahren rund um Compute- Sicherheit sowie spezifische bekannte Konfigurationen aufrufen, die zu Sicherheitsfragen führen können. Die ``nova.conf``Datei und die ``/var/ lib/nova``Orte sollten gesichert werden. Kontrollen wie zentrale Protokollierung, die ``policy.json``Datei und ein obligatorisches Zugangskontrollrahmen sollte implementiert werden.
id: Dalam bab ini kita akan memanggil praktik umum terbaik seputar keamanan Compute dan juga konfigurasi yang diketahui yang dapat menyebabkan masalah keamanan. File ``nova.conf`` dan lokasi ``/var/lib/nova``` harus diamankan. Kontrol seperti logging terpusat, file ``policy.json``, dan kerangka kontrol akses wajib harus diimplementasikan.
tr_tr: Bu bölümde, Hesaplama güvenliği ve güvenlik sorunlarına yol açabilecek bilinen yapılandırmalarda genel en iyi uygulamalara değineceğiz. ``nova.conf`` dosyası ve "/var/lib/nova" konumları güvenli olmalıdır. Merkezi günlük kaydı, ``policy.json`` dosyası ve zorunlu bir erişim kontrolü çatısı gibi kontroller uygulanmalıdır.

source: In this document, we treat community and hybrid similarly, dealing explicitly only with the extremes of public and private clouds from a security perspective. Your security measures depend where your deployment falls upon the private public continuum.
de: Für die Zwecke dieses Dokuments behandeln wir Community und Hybrid in ähnlicher Weise und handeln explizit nur mit den Extremen der öffentlichen und privaten Cloudn aus einer Perspektive der Sicherheit. Ihre Sicherheitsmaßnahmen hängen davon ab, wo Ihr Einsatz auf das private öffentliche Kontinuum fällt.
id: Dalam dokumen ini, kita memperlakukan masyarakat dan hibrida dengan cara yang sama, berurusan secara eksplisit hanya dengan awan publik dan awan ekstrem yang ekstrem dari perspektif keamanan. Langkah keamanan Anda bergantung di tempat penempatan Anda berada di atas rangkaian publik privat.

source: In this example we introduce a scoring matrix that places vulnerabilities in three categories: Privilege Escalation, Denial of Service and Information Disclosure. Understanding the type of vulnerability and where it occurs in your infrastructure will enable you to make reasoned response decisions.
de: In diesem Beispiel stellen wir eine Scoring-Matrix vor, die Schwachstellen in drei Kategorien platziert: Privileg Eskalation, Denial of Service und Information Disclosure. Das Verständnis der Art der Anfälligkeit und wo es in Ihrer Infrastruktur auftritt, ermöglicht es Ihnen, begründete Antwortentscheidungen zu treffen.
id: Dalam contoh ini kami memperkenalkan matriks penilaian yang menempatkan kerentanan dalam tiga kategori: rivilege Escalation, Denial of Service dan Information Disclosure. Memahami jenis kerentanan dan di mana hal itu terjadi di infrastruktur Anda akan memungkinkan Anda membuat keputusan respons beralasan.
tr_tr: Bu örnekte güvenlik açıklarını üç kategoriye yerleştiren bir puanlama matrisi sunuyoruz: İmtiyaz Artışı, Hizmet Reddi ve Bilginin Açığa Çıkması. Güvenlik açığının türünü ve altyapınızda nerede olduğunu anlamak, mantıklı tepki kararları vermenizi sağlayacaktır.

source: In this mode, a driver is able to create share servers and plug them to existing networks. When providing a new share server, drivers expect an IP address and subnet from the Shared File Systems service.
de: In diesem Modus kann ein Treiber Share-Server erstellen und an bestehende Netzwerke anschließen. Bei der Bereitstellung eines neuen Freigabeservers erwarten Treiber eine IP-Adresse und ein Subnetz aus dem Shared File Systems Service.
id: Dalam mode ini, driver mampu membuat share server dan menyambungkannya ke jaringan yang ada. Saat menyediakan server share baru, driver mengharapkan alamat IP dan subnet dari layanan Shared File Systems.
tr_tr: Bu kipte, bir sürücü paylaşım sunucuları oluşturabilir ve bunları mevcut ağlara bağlayabilir. Yeni bir paylaşım sunucusu sunarken, sürücüler Paylaşımlı Dosya Sistemleri servisinden bir IP adresi ve alt ağ bekler.

source: In this mode, a share driver is able to create share servers and plug them to an existing segmented network. Share drivers expect the Shared File Systems service to provide a subnet definition for every new share server. This definition should include segmentation type, segmentation ID, and any other info relevant to the segmentation type.
de: In diesem Modus kann ein Share-Treiber Share-Server erstellen und an ein bestehendes segmentiertes Netzwerk anschließen. Share-Treiber erwarten, dass der Shared File Systems-Dienst eine Subnetzdefinition für jeden neuen Share-Server bereitstellt. Diese Definition sollte Segmentierungstyp, Segmentierungs-ID und alle anderen für den Segmentierungstyp relevanten Informationen enthalten.
id: Dalam mode ini, share driver dapat membuat server berbagi dan menyambungkannya ke jaringan tersegmentasi yang ada. Share driver mengharapkan layanan Shared File Systems untuk menyediakan definisi subnet untuk setiap server berbagi baru. Definisi ini harus mencakup tipe segmentasi, ID segmentasi, dan info lainnya yang relevan dengan tipe segmentasi.
tr_tr: Bu kipte, bir paylaşım sürücüsü paylaşım sunucuları oluşturabilir ve onları mevcut bir bölümlü ağa bağlayabilir. Paylaşım sürücüleri, Paylaşımlı Dosya Sistemleri servisinin her yeni paylaşım sunucusu için bir alt ağ tanımını sağlamasını bekler. Bu tanım bölümleme türü, bölümleme kimliği ve bölümlendirme türüne ilişkin diğer bilgileri içermelidir.

source: In this mode, drivers have basically no network requirements whatsoever. It's assumed that storage controller being managed by the driver has all of the network interfaces it's going to need. The Shared File Systems service will expect the driver to provision shares directly without creating any share server beforehand. This mode corresponds to what some existing drivers are already doing, but it makes the choice explicit for the administrator. In this mode, the share networks are not needed at share creation time and must not be provided.
de: In diesem Modus haben die Treiber grundsätzlich keine Netzwerkanforderungen. Es wird davon ausgegangen, dass der Speichercontroller, der vom Treiber verwaltet wird, alle Netzwerkschnittstellen bereitstellt, die er benötigen wird. Der Shared File Systems-Dienst erwartet, dass der Treiber die Bereitstellung von Freigaben direkt vorsieht, ohne zuvor einen Freigabe-Server zu erstellen. Dieser Modus entspricht dem, was einige vorhandene Treiber bereits machen, aber es macht die Wahl explizit für den Administrator. In diesem Modus werden die Freigaben-Netzwerke nicht zum Zeitpunkt der Erstellung der Freigabe benötigt und dürfen nicht bereitgestellt werden.
id: Dalam mode ini, driver pada dasarnya tidak memiliki persyaratan jaringan sama sekali. Diasumsikan bahwa pengendali penyimpanan yang dikelola oleh driver memiliki semua antarmuka jaringan yang dibutuhkannya. Layanan Shared File Systems akan mengharapkan driver untuk menyediakan share secara langsung tanpa membuat share server terlebih dahulu. Mode ini sesuai dengan beberapa driver yang sudah ada, namun ini membuat pilihan eksplisit bagi administrator. Dalam mode ini, jaringan share tidak diperlukan pada waktu pembuatan share dan tidak boleh disediakan.
tr_tr: Bu kipte, sürücüler temelde hiçbir ağ gereksinimine sahip değillerdir. Sürücü tarafından yönetilen depolama denetleyicisinin, ihtiyaç duyacağı tüm ağ arayüzlerine sahip olduğu kabul edilir. Paylaşımlı Dosya Sistemleri servisi, sürücünün önceden paylaşım sunucusu oluşturmadan doğrudan paylaşım sağlaması beklenir. Bu kip, mevcut bazı sürücülerin zaten yaptıklarına karşılık gelir, ancak seçimi yöneticiye açıkça gösterir. Bu modda, paylaşım ağları paylaşım oluşturma zamanında gerekli değildir ve sağlanmamalıdır.

source: In this mode, some storage controllers can create share servers but due to various limitations of physical or logical network all of share servers have to be on a flat network. In this mode, a share driver needs something to provision IP addresses for share servers, but IPs will all come out of the same subnet and that subnet itself is assumed to be reachable by all tenants.
de: In diesem Modus können einige Speichercontroller geteilte Server erstellen, aber aufgrund verschiedener Einschränkungen des physischen oder logischen Netzwerks müssen alle geteilte Server auf einem flachen Netzwerk sein. In diesem Modus braucht ein Share-Treiber etwas, um IP-Adressen für Share-Server bereitzustellen, aber IPs werden alle aus demselben Subnetz kommen und das Subnetz selbst wird von allen Tenantn als erreichbar angenommen.
id: Dalam mode ini, beberapa controller penyimpanan dapat membuat share server namun karena berbagai keterbatasan jaringan fisik atau logis, semua share server harus berada pada jaringan datar. Dalam mode ini, share driver membutuhkan sesuatu untuk menyediakan alamat IP untuk share serveri, namun semua IP keluar dari subnet yang sama dan subnet itu sendiri diasumsikan dapat dijangkau oleh semua penyewa.
tr_tr: Bu kipte, bazı depolama denetleyicileri paylaşım sunucuları oluşturabilir ancak fiziksel veya mantıksal ağın çeşitli sınırlamaları nedeniyle tüm paylaşım sunucuları düz bir ağ üzerinde olmalıdır. Bu kipte, bir paylaşım sürücüsünün paylaşım sunucuları için IP adresleri hazırlamak için bir şeye ihtiyacı vardır, ancak IP'lerin tümü aynı alt ağdan çıkar ve alt ağın kendisinin de tüm kiracılar tarafından erişilebilir olduğu varsayılır.

source: Incidence response
de: Inzidenzreaktion
id: Respon insiden
tr_tr: Olay yanıtı

source: Independent verification and validation
de: Unabhängige Überprüfung und Validierung
id: Verifikasi dan validasi independen
tr_tr: Bağımsız onaylama ve doğrulama

source: Indirect access
de: Indirekter Zugang
id: Akses tidak langsung
tr_tr: Dolaylı erişim

source: Industry standard security principles provide a baseline for compliance certifications and attestations. If these principles are considered and referenced throughout an OpenStack deployment, certification activities may be simplified.
de: Industriestandard Sicherheitsprinzipien bieten eine Grundlinie für Compliance-Zertifizierungen und Bescheinigungen. Wenn diese Prinzipien in einem OpenStack-Einsatz berücksichtigt und referenziert werden, können Zertifizierungsaktivitäten vereinfacht werden.
id: Prinsip keamanan standar industri memberikan dasar untuk sertifikasi kepatuhan dan pengesahan. Jika prinsip-prinsip ini dipertimbangkan dan dirujuk sepanjang penerapan OpenStack, kegiatan sertifikasi dapat disederhanakan.
tr_tr: Endüstri standardı güvenlik ilkeleri, uyumluluk sertifikaları ve tasdiknameleri için temel sağlar. Bu ilkeler bir OpenStack dağıtımında dikkate alınır ve atıfta bulunulursa, sertifikalandırma faaliyetleri basitleştirilebilir.

source: Information Disclosure vulnerabilities reveal information about your system or operations. These vulnerabilities range from debugging information disclosure, to exposure of critical security data, such as authentication credentials and passwords.
de: Informationen Offenlegung Schwachstellen zeigen Informationen über Ihr System oder Operationen. Diese Schwachstellen reichen von der Offenlegung von Informationen über die Offenlegung von kritischen Sicherheitsdaten wie Authentifizierungsanmeldeinformationen und Passwörtern.
id: Kerentanan Information Disclosurei mengungkapkan informasi tentang sistem atau operasi Anda. Kerentanan ini berkisar dari debugging pengungkapan informasi, hingga pemaparan (exposure) data keamanan penting, seperti kredensial dan kata kunci otentikasi.
tr_tr: Bilginin Açığa Çıkması güvenlik açıkları, sisteminiz veya işlemleriniz hakkında bilgi verir. Bu güvenlik açıkları, bilgi açıklığının hata ayıklamasından, kimlik doğrulama kimlik bilgileri ve parolalar gibi kritik güvenlik verilerinin ortaya çıkmasına kadar değişir.

source: Information disclosure
de: Offenlegung von Informationen
tr_tr: Bilgi ifşası

source: Information on authentication used to connect to that interface
de: Informationen zur Authentifizierung, die für die Verbindung zu dieser Schnittstelle verwendet wird
id: Informasi tentang otentikasi yang digunakan untuk terhubung ke antarmuka itu
tr_tr: Bu arabirime bağlanmak için kullanılan kimlik doğrulama hakkında bilgi

source: Information system security compliance is reliant on the completion of two foundational processes:
de: Die Einhaltung der Sicherheitssysteme des Informationssystems ist auf die Fertigstellung von zwei Grundlagenprozessen angewiesen:
id: Kepatuhan keamanan sistem informasi bergantung pada penyelesaian dua proses dasar:
tr_tr: Bilgi sistemi güvenlik uyumu, iki temel sürecin tamamlanmasına bağlıdır:

source: Infrastructure nodes
de: Infrastrukturknoten
id: Node infrastruktur
tr_tr: Altyapı düğümleri

source: Initial Program Loader (IPL) code. For example, master boot record.
de: Initial Program Loader (IPL) Code. Zum Beispiel Master-Boot-Record.
id: Kode Initial Program Loader (IPL). Contohnya, master boot record.
tr_tr: İlk Program Yükleyici (IPL) kodu. Örneğin, ana önyükleme kaydı.

source: Initially, when creating a share network, you can set up either a network and subnet of the OpenStack Networking (neutron) or a network of Legacy networking (nova-network) services. The third approach is to configure the networking without Legacy networking and Networking services. ``StandaloneNetworkPlugin`` can be used with any network platform. You can set network parameters in its configuration file.
de: Anfänglich können Sie bei der Erstellung eines Share-Netzwerks entweder ein Netzwerk und ein Subnetz des OpenStack Networking (Neutron) oder ein Netzwerk von Legacy Networking (Nova-Netzwerk)-Dienst einrichten. Der dritte Ansatz besteht darin, das Netzwerk ohne Legacy Networking und Networking Services zu konfigurieren. ``StandaloneNetworkPlugin``kann mit jeder Netzwerkplattform verwendet werden. Sie können Netzwerkparameter in der Konfigurationsdatei festlegen.
id: Awalnya, saat membuat jaringan berbagi, Anda dapat mengatur jaringan dan subnet jaringan OpenStack (neutron) atau jaringan layanan Legacy networking (nova-network). Pendekatan ketiga adalah mengkonfigurasi jaringan tanpa layanan Legacy networking dan Networking. `StandaloneNetworkPlugin`` dapat digunakan dengan platform jaringan apapun. Anda dapat mengatur parameter jaringan pada file konfigurasinya.
tr_tr: Başlangıçta, bir paylaşım ağı oluştururken, OpenStack Ağ (neutron) veya Eski Ağ (nova-network) servislerinin bir ağını veya alt ağını kurabilirsiniz. Üçüncü yaklaşım, Ağ'ı Eski ağ ve Ağ servisi olmadan yapılandırmaktır. ``StandaloneNetworkPlugin``, herhangi bir ağ platformuyla kullanılabilir. Ağ parametrelerini ayar dosyasında ayarlayabilirsiniz.

source: Inside The Shared File Systems API, a ``security_service`` is associated with the ``share_networks``.
de: Innerhalb der Shared File Systems API ist ein ``security_service``mit dem ``share_networks`` verbunden.
id: Di dalam File Systems API, sebuah ``security_service`` dikaitkan dengan ``share_networks``.
tr_tr: Paylaşımlı Dosya Sistemleri API'sinde bir ``security_service``, ``share_networks`` ile ilişkilendirilir.

source: Install Shibboleth:
de: Installiere Shibboleth:
tr_tr: Shibboleth Kurulumu:

source: Instance data is copied from the hypervisor to libvirtd.
de: Instanzdaten werden vom Hypervisor auf libvirtd kopiert.
id: Instance data disalin dari hypervisor ke libvirt.
tr_tr: Örnek verileri, hipervizör'den libvirtd'ye kopyalanır.

source: Instance memory scrubbing
de: Instanz-Speicher-Scrubbing
tr_tr: Örnek bellek temizleme

source: Instance migrations
de: Instanzmigrationen
id: Migrasi instance
tr_tr: Örnek göçleri

source: Instance security management
de: Instanzsicherheitsmanagement
id: Manajemen keamanan instance
tr_tr: Örnek güvenlik yönetimi

source: Integrity Failure Impact: barbican and Workers can no longer access the queue. Denial of service.
de: Integrity Failure Impact: barbican und Worker können nicht mehr auf die Warteschlange zugreifen. Denial of Service.
id: Integrity Failure Impact: barbican dan Workers tidak bisa lagi mengakses antrian. Denial of service.
tr_tr: Bütünlük Başarısızlığı Etkisi: barbican ve Worker'lar kuyruğa artık erişemezler. Hizmet reddi.

source: Integrity Failure Impact: barbican will not be able to validate user credentials and fail. DoS.
de: Integrity Failure Impact: barbican wird nicht in der Lage sein, Benutzeranmeldeinformationen zu validieren und fehlschlagen. DOS.
id: Integrity Failure Impact: barbican tidak akan bisa memvalidasi kredensial pengguna dan gagal. DoS.
tr_tr: Bütünlük Başarısızlığı Etkisi: barbican, kullanıcı kimlik bilgilerini doğrulayamaz ve başarısız olur. DoS.

source: Integrity life-cycle
de: Integritätslebenszyklus
id: Integritas siklus hidup
tr_tr: Bütünlük yaşam döngüsü

source: Intel.com, Trusted Compute Pools with Intel Trusted Execution Technology (Intel TXT). `http://www.intel.com/txt <http://www.intel.com/txt>`_
de: Intel.com, Trusted Compute Pools mit Intel Trusted Execution Technologie (Intel TXT). `http://www.intel.com/txt <http://www.intel.com/txt>`_
id: Intel.com, Trusted Compute Pools dengan Intel Trusted Execution Technology (Intel TXT). `http://www.intel.com/txt <http://www.intel.com/txt>`_
tr_tr: Intel.com, Intel Güvenli Çalıştırma Teknolojisi (Intel TXT) ile Güvenli Hesaplama Havuzları. `http://www.intel.com/txt <http://www.intel.com/txt>`_

source: Intelligence services
de: Geheimdienste
tr_tr: İstihbarat servisleri

source: Intended purpose
de: Sinn und Zweck der Sache
id: Intended Purpose (tujuan yang diinginkan)
tr_tr: Hedeflenen amaç

source: Inter-device communication is a serious security concern. Between large project errors, such as Heartbleed, or more advanced attacks such as BEAST and CRIME, secure methods of communication over a network are becoming more important. It should be remembered, however that encryption should be applied as one part of a larger security strategy. The compromise of an endpoint means that an attacker no longer needs to break the encryption used, but is able to view and manipulate messages as they are processed by the system.
de: Inter-Device-Kommunikation ist ein ernstes Sicherheitsrisiko. Zwischen großen Projektfehlern wie Heartbleed oder fortgeschrittenen Angriffen wie BEAST und CRIME werden sichere Kommunikationsmethoden über ein Netzwerk immer wichtiger. Es sollte jedoch daran erinnert werden, dass die Verschlüsselung als ein Teil einer größeren Sicherheitsstrategie angewendet werden sollte. Der Kompromiss eines Endpunktes bedeutet, dass ein Angreifer nicht mehr die verschlüsselte Verschlüsselung brechen muss, sondern in der Lage ist, Nachrichten zu sehen und zu manipulieren, wie sie vom System verarbeitet werden.
id: Komunikasi antar perangkat merupakan masalah keamanan yang serius. Antara kesalahan proyek besar, seperti serangan Heartbleed, atau yang lebih maju seperti BEAST dan CRIME, metode komunikasi yang aman melalui jaringan menjadi lebih penting. Harus diingat, bagaimanapun enkripsi itu harus diterapkan sebagai salah satu bagian dari strategi keamanan yang lebih besar. Kompromi dari endpoint berarti bahwa penyerang tidak lagi perlu memecahkan enkripsi yang digunakan, namun mampu melihat dan memanipulasi pesan saat diproses oleh sistem.
tr_tr: Cihazlar arası iletişim ciddi bir güvenlik kaygısıdır. Heartbleed gibi büyük proje hataları ya da BEAST ve CRIME gibi daha gelişmiş saldırılar arasında bir ağ üzerinden güvenli iletişim yöntemleri daha da önem kazanmaktadır. Şifreleme daha büyük bir güvenlik stratejisinin bir parçası olarak uygulanması gerektiği unutulmamalıdır. Bir uç noktanın güvenlik ihlali, bir saldırganın artık kullanılan şifrelemeyi bozması gerekmediği, ancak mesajları sistem tarafından işledikleri şekliyle görüntüleyebildiği ve işleyebildiği anlamına gelir.

source: Interface with the Key management service through a secure wrapper
de: Schnittstelle mit dem Key Management Service über einen sicheren Wrapper
id: Interface dengan layanan manajemen Key melalui pembungkus yang aman
tr_tr: Güvenli bir sarmalayıcı aracılığıyla Anahtar yönetimi servisiyle arabirim

source: Interfaces
de: Schnittstellen
id: Antarmuka
tr_tr: Arayüzler

source: Internal API communications
de: Interne API-Kommunikation
id: Komunikasi API internal
tr_tr: İç API iletişimi

source: Internal audit
de: Internes Audit
id: Audit internal
tr_tr: Dahili denetim

source: Internally generated private keys for compute image bundling
de: Intern generierte private Schlüssel für Compute Abbildbündelung
id: Private key yang dibuat secara internal untuk komputasi bundling image
tr_tr: Hesaplama imaj paketlemesi için dahili olarak üretilen özel anahtarlar

source: Internally implemented authentication methods
de: Intern implementierte Authentifizierungsmethoden
id: Metode otentikasi yang diimplementasikan secara internal
tr_tr: Dahili olarak uygulanan kimlik doğrulama yöntemleri

source: Introduce privacy considerations specific to OpenStack and cloud environments.
de: Einführung von Datenschutzbestimmungen für OpenStack- und Cloud-Umgebungen.
id: Perkenalkan pertimbangan privasi yang spesifik untuk lingkungan OpenStack dan cloud.
tr_tr: OpenStack ve bulut ortamlarına özgü gizlilik önemini tanıtın.

source: Introduced into the Linux kernel in version 2.6.32, Kernel Samepage Merging (KSM) consolidates identical memory pages between Linux processes. As each guest VM under the KVM hypervisor runs in its own process, KSM can be used to optimize memory use between VMs.
de: Einleitung in den Linux-Kernel in Version 2.6.32, Kernel Samepage Merging (KSM) konsolidiert identische Speicherseiten zwischen Linux-Prozessen. Da jeder Gast VM unter dem KVM-Hypervisor in seinem eigenen Prozess läuft, kann KSM verwendet werden, um den Speicherverbrauch zwischen VMs zu optimieren.
id: Diperkenalkan ke dalam kernel Linux di versi 2.6.32, Kernel Samepage Merging (KSM) mengkonsolidasikan halaman memori identik di antara proses Linux. Karena setiap guest VM di bawah hypervisor KVM berjalan dalam prosesnya sendiri, KSM dapat digunakan untuk mengoptimalkan penggunaan memori di antara VM.
tr_tr: Sürüm 2.6.32'de Linux çekirdeği ile tanıtılan Çekirdek Aynı Sayfa Birleştirme (KSM), Linux işlemleri arasında özdeş hafıza sayfalarını birleştirir. KVM hipervizör altındaki her konuk VM kendi işleminde çalıştığından, KSM VM'ler arasındaki bellek kullanımını optimize etmek için kullanılabilir.

source: Introduction
de: Einführung
id: Pengantar
tr_tr: Giriş

source: Introduction to Data processing
de: Einführung in die Datenverarbeitung
id: Pengantar pengolahan Data
tr_tr: Veri işlemeye giriş

source: Introduction to OpenStack
de: Einführung in OpenStack
id: Pengantar OpenStack
tr_tr: Openstack'e giriş

source: Introduction to TLS and SSL
de: Einführung in TLS und SSL
id: Pengantar TLS dan SSL
tr_tr: TLS ve SSL'e giriş

source: Introduction to security services
de: Einführung in die Sicherheitsdienste
id: Pengantar layanan keamanan
tr_tr: Güvenlik servislerine giriş

source: Invalid login attempts
de: Ungültige Login-Versuche
id: Upaya login tidak valid
tr_tr: Geçersiz oturum açma girişimleri

source: Is the technology cryptographically signed before distribution?
de: Ist die Technik vor der Verteilung kryptographisch unterzeichnet?
id: Apakah teknologi itu kriptografis ditandatangani sebelum distribusinya?
tr_tr: Teknoloji, dağıtımdan önce kriptografik olarak imzalanıyor mu?
