Repository: openstack/security-doc
Catalog: security-guide/source/locale/*/LC_MESSAGES/security-guide.po
Languages: de, id, tr_tr

source: OpenStack management relies on out-of-band management interfaces such as the IPMI protocol to access into nodes running OpenStack components. IPMI is a very popular specification to remotely manage, diagnose, and reboot servers whether the operating system is running or the system has crashed.
de: Das OpenStack-Management beruht auf Out-of-Band-Management-Schnittstellen wie dem IPMI-Protokoll, um auf Knoten zuzugreifen, die OpenStack-Komponenten ausführen. IPMI ist eine sehr beliebte Spezifikation, um Server zu verwalten, zu diagnostizieren und neu zu starten, ob das Betriebssystem läuft oder das System abgestürzt ist.
id: Manajemen OpenStack mengandalkan antarmuka manajemen out-of-band seperti protokol IPMI untuk mengakses node yang menjalankan komponen OpenStack. IPMI adalah spesifikasi yang sangat populer untuk mengelola, mendiagnosis, dan server reboot jarak jauh apakah sistem operasi berjalan atau sistem mogok (crashed).
tr_tr: OpenStack yönetimi, OpenStack bileşenlerini çalıştıran düğümlere erişmek için IPMI protokolü gibi bant dışı yönetim arabirimlerine dayanır. IPMI, işletim sisteminin çalışıp çalışmadığına veya sistem çöktüğüne bakmaksızın sunucuları uzaktan yönetmek, teşhis etmek ve yeniden başlatmak için çok popüler bir özelliktir.

source: OpenStack management utilities such as nova-manage and glance-manage
de: OpenStack-Management-Dienstprogramme wie nova-manage und glance-manage
id: Utilitas manajemen OpenStack seperti manajemen nova-manage dan glance-manage
tr_tr: Nova-manage ve glance-manage gibi OpenStack yönetim yardımcı programları

source: OpenStack network node: Management, guest, and possibly public depending upon neutron-plugin in use.
de: OpenStack Netzwerkknoten: Management, Gast und eventuell public je nach Neutronen-Plugin im Einsatz.
id: OpenStack network node: Management, guest, dan mungkin publik tergantung pada plugin neutron yang digunakan.
tr_tr: OpenStack ağ düğümü: Yönetim, misafir ve kullanımdaki neutron eklentisine bağlı olarak muhtemelen kamu.

source: OpenStack operators should strive to provide a certain level of tenant data disposal assurance. Best practices suggest that the operator sanitize cloud system media (digital and non-digital) prior to disposal, release out of organization control or release for reuse. Sanitization methods should implement an appropriate level of strength and integrity given the specific security domain and sensitivity of the information.
de: Die OpenStack-Betreiber sollten sich bemühen, ein gewisses Maß an Tenantdaten zur Verfügung zu stellen. Best Practices deuten darauf hin, dass der Betreiber die Cloud-System-Medien (digital und nicht-digital) vor der Entsorgung, die Freisetzung von Organisationskontrolle oder Freigabe zur Wiederverwendung reinigt. Sanitisierungsmethoden sollten ein angemessenes Maß an Stärke und Integrität bei der spezifischen Sicherheitsdomäne und der Sensitivität der Informationen implementieren.
id: Operator OpenStack harus berusaha memberikan tingkat jaminan penyewa data tingkat tertentu. Praktik terbaik menunjukkan bahwa operator membersihkan media sistem awan (digital dan non-digital) sebelum dibuang, bebas dari pengendalian organisasi atau pelepasan untuk digunakan kembali. Metode sanitasi harus menerapkan tingkat kekuatan dan integritas yang tepat mengingat domain keamanan dan kepekaan informasi yang spesifik.
tr_tr: OpenStack operatörleri belirli seviyede kiracı veri elden çıkarma güvencesi sağlamaya çalışmalıdır. En iyi uygulamalar, operatörün atma öncesinde bulut sistemi ortamlarını (sayısal ve sayısal olmayan) temizlemesini, organizasyon kontrolünü serbest bırakmasını veya yeniden kullanım için serbest bırakmasını önerir. Temizleme yöntemleri, bilgilerin güvenlik alanını ve hassasiyetini göz önünde bulundurarak uygun bir seviyede güç ve bütünlük uygulamalıdır.

source: OpenStack provides both public facing and private API endpoints. By default, OpenStack components use the publicly defined endpoints. The recommendation is to configure these components to use the API endpoint within the proper security domain.
de: OpenStack bietet sowohl öffentliche als auch private API-Endpunkte. Standardmäßig verwenden OpenStack-Komponenten die öffentlich definierten Endpunkte. Die Empfehlung besteht darin, diese Komponenten so zu konfigurieren, dass sie den API-Endpunkt innerhalb der entsprechenden Sicherheitsdomäne verwenden.
id: OpenStack menyediakan endpoint API yang dihadapi publik maupun pribadi. Secara default, komponen OpenStack menggunakan endpoint yang ditentukan secara umum. Rekomendasinya adalah mengkonfigurasi komponen ini untuk menggunakan endpoint API dalam domain keamanan yang tepat.
tr_tr: Openstack hem genel hem de özel API uç noktaları sağlar. Öntanımlı olarak, OpenStack bileşenleri genel tanımlanmış uç noktaları kullanır. Önerilen, bu bileşenleri uygun güvenlik alanında kullanacak şekilde yapılandırmaktır.

source: OpenStack provides security groups for both hosts and the network to add defense in depth to the virtual machines in a given project. These are similar to host-based firewalls as they allow or deny incoming traffic based on port, protocol, and address, however security group rules are applied to incoming traffic only, while host-based firewall rules are able to be applied to both incoming and outgoing traffic. It is also possible for host and network security group rules to conflict and deny legitimate traffic. We recommend ensuring that security groups are configured correctly for the networking being used. See :ref:`networking-security-groups` in this guide for more detail.
de: OpenStack bietet Sicherheitsgruppen sowohl für Hosts als auch das Netzwerk, um die virtuellen Maschinen in einem bestimmten Projekt zusammen zu bringen. Diese ähneln Host-basierten Firewalls, da sie eingehenden Datenverkehr auf Port, Protokoll und Adresse zulassen oder verweigern, wobei jedoch Sicherheitsgruppenregeln nur auf eingehenden Datenverkehr angewendet werden, während Host-basierte Firewall-Regeln sowohl auf eingehende als auch auf angewendet werden können ausgehender Verkehr Es ist auch möglich, dass Host- und Netzwerksicherheitsgruppenregeln in Konflikt geraten und legitimer Verkehr verweigern. Wir empfehlen, sicherzustellen, dass Sicherheitsgruppen für die verwendete Vernetzung korrekt konfiguriert sind. Siehe :ref:`networking-security-groups` in diesem Leitfaden für mehr Details.
id: OpenStack menyediakan kelompok keamanan untuk kedua host dan jaringan untuk menambahkan pertahanan secara mendalam ke mesin virtual dalam proyek tertentu. Ini mirip dengan firewall berbasis host saat mereka mengizinkan atau menolak lalu lintas masuk berdasarkan port, protokol, dan alamat, namun peraturan kelompok keamanan hanya berlaku untuk lalu lintas masuk, sementara aturan firewall berbasis host dapat diterapkan pada masuk dan masuk lalu lintas keluar. Hal ini juga memungkinkan peraturan kelompok host dan keamanan jaringan bertentangan dan menolak lalu lintas yang sah. Sebaiknya pastikan bahwa kelompok keamanan dikonfigurasi dengan benar untuk jaringan yang sedang digunakan. Lihat :ref: `networking-security-groups` dalam panduan ini untuk detail lebih lanjut.
tr_tr: OpenStack, belirli bir projedeki sanal makinelere derinlemesine savunma eklemek için hem ana makineler hem de ağ için güvenlik grupları sağlar. Gelen trafiği port, protokol ve adres temelinde kabul veya reddettiği için bunlar sunucu tabanlı güvenlik duvarlarına benzer, ancak güvenlik grup kuralları yalnızca gelen trafiğe uygulanır, ancak sunucu tabanlı güvenlik duvarı kuralları hem gelen hem de giden trafik. Ana bilgisayar ve ağ güvenlik grubu kurallarının çakışması ve meşru trafiği reddetmesi de mümkündür. Kullanılan ağlar için güvenlik gruplarının doğru yapılandırılmasını sağlamanızı öneririz. Daha ayrıntılı bilgi için bakınız :ref:`networking-security-groups`.

source: OpenStack provides several management interfaces for operators and tenants:
de: OpenStack bietet mehrere Management-Schnittstellen für Betreiber und Tenants:
id: OpenStack menyediakan beberapa antarmuka manajemen untuk operator dan penyewa:
tr_tr: OpenStack, operatörler ve kiracılar için birkaç yönetim arabirimi sağlar:

source: OpenStack releases security information through two channels.
de: OpenStack gibt Sicherheitsinformationen über zwei Kanäle frei.
id: OpenStack merilis informasi keamanan melalui dua saluran.
tr_tr: OpenStack, güvenlik bilgilerini iki kanal üzerinden yayınlar.

source: OpenStack security notes
de: OpenStack Sicherheitshinweise
id: Catatan keamanan OpenStack
tr_tr: OpenStack güvenlik notları

source: OpenStack service configuration: Qpid
de: OpenStack Service Konfiguration: Qpid
id: Konfigurasi layanan OpenStack: Qpid
tr_tr: OpenStack servis yapılandırması: Qpid

source: OpenStack service configuration: RabbitMQ
de: OpenStack Service Konfiguration: RabbitMQ
id: Konfigurasi layanan OpenStack: RabbitMQ
tr_tr: OpenStack servis yapılandırması: RabbitMQ

source: OpenStack service database configuration
de: OpenStack-Service-Datenbankkonfiguration
id: Konfigurasi database layanan OpenStack
tr_tr: OpenStack servis veritabanı yapılandırması

source: OpenStack service overview
de: OpenStack Service-Übersicht
id: Ikhtisar layanan OpenStack
tr_tr: OpenStack servis genel bakışı

source: OpenStack software components, such as Identity or Compute
de: OpenStack Softwarekomponenten wie Identity oder Compute
id: Komponen perangkat lunak OpenStack, seperti Identity or Compute
tr_tr: OpenStack yazılım bileşenleri, örn. Kimlik ya da Hesaplama

source: OpenStack supports various authentication strategies including noauth, and keystone. If the ``noauth`` strategy is used, then users can interact with OpenStack services without any authentication. This could be a potential risk since an attacker might gain unauthorized access to the OpenStack components. We strongly recommend that all services must be authenticated with keystone using their service accounts.
de: OpenStack unterstützt verschiedene Authentifizierungsstrategien, darunter noauth und keystone. Wenn die ``noauth``Strategie verwendet wird, können Benutzer mit OpenStack Services ohne Authentifizierung interagieren. Dies könnte ein potentielles Risiko darstellen, da ein Angreifer einen unbefugten Zugriff auf die OpenStack-Komponenten erhalten könnte. Wir empfehlen dringend, dass alle Dienste mit Keystone mit ihren Servicekonten authentifiziert werden müssen.
id: OpenStack mendukung berbagai strategi otentikasi termasuk noauth, dan keystone. Jika strategi ``noauth`` digunakan, pengguna dapat berinteraksi dengan layanan OpenStack tanpa autentikasi apapun. Ini bisa menjadi risiko potensial karena penyerang bisa mendapatkan akses tidak sah ke komponen OpenStack. Kami sangat menyarankan agar semua layanan harus diotentikasi dengan keystone menggunakan akun layanan mereka.
tr_tr: OpenStack, noauth ve keystone gibi çeşitli kimlik doğrulama stratejilerini desteklemektedir. ``noauth`` stratejisi kullanılıyorsa, kullanıcılar herhangi bir kimlik denetimi olmaksızın OpenStack servisleri ile etkileşimde bulunabilirler. Bu, bir saldırgan OpenStack bileşenlerine yetkisiz erişebileceğinden potansiyel bir risk oluşturabilir. Tüm servislerin servis hesaplarını kullanarak keystone ile doğrulanması önemle tavsiye edilir.

source: OpenStack supports various authentication strategies like ``noauth`` and ``keystone``. If the ``noauth`` strategy is used then the users can interact with OpenStack services without any authentication. This could be a potential risk since an attacker might gain unauthorized access to the OpenStack components. We strongly recommend that all services must be authenticated with keystone using their service accounts.
de: OpenStack unterstützt verschiedene Authentifizierungsstrategien wie ``noauth`` und ``keystone``. Wenn die Strategie "noauth" verwendet wird, können die Benutzer ohne Authentifizierung mit OpenStack-Diensten interagieren. Dies kann ein potenzielles Risiko darstellen, da ein Angreifer möglicherweise einen nicht autorisierten Zugriff auf die OpenStack-Komponenten erhält. Wir empfehlen dringend, dass alle Dienste über ihre Dienstkonten mit Keystone authentifiziert werden müssen.
id: OpenStack mendukung berbagai strategi otentikasi seperti ``noauth`` dan ``keystone``. Jika strategi ``noauth`` digunakan maka pengguna dapat berinteraksi dengan layanan OpenStack tanpa autentikasi apapun. Ini bisa menjadi risiko potensial karena penyerang bisa mendapatkan akses tidak sah ke komponen OpenStack. Kami sangat menyarankan agar semua layanan harus diotentikasi dengan keystone menggunakan akun layanan mereka.

source: OpenStack supports various authentication strategies like noauth and keystone. If the '``noauth``' strategy is used then the users could interact with OpenStack services without any authentication. This could be a potential risk since an attacker might gain unauthorized access to the OpenStack components. Thus it is strongly recommended that all services must be authenticated with keystone using their service accounts.
de: OpenStack unterstützt verschiedene Authentifizierungsstrategien wie noauth und keystone. Wenn die '``noauth``' Strategie benutzt wird, können Benutzer ohne irgendeine Authentifizierung mit den OpenStack Diensten interagieren. Dies könnte ein potentielles Risiko darstellen, da ein Angreifer einen unbefugten Zugriff auf die OpenStack-Komponenten erhalten könnte. So wird dringend empfohlen, dass alle Dienste mit Keystone mit ihren Servicekonten authentifiziert werden müssen.
id: OpenStack mendukung berbagai strategi otentikasi seperti noauth dan keystone. Jika strategi ``noauth``' digunakan maka pengguna dapat berinteraksi dengan layanan OpenStack tanpa autentikasi apapun. Ini bisa menjadi risiko potensial karena penyerang bisa mendapatkan akses tidak sah ke komponen OpenStack. Jadi sangat disarankan agar semua layanan harus diautentikasi dengan keystone menggunakan akun layanan mereka.
tr_tr: OpenStack, noauth ve keystone gibi çeşitli doğrulama stratejilerini desteklemektedir. ``noauth`` stratejisi kullanılıyorsa, kullanıcılar herhangi bir kimlik denetimi olmaksızın OpenStack servisleri ile etkileşimde bulunabilirler. Bu, bir saldırgan OpenStack bileşenlerine yetkisiz erişebileceğinden potansiyel bir risk oluşturabilir. Bu nedenle, tüm servislerin servis hesaplarını kullanarak keystone ile doğrulanması önemle tavsiye edilir.

source: OpenStack supports various authentication strategies like noauth, and keystone. If the noauth strategy is used, then the users could interact with OpenStack services without any authentication. This could be a potential risk since an attacker might gain unauthorized access to the OpenStack components. We strongly recommend that all services must be authenticated with keystone using their service accounts.
de: OpenStack unterstützt verschiedene Authentifizierungsstrategien wie noauth und Keystone. Wenn die noauth-Strategie verwendet wird, können die Benutzer ohne Authentifizierung mit OpenStack-Diensten interagieren. Dies könnte ein potentielles Risiko darstellen, da ein Angreifer einen unbefugten Zugriff auf die OpenStack-Komponenten erhalten könnte. Wir empfehlen dringend, dass alle Dienste mit Keystone mit ihren Servicekonten authentifiziert werden müssen.
id: OpenStack mendukung berbagai strategi otentikasi seperti noauth, dan keystone. Jika strategi noauth digunakan, maka pengguna bisa berinteraksi dengan layanan OpenStack tanpa autentikasi apapun. Ini bisa menjadi risiko potensial karena penyerang bisa mendapatkan akses tidak sah ke komponen OpenStack. Kami sangat menyarankan agar semua layanan harus diotentikasi dengan keystone menggunakan akun layanan mereka.
tr_tr: OpenStack, noauth ve keystone gibi çeşitli kimlik doğrulama stratejilerini desteklemektedir. Eğer noauth stratejisi kullanılırsa, kullanıcılar herhangi bir kimlik denetimi olmaksızın OpenStack servisleri ile etkileşimde bulunabilirler. Bu, bir saldırgan OpenStack bileşenlerine yetkisiz erişebileceğinden potansiyel bir risk oluşturabilir. Tüm servislerin servis hesaplarını kullanarak keystone ile doğrulanması önemle tavsiye edilir.

source: OpenStack supports various authentication strategies like noauth, keystone etc. If the 'noauth' strategy is used then the users could interact with OpenStack services without any authentication. This could be a potential risk since an attacker might gain unauthorized access to the OpenStack components. Thus it is strongly recommended that all services must be authenticated with keystone using their service accounts.
de: OpenStack unterstützt verschiedene Authentifizierungsstrategien wie noauth, keystone etc. Wenn die 'noauth'-Strategie verwendet wird, können die Benutzer mit OpenStack-Diensten ohne Authentifizierung interagieren. Dies könnte ein potentielles Risiko darstellen, da ein Angreifer einen unbefugten Zugriff auf die OpenStack-Komponenten erhalten könnte. So wird dringend empfohlen, dass alle Dienste mit Keystone mit ihren Servicekonten authentifiziert werden müssen.
id: OpenStack mendukung berbagai strategi otentikasi seperti noauth, keystone dll. Jika strategi 'noauth' digunakan maka pengguna dapat berinteraksi dengan layanan OpenStack tanpa autentikasi apapun. Ini bisa menjadi risiko potensial karena penyerang bisa mendapatkan akses tidak sah ke komponen OpenStack. Jadi sangat disarankan agar semua layanan harus diautentikasi dengan keystone menggunakan akun layanan mereka.
tr_tr: OpenStack, noauth, keystone vb. gibi çeşitli kimlik doğrulama stratejilerini desteklemektedir. Eğer 'noauth' stratejisi kullanılıyorsa, kullanıcılar herhangi bir kimlik denetimi olmaksızın OpenStack servisleri ile etkileşimde bulunabilirler. Bu, bir saldırgan OpenStack bileşenlerine yetkisiz erişebileceğinden potansiyel bir risk oluşturabilir. Bu nedenle, tüm servislerin servis hesaplarını kullanarak keystone ile doğrulanması önemle tavsiye edilir.

source: OpenStack supports various authentication strategies like noauth, keystone etc. If the 'noauth' strategy is used then the users could interact with OpenStack services without any authentication. This could be a potential risk since an attacker might gain unauthorized access to the OpenStack components. Thus we strongly recommend that all services must be authenticated with keystone using their service accounts.
de: OpenStack unterstützt verschiedene Authentifizierungsstrategien wie noauth, keystone etc. Wenn die 'noauth'-Strategie verwendet wird, können die Benutzer mit OpenStack-Diensten ohne Authentifizierung interagieren. Dies könnte ein potentielles Risiko darstellen, da ein Angreifer einen unbefugten Zugriff auf die OpenStack-Komponenten erhalten könnte. So empfehlen wir dringend, dass alle Dienste mit Keystone mit ihren Servicekonten authentifiziert werden müssen.
id: OpenStack mendukung berbagai strategi otentikasi seperti noauth, keystone dll. Jika strategi 'noauth' digunakan maka pengguna dapat berinteraksi dengan layanan OpenStack tanpa autentikasi apapun. Ini bisa menjadi risiko potensial karena penyerang bisa mendapatkan akses tidak sah ke komponen OpenStack. Dengan demikian, kami sangat menyarankan agar semua layanan harus diotentikasi dengan keystone menggunakan akun layanan mereka.
tr_tr: OpenStack noauth, keystone gibi farklı kimlik doğrulama stratejileri destekler. Eğer 'noauth' stratejisi kullanılıyorsa kullanıcılar OpenStack servisleri ile hiçbir kimlik doğrulama olmadan etkileşime geçebilirler. Bu yüzden tüm servislerin, servis hesaplarını kullanırken keystone ile kimlik doğrulanmasını öneriyoruz.

source: OpenStack's sVirt implementation aspires to protect hypervisor hosts and virtual machines against two primary threat vectors:
de: OpenStacks sVirt-Implementierung strebt an, Hypervisor-Hosts und virtuelle Maschinen vor zwei primären Bedrohungsvektoren zu schützen:
id: Implementasi OpenStack's sVirt bercita-cita untuk melindungi host hypervisor dan mesin virtual terhadap dua vektor ancaman utama:
tr_tr: OpenStack'ın sVirt uygulaması, iki ana tehdit vektörüne karşı hipervizör ana makine ve sanal makineleri korumayı hedeflemektedir:

source: OpenStack-dev mailing list
de: OpenStack-dev Mailingliste

source: OpenStack-dev mailinglist
de: OpenStack-dev Mailingliste
id: Daftar mailing OpenStack-dev
tr_tr: OpenStack-dev eposta listesi

source: OpenStack.org, OpenStack End User Guide section. 2016. `OpenStack command-line clients overview <https://docs.openstack.org/user-guide/common/cli_overview.html>`__
de: OpenStack.org, OpenStack End Benutzerhandbuch. 2016. `OpenStack-Befehlszeilen-Clients-Übersicht <https://docs.openstack.org/user-guide/common/cli_overview.html>`__
tr_tr: OpenStack.org, OpenStack Son Kullanıcı Kılavuz bölümü. 2016. `OpenStack komut satırı istemcileri tanıtımı <https://docs.openstack.org/user-guide/common/cli_overview.html>`__

source: OpenStack.org, Set environment variables using the OpenStack RC file. 2016. `Download and source the OpenStack RC file <https://docs.openstack.org/user-guide/common/cli_set_environment_variables_using_openstack_rc.html#download-and-source-the-openstack-rc-file>`__
de: OpenStack.org, legen Sie Umgebungsvariablen mit der OpenStack RC-Datei fest. 2016. "Downloaden und sourcen Sie die OpenStack RC Datei <https://docs.openstack.org/user-guide/common/cli_set_environment_variables_using_openstack_rc.html#download-and-source-the-openstack-rc-file>`__
tr_tr: OpenStack.org, OpenStack RC dosyasını kullanarak ortam değişkenlerini ayarlayın. 2016. `OpenStack RC dosyasını indirin ve kaynaklaştırın <https://docs.openstack.org/user-guide/common/cli_set_environment_variables_using_openstack_rc.html#download-and-source-the-openstack-rc-file>`__

source: OpenStack.org, Welcome to Sahara!. 2016. `Sahara project documentation <https://docs.openstack.org/sahara/latest/>`__
de: OpenStack.org, Willkommen in Sahara!. 2016. \Sahara- Projektdokumentation <https://docs.openstack.org/sahara/latest/>`__

source: OpenStack.org, Welcome to barbican's Developer Documentation!. 2014. `Barbican developer documentation <https://docs.openstack.org/barbican/latest/>`__
de: OpenStack.org, Willkommen zur barbican's Developer Documentation!. 2014. `Barbican developer documentation <https://docs.openstack.org/barbican/latest/>`__

source: Operating system events on the OpenStack service machines such as user logins or restarts also provide valuable insight into proper and improper usage of systems.
de: Betriebssystem-Events auf den OpenStack-Service-Maschinen wie Benutzer-Logins oder Neustarts bieten auch einen wertvollen Einblick in die ordnungsgemäße und unsachgemäße Nutzung von Systemen.
id: Event sistem operasi pada mesin layanan OpenStack seperti login pengguna atau restart juga memberikan wawasan berharga tentang penggunaan sistem yang tepat dan tidak tepat.
tr_tr: OpenStack servis makinelerinde, kullanıcı oturumları veya yeniden başlatma gibi işletim sistemi olayları, sistemlerin doğru ve hatalı kullanımıyla ilgili değerli bilgiler sağlar.
