Repository: openstack/security-doc
Catalog: security-guide/source/locale/*/LC_MESSAGES/security-guide.po
Languages: de, id, tr_tr

source: The `Cloud Security Alliance Cloud Controls Matrix <https://cloudsecurityalliance.org/group/cloud-controls-matrix/>`_ (CCM) assists both cloud providers and consumers in assessing the overall security of a cloud provider. The CSA CMM provides a controls framework that map to many industry-accepted standards and regulations including the ISO 27001/2, ISACA, COBIT, PCI, NIST, Jericho Forum and NERC CIP.
de: Die `Cloud Security Alliance Cloud Controls Matrix<https://cloudsecurityalliance.org/group/cloud-controls-matrix/>`_ (CCM) unterstützt sowohl Cloud-Provider als auch Konsumenten bei der Beurteilung der Gesamtsicherheit eines Cloud-Providers. Das CSA CMM bietet ein Kontroll-Framework, das viele branchenübergreifende Standards und Vorschriften wie ISO 27001/2, ISACA, COBIT, PCI, NIST, Jericho Forum und NERC CIP abbildet.
id: The `Cloud Security Alliance Cloud Controls Matrix <https://cloudsecurityalliance.org/group/cloud-controls-matrix/>`_ (CCM) membantu penyedia awan dan konsumen dalam menilai keamanan keseluruhan penyedia awan. CSA CMM menyediakan kerangka kerja kontrol yang memetakan standar dan peraturan yang berlaku di industri termasuk ISO 27001/2, ISACA, COBIT, PCI, NIST, Forum Jericho dan NERC CIP.
tr_tr: `Bulut Güvenlik İttifakı Bulut Kontrol Matrisi <https://cloudsecurityalliance.org/group/cloud-controls-matrix/>`_ (CCM) bulut sağlayıcılarının ve tüketicilerin bir bulut sağlayıcının genel güvenliğini değerlendirmesine yardımcı olur. CSA CMM, ISO 27001/2, ISACA, COBIT, PCI, NIST, Jericho Forumu ve NERC CIP gibi endüstride kabul görmüş pek çok standart ve yönetmelik ile eşleşen bir kontrol çerçevesi sağlar.

source: The `Key Management Interoperability Protocol (KMIP) <https://www.oasis-open.org/committees/tc_home.php?wg_abbrev=kmip>`_ secret store plugin is used to communicate with a KMIP-enabled device, such as a Hardware Security Module (HSM). The secret is securely stored in the KMIP-enabled device directly, rather than in the Barbican database. The Barbican database maintains a reference to the secret's location for later retrieval. The plugin can be configured to authenticate to the KMIP-enabled device using either a username and password, or using a client certificate. This information is stored in the Barbican configuration file.
de: Das `Key Management Interoperability Protocol (KMIP) <https://www.oasis-open.org/committees/tc_home.php?wg_abbrev=kmip>`_ Secret Store Plugin wird verwendet, um mit einem KMIP-fähigen Gerät zu kommunizieren, wie ein Hardware-Sicherheitsmodul (HSM). Das Geheimnis wird direkt im KMIP-fähigen Gerät und nicht in der Barbican-Datenbank gespeichert. Die Barbican-Datenbank enthält einen Verweis auf den Standort des Geheimnisses, der später abgerufen werden kann. Das Plugin kann so konfiguriert werden, dass es sich mit einem Benutzernamen und einem Kennwort oder mit einem Clientzertifikat beim KMIP-fähigen Gerät authentifiziert. Diese Information wird in der Barbican-Konfigurationsdatei gespeichert.
id: Plugin penyimpanan rahasia `Key Management Interoperability Protocol (KMIP) <https://www.oasis-open.org/committees/tc_home.php?wg_abbrev=kmip>`_ digunakan untuk berkomunikasi dengan perangkat berkemampuan KMIP, seperti Hardware Security Module (HSM). Rahasianya disimpan dengan aman di perangkat berkemampuan KMIP secara langsung, bukan di database Barbican. Database Barbican menyimpan referensi ke lokasi rahasia untuk pengambilan nanti. Plugin ini dapat dikonfigurasi untuk melakukan otentikasi ke perangkat berkemampuan KMIP menggunakan nama pengguna dan kata sandi, atau menggunakan sertifikat klien. Informasi ini disimpan dalam file konfigurasi Barbican.

source: The `SCAP Security Guide <https://github.com/OpenSCAP/scap-security-guide/>`_ is another useful reference. This is still an emerging source, but we anticipate that this will grow into a tool with controls mappings that are more focused on the US federal government certifications and recommendations. For example, the SCAP Security Guide currently has some mappings for security technical implementation guides (STIGs) and NIST-800-53.
de: Der `SCAP Sicherheitsleitfaden <https://github.com/OpenSCAP/scap-security-guide/>`_ ist eine weitere nützliche Referenz. Dies ist immer noch eine neue Quelle, aber wir erwarten, dass dies zu einem Werkzeug mit Kontrollmapping wird, das mehr auf die US-Bundesregierung Zertifizierungen und Empfehlungen konzentriert ist. Zum Beispiel hat das SCAP Security Guide derzeit einige Mappings für sicherheitstechnische Implementierungsleitfäden (STIGs) und NIST-800-53.
id: The `SCAP Security Guide <https://github.com/OpenSCAP/scap-security-guide/>`_ adalah referensi lain yang berguna. Ini masih merupakan sumber yang muncul, namun kami mengantisipasi bahwa ini akan tumbuh menjadi alat dengan pemetaan kontrol yang lebih terfokus pada sertifikasi dan rekomendasi pemerintah federal AS. Misalnya, SCAP Security Guide saat ini memiliki beberapa pemetaan untuk panduan penerapan teknis keamanan (STIG) dan NIST-800-53.
tr_tr: `SCAP Güvenlik Kılavuzu <https://github.com/OpenSCAP/scap-security-guide/>`_ başka bir faydalı referans. Bu hala ortaya çıkmakta olan bir kaynaktır, ancak bunun, ABD federal hükümet sertifikaları ve önerileri üzerine daha fazla odaklanan denetim eşlemeleri ile bir araç haline geleceğini umuyoruz. Örneğin, SCAP Güvenlik Kılavuzu şu anda güvenlik teknik uygulama kılavuzları (STIG) ve NIST-800-53 için bazı eşlemelere sahiptir.

source: The ``/etc/swift`` directory contains information about the ring topology and environment configuration. The following permissions are recommended:
de: Das ``/etc/swift``-Verzeichnis enthält Informationen über die Ring- Topologie und die Umgebungskonfiguration. Folgende Berechtigungen werden empfohlen:
id: Direktori ``/etc/swift`` berisi informasi tentang topologi ring dan konfigurasi lingkungan. Izin berikut direkomendasikan:
tr_tr: ``/etc/swift`` dizini, halka topolojisi ve ortam yapılandırması hakkında bilgi içerir. Aşağıdaki izinler önerilir:

source: The ``/var/lib/nova`` directory is used to hold details about the instances on a given compute host. This directory should be considered sensitive as well, with strictly enforced file permissions. Additionally, it should be backed up regularly as it contains information and metadata for the instances associated with that host.
de: Das ``/var/lib/nova``-Verzeichnis wird verwendet, um Details über die Instanzen auf einem gegebenen Compute-Host zu halten. Dieses Verzeichnis sollte auch als sensibel betrachtet werden, mit streng erzwungenen Dateiberechtigungen. Darüber hinaus sollte es regelmäßig gesichert werden, da es Informationen und Metadaten für die Instanzen enthält, die mit diesem Host verbunden sind.
id: Direktori ``/var/lib/nova`` digunakan untuk menyimpan rincian tentang instance pada compute host tertentu. Direktori ini harus dianggap sensitif juga, dengan hak akses file yang ketat. Selain itu, ini harus dicadangkan secara teratur karena berisi informasi dan metadata untuk instance yang terkait dengan host tersebut.
tr_tr: ``/var/lib/nova`` dizini, belirli bir hesaplama sunucusundaki örneklerle ilgili ayrıntıları tutmak için kullanılır. Bu dizin, kesinlikle zorla uygulanan dosya izinleriyle de hassas olarak düşünülmelidir. Ayrıca, bu ana makine ile ilişkili örnekler için bilgi ve meta veriler içerdiği için düzenli olarak yedeklenmesi gerekir.

source: The ``DiskFilter`` filter is capable of oversubscribing disk space. While not normally an issue, this can be a concern on storage devices that are thinly provisioned, and this filter should be used with well-tested quotas applied.
de: Der ``DiskFilter``-Filter ist in der Lage, Speicherplatz zu überzeichnen. Während es sich in der Regel nicht um ein Problem handelt, kann dies ein Problem mit Speichergeräten sein, die dünn versorgt sind, und dieser Filter sollte mit bewährten Quoten verwendet werden.
id: Filter ``DiskFilter`` mampu melampaui batas ruang disk. Meskipun biasanya tidak menjadi masalah, ini bisa menjadi perhatian pada perangkat penyimpanan yang tersedia secara tipis, dan filter ini harus digunakan dengan kuota yang teruji dengan baik.
tr_tr: ``DiskFilter`` süzgeci, disk alanını aşırı abone etme yeteneğine sahiptir. Normalde bir sorun olmamakla birlikte, bu ince ayarlanmış depolama aygıtları için bir endişe kaynağı olabilir ve bu filtre, iyi uygulanmış kotalarla birlikte kullanılmalıdır.

source: The ``FilterScheduler`` is the default scheduler for OpenStack Compute, although other schedulers exist (see the section `Scheduling <https://docs.openstack.org/ocata/config-reference/compute/scheduler.html>`_ in the `OpenStack Configuration Reference <https://docs.openstack.org/ocata/config-reference/config-overview.html>`_ ). This works in collaboration with 'filter hints' to decide where an instance should be started. This process of host selection allows administrators to fulfill many different security and compliance requirements. Depending on the cloud deployment type for example, one could choose to have tenant instances reside on the same hosts whenever possible if data isolation was a primary concern. Conversely one could attempt to have instances for a tenant reside on as many different hosts as possible for availability or fault tolerance reasons.
de: Der ``FilterScheduler``ist der Standard-Scheduler für OpenStack Compute, obwohl andere Scheduler vorhanden sind (siehe Abschnitt `Scheduling <https://docs.openstack.org/ocata/config-reference/compute/scheduler.html> `_ in der` OpenStack Configuration Reference <https://docs.openstack.org/ocata/config-reference/config-overview.html> `_). Dies funktioniert in Zusammenarbeit mit 'filter hints', um zu entscheiden, wo eine Instanz gestartet werden soll. Dieser Prozess der Host-Auswahl ermöglicht es Administratoren, viele verschiedene Sicherheits- und Compliance-Anforderungen zu erfüllen. Abhängig von der Cloud-Deployment- Art zum Beispiel könnte man wählen, dass Tenant-Instanzen auf den gleichen Hosts liegen, wann immer möglich, wenn die Datenisolation ein primäres Anliegen war. Umgekehrt könnte man versuchen, Instanzen für einen Tenant zu haben, so viele verschiedene Hosts wie möglich aus Gründen der Verfügbarkeit oder Fehlertoleranz.

source: The ``GroupAffinity`` and ``GroupAntiAffinity`` filters conflict and should not both be enabled at the same time.
de: Die ``GroupAffinity``und ``GroupAntiAffinity``Filter stehen im Konflikt und sollten nicht beide gleichzeitig aktiviert werden.
id: Filter ``GroupAffinity`` dan ``GroupAntiAffinity`` terjadi konflik dan seharusnya keduanya tidak diaktifkan secara bersamaan.
tr_tr: ``GroupAffinity`` ve ``GroupAntiAffinity`` filtreleri çakışır ve her ikisinde de aynı anda etkin olmamalıdır.

source: The ``QoSBandwidthLimitRule`` has been implemented in the neutron Open vSwitch, Linux bridge and single root input/output virtualization (SR-IOV) drivers.
de: Die ``QoSBandwidthLimitRule``wurde in den Neutronen Open VSwitch, Linux Bridge und Single Root Input/Output Virtualisierung (SR-IOV) Treiber implementiert.
id: The `` QoSBandwidthLimitRule`` telah diimplementasikan di netron Open vSwitch, Linux bridge dan driver single root input/output virtualization (SR-IOV).
tr_tr: ``QoSBandwidthLimitRule``, neutron Open vSwitch, Linux köprüsü ve tek kök giriş/çıkış sanallaştırma (SR-IOV) sürücülerinde uygulanmıştır.

source: The ``ShibRequireSession`` rule is invalid in Apache 2.4 or newer and should be dropped in that specific setup.
de: Die ``ShibRequireSession``-Regel ist in Apache 2.4 oder neuer ungültig und sollte in diesem speziellen Setup gelöscht werden.
tr_tr: ``ShibRequireSession`` kuralı Apache 2.4 veya daha yeni sürümünde geçersizdir ve bu kurulumlarda bu özellik bırakılmalıdır.

source: The ``apt-get`` command is Ubuntu specific. For other distributions, replace with appropriate command.
de: Der ``apt-get``Befehl ist Ubuntu spezifisch. Für andere Distributionen ersetzen Sie durch entsprechenden Befehl.
tr_tr: ``apt-get`` komutu Ubuntu'ya özgüdür. Diğer dağıtımlar için uygun komut ile değiştirin.

source: The ``external`` method should be dropped to avoid any interference with some Apache and Shibboleth SP setups, where a ``REMOTE_USER`` environment variable is always set, even as an empty value.
de: Die ``external``-Methode sollte gelöscht werden, um jegliche Interferenzen mit einigen Apache- und Shibboleth-SP-Setups zu vermeiden, wobei eine Umgebungsvariable ``REMOTE_USER`` immer auch als leerer Wert gesetzt ist.
tr_tr: ``REMOTE_USER`` ortam değişkeni her zaman boş bir değer olarak bile ayarlandığı bazı Apache ve Shibboleth SP kurulumlarında herhangi bir etkileşimden kaçınmak için ``external`` yöntemi düşürülmelidir.

source: The ``md5`` parameter defines the authentication method as a hashed password. We provide a secure authentication example in the section below.
de: Der ``md5``-Parameter definiert die Authentifizierungsmethode als Hash- Passwort. Wir stellen ein sicheres Authentifizierungsbeispiel im folgenden Abschnitt zur Verfügung.
id: Parameter ``md5`` mendefinisikan metode otentikasi sebagai hashed password. Kami memberikan contoh otentikasi yang aman pada bagian di bawah ini.
tr_tr: ``md5`` parametresi, özetlenmiş parola yöntemi olarak bir kimlik doğrulama yöntemi tanımlar. Aşağıdaki bölümde güvenli bir kimlik doğrulama örneği sağlıyoruz.

source: The ``nova-novncproxy`` and ``nova-xvpvncproxy`` services by default open public-facing ports that are token authenticated.
de: Die ``nova-novncproxy``und ``nova-xvpvncproxy``-Dienste öffnen standardmäßig öffentlich zugängliche Ports, die authentifiziert werden.
id: Layanan ``nova-novncproxy`` dan ``nova-xvpvncproxy`` secara default terbuka menghadap ke publik port yang token dikonfirmasi.
tr_tr: Varsayılan olarak ``nova-novncproxy`` ve ``nova-xvpvncproxy`` servisi, kimliği doğrulanmış olan halka açık portları açar.

source: The ``nova-spicehtml5proxy`` service by default opens public-facing ports that are token authenticated.
de: Der ``nova-spicehtml5proxy``Service öffnet standardmäßig öffentlich zugängliche Ports, die authentifiziert werden.
id: Layanan ``nova-spicehtml5proxy`` secara default membuka port yang menghadap ke publik yang diberi tanda bukti.
tr_tr: Varsayılan olarak ``nova-spicehtml5proxy`` hizmeti, kimliği doğrulanmış olan halka açık bağlantı noktalarını açar.

source: The ``nova`` command-line utility can return a URL for the VNC console for access by the nova Java VNC client. This requires the ``nova-xvpvncproxy`` service to bridge from the public network to the management network.
de: Das ``nova``Befehlszeilenprogramm kann eine URL für die VNC-Konsole für den Zugriff durch den nova Java VNC Client zurückgeben. Dies erfordert den ``nova-xvpvncproxy``Service, um vom öffentlichen Netz zum Management- Netzwerk zu überbrücken.
id: Utilitas baris perintah ``nova`` dapat mengembalikan URL untuk konsol VNC untuk diakses oleh klien VNC nova Java. Ini memerlukan layanan ``nova-xvpvncproxy`` untuk menjembatani dari jaringan publik ke jaringan manajemen.
tr_tr: ``nova`` komut satırı yardımcı programı, yeni Java VNC istemcisi tarafından erişilebilmesi için VNC konsolu için bir URL döndürebilir. Bu, kamu ağından yönetim ağına köprü kurmak için ``nova-xvpvncproxy`` servisi gerektirir.

source: The ``service apache2 restart`` command is Ubuntu-specific. For other distributions, replace with appropriate command.
de: Der ``service apache2 restart``Befehl ist Ubuntu-spezifisch. Für andere Distributionen ersetzen Sie durch entsprechenden Befehl.
tr_tr: ``service apache2 restart`` komutu Ubuntu'ya özgüdür. Diğer dağıtımlar için, uygun komut ile değiştirin.

source: The ``svirt_image_t`` label uniquely identifies image files on disk, allowing for the SELinux policy to restrict access. When a KVM-based compute image is powered on, sVirt appends a random numerical identifier to the image. sVirt is capable of assigning numeric identifiers to a maximum of 524,288 virtual machines per hypervisor node, however most OpenStack deployments are highly unlikely to encounter this limitation.
de: Das ``svirt_image_t``Label identifiziert eindeutig Abbilddateien auf der Festplatte, so dass die SELinux-Richtlinie den Zugriff beschränken kann. Wenn ein KVM-basiertes Compute-Abbild eingeschaltet wird, hängt sVirt dem Abbild eine zufällige numerische Kennung an. sVirt ist in der Lage, numerische Identifikatoren auf maximal 524.288 virtuelle Maschinen pro Hypervisor- Knoten zuzuordnen, aber bei den meisten OpenStack-Implementierungen sind höchst unwahrscheinlich, dass diese Beschränkung auftritt.
id: Label ``svirt_image_t`` secara unik mengidentifikasi file image pada disk, memungkinkan kebijakan SELinux membatasi akses. Saat image komputasi berbasis KVM diaktifkan, sVirt menambahkan pengenal numerik acak ke image. SVirt mampu menugaskan pengenal numerik (numeric identifier) ke maksimum 524.288 mesin virtual per node hypervisor, namun sebagian besar penerapan OpenStack sangat tidak mungkin untuk menghadapi keterbatasan ini.
tr_tr: ``svirt_image_t`` etiketi, görüntü dosyalarını disk üzerinde benzersiz şekilde tanımlar ve SELinux ilkesinin erişimi kısıtlamasına izin verir. Bir KVM tabanlı hesaplama görüntüsü açıldığında, sVirt, görüntüye rastgele sayısal bir tanımlayıcı ekler. sVirt, hypervisor düğüm başına maksimum 524.288 sanal makineye sayısal tanımlayıcı atayabilir, ancak OpenStack dağıtımlarının çoğunda bu kısıtlamayla karşılaşma ihtimali çok düşüktür.

source: The ``volume_clear`` parameter can accept either ``zero`` or ``shred`` arguments. The ``zero`` argument will write a single pass of zeroes to the device. The ``shred`` argument will write three passes of predetermined bit patterns.
de: Der Parameter ``volume_clear`` kann entweder ``zero`` oder ``shred`` Argumente akzeptieren. Das ``zero``-Argument schreibt einen einzigen Nullenstrich auf das Gerät. Das ``shred``-Argument schreibt drei Pässe von vorbestimmten Bitmustern.

source: The above link defaults to the Ubuntu version.
de: Der obige Link ist standardmäßig auf die Ubuntu-Version eingestellt.
id: Tautan di atas default ke versi Ubuntu.
tr_tr: Yukarıdaki bağlantı varsayılan olarak Ubuntu sürümüdür.

source: The actual data objects. ACLs at the object level are also possible with metadata and are dependent on the authentication system used.
de: Die eigentlichen Datenobjekte. ACLs auf Objektebene sind auch mit Metadaten möglich und sind abhängig vom verwendeten Authentifizierungssystem.
id: Objek data sebenarnya. ACL pada tingkat objek juga dimungkinkan dengan metadata dan bergantung pada sistem otentikasi yang digunakan.
tr_tr: Gerçek veri nesneleri. Nesne düzeyindeki ACL'ler metaverileri ile de mümkündür ve kullanılan doğrulama sistemine bağlıdır.

source: The admin token is generally used to bootstrap Identity. This token is the most valuable Identity asset, which could be used to gain cloud admin privileges.
de: Das Admin-Token wird generell verwendet, um Identity zu booten. Dieses Token ist das wertvollste Identitäts-Asset, das verwendet werden könnte, um Cloud-Admin-Privilegien zu gewinnen.
id: Token admin umumnya digunakan untuk bootstrap Identity. Token ini adalah aset Identity yang paling berharga, yang bisa digunakan untuk mendapatkan hak istimewa admin awan.
tr_tr: Yönetici belirteci genellikle Kimliği önyüklemek için kullanılır. Bu belirteç, bulut yöneticisi ayrıcalıkları kazanmak için kullanılabilecek en değerli Kimlik varlığıdır.

source: The administrator can grant access to the private share type for the demo tenant with the tenant ID equal to df29a37db5ae48d19b349fe947fada46:
de: Der Administrator kann den Zugriff auf den privaten Anteilstyp für den demo-Tenant mit der Tenant-ID gleich df29a37db5ae48d19b349fe947fada46 gewähren:
id: Administrator dapat memberikan akses ke jenis share privat untuk penyewa demo dengan ID penyewa sama dengan df29a37db5ae48d19b349fe947fada46:
tr_tr: Yönetici, kiracı kimliği df29a37db5ae48d19b349fe947fada46 olan demo kiracısı için gizli paylaşım türüne erişim izni verebilir:

source: The amount of information that can be gathered about a system and its users should be minimized.
de: Die Menge an Informationen, die über ein System und seine Benutzer gesammelt werden können, sollte minimiert werden.
id: Jumlah informasi yang bisa dikumpulkan tentang suatu sistem dan penggunanya harus diminimalkan.
tr_tr: Bir sistem hakkında toplanabilecek bilgi miktarıdır ve onun kullanıcıları azaltılmalıdır.

source: The ansible-hardening project provides an Ansible role that applies security controls to a wide array of Linux operating systems. It can also be used to audit an existing system. Each control is carefully reviewed to determine if it could cause harm to a production system. The controls are based on the Red Hat Enterprise Linux 7 STIG.
de: Das ansible-hardening Projekt bietet eine Ansible Rolle, die Sicherheitskontrollen auf eine breite Palette von Linux-Betriebssystemen anwendet. Es kann auch verwendet werden, um ein bestehendes System zu prüfen. Jede Kontrolle wird sorgfältig überprüft, um festzustellen, ob sie ein Produktionssystem beschädigen könnte. Die Bedienelemente basieren auf dem Red Hat Enterprise Linux 7 STIG.
id: Proyek ansible-hardening memberikan peran penting yang menerapkan kontrol keamanan ke beragam sistem operasi Linux. Ini juga bisa digunakan untuk mengaudit sistem yang ada. Setiap kontrol ditinjau ulang secara seksama untuk menentukan apakah hal itu dapat menyebabkan kerusakan pada sistem produksi. Kontrol didasarkan pada Red Hat Enterprise Linux 7 STIG.
tr_tr: Ansible-hardening projesi, güvenlik kontrollerini geniş bir Linux işletim sistem dizisi için geçerli bir Ansible rolü sağlar. Mevcut bir sistemi denetlemek için de kullanılabilir. Her bir kontrol, bir üretim sistemine zarar verip vermeyeceğini belirlemek için dikkatlice gözden geçirilir. Kontroller, Red Hat Enterprise Linux 7 STIG'a dayanıyor.
