Repository: openstack/security-doc
Catalog: security-guide/source/locale/*/LC_MESSAGES/security-guide.po
Languages: de, id, tr_tr

source: Browser-based access to the OpenStack cloud, whether through the dashboard or other applications, introduces additional considerations. Modern browsers all support some form of password storage and autofilling of credentials for remembered sites. This can be useful when using strong passwords that cannot be easily remembered or typed, but may cause the browser to become the weak link if the physical security of the client is compromised. If the browser's password store itself is not protected by a strong password, or if the password store is allowed to remain unlocked for the duration of the session, unauthorized access to your system can be easily obtained.
de: Browser-basierter Zugriff auf die OpenStack-Cloud, ob über das Dashboard oder andere Anwendungen, führt zusätzliche Überlegungen ein. Moderne Browser unterstützen alle Arten von Passwort-Speicherung und Autofilling von Anmeldeinformationen für gespeicherte Websites. Dies kann nützlich sein, wenn Sie starke Passwörter verwenden, die nicht leicht gespeichert oder eingegeben werden können, aber der Browser kann zum schwachen Glied werden, wenn die physische Sicherheit des Clients beeinträchtigt wird. Wenn das Passwort des Browsers selbst nicht durch ein starkes Passwort geschützt ist oder wenn der Passwortspeicher für die Dauer der Sitzung freigeschaltet bleibt, kann ein unbefugter Zugriff auf Ihr System leicht erreicht werden.
id: Akses berbasis browser ke awan OpenStack, baik melalui dashboard maupun aplikasi lainnya, memperkenalkan pertimbangan tambahan. Browser modern semua mendukung beberapa bentuk penyimpanan kata sandi dan autofilling kredensial untuk situs yang diingat. Ini bisa berguna saat menggunakan kata kunci kuat yang tidak mudah diingat atau diketik, namun bisa menyebabkan browser menjadi lemah jika keamanan fisik klien terganggu. Jika penyimpanan kata kunci browser itu sendiri tidak dilindungi oleh kata sandi yang kuat, atau jika penyimpanan kata sandi diizinkan tetap tidak terkunci selama sesi berlangsung, akses yang tidak sah ke sistem Anda dapat diperoleh dengan mudah.
tr_tr: Panel veya diğer uygulamalar aracılığıyla OpenStack bulutuna tarayıcı tabanlı erişim, ek hususlar getiriyor. Modern tarayıcıların tümü, hatırlanan siteler için kimlik belgelerinin otomatik olarak doldurulması ve bazı parola saklama alanlarını desteklemektedir. Bu, kolayca hatırlanamayan veya yazılmayan güçlü parolaları kullanırken yararlı olabilir, ancak istemcinin fiziksel güvenliği tehlikeye atılırsa, tarayıcının zayıf bağlantı haline gelmesine neden olabilir. Tarayıcının parola deposunun kendisi güçlü bir parolayla korunmuyorsa veya şifre deposunun oturum süresi boyunca kilitli kalmasına izin verilirse, sisteminize yetkisiz erişim kolayca elde edilebilir.

source: By default, Quality of Service (QoS) policies and rules are managed by the cloud administrator, which results in tenants being unable to create specific QoS rules, or to attach specific ports to policies. In some use cases, such as some telecommunications applications, the administrator may trust the tenants and therefore let them create and attach their own policies to ports. This can be achieved by modifying the ``policy.json`` file and `specific documentation <https://specs.openstack.org/openstack/neutron-specs/specs/liberty/qos-api-extension.html>`_. will be released with the extension.
de: Standardmäßig werden Richtlinien und Regeln von Quality of Service (QoS) vom Cloud-Administrator verwaltet, was dazu führt, dass Tenant keine bestimmten QoS-Regeln erstellen oder bestimmte Ports an Richtlinien anhängen können. In einigen Anwendungsfällen, wie z. B. einigen Telekommunikationsanwendungen, kann der Administrator dem Tenant vertrauen und ihn daher seine eigenen Richtlinien an Ports anlegen und anhängen lassen. Dies kann durch die Änderung der ``policy.json``Datei und `spezifische Dokumentation` erreicht werden <https://specs.openstack.org/openstack/neutron-specs/specs/liberty/qos-api-extension.html>`_. wird mit der Erweiterung freigegeben.
id: Secara default, kebijakan dan aturan Quality of Service (QoS) dikelola oleh administrator awan, yang mengakibatkan penyewa tidak dapat membuat aturan QoS tertentu, atau untuk melampirkan port tertentu ke kebijakan. Dalam beberapa kasus penggunaan, seperti beberapa aplikasi telekomunikasi, administrator dapat mempercayai penyewa dan karena itu membiarkan mereka membuat dan melampirkan kebijakan mereka sendiri ke port. Hal ini dapat dicapai dengan memodifikasi file `policy.json` dan `specific documentation <https://specs.openstack.org/openstack/neutron-specs/specs/liberty/qos-api-extension.html>`_. akan dirilis dengan ekstensi.
tr_tr: Varsayılan olarak, Hizmet Kalitesi (QoS) ilkeleri ve kuralları bulut yöneticisi tarafından yönetilir; kiracılar belirli QoS kuralları oluşturamaz veya politikalara belirli portlar ekleyemezler. Bazı haberleşme uygulamaları gibi bazı kullanım durumlarda, yönetici kiracılara güvenebilir ve bu nedenle kendi ilkelerini portlara ekleyip bunlara portlara bağlayabilir. Bu, ``policy.json`` dosyasını değiştirerek ve uzantı ile yayınlanacak `özel belgelendirmeler <https://specs.openstack.org/openstack/neutron-specs/specs/liberty/qos-api-extension.html>`_ ile başarılabilir.

source: By default, each of the OpenStack services and their processes access the database using a shared set of credentials. This makes auditing database operations and revoking access privileges from a service and its processes to the database particularly difficult.
de: Standardmäßig greift jeder der OpenStack-Dienste und deren Prozesse auf die Datenbank zu, indem er einen gemeinsamen Satz von Anmeldeinformationen verwendet. Dies macht Audit-Datenbank-Operationen und widerruft Zugriffsberechtigungen von einem Dienst und seine Prozesse auf die Datenbank besonders schwierig.
id: Secara default, masing-masing layanan OpenStack dan prosesnya mengakses database menggunakan sekumpulan kredensial bersama. Hal ini membuat operasi database auditing dan mencabut hak akses dari sebuah layanan dan prosesnya ke database sangat sulit dilakukan.
tr_tr: Varsayılan olarak, OpenStack servislerinin ve süreçlerinin her biri, paylaşılan bir kimlik bilgisi kümesi kullanarak veritabanına erişir. Bu, veritabanı işlemlerini denetlemeyi ve bir hizmetten ve işlemlerinden veritabanına erişim ayrıcalıklarını özellikle zorlaştırır.

source: By default, share types are created as public. While creating a share type, use ``--is_public`` parameter set to ``False`` to make your share type private which will prevent other tenants from seeing it in a list of share types and creating new shares with it. On the other hand, *public* share types are available to every tenant in a cloud.
de: Standardmäßig werden Freigabetypen als öffentlich angelegt. Beim Erstellen eines Freigabe-Typs verwenden Sie ``--is_public``-Parametersatz auf `` False``, um Ihren Freigabetyp privat zu machen, der verhindert, dass andere Tenants sie in einer Liste von Freigabetypen sehen und neue Freigaben mit ihm erstellen. Auf der anderen Seite stehen für jeden Tenant in einer Cloud * public* Freigabetypen zur Verfügung.
id: Secara default, jenis share dibuat sebagai publik. Saat membuat jenis share, gunakan parameter ``--is_public`` yang disetel ke ``False`` untuk menjadikan tipe share Anda pribadi yang akan mencegah penyewa lain melihatnya di daftar jenis share dan membuat share baru dengannya. Di sisi lain, jenis share *public* tersedia untuk setiap penyewa di awan.
tr_tr: Varsayılan olarak, paylaşım türleri herkese açık olarak oluşturulur. Bir paylaşım türü oluştururken, paylaşım türünü gizli yaparak diğer kiracıların bir paylaşım türü listesinde görmesini ve onunla yeni paylaşımlar oluşturmasını engellemek için ``--is_public`` parametresini ``False`` olarak ayarlayın. Öte yandan, her kiracı bir bulutta *genel* paylaşım türlerini kullanabilir.

source: By default, the Shared File Systems API service listens only on the port ``8786`` with ``tcp6`` type that supports both IPv4 and IPv6.
de: Standardmäßig lauscht der API-Dienst der Shared File Systems nur auf dem Port ``8786`` mit ``tcp6``Typ, der sowohl IPv4 als auch IPv6 unterstützt.
id: Secara default, layanan Shared File Systems API hanya mendengarkan pada port ``8786`` dengan tipe ``tcp6`` yang mendukung IPv4 dan IPv6.
tr_tr: Varsayılan olarak, Paylaşımlı Dosya Sistemleri API servisi, IPv4 ve IPv6'yi destekleyen ``tcp6`` tipi ile ``8786`` portunu dinler.

source: By default, the remote desktop traffic is not encrypted. TLS can be enabled to encrypt the VNC traffic. Refer to :doc:`../secure-communication/introduction-to-ssl-and-tls` for appropriate recommendations.
de: Standardmäßig ist der Remote-Desktop-Verkehr nicht verschlüsselt. TLS kann aktiviert werden, um den VNC-Verkehr zu verschlüsseln. Siehe :doc:`../ secure-communication/Einführung-to-ssl-and-tls` für entsprechende Empfehlungen.
id: Secara default, lalu lintas desktop jarak jauh tidak dienkripsi. TLS dapat diaktifkan untuk mengenkripsi lalu lintas VNC. Lihat :doc:`../secure-communication/introduction-to-ssl-and-tls` untuk rekomendasi yang tepat.
tr_tr: Varsayılan olarak, uzak masaüstü trafiği şifrelenmez. TLS, VNC trafiğini şifrelemek için etkinleştirilebilir. Uygun tavsiyeler için: :doc:`../secure-communication/ssl-and-tls` ye giriş bölümüne bakınız.

source: By default, when a share is created and has its export location, the Shared File Systems service expects that nobody can access the share by mounting it. Please note that the share driver you use can change this configuration, or it can be directly changed on the share storage. To ensure access to the share, check the mounting config for the export protocol.
de: Wenn ein Freigabe erstellt wird und seinen Exportort hat, erwartet der Shared File Systems Service standardmäßig, dass niemand auf die Freigabe zugreifen kann. Bitte beachten Sie, dass der von Ihnen verwendete Share-Treiber diese Konfiguration ändern kann oder direkt auf dem Share-Storage geändert werden kann. Um den Zugriff auf die Freigabe zu gewährleisten, überprüfen Sie die Mount-Konfiguration für das Exportprotokoll.
id: Secara default, bila share dibuat dan memiliki lokasi ekspor, layanan Shared File Systems mengharapkan tidak ada yang dapat mengakses share dengan mounting. Harap dicatat bahwa share driver yang Anda gunakan dapat mengubah konfigurasi ini, atau bisa langsung diubah pada penyimpanan share. Untuk memastikan akses ke share, periksa konfigurasi pemasangan untuk protokol ekspor.
tr_tr: Varsayılan olarak, bir paylaşım oluşturulduğunda ve dışa aktarma konumunda olduğunda, Paylaşımlı Dosya Sistemleri servisi, kimsenin onu paylaşarak paylaşıma erişmesini beklememektedir. Kullandığınız paylaşım sürücüsünün bu yapılandırmayı değiştirebileceğini veya paylaşım deposunda doğrudan değiştirilebileceğini lütfen unutmayın. Paylaşıma erişim sağlamak için, dışa aktarma protokolünün bağlama yapılandırmasını kontrol edin.

source: By their nature, public clouds are exposed to a higher degree of risk. As a consumer of a public cloud, you should validate that your selected provider has the necessary certifications, attestations, and other regulatory considerations. As a public cloud provider, depending on your target customers, you might be subject to one or more regulations. Additionally, even if not required to meet regulatory requirements, a provider should ensure tenant isolation as well as protecting management infrastructure from external attacks.
de: Öffentliche Clouds sind naturgemäß einem höheren Risiko ausgesetzt. Als Nutzer einer öffentlichen Cloud sollten Sie sicherstellen, dass Ihr ausgewählter Anbieter über die erforderlichen Zertifizierungen, Bescheinigungen und sonstigen behördlichen Erwägungen verfügt. Als öffentlicher Cloud-Anbieter unterliegen Sie abhängig von Ihren Zielkunden möglicherweise einer oder mehreren Bestimmungen. Darüber hinaus sollte ein Anbieter, auch wenn er nicht verpflichtet ist, die gesetzlichen Anforderungen zu erfüllen, die Isolierung der Mandanten sicherstellen und die Verwaltungsinfrastruktur vor Angriffen von außen schützen.
id: Menurut sifatnya, awan publik terkena tingkat risiko yang lebih tinggi. Sebagai konsumen awan publik, Anda harus memvalidasi bahwa penyedia pilihan Anda memiliki sertifikasi, atestasi, dan pertimbangan peraturan lainnya yang diperlukan. Sebagai penyedia awan publik, bergantung pada target pelanggan Anda, Anda mungkin dikenai satu atau lebih peraturan. Selain itu, meski tidak diharuskan memenuhi persyaratan peraturan, penyedia harus memastikan isolasi penyewa sekaligus melindungi infrastruktur manajemen dari serangan luar.

source: By using the previously returned token, the user can issue requests to the list projects and domains that are accessible.
de: Durch die Verwendung des zuvor zurückgegebenen Tokens kann der Benutzer Anfragen an die Listenprojekte und Domains ausgeben, auf die zugegriffen werden kann.
tr_tr: Daha önce döndürülen belirteci kullanarak, kullanıcı liste projelerine ve erişilebilir alanlara istekte bulunabilir.

source: CA is a trusted entity, both by the end party and the party that relies upon the certificate for certification policies, management handling, and certificate issuance.
de: CA ist eine vertrauenswürdige Entität, sowohl von der Endpartei als auch von der Partei, die auf dem Zertifikat für Zertifizierungsrichtlinien, Managementabwicklung und Zertifikatsausgabe beruht.
id: CA adalah entitas terpercaya, baik oleh end party maupun party yang bergantung pada sertifikat untuk kebijakan sertifikasi, penanganan manajemen, dan penerbitan sertifikat.
tr_tr: CA, son taraf tarafından hem sertifika ilkeleri, yönetim yönetimi ve sertifika verme için sertifikaya güvenen taraflardan güvenilir bir varlıktır.

source: CIS regularly publishes security benchmarks as well as automated tools that apply those security controls automatically. These benchmarks are published under a `Creative Commons license <https://creativecommons.org/licenses/by-nc-sa/4.0/legalcode>`_ that has some limitations.
de: CIS veröffentlicht regelmäßig Sicherheits-Benchmarks sowie automatisierte Tools, die diese Sicherheitskontrollen automatisch anwenden. Diese Benchmarks werden unter einer `Creative Commons Lizenz veröffentlicht <https://creativecommons.org/licenses/by-nc-sa/4.0/legalcode>`_ das hat einige einschränkungen
id: CIS secara teratur menerbitkan tolok ukur keamanan serta alat otomatis yang menerapkan kontrol keamanan secara otomatis. Tolok ukur ini dipublikasikan di bawah `Creative Commons license <https://creativecommons.org/licenses/by-nc-sa/4.0/legalcode>`_ yang memiliki beberapa keterbatasan.
tr_tr: CIS düzenli olarak bu güvenlik denetimlerini otomatik olarak uygulayan güvenlik ölçütlerini ve otomatik araçları yayınlar. Bu kıyaslamalar, bazı sınırlamaları olan bir `Creative Commons lisansı <https://creativecommons.org/licenses/by-nc-sa/4.0/legalcode>`_ altında yayınlanmaktadır.

source: CRL issuer
de: CRL-Emittent
tr_tr: CRL veren

source: CSRF (Cross-site request forgery) is an attack which forces an end user to execute unauthorized commands on a web application in which he/she is currently authenticated. A successful CSRF exploit can compromise end user data and operations. If the targeted end user has admin privileges, this can compromise the entire web application.
de: CSRF (Cross-Site Request Forgery) ist ein Angriff, der einen Endbenutzer dazu zwingt, nicht autorisierte Befehle auf einer Webanwendung auszuführen, in der er gerade authentifiziert wird. Eine erfolgreiche CSRF-Exploit kann Endbenutzerdaten und -operationen beeinträchtigen. Wenn der gezielte Endbenutzer Administratorrechte hat, kann dies die gesamte Webanwendung beeinträchtigen.
id: CSRF (Cross-site request forgery) adalah serangan yang memaksa end user untuk menjalankan perintah yang tidak sah pada aplikasi web yang saat ini dia otentikasi. Eksploitasi CSRF yang berhasil dapat membahayakan data dan operasi end user. Jika end user yang ditargetkan memiliki hak istimewa admin, ini dapat membahayakan keseluruhan aplikasi web.
tr_tr: CSRF (Siteler arası istek sahtekarlığı), son kullanıcıyı, o anda kimliği doğrulanmış bir web uygulamasında yetkisiz komutları çalıştırmaya zorlayan bir saldırıdır. Başarılı bir CSRF istismarı, son kullanıcı verilerini ve operasyonlarını tehlikeye atabilir. Hedeflenen son kullanıcının yönetici ayrıcalıkları varsa, bu tüm web uygulamasını tehlikeye düşürebilir.

source: Capabilities
de: Fähigkeiten
tr_tr: Yetenekler

source: Careful consideration should be given to potential outbound abuse from a cloud deployment. Whether public or private, clouds tend to have lots of resource available. An attacker who has established a point of presence within the cloud, either through hacking or entitled access, such as rogue employee, can bring these resources to bear against the internet at large. Clouds with compute services make for ideal DDoS and brute force engines. The issue is more pressing for public clouds as their users are largely unaccountable, and can quickly spin up numerous disposable instances for outbound attacks. Major damage can be inflicted upon a company's reputation if it becomes known for hosting malicious software or launching attacks on other networks. Methods of prevention include egress security groups, outbound traffic inspection, customer education and awareness, and fraud and abuse mitigation strategies.
de: Sorgfältige Berücksichtigung von potenziellen Outbound-Missbrauch aus einer Cloud-Bereitstellung. Ob öffentlich oder privat, Clouds neigen dazu, viel Ressourcen zur Verfügung zu haben. Ein Angreifer, der in der Cloud einen Punkt der Präsenz in der Cloud etabliert hat, kann entweder durch Hacken oder berechtigten Zugang, wie z. B. Schurkenarbeiter, diese Ressourcen gegen das Internet einsetzen. Clouds mit Compute Services sorgen für ideale DDoS- und Brute-Power-Motoren. Das Problem ist dringender für öffentliche Clouds, da ihre Benutzer weitgehend unerklärlich sind und schnell eine hohe Anzahl von Einweg-Instanzen für ausgehende Angriffe starten können. Größere Schäden können dem Ruf eines Unternehmens zugerechnet werden, wenn es bekannt ist, schädliche Software zu hosten oder Angriffe auf andere Netzwerke zu starten. Methoden der Prävention gehören ausgehende Sicherheits-Gruppen, ausgehende Verkehrskontrolle, Kundenerziehung und Bewusstsein, und Betrug und Strategie zur Abschwächung von Missbrauch.
id: Pertimbangan yang cermat harus diberikan pada penyalahgunaan outbound potensial dari penyebaran awan. Apakah publik atau private, awan cenderung memiliki banyak sumber daya yang tersedia. Seorang penyerang yang telah memiliki titik kehadiran (point of presence) di dalam awan, baik melalui akses hacking atau berhak, seperti pegawai nakal, dapat membawa sumber daya ini untuk menghadapi internet secara keseluruhan. Awan dengan layanan komputasi membuat mesin DDoS dan brute force ideal. Masalahnya lebih mendesak untuk awan publik karena pengguna mereka sebagian besar tidak bertanggung jawab, dan dengan cepat dapat memutar banyak disposable instance sekali pakai untuk serangan keluar. Kerusakan besar dapat ditimbulkan atas reputasi perusahaan jika diketahui meng-host perangkat lunak berbahaya atau meluncurkan serangan ke jaringan lain. Metode pencegahan meliputi kelompok keamanan egress, inspeksi lalu lintas keluar, edukasi dan kesadaran pelanggan, dan strategi mitigasi penyalahgunaan dan penyalahgunaan.
tr_tr: Bulut dağıtımından kaynaklanan olası istismarlara dikkatli bir özen gösterilmelidir. Kamu ya da özel olsun bulutlar çok miktarda kaynak bulundurma eğilimindedir. Bulut içerisindeki haydut veya yetkisiz erişim yoluyla bir varlık noktası belirleyen bir saldırgan, bu kaynakları tümüyle internete karşı dayatabilir. Hesaplama servislerine sahip bulutlar, ideal DDoS ve kaba kuvvetli motorlar sağlar. Kullanıcılar genelde anlaşılmaz olduğu için bu konu halka açık bulutlar için daha büyük önem taşıyor ve giden saldırılar için sayısız atılabilir örneği hızla artırabilir. Kötü amaçlı yazılım barındırması veya diğer ağlarda saldırı başlatılması bilinen bir şirketin itibarına büyük zarar verilebilir. Önleme yöntemleri, çıkış güvenlik grupları, giden trafik denetimi, müşteri eğitimi ve farkındalık, sahtecilik ve suiistimal azaltma stratejilerini içerir.

source: Castellan is a generic Key Manager interface developed by the Barbican team. It enables projects to use a configurable key manager that can be deployment specific.
de: Castellan ist eine generische Key Manager-Schnittstelle, die vom Barbican-Team entwickelt wurde. Es ermöglicht Projekten, einen konfigurierbaren Schlüsselmanager zu verwenden, der deployment-spezifisch sein kann.
id: Castellan adalah antarmuka Key Manager generik yang dikembangkan oleh tim Barbican. Ini memungkinkan proyek menggunakan manajer kunci yang dapat dikonfigurasi yang dapat diterapkan secara spesifik.

source: Certificate Repository
de: Zertifikat-Repository
tr_tr: Sertifika Deposu

source: Certificates used to support TLS on internet facing cloud endpoints (or customer interfaces where the customer is not expected to have installed anything other than standard operating system provided certificate bundles) should be provisioned using Certificate Authorities that are installed in the operating system certificate bundle. Typical well known vendors include Let's Encrypt, Verisign and Thawte but many others exist.
de: Zertifikate, die zur Unterstützung von TLS im Internet mit Cloud-Endpunkten (oder Kundenschnittstellen, bei denen der Kunde nicht erwartet wird, dass es andere als Standard-Betriebssystem-bereitgestellte Zertifikatsbündel installiert hat) unterstützt werden, sollten mit Zertifikatsautoritäten bereitgestellt werden, die im Betriebssystem-Zertifikatsbündel installiert sind. Typische bekannte Anbieter sind Let's Encrypt, Verisign und Thawte, aber viele andere existieren.
id: Sertifikat yang digunakan untuk mendukung TLS di internet yang menghadapi endpoint awan (atau antarmuka pelanggan yang tidak diharapkan pelanggannya telah menginstal apa pun selain kumpulan berkas sistem operasi standar yang disediakan) harus disediakan menggunakan Certificate Authorities yang terpasang dalam berkas sertifikat sistem operasi. Vendor terkenal yang terkenal termasuk Let's Encrypt, Verisign dan Thawte tapi ada banyak lainnya.
tr_tr: Bulut uç noktalarına (veya müşterinin standart işletim sistemi tarafından sağlanan sertifika paketleri dışında bir şey yüklememesi beklenen müşteri arayüzleri) İnternet'te TLS'yi desteklemek için kullanılan sertifikalar, işletim sistemi sertifika paketinde yüklü olan Sertifika Otoriteleri kullanılarak sağlanmalıdır. Tipik tanınmış sağlayıcılar Let's Encrypt, Verisign ve Thawte'dir ancak diğerleri mevcuttur.

source: Certification Authority (:term:`CA <certificate authority (CA)>`)
de: Zertifizierungsstelle (:term:`CA <certificate authority (CA)>`)
tr_tr: Sertifikasyon Otoritesi (:term:`CA <sertifika otoritesi (CA)>`)

source: Certification and compliance statements
de: Zertifizierungen und Compliance Statements
id: Pernyataan sertifikasi dan kepatuhan
tr_tr: Sertifikalandırma ve uyum ifadeleri

source: Certification authorities
de: Zertifizierungsstellen
id: Otoritas sertifikasi
tr_tr: Sertifika otoriteleri

source: Certifications and attestations
de: Zertifizierungen und Bescheinigungen
id: Sertifikasi dan pengesahan
tr_tr: Sertifikalar ve onaylamalar

source: Check-Block-01: Is user/group ownership of config files set to root/cinder?
de: Check-Block-01: Ist Benutzer-/Gruppen-Besitz von Konfigurationsdateien auf root/cinder eingestellt?
id: Check-Block-01: Apakah user/group ownership dari file konfigurasi diset ke root/cinder?
tr_tr: Check-Block-01: Yapılandırma dosyalarının kullanıcı/grup sahipliği root/cinder olarak ayarlandı mı?
