Repository: openstack/security-doc
Catalog: security-guide/source/locale/*/LC_MESSAGES/security-guide.po
Languages: de, id, tr_tr

source: Deployers or users of OpenStack with strong security requirements may want to consider deploying these technologies. Not all are applicable in every situation. In some cases, technologies may be ruled out for use in a cloud because of prescriptive business requirements. Similarly some technologies inspect instance data such as run state which may be undesirable to the users of the system.
de: Bereitsteller oder Benutzer von OpenStack mit starken Sicherheitsanforderungen können die Implementierung dieser Technologien in Erwägung ziehen. Nicht alle sind in jeder Situation anwendbar. In einigen Fällen können Technologien wegen der vorgeschriebenen Geschäftsanforderungen für den Einsatz in einer Cloud ausgeschlossen werden. Ähnlich untersuchen einige Technologien Instanzdaten, wie z. B. Laufzustand, der für die Benutzer des Systems unerwünscht sein kann.
id: Deployer atau pengguna OpenStack dengan persyaratan keamanan yang kuat mungkin ingin mempertimbangkan penggelaran teknologi ini. Tidak semua bisa diterapkan dalam setiap situasi. Dalam beberapa kasus, teknologi mungkin dikesampingkan untuk digunakan di awan karena persyaratan bisnis yang ditentukan. Demikian pula beberapa teknologi memeriksa data instance seperti run state yang mungkin tidak diinginkan pengguna sistem.
tr_tr: Güçlü güvenlik gereksinimleri olan OpenStack'in dağıtımcıları veya kullanıcıları, bu teknolojileri kullanmayı düşünebilir. Her şey, her durumda geçerli değildir. Bazı durumlarda, teknolojiler, kurallara uygun işletme gereklilikleri nedeniyle bir bulutta kullanılmak üzere hariç tutulabilir. Benzer şekilde bazı teknolojiler, sistemin kullanıcıları için istenmeyebilecek olan çalışma durumu gibi örnek verilerini incelerler.

source: Deploying the updates
de: Bereitstellung der Updates
id: Menyebarkan pembaruan
tr_tr: Güncelleştirmeleri uygulamak

source: Description
de: Beschreibung
id: Deskripsi
tr_tr: Açıklama

source: Destination libvirtd host copies the instances back to an underlying hypervisor.
de: Destination libvirtd host kopiert die Instanzen zurück zu einem zugrundeliegenden Hypervisor.
id: Tujuan libvirtd host menyalin instance kembali ke hypervisor yang mendasarinya.
tr_tr: Hedef libvirtd sunucu, örnekleri alttaki bir hipervizör'e geri kopyalar.

source: Destroy cloud system media that cannot be sanitized.
de: Zerstöre Cloud-System Medien, die nicht saniert werden können.
id: Hancurkan media sistem cloud yang tidak bisa di sanitasi.
tr_tr: Temizleme işlemine tabi tutulamayan bulut sistemi ortamını yok edin.

source: Detecting the absence of log generation is an event of high value. Such an event would indicate a service failure or even an intruder who has temporarily switched off logging or modified the log level to hide their tracks.
de: Das Erkennen der Abwesenheit der Protokollgenerierung ist ein Ereignis mit hohem Wert. Ein solches Ereignis würde einen Dienstausfall oder sogar einen Eindringling anzeigen, der die Protokollierung vorübergehend ausgeschaltet hat oder die Log-Ebene geändert hat, um ihre Spuren zu verbergen.
id: Mendeteksi tidak adanya generasi log adalah peristiwa bernilai tinggi. Peristiwa semacam itu akan menunjukkan kegagalan layanan atau bahkan penyusup yang mematikan sementara logging atau memodifikasi tingkat log untuk menyembunyikan jejak mereka.
tr_tr: Günlük üretimin yokluğunun tespit edilmesi, yüksek değerli bir olaydır. Böyle bir olay, servis hatasına veya hatta geçici olarak günlüğü kapatan veya izlerini gizlemek için günlük düzeyini değiştiren bir saldırgana işaret eder.

source: Determine accessible resources.
de: Ermitteln Sie zugängliche Ressourcen.
tr_tr: Erişilebilir kaynakları belirlemek.

source: Determining audit scope
de: Ermittlung des Prüfungsumfangs
id: Menentukan cakupan audit
tr_tr: Denetim kapsamına karar vermek

source: Determining audit scope, specifically what controls are needed and how to design or modify an OpenStack deployment to satisfy them, should be the initial planning step.
de: Ermittlung des Auditumfangs, speziell welche Kontrollen benötigt werden und wie man eine OpenStack-Implementierung entwirft oder modifiziert, um sie zu befriedigen, sollte der erste Planungsschritt sein.
id: Menentukan lingkup audit, khususnya kontrol apa yang dibutuhkan dan bagaimana merancang atau memodifikasi penyebaran OpenStack untuk memuaskan mereka, seharusnya hal ini merupakan langkah perencanaan awal.
tr_tr: Denetim kapsamının belirlenmesi, özellikle de hangi denetime ihtiyaç duyulduğu ve onları tatmin etmek için bir OpenStack dağıtımının nasıl tasarlanacağı veya değiştirileceği ilk planlama adımında olmalıdır.

source: Different authentication services are supported by different share drivers. For details of supporting of features by different drivers, see `Manila share features support mapping <https://docs.openstack.org/manila/latest/contributor/share_back_ends_feature_support_mapping.html>`_. Support for a specific authentication service by a driver does not mean that it can be configured with any shared file system protocol. Supported shared file systems protocols are NFS, CIFS, GlusterFS, and HDFS. See the driver vendor's documentation for information on a specific driver and its configuration for security services.
de: Verschiedene Authentifizierungsdienste werden von verschiedenen Freigabe- Treibern unterstützt. Weitere Informationen zur Unterstützung von Features durch verschiedene Treiber finden Sie unter `Manila Share Features Support Mapping <https://docs.openstack.org/manila/latest/contributor/share_back_ends_feature_support_mapping.html> `_. Die Unterstützung eines bestimmten Authentifizierungsdienstes durch einen Treiber bedeutet nicht, dass er mit einem beliebigen Dateisystemprotokoll konfiguriert werden kann. Unterstützte freigegebene Dateisystemprotokolle sind NFS, CIFS, GlusterFS und HDFS. In der Dokumentation des Treiberherstellers finden Sie Informationen zu einem bestimmten Treiber und dessen Konfiguration für Sicherheitsdienste.
id: Layanan otentikasi yang berbeda didukung oleh driver share yang berbeda. Untuk rincian dukungan fitur oleh driver yang berbeda, lihat `Manila share features support mapping <https://docs.openstack.org/manila/latest/contributor/share_back_ends_feature_support_mapping.html>`_. Dukungan untuk layanan otentikasi tertentu oleh driver tidak berarti dapat dikonfigurasi dengan protokol sistem file shared. Protokol sistem file shared yang didukung adalah NFS, CIFS, GlusterFS, dan HDFS. Lihat dokumentasi vendor driver untuk mendapatkan informasi mengenai driver khusus dan konfigurasinya untuk layanan keamanan.

source: Different drivers support different access options depending on which shared file system protocol is used. Supported shared file system protocols are NFS, CIFS, GlusterFS, and HDFS. For example, the Generic (Block Storage as a back end) driver does not support user and certificate authentication methods. It also does not support any of the security services, such as LDAP, Kerberos, or Active Directory. For details of features supported by different drivers, see `Manila share features support mapping <https://docs.openstack.org/manila/latest/contributor/share_back_ends_feature_support_mapping.html>`_.
de: Verschiedene Treiber unterstützen unterschiedliche Zugriffsoptionen, je nachdem, welches freigegebene Dateisystemprotokoll verwendet wird. Unterstützte freigegebene Dateisystemprotokolle sind NFS, CIFS, GlusterFS und HDFS. Beispielsweise unterstützt der Generic (Block Storage als Backend) -Treiber keine Benutzer- und Zertifikatsauthentifizierungsmethoden. Es unterstützt auch keine der Sicherheitsdienste wie LDAP, Kerberos oder Active Directory. Weitere Informationen zu Funktionen, die von verschiedenen Treibern unterstützt werden, finden Sie unter `Manila Share Features Support Mapping <https://docs.openstack.org/manila/latest/contributor/share_back_ends_feature_support_mapping.html>`_.
id: Driver yang berbeda mendukung pilihan akses yang berbeda tergantung pada protokol sistem file bersama yang digunakan. Protokol sistem file bersama yang didukung adalah NFS, CIFS, GlusterFS, dan HDFS. Misalnya, driver Generic (Block Storage as a back end) tidak mendukung metode otentikasi pengguna dan sertifikat. Ini juga tidak mendukung layanan keamanan apa pun, seperti LDAP, Kerberos, atau Active Directory. Untuk rincian fitur yang didukung oleh driver yang berbeda, lihat `Manila share features support mapping <https://docs.openstack.org/manila/latest/contributor/share_back_ends_feature_support_mapping.html>`_.

source: Digital Certificates
de: Digitale Zertifikate
tr_tr: Sayısal Sertifikalar

source: Direct memory access (DMA) is a feature that permits certain hardware devices to access arbitrary physical memory addresses in the host computer. Often video cards have this capability. However, an instance should not be given arbitrary physical memory access because this would give it full view of both the host system and other instances running on the same node. Hardware vendors use an input/output memory management unit (IOMMU) to manage DMA access in these situations. We recommend cloud architects should ensure that the hypervisor is configured to utilize this hardware feature.
de: Der Direktspeicherzugriff (DMA) ist ein Merkmal, das es bestimmten Hardwaregeräten ermöglicht, auf beliebige physikalische Speicheradressen im Hostcomputer zuzugreifen. Oft haben Grafikkarten diese Fähigkeit. Jedoch sollte eine Instanz keinen willkürlichen physischen Speicherzugriff erhalten, da dies eine vollständige Ansicht sowohl des Host-Systems als auch anderer Instanzen, die auf demselben Knoten laufen, geben würde. Hardware-Hersteller verwenden eine Input/Output-Speicherverwaltungseinheit (IOMMU), um den DMA-Zugriff in diesen Situationen zu verwalten. Wir empfehlen Cloud-Architekten sicherzustellen, dass der Hypervisor konfiguriert so ist, um diese Hardware-Funktion zu nutzen.
id: Direct memory access (DMA) adalah fitur yang memungkinkan perangkat keras tertentu mengakses alamat memori fisik secara acak di komputer host. Seringkali kartu video memiliki kemampuan ini. Namun, sebuah instance tidak boleh diberikan akses memori fisik yang acak karena ini akan memberikan tampilan penuh dari kedua sistem host dan instance lainnya yang berjalan pada node yang sama. Vendor perangkat keras menggunakan input/output memory management unit (IOMMU) untuk mengelola akses DMA dalam situasi ini. Kami merekomendasikan arsitek awan harus memastikan bahwa hypervisor dikonfigurasi untuk memanfaatkan fitur perangkat keras ini.
tr_tr: Doğrudan bellek erişimi (DMA), belirli donanım aygıtlarının ana bilgisayardaki rastgele fiziksel bellek adreslerine erişmesine izin veren bir özelliktir. Genellikle video kartları bu yeteneğe sahiptir. Bununla birlikte, bir örneğe rastgele fiziksel bellek erişimi verilmemelidir, çünkü bu hem ana sistem hem de aynı düğümde çalışan diğer örneklerin tam olarak görülebilmesini sağlar. Donanım üreticileri bu durumlarda DMA erişimini yönetmek için bir giriş / çıkış bellek yönetim birimi (IOMMU) kullanmaktadır. Bulut mimarlarının, hipervizörün bu donanım özelliğini kullanacak şekilde yapılandırıldığından emin olmasını öneririz.

source: Disable live migration
de: Live-Migration deaktivieren
id: Nonaktifkan migrasi langsung
tr_tr: Canlı göçü kapatmak

source: Disallows clear text.
de: Löscht Klartext.
id: Tidak mengizinkan teks yang jelas.
tr_tr: Düz metinlere izin verme.

source: Disallows export encryption algorithms, which by design tend to be weak, typically using 40 and 56 bit keys.
de: Enthält Export-Verschlüsselungsalgorithmen, die durch Design tendenziell schwach sind, in der Regel mit 40 und 56 Bit-Schlüssel.
id: Tidak mengizinkan algoritma enkripsi ekspor, yang menurut desainnya cenderung lemah, biasanya menggunakan kunci 40 dan 56 bit.
tr_tr: Tasarım gereği genellikle 40 ve 56 bitlik anahtarları kullanarak zayıf olma eğiliminde olan harici şifreleme algoritmalarına izin verme.

source: Disallows low (56 or 64 bit long keys) and medium (128 bit long keys) ciphers because of their vulnerability to brute force attacks (example 2-DES). This rule still permits Triple Data Encryption Standard (Triple DES) also known as Triple Data Encryption Algorithm (TDEA) and the Advanced Encryption Standard (AES), each of which has keys greater than equal to 128 bits and thus more secure.
de: Erlaubt niedrige (56 oder 64 Bit lange Schlüssel) und mittlere (128 Bit lange Schlüssel) Cipher wegen ihrer Anfälligkeit für Brute-Force-Attacken (Beispiel 2-DES). Diese Regel erlaubt immer noch den Triple Data Encryption Standard (Triple DES), der auch als Triple Data Encryption Algorithm (TDEA) und der Advanced Encryption Standard (AES) bekannt ist, von denen jeder Schlüssel größer als 128 Bits hat und damit sicherer ist.
id: Larang (56 or 64 bit long keys) rendah dan ciphers (128 bit long keys) menengah karena kerentanannya terhadap serangan brute force (contoh 2-DES). Aturan ini masih mengizinkan Triple Data Encryption Standard (Triple DES) yang juga dikenal sebagai Triple Data Encryption Algorithm (TDEA) dan Advanced Encryption Standard (AES), yang masing-masing memiliki kunci lebih besar dari pada 128 bit dan lebih aman.
tr_tr: Kaba kuvvet saldırılarına (örnek 2-DES) karşı savunmasızlıklarından ötürü düşük (56 veya 64 bit uzunluktaki anahtarlar) ve orta (128 bit uzunluktaki anahtarlar) şifrelere izin vermez. Bu kural yine de üçlü Veri Şifreleme Algoritması (TDEA) ve Gelişmiş Şifreleme Standardı (AES) olarak da bilinen Üçlü Veri Şifreleme Standardı'na (Triple DES) izin verir ve bunların her biri 128 bit'e eşit ve dolayısıyla daha güvenli anahtarlara sahiptir.

source: Disaster Recovery (DR) and Business Continuity Planning (BCP) plans are common requirements for ISMS and compliance activities. These plans must be periodically tested as well as documented. In OpenStack, key areas are found in the management security domain, and anywhere that single points of failure (SPOFs) can be identified.
de: Disaster Recovery (DR) und Business Continuity Planning (BCP) sind gemeinsame Anforderungen an ISMS und Compliance-Aktivitäten. Diese Pläne müssen regelmäßig geprüft und dokumentiert werden. In OpenStack finden sich Schlüsselbereiche in der Verwaltungssicherheitsdomäne und überall, wo einzelne Punkte des Fehlers (SPOFs) identifiziert werden können.
id: Disaster Recovery (DR) dan rencana Business Continuity Planning (BCP) adalah persyaratan umum untuk ISMS dan kegiatan kepatuhan. Rencana ini harus diuji secara berkala dan juga terdokumentasi. Di OpenStack, area utama ditemukan di domain keamanan manajemen, dan di manapun single points of failure (SPOFs) dapat diidentifikasi.
tr_tr: Felaket Kurtarma (DR) ve İş Sürekliliği Planlama (BCP) planları, ISMS ve uyumluluk faaliyetleri için ortak gereksinimlerdir. Bu planlar belgelenmiş olduğu kadar periyodik olarak test edilmelidir. OpenStack'te kilit alanlar, yönetim güvenlik alanlarında ve tek arıza noktalarının (SPOF'ların) tespit edilebildiği her yerde bulunur.

source: Discretionary Access Control
de: Diskretionäre Zugangskontrolle
tr_tr: İsteğe Bağlı Erişim Kontrolü

source: Discuss common control frameworks and certification resources to achieve industry certifications or regulator attestations.
de: Diskutieren Sie gemeinsame Kontrollrahmen und Zertifizierungsressourcen, um Industriezertifikate oder Regulierungsbescheinigungen zu erreichen.
id: Diskusikan kerangka kerja pengendalian bersama dan sumber sertifikasi untuk mendapatkan sertifikasi industri atau pengesahan regulator.
tr_tr: Endüstri sertifikalarını veya yönetmelik tasdiklerini elde etmek için yaygın kontrol çatılarını ve sertifikalandırma kaynaklarını tartışmak.

source: Discuss upcoming security features
de: Besprechen Sie die folgenden Sicherheitsmerkmale
id: Diskusikan fitur keamanan yang akan datang
tr_tr: Gelecek güvenlik özelliklerini tartışın

source: Django has dedicated middleware for cross-site request forgery (CSRF). For further details, see the `Django documentation <https://docs.djangoproject.com/>`_.
de: Django hat Middleware für Cross-Site Request Forgery (CSRF) gewidmet. Weitere Informationen finden Sie in der `Django Dokumentation <https://docs.djangoproject.com/>`_.
id: Django telah mendedikasikan middleware untuk cross-site request forgery (CSRF). Untuk keterangan lebih lanjut, lihat `Django documentation <https://docs.djangoproject.com/>`_.
tr_tr: Django, siteler arası talep sahteciliği (CSRF) için özel katman yazılımına sahiptir. Ayrıntılı bilgi için, `Django belgelerine <https://docs.djangoproject.com/>`_ bakın.

source: Django media settings are documented in the `Django documentation <https://docs.djangoproject.com/>`_.
de: Django Medieneinstellungen sind in der `Django Dokumentation dokumentiert <https://docs.djangoproject.com/>`_.
id: Pengaturan media Django didokumentasikan di `Django documentation <https://docs.djangoproject.com/>`_.
tr_tr: Django medya ayarları `Django belgelerinde <https://docs.djangoproject.com/>` _ belgelenmiştir.

source: Documentation should provide a general description of the OpenStack environment and cover all systems used (for example, production, development, or test). Documenting system components, networks, services, and software often provides the bird's-eye view needed to thoroughly cover and consider security concerns, attack vectors, and possible security domain bridging points. A system inventory may need to capture ephemeral resources such as virtual machines or virtual disk volumes that would otherwise be persistent resources in a traditional IT system.
de: Die Dokumentation sollte eine allgemeine Beschreibung der OpenStack-Umgebung geben und alle verwendeten Systeme (Produktion, Entwicklung, Test usw.) abdecken. Die Dokumentation von Systemkomponenten, Netzwerken, Diensten und Software bietet oft die Vogelperspektive, die erforderlich ist, um Sicherheitsbedenken, Angriffsvektoren und mögliche Sicherheitsüberbrückungspunkte sorgfältig abzudecken und zu berücksichtigen. Ein Systeminventory muss möglicherweise ephemeren Ressourcen wie virtuelle Maschinen oder virtuelle Datenträgerabbiler erfassen, die ansonsten persistente Ressourcen in einem herkömmlichen IT-System sein würden.
id: Dokumentasi harus memberikan gambaran umum tentang lingkungan OpenStack dan mencakup semua sistem yang digunakan (misalnya, produksi, pengembangan, atau pengujian). Mendokumentasikan komponen sistem, jaringan, layanan, dan perangkat lunak sering kali memberikan pandangan bird's-eye (mata burung) untuk menutupi dan mempertimbangkan masalah keamanan, vektor serangan, dan kemungkinan poin penjembatan domain keamanan. Inventarisasi sistem mungkin perlu menangkap sumber daya singkat seperti mesin virtual atau volume disk virtual yang jika tidak, sumber daya persisten akan ada dalam sistem Teknologi Informasi tradisional.

source: Domain names
de: Domain Namen
id: Nama domain
tr_tr: Alan adları

source: Domain names, dashboard upgrades, and basic web server configuration
de: Domain-Namen, Dashboard-Upgrades und grundlegende Web-Server-Konfiguration
id: Nama domain, upgrade dasbor, dan konfigurasi server web dasar
tr_tr: Alan adları, panel güncellemeleri ve temel web sunucusu yapılandırması

source: Domain-specific authentication drivers allow the Identity service to be configured for multiple domains using domain-specific configuration files. Enabling the drivers and setting the domain-specific configuration file location occur in the ``[identity]`` section of the ``keystone.conf`` file:
de: Domänenspezifische Authentifizierungstreiber ermöglichen es, den Identity- Dienst für mehrere Domänen mit domänenspezifischen Konfigurationsdateien zu konfigurieren. Die Aktivierung der Treiber und die Einstellung der domänenspezifischen Konfigurationsdateiposition erfolgen im ``[identity] `` Abschnitt der ``keystone.conf``Datei:
id: Driver otentikasi domain-specific memungkinkan layanan Identity dikonfigurasi untuk beberapa domain menggunakan file konfigurasi domain-specific. Mengaktifkan driver dan menyetel lokasi file konfigurasi domain-specific terjadi di bagian ``[identity] `` pada file ``keystone.conf``:
tr_tr: Alana özgü kimlik doğrulama sürücüleri, Kimlik servisinin alana özgü yapılandırma dosyaları kullanarak birden çok alan için yapılandırılmasını sağlar. Sürücüleri etkinleştirme ve alana özgü yapılandırma dosyası konumunu ayarlama, ``keystone.conf`` dosyasının ``[identity]`` bölümünde gerçekleşir:

source: Domains are high-level containers for projects, users and groups. As such, they can be used to centrally manage all keystone-based identity components. With the introduction of account domains, server, storage and other resources can now be logically grouped into multiple projects (previously called tenants) which can themselves be grouped under a master account-like container. In addition, multiple users can be managed within an account domain and assigned roles that vary for each project.
de: Domains sind hochrangige Container für Projekte, Benutzer und Gruppen. Als solche können sie verwendet werden, um alle Keystone-basierten Identitätskomponenten zentral zu verwalten. Mit der Einführung von Account-Domains können Server-, Speicher- und andere Ressourcen nun logisch in mehrere Projekte (bisher Tenants) gruppiert werden, die selbst unter einem Master-Account-Container gruppiert werden können. Darüber hinaus können mehrere Benutzer innerhalb einer Account-Domäne verwaltet und Rollen zugeordnet werden, die für jedes Projekt variieren.
id: Domain adalah wadah tingkat tinggi untuk proyek, pengguna, dan grup. Dengan demikian, mereka dapat digunakan untuk mengelola semua komponen identity keystone-based secara terpusat. Dengan diperkenalkannya domain akun, server, penyimpanan dan sumber daya lainnya sekarang dapat dikelompokkan secara logis ke dalam beberapa proyek (yang sebelumnya disebut tenant) yang dapat dikelompokkan dalam wadah seperti akun induk. Selain itu, beberapa pengguna dapat dikelola dalam domain akun dan peran yang ditetapkan berbeda untuk setiap proyek.
tr_tr: Alanlar, projeler, kullanıcılar ve gruplar için üst düzey kaplardır. Bu nedenle, keystone tabanlı kimlik bileşenlerini merkezi olarak yönetmek için kullanılabilirler. Hesap alanlarının tanıtılmasıyla birlikte, sunucu, depolama ve diğer kaynaklar, mantıksal olarak, ana hesap benzeri bir kapsayıcı altında gruplanabilen birden fazla projeye (önceden kiracı olarak adlandırıldı) gruplandırılabilir. Buna ek olarak, birden fazla kullanıcı bir hesap etki alanında yönetilebilir ve her proje için farklı roller atanabilir.
