Repository: openstack/security-doc
Catalog: security-guide/source/locale/*/LC_MESSAGES/security-guide.po
Languages: de, id, tr_tr

source: **Pass:** If value of parameter ``max_request_body_size`` under ``[oslo_middleware]`` section in ``manila.conf`` is set to ``114688``, or if value of parameter ``osapi_max_request_body_size`` under ``[DEFAULT]`` section in ``manila.conf`` is set to ``114688``. The parameter ``osapi_max_request_body_size`` under ``[DEFAULT]`` is deprecated and it is better to use [oslo_middleware]/``max_request_body_size``.
de: **Pass:** Wenn der Wert des Parameters ``max_request_body_size`` unter `` [oslo_middleware]``Abschnitt in ``manila.conf`` auf ``114688`` gesetzt ist oder wenn Wert des Parameters ``osapi_max_request_body_size` ist unter ``[DEFAULT]``Abschnitt in ``manila.conf`` ist auf ``114688`` gesetzt. Der Parameter ``osapi_max_request_body_size`` unter ``[DEFAULT] ``ist veraltet und es ist besser, [oslo_middleware]/`` max_request_body_size``zu verwenden.
id: **Pass:** Jika nilai parameter ``max_request_body_size`` di bagian ``[oslo_middleware] `` di ``manila.conf`` diatur ke ``114688``, atau jika nilai parameter ``osapi_max_request_body_size`` di bawah bagian ``[DEFAULT ] `` dalam ``manila.conf`` diatur ke ``114688``. Parameter ``osapi_max_request_body_size`` di bawah ``[DEFAULT] `` sudah tidak berlaku lagi dan lebih baik menggunakan [oslo_middleware]/``max_request_body_size``.
tr_tr: **Başarılı:** ``manila.conf`` dosyasında ``[oslo_middleware]`` bölümündeki ``max_request_body_size`` parametresinin değeri ``114688`` ise ya da ``manila.conf`` dosyasında ``[oslo_middleware]`` bölümündeki ``osapi_max_request_body_size`` parametresinin değeri ``114688`` ise. ``[DEFAULT]`` altındaki ``osapi_max_request_body_size`` parametresi artık kullanılmıyor, [oslo_middleware]/``max_request_body_size`` kullanmak daha iyi.

source: **Pass:** If value of parameter ``nas_secure_file_permissions`` under ``[DEFAULT]`` section in ``/etc/cinder/cinder.conf`` is set to ``auto``. When set to ``auto``, a check is done during cinder startup to determine if there are existing cinder volumes, no volumes will set the option to ``True``, and use secure file permissions. The detection of existing volumes will set the option to ``False``, and use the current insecure method of handling file permissions. If value of parameter ``nas_secure_file_operations`` under ``[DEFAULT]`` section in ``/etc/cinder/cinder.conf`` is set to ``auto``. When set to "auto", a check is done during cinder startup to determine if there are existing cinder volumes, no volumes will set the option to ``True``, be secure and do NOT run as the ``root`` user. The detection of existing volumes will set the option to ``False``, and use the current method of running operations as the ``root`` user. For new installations, a "marker file" is written so that subsequent restarts of cinder will know what the original determination had been.
de: **Pass:** Wenn der Wert des Parameter ``nas_secure_file_permissions`` im ``[DEFAULT]`` Abschnitt in der ``/etc/cinder/cinder.conf`` ist gesetzt auf ``auto``. Wenn es auf ``auto`` gesetzt ist, wird ein Check beim Start von Cinder gemacht, ob keine Cinder Datenträger mit der Option ``True`` existieren, und sicher Dateirechte gesetzt sind. Die Untersuchung auf existierende Datenträger wird die Option auf ``False`` setzen, und die derzeit unsichere Methode auf Behandlung der Dateirechte benutzen. Wenn der Wert des Parameter ``nas_secure_file_operations`` im ``[DEFAULT]`` Abschnitt in ``/etc/cinder/cinder.conf`` ist auf ``auto`` gesetzt. Wenn es auf "auto" gesetzt ist, wird ein Check beim Start von Cinder, ob kein Datenträger mit der Option ``True`` existiert, sicher ist und NICHT unter ``root`` Benutzer läuft. Die Untersuchung auf existierende Datenträger wird die Option auf ``False`` setzen, und die derzeit unsichere Methode von laufenden Betrieb als ``root`` Benutzer benutzen. Für neue Installationen, wurde eine "Marker Datei" geschrieben, sodass is written so dass nachfolgende Neustarts von Cinder wissen, was die ursprüngliche Bestimmung gewesen ist.
id: **Pass:** Jika nilai parameter ``nas_secure_file_permissions`` di bawah bagian ``[DEFAULT]`` di ``/etc/cinder/cinder.conf`` diatur ke ``auto``. Bila diatur ke ``auto``, sebuah cek dilakukan saat startup cinder untuk menentukan apakah ada volume pengaman yang ada, tidak ada volume yang akan mengatur pilihan ke ``True``, dan menggunakan hak akses file yang aman. Deteksi volume yang ada akan mengatur pilihan ke ``False``, dan gunakan metode penanganan berkas yang tidak aman saat ini. Jika nilai parameter ``nas_secure_file_operations`` di bawah bagian ``[DEFAULT] `` di ``/etc/cinder/cinder.conf`` diatur ke ``auto``. Bila disetel ke "auto", cek dilakukan saat startup cinder untuk menentukan apakah ada volume cinder yang ada, tidak ada volume yang akan mengatur pilihan ke ``True``, menjadi aman dan TIDAK dijalankan sebagai pengguna ``root`` . Deteksi volume yang ada akan mengatur pilihan ke ``False``, dan gunakan metode operasi berjalan saat ini sebagai pengguna ``root``. Untuk instalasi baru, sebuah "marker file" ditulis sehingga restarts cinder berikutnya akan tahu apa tekad semula.
tr_tr: **Başarılı:** ``/etc/cinder/cinder.conf`` içindeki ``[DEFAULT]`` bölümündeki ``nas_secure_file_permissions`` parametresinin değeri ``auto`` olarak ayarlanırsa. ``Auto`` olarak ayarlandığında, mevcut cinder hacimleri olup olmadığına karar vermek için cinder başlangıcı sırasında bir onay yapılır; hiçbir hacim seçeneği ``True` olarak ayarlamaz ve güvenli dosya izinlerini kullanır. Mevcut birimlerin algılanması seçeneği ``False`` olarak ayarlar ve dosya izinlerini işleme alan şu andaki güvensiz yöntemini kullanır. ``/etc/cinder/cinder.conf`` içindeki ``[DEFAULT]`` bölümündeki ``nas_secure_file_operations`` parametresinin değeri ``auto`` olarak ayarlanırsa. "Auto" olarak ayarlandığında, cinder başlangıcı esnasında mevcut cinder hacimleri olup olmadığına karar vermek için bir kontrol gerçekleştirilir; hiçbir hacim seçeneği ``True`` olarak ayarlamaz, güvenli olur ve ``root`` kullanıcı olarak çalışmaz. Mevcut birimlerin algılanması seçeneği ``False`` olarak ayarlar ve şu anki çalıştırma yöntemini "root" kullanıcısı olarak kullanır. Yeni kurulumlar için "işaretleyici dosya" yazılır, böylece cinder'in daha sonra yeniden başlatılması orijinal tayininin ne olduğunu bilir.

source: **Pass:** If value of parameter ``neutron_api_insecure`` under ``[DEFAULT]`` section in ``manila.conf`` is set to ``False``.
de: **Pass:** Wenn der Wert des Parameters ``neutron_api_insecure``unter `` [DEFAULT]``Abschnitt in ``manila.conf`` auf ``False``gesetzt ist.
id: **Pass:**Jika nilai parameter ``neutron_api_insecure`` di bawah bagian ``[DEFAULT] `` di ``manila.conf`` diatur ke ``False``.
tr_tr: **Başarılı:** ``manila.conf`` dosyasında ``[DEFAULT]`` bölümündeki ``neutron_api_insecure`` parametresinin değeri ``False`` ise.

source: **Pass:** If value of parameter ``nova_api_insecure`` under ``[DEFAULT]`` section in ``/etc/cinder/cinder.conf`` is set to ``False``.
de: **Pass:** Wert des Parameters ``nova_api_insecure`` in der ``[DEFAULT]`` Sektion in ``/etc/cinder/cinder.conf`` ist auf ``False`` gesetzt.
id: **Pass:** Jika nilai parameter ``nova_api_insecure`` di bawah bagian ``[DEFAULT] `` di ``/etc/cinder/cinder.conf`` diatur ke ``False``.
tr_tr: **Başarılı:** ``/etc/cinder/cinder.conf`` içindeki ``[DEFAULT]`` bölümündeki ``nova_api_insecure`` parametresinin değeri ``False`` ise.

source: **Pass:** If value of parameter ``nova_api_insecure`` under ``[DEFAULT]`` section in ``manila.conf`` is set to ``False``.
de: **Pass:** Wenn der Wert des Parameters ``nova_api_insecure`` unter `` [DEFAULT]``Abschnitt in ``manila.conf`` auf ``False`` gesetzt ist.
id: **Pass:** Jika nilai parameter ``nova_api_insecure`` dibawah bagian ``[DEFAULT]`` dalam ``manila.conf`` diatur ke ``False``.
tr_tr: **Başarılı:** ``manila.conf`` dosyasında ``[DEFAULT]`` bölümündeki ``nova_api_insecure`` parametresinin değeri ``False`` ise.

source: **Pass:** If value of parameter ``osapi_max_request_body_size`` under ``[DEFAULT]`` section in ``/etc/cinder/cinder.conf`` is set to ``114688`` or if value of parameter ``max_request_body_size`` under ``[oslo_middleware]`` section in ``/etc/cinder/cinder.conf`` is set to ``114688``.
de: **Pass:** Wenn der Wert des Parameter ``osapi_max_request_body_size`` im ``[DEFAULT]`` Abschnitt in der ``/etc/cinder/cinder.conf`` ist auf ``114688`` gesetzt oder wenn der Wert des Parameter ``max_request_body_size`` unter dem ``[oslo_middleware]`` Abschnitt in der ``/etc/cinder/cinder.conf`` auf ``114688`` gesetzt ist.
id: **Pass:** Jika nilai parameter ``osapi_max_request_body_size`` di bawah bagian ``[DEFAULT]`` di ``/etc/cinder/cinder.conf`` diatur ke ``114688`` atau jika nilai parameter ``max_request_body_size`` di bagian bawah ``[oslo_middleware]`` di ``/etc/cinder/cinder.conf`` diatur ke ``114688``.
tr_tr: **Başarılı:** ``/etc/cinder/cinder.conf`` içindeki ``[DEFAULT]`` bölümündeki ``osapi_max_request_body_size`` parametresinin değeri ``114688`` olarak ayarlanırsa veya parametrenin değeri ``/etc/cinder/cinder.conf`` içindeki ``[oslo_middleware]`` bölümündeki ``max_request_body_size``, ``114688`` olarak ayarlandıysa.

source: **Pass:** If value of parameter ``provider`` under ``[token]`` section in ``/etc/keystone/keystone.conf`` is set to fernet.
de: **Pass:** Wenn der Wert des Parameter ``provider`` unter ``[token]`` Sektion in ``/etc/keystone/keystone.conf`` auf fernet gesetzt ist.
id: **Pass:**Jika nilai parameter ``provider`` di bawah bagian ``[token] `` di ``/etc/keystone/keystone.conf`` diatur ke fernet.

source: **Pass:** If value of parameter ``use_ssl`` under ``[DEFAULT]`` section in ``/etc/neutron/neutron.conf`` is set to ``True``.
de: **Pass:** Wenn der Wert des Parameters ``use_ssl``unter ``[DEFAULT] `` Abschnitt in ``/etc/neutron/neutron.conf``auf ``True``gesetzt ist.
id: **Pass:** Jika nilai parameter ``use_ssl`` di bawah bagian ``[DEFAULT]`` di ``/etc/neutron/neutron.conf``diatur ke ``True``.
tr_tr: **Başarılı:** ``/etc/neutron/neutron.conf`` dosyasında ``[DEFAULT]`` bölümündeki ``use_ssl`` parametresinin değeri ``True`` ise.

source: **Segmented network in share servers back-end mode**
de: **Segmentiertes Netzwerk im share-servers-Back-End-Modus **
tr_tr: **paylaşım sunucusu arka uç kipinde bölümlü ağ**

source: **cert**. Authenticates an instance by a TLS certificate. Specify the TLS identity as the IDENTKEY. A valid value is any string up to 64 characters long in the common name (CN) of the certificate.
de: **cert**. Authentifiziert eine Instanz durch ein TLS-Zertifikat. Geben Sie die TLS-Identität als IDENTKEY an. Ein gültiger Wert ist ein String mit einer Länge von bis zu 64 Zeichen im Common Name (CN) des Zertifikats.
id: **cert**. Mengotentikasi sebuah instance dari sertifikat TLS. Tentukan identitas TLS sebagai IDENTKEY. Nilai yang valid adalah string yang memiliki panjang hingga 64 karakter dalam common name (CN) dari sertifikat.
tr_tr: **cert**. Bir örneği bir TLS sertifikası ile doğrular. IDENTKEY olarak TLS kimliğini belirtin. Geçerli bir değer, sertifikanın ortak adında (CN) 64 karaktere kadar herhangi bir dizedir.

source: **ip**. Authenticates an instance by its IP address. A valid format is XX.XX.XX.XX or XX.XX.XX.XX/XX. For example 0.0.0.0/0.
de: **ip** Authentifiziert eine Instanz durch ihre IP-Adresse. Ein gültiges Format ist XX.XX.XX.XX oder XX.XX.XX.XX/XX. Zum Beispiel 0.0.0.0/0.
id: **ip**. Mengotentikasi sebuah instance dari alamat IP-nya. Format yang valid adalah XX.XX.XX.XX atau XX.XX.XX.XX / XX. Misalnya 0.0.0.0/0.
tr_tr: **ip**. Bir örneği IP adresiyle doğrular. Geçerli bir biçim XX.XX.XX.XX veya XX.XX.XX.XX/XX'dir. Örneğin 0.0.0.0/0.

source: **ro**. Read-only (RO) access.
de: **ro**. Read-only (RO) Zugriff.
id: **ro**. Akses Read-only (RO).
tr_tr: **ro**. Salt-okunur (RO) erişim.

source: **rw**. Read and write (RW) access. This is the default value.
de: **rw** Lesen und Schreiben (RW). Dies ist der Standardwert.
id: **rw**. Akses Read dan write (RW). Ini adalah nilai default.
tr_tr: **rw**. Okuma ve yazma (RW) erişimi. Öntanımlı değerdir.

source: **user**. Authenticates by a specified user or group name. A valid value is an alphanumeric string that can contain some special characters and is from 4 to 32 characters long.
de: **Benutzer**. Authentifiziert durch einen bestimmten Benutzer oder Gruppennamen. Ein gültiger Wert ist ein alphanumerischer String, der einige Sonderzeichen enthalten kann und von 4 bis 32 Zeichen lang ist.
id: **user**. Mengotentikasi pengguna tertentu atau nama grup. Nilai yang valid adalah string alfanumerik yang dapat berisi beberapa karakter khusus dan terdiri dari 4 hingga 32 karakter.
tr_tr: **user**. Belirli bir kullanıcı veya grup adına göre kimlik doğrulama yapar. Geçerli bir değer, bazı özel karakterler içerebilen ve 4 ila 32 karakter uzunluğunda bir alfasayısal dizedir.

source: *Code injection*: If memory or disk transfers are not handled securely, then an attacker could manipulate executables, either on disk or in memory, during the migration.
de: *Code-Injektion*: Wenn Speicher- oder Datentransfers nicht sicher abgewickelt werden, könnte ein Angreifer während der Migration ausführbare Dateien entweder auf Festplatte oder im Speicher manipulieren.
id: *Code injection*: Jika transfer memori atau disk tidak ditangani dengan aman, maka penyerang dapat memanipulasi file executable, baik pada disk atau memori selama migrasi berlangsung.
tr_tr: * Kod enjeksiyonu *: Bellek veya disk aktarmaları güvenli bir şekilde ele alınmazsa, bir saldırgan, geçiş sırasında yürütülebilir dosyaları diskte veya bellekte yönlendirebilir.

source: *Data exposure*: Memory or disk transfers must be handled securely.
de: *Datenbelastung*: Speicher- oder Datentransfers müssen sicher abgewickelt werden.
id: *Data exposure*: Transfer memori atau disk harus ditangani dengan aman.
tr_tr: *Veri maruziyeti*: Bellek veya disk aktarmaları güvenli bir şekilde ele alınmalıdır.

source: *Data manipulation*: If memory or disk transfers are not handled securely, then an attacker could manipulate user data during the migration.
de: *Datenmanipulation*: Wenn Speicher- oder Datentransfers nicht sicher abgewickelt werden, könnte ein Angreifer Benutzerdaten während der Migration manipulieren.
id: *Data manipulation*: Jika transfer memori atau disk tidak ditangani dengan aman, maka penyerang dapat memanipulasi data pengguna selama migrasi berlangsung.
tr_tr: * Veri işleme *: Bellek veya disk aktarmaları güvenli bir şekilde ele alınmazsa, bir saldırgan geçiş sırasında kullanıcı verilerini işleyebilir.

source: *Denial of Service (DoS)*: If something fails during the migration process, the instance could be lost.
de: *Denial of Service (DoS)*: Wenn während des Migrationsprozesses etwas fehlschlägt, könnte die Instanz verloren gehen.
id: *Denial of Service (DoS)*: Jika sesuatu gagal selama proses migrasi, instance bisa hilang.
tr_tr: *Hizmet Reddi (DoS)*: Taşıma işlemi sırasında bir şey başarısız olursa, örnek kaybolabilir.

source: *Middleware configuration* - persisted in paste.ini
de: *Middleware-Konfiguration* - persistiert in Paste.ini
id: *Middleware configuration* - bertahan di paste.ini
tr_tr: *Ara katman yapılandırması* - paste.ini dosyasında saklanır

source: *RBAC rulesets* - persisted in policy.json
de: *RBAC-Regeln* - persistiert in policy.json
id: *RBAC rulesets* - bertahan di policy.json
tr_tr: *RBAC kural kümeleri* - policy.json dosyasında saklanır

source: *RabbitMQ Credentials* - persisted in barbican.conf
de: *RabbitMQ Credentials* - persistiert in barbican.conf
id: *RabbitMQ Credentials* - bertahan di barbican.conf
tr_tr: *RabbitMQ Kimlik Bilgileri* - barbican.conf dosyasında saklanır

source: *RabbitMQ credentials*:
de: *RabbitMQ Anmeldeinformationen*:
tr_tr: *RabbitMQ kimlik bilgileri*:

source: *Secret data* - Passphrases, Encryption Keys, RSA Keys - persisted in Database [PKCS#11] or HSM [KMIP] or [KMIP, Dogtag]
de: *Geheime Daten* - Passphrasen, Verschlüsselungsschlüssel, RSA Keys - Bestand in Datenbank [PKCS#11] oder HSM [KMIP] oder [KMIP, Dogtag]
id: *Secret data* - Passphrases, Encryption Keys, RSA Keys - bertahan di Database [PKCS#11] atau HSM [KMIP] or [KMIP, Dogtag]
tr_tr: *Gizli veriler* - Parola deyimleri, Şifreleme Anahtarları, RSA Anahtarları - Veritabanı [PKCS#11] veya HSM [KMIP] veya [KMIP, Dogtag]

source: *keystone Event Queue Credentials* - persisted in barbican.conf
de: *keystone Event Queue Credentials* - persistiert in barbican.conf
id: *keystone Event Queue Credentials* - bertahan di barbican.conf
tr_tr: *keystone Olay Kuyruk Kimlik Bilgileri* - barbican.conf dosyasında saklanır

source: *keystone credentials*:
de: *Keystone-Anmeldeinformationen*:
tr_tr: *keystone kimlik bilgileri*:

source: 1024, 2048, or 3072 bits
de: 1024, 2048 oder 3072 Bits
id: 1024, 2048, atau 3072 bits
tr_tr: 1024, 2048, ya da 3072 bit

source: 128, 192, or 256 bit
de: 128, 192 oder 256 bit
id: 128, 192, atau 256 bit
tr_tr: 128, 192, ya da 256 bit

source: 128, 192, or 256 bits
de: 128, 192 oder 256 Bits
tr_tr: 128, 192 ya da 256 bit

source: :doc:`Block Storage service checklist <block-storage/checklist>`
de: :doc:`Blockspeicher-Service-Checkliste <block-storage/checklist> "
tr_tr: :doc:`Blok Depolama servisi kontrol listesi <block-storage/checklist>`

source: :doc:`Compute service checklist <compute/checklist>`
de: :doc:`rechnen Service Checkliste <compute/checklist> "
tr_tr: :doc:`İşleme servisi kontrol listesi <compute/checklist>`

source: :doc:`Dashboard checklist <dashboard/checklist>`
de: :doc:`Dashboard-Checkliste <dashboard/checklist> "
tr_tr: :doc:`Kontrol paneli kontrol listesi <dashboard/checklist>`

source: :doc:`Identity service checklist <identity/checklist>`
de: :doc:`Identitätsdienst-Checkliste <identity/checklist> "
tr_tr: :doc:`Kimlik servisi kontrol listesi <identity/checklist>`

source: :doc:`Networking service checklist <networking/checklist>`
de: :doc:`Netzwerk-Service-Checkliste <networking/checklist>`
tr_tr: :doc:`Ağ servisi kontrol listesi <networking/checklist>`

source: :doc:`Shared File Systems service checklist <shared-file-systems/checklist>`
de: :doc:`Checkliste für Shared File Systems Service <shared-file-systems/checklist>`
tr_tr: :doc:`Paylaşımlı Dosya Sistemleri servisi kontrol listesi <shared-file-systems/checklist>`

source: :term:`Discretionary Access Control (DAC)` restricts access to file system objects based on :term:`ACL <access control list (ACL)>` that include the standard UNIX permissions for user, groups, and others. Access control mechanisms also protect IPC objects from unauthorized access. The system includes the ext4 file system, which supports POSIX ACLs. This allows defining access rights to files within this type of file system down to the granularity of a single user.
de: :term:`Discretionary Access Control (DAC)` beschränkt den Zugriff auf Dateisystemobjekte auf :term:`ACL <access control list (ACL)>`, die die Standard-UNIX-Berechtigungen für Benutzer, Gruppen und andere enthalten. Zugriffskontrollmechanismen schützen auch IPC-Objekte vor unbefugtem Zugriff. Das System enthält das ext4-Dateisystem, das POSIX-ACLs unterstützt. Dies ermöglicht die Definition von Zugriffsrechten auf Dateien innerhalb dieser Art von Dateisystem bis hin zur Granularität eines einzelnen Benutzers.
id: :term:`Discretionary Access Control (DAC)` membatasi akses ke objek sistem file berdasarkan :term:`ACL <access control list (ACL)>` yang termasuk izin UNIX standar untuk pengguna, grup, dan lainnya. Mekanisme kontrol akses juga melindungi objek IPC dari akses yang tidak sah. Sistem ini mencakup sistem file ext4, yang mendukung POSIX ACLs. Hal ini memungkinkan hak akses menentukan ke file dalam jenis sistem file ini sampai ke perincian satu pengguna.
tr_tr: :term: `İsteğe Bağlı Erişim Kontrolü (DAC)`, kullanıcı, gruplar ve diğerleri için standart UNIX izinlerini içeren :term: `ACL <erişim kontrol listesi (ACL)>` ye dayalı dosya sistemi nesnelerine erişimi kısıtlar. Erişim kontrol mekanizmaları ayrıca IPC nesnelerini yetkisiz erişime karşı korur. Sistem, POSIX ACL'lerini destekleyen ext4 dosya sistemini içerir. Bu, bu dosya sistemi türü içindeki dosyalara erişim haklarını tek bir kullanıcının ayrıntısına kadar tanımlamaya olanak tanır.

source: :term:`Federated Identity<federated identity>` is a mechanism to establish trusts between Identity Providers and Service Providers (SP), in this case, between Identity Providers and the services provided by an OpenStack Cloud.
de: :term:`Federated Identity <federated identity>`ist ein Mechanismus, um Trusts zwischen Identity Provider und Service Provider (SP), in diesem Fall zwischen Identity Provider und die Dienste von einer OpenStack Cloud zur Verfügung zu stellen.
tr_tr: :term:`Federe Kimlik <federated identity>`, Kimlik Sağlayıcıları ve Servis Sağlayıcıları (SP) arasında, bu durumda, Kimlik Sağlayıcıları ile bir OpenStack Bulutu tarafından sağlanan hizmetler arasında güven ilişkileri kurmak için bir mekanizma.

source: A **real production use case** that shows the purpose of a share types and access to them is a situation when you have two back ends: cheap LVM as a public storage and expensive Ceph as a private storage. In this case you can grant access to certain tenants and make the access with ``user/group`` authentication method.
de: Ein **echter Produktions Use Case **, der den Zweck eines Share-Typen zeigt und Zugang zu ihm ist eine Situation, wenn Sie zwei Backends haben: billige LVM als öffentlichen Speicher und teuren Ceph als privaten Speicher. In diesem Fall können Sie Zugang zu bestimmten Tenants gewähren und den Zugang mit der ``user/group``Authentifizierungsmethode machen.
id: **real production use case** yang menunjukkan tujuan dari jenis share dan akses ke mereka adalah situasi saat Anda memiliki dua tujuan: LVM murah sebagai penyimpanan publik dan Ceph mahal sebagai penyimpanan privat. Dalam hal ini Anda dapat memberikan akses ke penyewa tertentu dan membuat akses dengan metode otentikasi ``user/group`` .
tr_tr: Bir paylaşım türlerinin amacını gösteren **gerçek canlı kullanımı vakası**, iki arka uç olduğunda bir durumdur: kamuya açık bir depolama alanı olarak ucuz LVM ve özel bir depolama alanı olarak pahalı Ceph. Bu durumda bazı kiracılara erişim izni verebilir ve ``user/group`` kimlik doğrulama yöntemi ile erişim sağlayabilirsiniz.
