Repository: openstack/security-doc
Catalog: security-guide/source/locale/*/LC_MESSAGES/security-guide.po
Languages: de, id, tr_tr

source: Encryption of data at rest is implemented by middleware that may be included in the proxy server WSGI pipeline. The feature is internal to a swift cluster and not exposed through the API. Clients are unaware that data is encrypted by this feature internally to the swift service; internally encrypted data should never be returned to clients through the swift API.
de: Die Verschlüsselung von Daten in Ruhe erfolgt durch Middleware, die in der Proxy-Server-WSGI-Pipeline enthalten sein kann. Das Feature ist intern in einem schnellen Cluster und nicht durch die API ausgesetzt. Die Kunden sind sich nicht bewusst, dass die Daten von dieser Funktion intern an den schnellen Service verschlüsselt werden. intern verschlüsselte Daten sollten niemals über die schnelle API an Clients zurückgegeben werden.
id: Enkripsi data saat istirahat diimplementasikan oleh middleware yang mungkin disertakan dalam pipeline WSGI server proxy. Fitur ini bersifat internal ke cluster cepat dan tidak terpapar melalui API. Klien tidak menyadari bahwa data dienkripsi oleh fitur ini secara internal ke layanan cepat; Data yang dienkripsi secara internal tidak boleh dikembalikan ke klien melalui API cepat.
tr_tr: Dinlenme sırasındaki verilerin şifrelenmesi, vekil sunucusu WSGI kanalına dahil olabilecek ara katman yazılımları tarafından gerçekleştirilir. Bu özellik, hızlı bir kümenin iç kısmında yer alır ve API aracılığıyla görüntülenmez. Müşteriler, verilerin dahili olarak swift servisi için bu özellik tarafından şifrelendiğinden habersizdir; dahili olarak şifrelenmiş veriler, müşterilere swift API vasıtasıyla asla gönderilmemelidir.

source: End entity
de: Ende Entität
tr_tr: Son varlık

source: End users
de: Endnutzer
id: Pengguna akhir (end user)
tr_tr: Son kullanıcılar

source: End users will use the system to store sensitive data, such as passphrases encryption keys, etc.
de: Die Endbenutzer verwenden das System zum Speichern von sensiblen Daten, wie z.B. Passphrasenverschlüsselungsschlüssel usw.
id: End user akan menggunakan sistem untuk menyimpan data sensitif, seperti kunci enkripsi frase, dll.
tr_tr: Son kullanıcılar, sistemi parolalar şifreleme anahtarları vb. gibi hassas verileri depolamak için kullanır.

source: Ensure only authenticated users and backup clients have access to the backup server.
de: Stellen Sie sicher, dass nur authentifizierte Benutzer und Backup-Clients Zugriff auf den Backup-Server haben.
id: Pastikan hanya pengguna terotentikasi dan klien cadangan yang memiliki akses ke server cadangan.
tr_tr: Sadece doğrulanan kullanıcıların ve yedek istemcilerin yedekleme sunucusuna erişebildiğinden emin olun.

source: Ensure that the .rc file which has your credential information is secured.
de: Stellen Sie sicher, dass die .rc-Datei, die Ihre Anmeldeinformationen enthält, gesichert ist.
id: Pastikan file .rc yang memiliki informasi kredensial Anda telah diamankan.
tr_tr: Kimlik bilgileriniz olan .rc dosyasının güvenli olduğundan emin olun.

source: Ensure that the network interfaces are on their own private(management or a separate) network. Segregate management domains with firewalls or other network gear.
de: Stellen Sie sicher, dass sich die Netzwerkschnittstellen auf einem eigenen privaten (Management oder separaten) Netzwerk befinden. Segregate Management-Domains mit Firewalls oder anderen Netzwerk-Equipment.
id: Pastikan bahwa antarmuka jaringan berada pada jaringan pribadi mereka (manajemen atau yang terpisah). Pisahkan domain manajemen dengan firewall atau peralatan jaringan lainnya.
tr_tr: Ağ arabirimlerinin kendi özel (yönetim veya ayrı) bir ağda olduğundan emin olun. Yönetim alanlarını güvenlik duvarları veya diğer ağ dişli ile ayırın.

source: Ensure that the system has the fewest number of packages installed and services running as possible. Removing unneeded packages makes patching easier and it reduces the number of items on the system which could lead to a breach. Stopping unneeded services shrinks the attack surface on the system and makes it more difficult to attack.
de: Stellen Sie sicher, dass das System die wenigsten installierten Pakete installiert und die Dienste wie möglich ausgeführt haben. Das Entfernen nicht benötigter Pakete erleichtert das Patching und reduziert die Anzahl der Elemente auf dem System, die zu einem Bruch führen könnten. Das Stoppen von unnötigen Diensten schrumpft die Angriffsfläche auf dem System und macht es schwieriger, anzugreifen.
id: Pastikan bahwa sistem memiliki jumlah paket terinstal dan layanan yang paling sedikit yang mungkin dijalankan. Melepaskan paket yang tidak dibutuhkan membuat tambalan lebih mudah dan mengurangi jumlah item pada sistem yang dapat menyebabkan pelanggaran. Menghentikan layanan yang tidak dibutuhkan mengecilkan permukaan serangan pada sistem dan membuatnya lebih sulit diserang.
tr_tr: Sistemin mümkün olan en az sayıda paket yüklenmiş olduğundan ve servislerin çalışıp çalışmadığından emin olun. Gereksiz paketleri kaldırmak, yamayı kolaylaştırır ve sistemdeki ihlal oluşturabilecek öğe sayısını azaltır. Gereksiz servislerin durdurulması, sistemdeki saldırı yüzeyini küçültür ve saldırmak daha zor hale gelir.

source: Ensure your end users that the node has been properly sanitized of their data prior to re-provisioning. Additionally, prior to reusing a node, you must provide assurances that the hardware has not been tampered or otherwise compromised.
de: Stellen Sie sicher, dass Ihre Endbenutzer, dass der Knoten vor der Wiederherstellung ordnungsgemäß von ihren Daten saniert wurde. Darüber hinaus müssen Sie vor der Wiederverwendung eines Knotens versichern, dass die Hardware nicht manipuliert oder anderweitig beeinträchtigt wurde.
id: Pastikan end user Anda bahwa nodus telah benar dibersihkan data mereka sebelum re-provisioning. Selain itu, sebelum menggunakan kembali sebuah node, Anda harus memberikan jaminan bahwa perangkat keras belum dirusak atau dikompromikan.
tr_tr: Son kullanıcıların, yeniden sağlanmadan önce düğümlerin verilerinden uygun şekilde temizlendiğinden emin olun. Ayrıca, bir düğümü yeniden kullanmadan önce, donanımın kurcalandığına veya başka şekilde tehlikeye atılmadığına dair güvence vermelisiniz.

source: Ensure your iptables have the default policy filtering network traffic, and consider examining the existing rule set to understand each rule and determine if the policy needs to be expanded upon.
de: Stellen Sie sicher, dass Ihre iptables die Standardrichtlinienfilterung des Netzwerkverkehrs haben und prüfen Sie die vorhandene Regelmenge, um jede Regel zu verstehen und festzustellen, ob die Richtlinie erweitert werden muss.
id: Pastikan iptables Anda memiliki kebijakan default yang memfilter lalu lintas jaringan, dan pertimbangkan untuk memeriksa peraturan yang ada agar dapat memahami setiap peraturan dan menentukan apakah kebijakan tersebut perlu diperluas.
tr_tr: Iptables'in varsayılan ağ filtresi trafik süzme politikasına sahip olduğundan emin olun ve her kuralın anlaşılması ve mevcut politikanın genişletilmesi gerekip gerekmediğinin belirlenmesi için mevcut kural kümesini incelemeyi düşünün.

source: Entropy to instances
de: Entropie zu Instanzen
id: Entropy ke instance
tr_tr: Örneklere entropi

source: Environment based filters
de: Umgebungsbasierte Filter
id: Filter berbasis lingkungan
tr_tr: Ortam tabanlı filtreler

source: Ephemeral Diffie-Hellman (abbreviated either as EDH or DHE) uses prime field groups.
de: Ephemeral Diffie-Hellman (abgekürzt entweder als EDH oder DHE) verwendet primäre Feldgruppen.
id: Ephemeral Diffie-Hellman (disingkat sebagai EDH ataupun DHE) menggunakan kelompok field utama
tr_tr: Geçici Diffie-Hellman (EDH veya DHE olarak kısaltılır) asal alan gruplarını kullanır.

source: Ephemeral Elliptic Curve Diffie-Hellman (abbreviated as EECDH and ECDHE).
de: Ephemeral Elliptische Kurve Diffie-Hellman (abgekürzt als EECDH und ECDHE).
id: Ephemeral Elliptic Curve Diffie-Hellman (disingkat EECDH dan ECDHE).
tr_tr: Geçici Elliptik Eğri Diffie-Hellman (kısaca EECDH ve ECDHE olarak).

source: Ephemeral Elliptic Curves require the server to be configured with a named curve, and provide better security than prime field groups and at lower computational cost. However, prime field groups are more widely implemented, and thus typically both are included in list.
de: Ephemeral Elliptic Curves erfordert, dass der Server mit einer benannten Kurve konfiguriert wird und eine bessere Sicherheit bietet als primäre Feldgruppen und zu niedrigeren Rechenkosten. Allerdings sind primäre Feldgruppen weit verbreitet, und daher sind in der Regel beide in der Liste enthalten.
id: Ephemeral Elliptic Curves meminta server untuk dikonfigurasi dengan kurva bernama, dan memberikan keamanan yang lebih baik daripada kelompok lapangan utama dan dengan biaya komputasi yang lebih rendah. Namun, kelompok field utama lebih banyak diimplementasikan, dan dengan demikian biasanya keduanya termasuk dalam daftar.
tr_tr: Geçici Eliptik Eğriler, sunucunun adlandırılmış bir eğriyle yapılandırılmasını ve asal alan gruplarına göre daha düşük güvenlik gerektirir ve daha düşük hesaplama maliyeti gerektirir. Bununla birlikte, asal alan grupları daha yaygın olarak uygulanmaktadır ve bu nedenle genellikle her ikisi de listede yer almaktadır.

source: Ephemeral disk encryption
de: Ephemeral Festplattenverschlüsselung
id: Enkripsi disk sesaat
tr_tr: Geçici disk şifreleme

source: Ephemeral disk encryption is supported by back-end key storage for enhanced security (for example, an HSM or a KMIP server can be used as a barbican back-end secret store)
de: Die ephemeren Festplattenverschlüsselung wird unterstützt durch Back-End-Schlüsselspeicher für verbesserte Sicherheit (z. B. ein HSM oder ein KMIP-Server kann als barbican back-end secret store verwendet werden)
id: Enkripsi disk ephemeral didukung oleh penyimpanan kunci back-end untuk keamanan yang ditingkatkan (misalnya, server HSM atau KMIP dapat digunakan sebagai penyimpanan rahasia back-end barbican)
tr_tr: Geçici disk şifreleme, gelişmiş güvenlik için arka uç anahtar depolaması ile desteklenir (örneğin, bir HSM veya bir KMIP sunucusu barbican arka uç gizli mağaza olarak kullanılabilir)

source: Eric Lopez is Senior Solution Architect at VMware's Networking and Security Business Unit where he helps customers implement OpenStack and VMware NSX (formerly known as Nicira's Network Virtualization Platform). Prior to joining VMware (through the company's acquisition of Nicira), he worked for Q1 Labs, Symantec, Vontu, and Brightmail. He has a B.S in Electrical Engineering/Computer Science and Nuclear Engineering from U.C. Berkeley and MBA from the University of San Francisco.
de: Eric Lopez ist Senior Solution Architect bei VMware Networking and Security Business Unit, wo er Kunden bei der Implementierung von OpenStack und VMware NSX (früher Nicira Network Virtualization Platform) unterstützt. Bevor er zu VMware kam (durch die Akquisition von Nicira), arbeitete er für Q1 Labs, Symantec, Vontu und Brightmail. Er hat einen BS in Elektrotechnik/Informatik und Nukleartechnik von UC Berkeley und MBA von der Universität von San Francisco.
id: Eric Lopez adalah Senior Solution Architect di VMware's Networking and Security Business Unit dimana dia membantu pelanggan menerapkan OpenStack dan VMware NSX (sebelumnya dikenal sebagai Platform Virtualisasi Jaringan Nicira). Sebelum bergabung dengan VMware (melalui akuisisi Nicira perusahaan), dia bekerja untuk Lab Q1, Symantec, Vontu, dan Brightmail. Dia memiliki B.S di Teknik Elektro/Ilmu Komputer dan Teknik Nuklir dari U.C. Berkeley dan MBA dari University of San Francisco.
tr_tr: Eric Lopez, müşterilerin OpenStack ve VMware NSX'i (eski adıyla Nicira'nın Ağ Sanallaştırma Platformu) uygulamanıza yardımcı olduğu VMware'in Ağ ve Güvenlik İş Birimi'ndeki Kıdemli Çözüm Mimarıdır. VMware'e katılmadan önce (şirketin Nicira'yı devralmasıyla) Q1 Labs, Symantec, Vontu ve Brightmail'de çalıştı. U.C'den Elektrik Mühendisliği / Bilgisayar Bilimi ve Nükleer Mühendisliği alanında B.S derecesine sahiptir. San Francisco Üniversitesi'nden Berkeley ve MBA.

source: Eric Windisch is a Principal Engineer at Cloudscaling where he has been contributing to OpenStack for over two years. Eric has been in the trenches of hostile environments, building tenant isolation and infrastructure security through more than a decade of experience in the web hosting industry. He has been building cloud computing infrastructure and automation since 2007.
de: Eric Windisch ist Principal Engineer bei Cloudscaling, wo er seit über zwei Jahren zum OpenStack beiträgt. Eric war in den Gräben der feindlichen Umgebungen, Bau von Tenant-Isolation und Infrastruktur-Sicherheit durch mehr als ein Jahrzehnt Erfahrung in der Web-Hosting-Industrie. Seit 2007 baut er Cloud Computing Infrastruktur und Automatisierung.
id: Eric Windisch adalah seorang Principal Engineer di Cloudscaling dimana dia telah berkontribusi pada OpenStack selama lebih dari dua tahun. Eric telah berada di parit (trench) lingkungan yang tidak bersahabat, membangun isolasi penyewa dan keamanan infrastruktur melalui lebih dari satu dekade pengalaman di industri web hosting. Dia telah membangun infrastruktur komputasi awan dan otomasi sejak 2007.
tr_tr: Eric Windisch, iki yıldan uzun bir süredir OpenStack'a katkıda bulunduğu Cloudscaling'de Müdür olarak çalışmaktadır. Eric, web barındırma endüstrisinde on yılı aşkın tecrübe ile kiracı ortamların siperlerinde kiracı izolasyonu ve altyapı güvenliği inşa ediyordu. 2007'den beri bulut hesaplama altyapısı ve otomasyonu geliştiriyor.

source: Establish formal access control policies
de: Festlegung formaler Zugangskontrollrichtlinien
id: Menetapkan kebijakan kontrol akses formal
tr_tr: Resmi erişim kontrolü politikaları sağlama

source: Even with ``prevent_arp_spoofing`` enabled, flat networking does not provide a complete level of project isolation, as all project traffic is still sent to the same VLAN.
de: Sogar mit ``prevent_arp_spoofing``aktiviert, bietet flache Vernetzung nicht ein vollständiges Niveau der Projektisolation, da alle Projektverkehr noch an das gleiche VLAN gesendet wird.
id: Even dengan ``prevent_arp_spoofing`` diaktifkan, jaringan flat (datar) tidak menyediakan tingkat isolasi proyek yang lengkap, karena semua lalu lintas proyek masih dikirim ke VLAN yang sama.
tr_tr: ``prevent_arp_spoofing`` özelliği etkinleştirilse bile, düz ağlar, tüm proje trafiği hala aynı VLAN'a gönderildiğinden, tam bir proje izolasyonu seviyesi sağlamaz.

source: Event monitoring is a more pro-active approach to securing an environment, providing real-time detection and response. Several tools exist which can aid in monitoring.
de: Event-Monitoring ist ein pro-aktiver Ansatz zur Sicherung einer Umgebung, die Echtzeit-Erkennung und Reaktion. Es gibt mehrere Werkzeuge, die bei der Überwachung helfen können.
id: Pemantauan kejadian adalah pendekatan yang lebih proaktif untuk mengamankan lingkungan, memberikan deteksi dan respons real-time. Beberapa alat ada yang bisa membantu dalam pemantauan.
tr_tr: Olay izleme, bir ortamın güvenliğini sağlama, gerçek zamanlı algılama ve yanıt verme konusunda daha proaktif bir yaklaşımdır. İzlemeye yardımcı olabilecek çeşitli araçlar mevcuttur.

source: Examine your attributes map in the ``/etc/shibboleth/attributes-map.xml`` file and adjust your requirements if needed. For more information see `Shibboleth Attributes <https://wiki.shibboleth.net/confluence/display/SHIB2/NativeSPAddAttribute>`__.
de: Untersuchen Sie Ihre Attribut-Map in der ``/etc/shibboleth/attributes- map.xml``Datei und stellen Sie Ihre Anforderungen bei Bedarf ein. Weitere Informationen finden Sie unter `Shibboleth-Attribute <https://wiki.shibboleth.net/confluence/display/SHIB2/NativeSPAddAttribute>`__.
tr_tr: Özniteliklerinizin eşleştirmesini ``/etc/shibboleth/attributes-map.xml`` dosyasında inceleyin ve gerekirse ihtiyaçlarınızı ayarlayın. Daha fazla bilgi için bkz. `Shibboleth Öznitelikleri <https://wiki.shibboleth.net/confluence/display/SHIB2/NativeSPAddAttribute>` __.

source: Example of RHEL 6 CCE-26976-1 which will help implement NIST 800-53 Section *AC-19(d)* in Oz.
de: Beispiel für RHEL 6 CCE-26976-1, die dazu beitragen wird, NIST 800-53 Abschnitt *AC-19(d)* in Oz zu implementieren.
id: Contoh RHEL 6 CCE-26976-1 yang akan membantu mengimplementasikan NIST 800-53 Section * AC-19 (d) * di Oz.
tr_tr: OZ'da NIST 800-53 Bölüm *AC-19(d)* 'nin uygulanmasına yardımcı olacak RHEL 6 CCE-26976-1 örneği.

source: Example of a ``:sql_connection`` string for X.509 certificate authentication to MySQL:
de: Beispiel für einen ``:sql_connection``String für X.509 Zertifikat- Authentifizierung für MySQL:
id: Contoh string ``:sql_connection`` untuk otentikasi sertifikat X.509 ke MySQL:
tr_tr: MySQL ile X.509 sertifikası ile kimlik doğrulama için ``:sql_connection`` örneği:

source: Example of a ``:sql_connection`` string to MySQL:
de: Beispiel eines ``:sql_connection``string zu MySQL:
id: Contoh string ``:sql_connection`` ke MySQL:
tr_tr: MySQL için ``:sql_connection`` örneği:

source: Examples
de: Beispiele
id: Contoh
tr_tr: Örnekler

source: Examples of secrets that does not require a keystone token to access are passwords for service users in service configuration files, or encryption keys that do not belong to any particular project.
de: Beispiele für Geheimnisse, für die kein Keystone-Token erforderlich ist, sind Kennwörter für Service-Benutzer in Servicekonfigurationsdateien oder Verschlüsselungsschlüssel, die nicht zu einem bestimmten Projekt gehören.
id: Contoh rahasia yang tidak memerlukan keystone token untuk diakses adalah password untuk pengguna layanan dalam file konfigurasi layanan, atau kunci enkripsi yang tidak termasuk dalam proyek tertentu.

source: Exception process
de: Ausnahmeprozess
id: Proses Pengecualian
tr_tr: İstisna süreci

source: Explanation
de: Erläuterung
id: Penjelasan
tr_tr: Açıklama

source: Exposes all OpenStack APIs, including the OpenStack Networking API, to tenants. The IP addresses on this network should be reachable by anyone on the Internet. This may be the same network as the external network, as it is possible to create a subnet for the external network that uses IP allocation ranges to use only less than the full range of IP addresses in an IP block. This network is considered the Public Security Domain.
de: Setzt alle OpenStack-APIs, einschließlich der OpenStack Networking API, an Tenant. Die IP-Adressen in diesem Netzwerk sollten von jedermann im Internet erreichbar sein. Dies kann das gleiche Netzwerk wie das externe Netzwerk sein, da es möglich ist, ein Subnetz für das externe Netzwerk zu erstellen, das IP-Zuweisungsbereiche verwendet, um nur weniger als den gesamten Bereich von IP-Adressen in einem IP-Block zu verwenden. Dieses Netzwerk gilt als Public Security Domain.
id: Explose (bukalah) semua API OpenStack, termasuk OpenStack Networking API,ke penyewa. Alamat IP pada jaringan ini harus dapat dijangkau oleh siapapun di Internet. Ini mungkin jaringan yang sama dengan jaringan eksternal, karena memungkinkan untuk membuat subnet untuk jaringan eksternal yang menggunakan rentang alokasi IP untuk penggunaan hanya kurang dari kisaran penuh alamat IP dalam blok IP. Jaringan ini dianggap sebagai Public Security Domain.
tr_tr: OpenStack Ağ API'sı da dahil olmak üzere tüm OpenStack API'leri kiracılara açar. Bu ağdaki IP adreslerine, İnternet'teki herkes erişebilir olmalıdır. IP paylaşım aralıklarını kullanan ve yalnızca bir IP bloğundaki tüm IP adres aralığından daha azını kullanmak için bir dış ağ için bir alt ağ oluşturmak mümkündür, bu, dış ağ ile aynı ağ olabilir. Bu ağ Ortak Güvenlik Alanı olarak kabul edilir.

source: External
de: Außen
tr_tr: Harici

source: External audit
de: Externes Audit
id: Audit eksternal
tr_tr: Harici denetim

source: External authentication methods
de: Externe Authentifizierungsmethoden
id: Metode otentikasi eksternal
tr_tr: Harici kimlik doğrulama yöntemleri

source: External dependencies and associated security assumptions
de: Externe Abhängigkeiten und damit verbundene Sicherheitsannahmen
id: Ketergantungan eksternal dan asumsi keamanan yang terkait
tr_tr: Harici bağımlılıklar ve ilişikili güvenlik varsayımları

source: External dependencies are items outside of the control of the service that are required for its operation, and may impact the service if they were compromised or became unavailable. These items are usually outside the control of the developer but within the control of the deployer, or they may be operated by a third party. Appliances should be regarded as external dependencies.
de: Externe Abhängigkeiten sind Gegenstände außerhalb der Kontrolle des Dienstes, die für seinen Betrieb erforderlich sind, und können den Dienst beeinflussen, wenn sie kompromittiert wurden oder nicht verfügbar waren. Diese Gegenstände sind in der Regel außerhalb der Kontrolle des Entwicklers, aber innerhalb der Kontrolle des Deployers, oder sie können von einem Dritten betrieben werden. Geräte sollten als externe Abhängigkeiten betrachtet werden.
id: Ketergantungan eksternal adalah item di luar kendali layanan yang diperlukan untuk pengoperasiannya, dan mungkin berdampak pada layanan jika disusupi atau tidak tersedia. Item ini biasanya berada di luar kendali pengembang namun berada dalam kendali pengirim, atau mungkin dioperasikan oleh pihak ketiga. Peralatan harus dianggap sebagai dependensi eksternal.
tr_tr: Harici bağımlılıklar, servisin çalışması için gerekli olan denetim dışındaki öğelerdir ve serviste açık olduğunda veya kullanılamaz duruma gelindiğinde bu servisi etkileyebilir. Bu öğeler genellikle geliştiricinin kontrolü dışındadır ancak dağıtımcının denetimi altında veya üçüncü taraflar tarafından işletilebilirler. Aletler dış bağımlılıklar olarak değerlendirilmelidir.

source: External dependencies of the project
de: Externe Abhängigkeiten des Projekts
id: Ketergantungan eksternal proyek
tr_tr: Projenin dış bağımlılıkları

source: External network
de: Externes Netzwerk
id: Jaringan eksternal
tr_tr: Harici ağ
