Repository: openstack/security-doc
Catalog: security-guide/source/locale/*/LC_MESSAGES/security-guide.po
Languages: de, id, tr_tr

source: Whilst this chapter is currently sparse on specific guidance, it is expected that standard hardening practices will be followed. This section will be expanded with relevant information.
de: Während dieses Kapitel derzeit spärlich auf spezifische Anleitung ist, wird erwartet, dass Standard-Härtungspraktiken befolgt werden. Dieser Abschnitt wird mit relevanten Informationen erweitert.
id: Sementara bab ini saat ini jarang dilakukan pada panduan spesifik, diharapkan praktik pengerasan standar akan diikuti. Bagian ini akan diperluas dengan informasi yang relevan.
tr_tr: Bu bölüm şu anda belirli bir rehberlik konusunda çok sıkı olmamakla birlikte, standart güçlendirme uygulamalarının izlenmesi beklenmektedir. Bu bölüm, ilgili bilgilerle genişletilecektir.

source: Why and how we wrote this book
de: Warum und wie wir dieses Buch geschrieben haben
id: Mengapa dan bagaimana kita menulis buku ini
tr_tr: Bu kitabı neden ve nasıl yazdık

source: Why should I use Barbican?
de: Warum sollte ich Barbican benutzen?
id: Mengapa saya harus menggunakan Barbican?

source: Why use Federated Identity?
de: Warum Föderierte Identität?
id: Mengapa menggunakanFederated Identity?
tr_tr: Neden Federe Kimlik kullanılıyor?

source: With :ref:`check_image_01`, and permissions set to 640, root has read/write access and glance has read access to these configuration files. The access rights can also be validated using the following command. This command will only be available on your system if it supports ACLs.
de: Mit :ref:`check_image_01` und Berechtigungen auf 640 gesetzt, hat root Lese-/Schreibzugriff und glance hat Lesezugriff auf diese Konfigurationsdateien. Die Zugriffsrechte können auch mit dem folgenden Befehl validiert werden. Dieser Befehl ist nur auf Ihrem System verfügbar, wenn er ACLs unterstützt.
id: Dengan :ref:`check_image_01`, dan hak akses diatur ke 640, root telah membaca/menulis akses dan glance telah membaca akses ke file konfigurasi ini. Hak akses juga bisa divalidasi dengan menggunakan perintah berikut. Perintah ini hanya akan tersedia di sistem Anda jika mendukung ACL.
tr_tr: :ref:`check_image_01` ve izinler 640 olarak ayarlanırsa, root okuma/yazma erişimi sağlar ve glance'in bu yapılandırma dosyalarına okuma erişimi vardır. Erişim hakları aşağıdaki komut kullanılarak da doğrulanabilir. Bu komut yalnızca sisteminiz ACL'leri destekliyorsa kullanılabilir olacaktır.

source: With :ref:`check_key_mgr_01` and permissions set to 640, root has read/write access and barbican has read access to these configuration files. The access rights can also be validated using the following command. This command will only be available on your system if it supports ACLs.
de: Mit: ref: `check_key_mgr_01` und Berechtigungen auf 640 gesetzt, root hat Lese- / Schreibzugriff und barbican hat Lesezugriff auf diese Konfigurationsdateien. Die Zugriffsrechte können auch mit dem folgenden Befehl überprüft werden. Dieser Befehl ist nur auf Ihrem System verfügbar, wenn er ACLs unterstützt.
id: Dengan :ref:`check_key_mgr_01` dan hak akses diatur ke 640, root telah membaca / menulis akses dan barbican telah membaca akses ke file konfigurasi ini. Hak akses juga dapat divalidasi dengan menggunakan perintah berikut. Perintah ini hanya akan tersedia di sistem Anda jika mendukung ACL.

source: With ZeroMQ messaging, IPC sockets are used on individual machines. Because these sockets are vulnerable to attack, ensure that the cloud operator has secured them.
de: Mit ZeroMQ Messaging werden IPC-Sockets auf einzelnen Maschinen eingesetzt. Weil diese Sockets anfällig für Angriffe sind, stellen Sie sicher, dass der Cloud-Betreiber sie gesichert hat.
id: Dengan pesan ZeroMQ, soket IPC digunakan pada mesin individual. Karena soket ini rentan diserang, pastikan operator awan telah mengamankan mereka.
tr_tr: ZeroMQ mesajlaşma ile, IPC soketleri tek tek makinelerde kullanılır. Bu soketler saldırıya açık olduğundan, bulut operatörünün bunları güvence altına almasını sağlayın.

source: With a Key Manager service deployed on the stack, sahara must be configured to enable the external storage of secrets. Sahara uses the Castellan library to interface with the OpenStack Key Manager service. This library provides configurable access to a key manager.
de: Mit einem Schlüssel-Manager-Dienst, der auf dem Stack bereitgestellt wird, muss Sahara so konfiguriert werden, dass er die externe Speicherung von Geheimnissen ermöglicht. Sahara verwendet die Castellan-Bibliothek, um sich mit dem OpenStack Schlüssel-Manager-Dienst zu verbinden. Diese Bibliothek bietet konfigurierbaren Zugriff auf einen Schlüssel-Manager.
id: Dengan layanan Key Manager yang ditempatkan di stack, sahara harus dikonfigurasi untuk memungkinkan penyimpanan rahasia eksternal. Sahara menggunakan perpustakaan Castellan untuk berinteraksi dengan layanan OpenStack Key Manager. Perpustakaan ini menyediakan akses yang dapat dikonfigurasi ke manajer kunci.

source: With careful modeling, you can use network ACLs and IDS technologies to enforce explicit point to point communication between network services. As a critical cross domain service, this type of explicit enforcement works well for OpenStack's message queue service.
de: Mit sorgfältiger Modellierung können Sie Netzwerk-ACLs und IDS-Technologien nutzen, um explizite Punkt-zu-Punkt-Kommunikation zwischen Netzwerkdiensten zu erzwingen. Als kritischer Cross-Domain-Service funktioniert diese Art der expliziten Durchsetzung gut für den Message-Warteschlangen-Dienst von OpenStack.
id: Dengan pemodelan yang cermat, Anda dapat menggunakan teknologi ACL dan IDS jaringan untuk menerapkan komunikasi point to talk secara eksplisit antara layanan jaringan. Sebagai layanan lintas domain yang kritis, jenis penegakan eksplisit ini bekerja dengan baik untuk layanan antrian pesan OpenStack.
tr_tr: Dikkatli bir modelleme ile, ağ servisleri arasındaki açık uç noktadan noktaya iletişimi zorlamak için ağ ACL'lerini ve IDS teknolojilerini kullanabilirsiniz. Kritik bir çapraz alan hizmeti olarak bu tür açık uygulama, OpenStack'ın mesaj kuyruğu hizmeti için iyi çalışır.

source: With drivers that support NFS protocol authentication via IP address is the only supported option.
de: Mit Treibern, die NFS-Protokoll-Authentifizierung über IP-Adresse unterstützen, ist die einzige unterstützte Option.
id: Dengan driver yang mendukung otentikasi protokol NFS melalui alamat IP adalah satu-satunya opsi yang didukung.
tr_tr: Tek desteklenen seçenek, IP adresi üzerinden NFS protokolü kimlik doğrulamasını destekleyen sürücülerdir.

source: With the Key management service, when an ephemeral disk is no longer needed, simply deleting the key may take the place of overwriting the ephemeral disk storage area
de: Mit dem Key Management Service, wenn eine kurzlebige Festplatte nicht mehr benötigt wird, kann das Löschen des Schlüssels an die Stelle des Überschreibens des kurzlebigen Plattenspeicherbereichs treten
id: Dengan layanan manajemen Key, ketika disk fana tidak lagi dibutuhkan, cukup hapus kunci yang mungkin menggantikan penimpaan area penyimpanan disk sementara
tr_tr: Anahtar yönetimi servisiyle, geçici bir disk gerekmediğinde, basitçe anahtarın silinmesi, kısa ömürlü disk depolama alanının üzerine yazmanın yerini alabilir

source: With unique kernel-level architecture and National Security Agency (NSA) developed security mechanisms, KVM provides foundational isolation technologies for multi-tenancy. With developmental origins dating back to 2002, the Secure Virtualization (sVirt) technology is the application of SELinux against modern day virtualization. SELinux, which was designed to apply separation control based upon labels, has been extended to provide isolation between virtual machine processes, devices, data files and system processes acting upon their behalf.
de: Mit einzigartiger Kernel-Level-Architektur und NSA entwickelte Sicherheitsmechanismen, bietet KVM fundamentale Isolationstechnologien für Multi-Tenants. Mit entwicklungsorientierten Ursprüngen aus dem Jahr 2002 ist die Secure Virtualization (sVirt)-Technologie die Anwendung von SELinux gegen die moderne Virtualisierung. SELinux, das entworfen wurde, um eine Trennungssteuerung basierend auf Etiketten anzuwenden, wurde erweitert, um eine Isolierung zwischen virtuellen Maschinenprozessen, Geräten, Datendateien und Systemprozessen, die in ihrem Namen handeln, bereitzustellen.
id: Dengan arsitektur kernel-level yang unik dan National Security Agency (NSA) mengembangkan mekanisme keamanan, KVM menyediakan teknologi isolasi fondasi untuk multi-tenancy. Dengan asal mula perkembangan sejak tahun 2002, teknologi Secure Virtualization (sVirt) adalah aplikasi SELinux melawan virtualisasi modern. SELinux, yang dirancang untuk menerapkan kontrol pemisahan berdasarkan label, telah diperluas untuk memberikan isolasi antara proses mesin virtual, perangkat, file data dan proses sistem yang bertindak atas nama mereka.
tr_tr: Benzersiz çekirdek düzeyinde mimari ve Ulusal Güvenlik Ajansı (NSA) tarafından geliştirilen güvenlik mekanizmaları ile KVM, çoklu kiracılık için temel izolasyon teknolojileri sağlar. Gelişimsel kökenleri 2002 yılına dayanan Secure Virtualization (sVirt) teknolojisi, SELinux'u modern sanallaştırmaya karşı uyguluyor. Etiketlere dayalı ayırma denetimini uygulamak üzere tasarlanan SELinux, sanal makine işlemleri, aygıtlar, veri dosyaları ve kendi adına hareket eden sistem işlemleri arasında izolasyon sağlamak üzere genişletildi.

source: Within OpenStack some data may be deleted, but not securely erased in the context of the NIST standards outlined above. This is generally applicable to most or all of the above-defined metadata and information stored in the database. This may be remediated with database and/or system configuration for auto vacuuming and periodic free-space wiping.
de: Innerhalb von OpenStack können einige Daten gelöscht, aber nicht sicher im Zusammenhang mit den oben beschriebenen NIST-Standards gelöscht werden. Dies gilt allgemein für die meisten oder alle oben definierten Metadaten und Informationen, die in der Datenbank gespeichert sind. Dies kann mit Datenbank- und/oder Systemkonfiguration für automatisches Vakumierung und periodisches free-space Wiping behoben werden.
id: Dalam OpenStack beberapa data dapat dihapus, namun tidak dicabut dengan aman dalam konteks standar NIST yang diuraikan di atas. Hal ini umumnya berlaku untuk sebagian besar atau semua metadata dan informasi yang didefinisikan di atas yang tersimpan dalam database. Hal ini dapat diperbaiki dengan konfigurasi sistem dan/atau database untuk vacuuming secara otomatis dan wiping (pembersihan) ruang bebas secara periodik.
tr_tr: OpenStack içinde bazı veriler silinebilir, ancak yukarıda özetlenen NIST standartları bağlamında güvenli bir şekilde silinmez. Bu, genellikle, veritabanında depolanan yukarıda tanımlanan metaverilerin ve bilgilerin çoğunun veya tamamının için geçerlidir. Bu, otomatik vakumlama ve periyodik boş alan silme için veri tabanı ve/veya sistem yapılandırmasıyla düzeltilebilir.

source: Within OpenStack, it is recommended that all endpoints, especially public, are provided with an extra layer of protection, by means of either a rate-limiting proxy or web application firewall.
de: Innerhalb von OpenStack empfiehlt es sich, dass alle Endpunkte, insbesondere die Öffentlichkeit, mit einer zusätzlichen Schutzschicht versehen sind, und zwar entweder durch eine ratenbegrenzende Proxy- oder Web-Applikations-Firewall.
id: Dalam OpenStack, disarankan agar semua endpoint, terutama publik, dilengkapi dengan lapisan perlindungan ekstra, dengan menggunakan proxy rate-limiting atau firewall aplikasi web.
tr_tr: OpenStack içinde, özellikle genel olan tüm uç noktalara, fazladan koruma katmanı sağlanır. Yani bu, bir oran-sınırlama vekili ya da web uygulaması güvenlik duvarı demektir.

source: Within OpenStack, there are two solutions recommended for secrets managment, those being `Barbican <https://docs.openstack.org/barbican/latest/>`_ and `Castellan <https://docs.openstack.org/castellan/latest/>`_. This chapter will outline different scenarios to help an operator make a choice on which key manager to use.
de: In OpenStack werden derzeit 2 Lösungen für Geheimnisverwaltung empfohlen, diese sind`Barbican <https://docs.openstack.org/barbican/latest/>`_ und `Castellan <https://docs.openstack.org/castellan/latest/>`_. Dieses Kapitel will die unterschiedlichen Szenarien darstellen, um dem Operator bei der Auswahl zu helfen, welche Schlüsselverwaltung zu benutzen ist.
id: Dalam OpenStack, ada dua solusi yang direkomendasikan untuk manajemen rahasia, keberadaannya `Barbican <https://docs.openstack.org/barbican/latest/>`_ dan `Castellan <https://docs.openstack.org/castellan/latest/>`_. Bab ini akan menjelaskan berbagai skenario untuk membantu operator menentukan pilihan manajer kunci mana yang akan digunakan.

source: Within a cloud environment there is a mixture of hardware, operating systems, virtual machine managers, OpenStack services, cloud-user activity (such as creating instances and attaching storage), networking, and end-users using the applications running on the various instances.
de: Innerhalb einer Cloud-Umgebung gibt es eine Mischung aus Hardware, Betriebssystemen, virtuellen Maschinenmanagern, OpenStack-Diensten, Cloud-User-Aktivitäten (z. B. Erstellen von Instanzen und Anhängen von Speicher), Netzwerken und Endbenutzern mit den Anwendungen, die auf den verschiedenen Instanzen laufen.
id: Dalam lingkungan awan terdapat campuran perangkat keras, sistem operasi, manajer mesin virtual, layanan OpenStack, aktivitas pengguna awan (seperti membuat instance dan penyimpanan terhubung), jaringan, dan pengguna akhir yang menggunakan aplikasi yang berjalan pada berbagai instance.
tr_tr: Bulut ortamı; donanım, işletim sistemleri, sanal makine yöneticileri, OpenStack servisleri, bulut kullanıcı etkinliği (örnek oluşturma ve depolama ekleme gibi), ağ oluşturma ve çeşitli örneklerde çalışan uygulamaları kullanan son kullanıcılar karışımıdır.

source: Within the OpenStack framework, you can choose among many hypervisor platforms and corresponding OpenStack plug-ins to optimize your cloud environment. In the context of this guide, hypervisor selection considerations are highlighted as they pertain to feature sets that are critical to security. However, these considerations are not meant to be an exhaustive investigation into the pros and cons of particular hypervisors. NIST provides additional guidance in Special Publication 800-125, "*Guide to Security for Full Virtualization Technologies*".
de: Innerhalb des OpenStack-Frameworks können Sie unter vielen Hypervisor-Plattformen und entsprechenden OpenStack-Plug-ins auswählen, um Ihre Cloud-Umgebung zu optimieren. Im Rahmen dieses Leitfadens werden Hypervisor-Selektionsüberlegungen hervorgehoben, da sie sich auf Sicherheitsmerkmale beziehen, die für die Sicherheit entscheidend sind. Diese Erwägungen sind jedoch nicht als eine umfassende Untersuchung der Vor- und Nachteile von bestimmten Hypervisoren zu verstehen. NIST bietet zusätzliche Hinweise in der Sonderveröffentlichung 800-125, "* Leitfaden für Sicherheit für vollständige Virtualisierungstechnologien *".
id: Dalam kerangka OpenStack, Anda dapat memilih di antara banyak platform hypervisor dan plug-in OpenStack yang sesuai untuk mengoptimalkan lingkungan awan Anda. Dalam konteks panduan ini, pertimbangan seleksi hypervisor disorot karena berkaitan dengan rangkaian fitur yang sangat penting untuk keamanan. Namun, pertimbangan ini tidak dimaksudkan sebagai penyelidikan menyeluruh terhadap pro dan kontra dari hypervisors tertentu. NIST memberikan panduan tambahan dalam Publikasi Khusus 800-125, "*Guide to Security for Full Virtualization Technologies*".
tr_tr: Bulut ortamınızı optimize etmek için OpenStack çatısında birçok hipervizör platformundan ve bunlara karşılık gelen OpenStack eklentilerinden birini seçebilirsiniz. Bu kılavuz bağlamında, güvenlik açısından kritik olan özellik kümeleri ile ilgili oldukları için, denetimci seçimi ile ilgili önemli hususlar vurgulanır. Bununla birlikte, bu düşüncelerin belirli denetleyicilerin artıları ve eksileri üzerinde kapsamlı bir araştırma yapılması gerekmiyor. NIST, Özel Yayın 800-125, "* Tam Sanallaştırma Teknolojileri için Güvenlik Kılavuzu*" nda ek rehberlik sağlar.

source: Within the ``keystone.conf`` assign values to the ``[saml]`` related fields, for example:
de: Innerhalb der ``keystone.conf``weisen Sie den ``[saml] ``verwandten Feldern Werte zu, z.B.:
tr_tr: ``keystone.conf`` içinde ``[saml]`` ilgili alanlara değer atamak, örneğin:

source: Xen Project, Xen Security Modules: XSM-FLASK. 2014. `http://wiki.xen.org/wiki/Xen_Security_Modules_:_XSM-FLASK <http://wiki.xen.org/wiki/Xen_Security_Modules_:_XSM-FLASK>`_
de: Xen-Projekt, Xen-Sicherheitsmodule: XSM-FLASK. 2014. `http://wiki.xen.org/wiki/Xen_Security_Modules_:_XSM-FLASK <http://wiki.xen.org/wiki/Xen_Security_Modules_:_XSM-FLASK>`_
tr_tr: Xen Projesi, Xen Güvenlik Modülleri: XSM-FLASK. 2014. `http://wiki.xen.org/wiki/Xen_Security_Modules_:_XSM-FLASK <http://wiki.xen.org/wiki/Xen_Security_Modules_:_XSM-FLASK>`_

source: Xen explicitly assigns dedicated memory regions to instances and scrubs data upon the destruction of instances (or domains in Xen parlance). KVM depends more greatly on Linux page management; A complex set of rules related to KVM paging is defined in the `KVM documentation <http://www.linux-kvm.org/page/Memory>`__.
de: Xen weist explizit dedizierte Speicherbereiche auf Instanzen und scrubs Daten bei der Zerstörung von Instanzen (oder Domänen in Xen Parlance). KVM hängt stärker von der Linux-Seitenverwaltung ab. Ein komplexes Regelwerk für KVM-Paging ist in der KVM-Dokumentation definiert <http://www.linux-kvm.org/page/Memory>`__.
id: Xen secara eksplisit menetapkan area memori khusus ke instance dan data scrub saat penghancuran instance (atau domain dalam bahasa Xen). KVM sangat bergantung pada pengelolaan halaman Linux; Kumpulan aturan kompleks yang terkait dengan paging KVM didefinisikan dalam `KVM documentation <http://www.linux-kvm.org/page/Memory>`__.
tr_tr: Xen, örneklere tahsis edilmiş bellek bölgelerini açıkça atar ve örneklerin imha edilmesiyle (veya Xen dilinde alanlar) verileri siler. KVM, Linux sayfa yönetimine daha fazla bağımlıdır; KVM sayfalama ile ilgili karmaşık bir kurallar kümesi `KVM belgelerinde <http://www.linux-kvm.org/page/Memory>`__ tanımlanmıştır.

source: XenServer 5.6 includes a memory overcommitment feature named Transparent Page Sharing (TPS). TPS scans memory in 4 KB chunks for any duplicates. When found, the Xen Virtual Machine Monitor (VMM) discards one of the duplicates and records the reference of the second one.
de: XenServer 5.6 enthält eine Speicher-Overcommitment-Funktion mit dem Namen Transparent Page Sharing (TPS). TPS scannt Speicher in 4 KB Chunks für alle Duplikate. Wenn gefunden, verwirft der Xen Virtual Machine Monitor (VMM) eines der Duplikate und zeichnet die Referenz des zweiten auf.
id: XenServer 5.6 menyertakan fitur overcommitment memori yang bernama Transparent Page Sharing (TPS). TPS memindai memori dalam potongan 4 KB untuk setiap duplikat. Ketika ditemukan, Xen Virtual Machine Monitor (VMM) membuang salah satu duplikat dan mencatat referensi yang kedua.
tr_tr: XenServer 5.6 Şeffaf Sayfa Paylaşımı (TPS) adlı bir bellek aşırı tanımlama özelliğini içerir. TPS, herhangi bir çoğaltma için 4 KB'lik parçalar halinde belleği tarar. Bulduğunuzda, Xen Sanal Makine Monitörü (VMM) kopyalarından birini atar ve ikincisinin referansını kaydeder.

source: You also can choose and add the :ref:`security service <shared_fs_security_services>` that is supported by the share driver to create access rules with authentication methods for clients that are appropriate for your share. Supported security services are LDAP, Kerberos and Microsoft Active Directory.
de: Sie können auch wählen und hinzufügen :ref:`Sicherheitsdienst <shared_fs_security_services>`, die vom Share-Treiber unterstützt wird, um Zugriffsregeln mit Authentifizierungsmethoden für Clients zu erstellen, die für Ihre Freigabe geeignet sind. Unterstützte Sicherheitsdienste sind LDAP, Kerberos und Microsoft Active Directory.
id: Anda juga bisa memilih dan menambahkan :ref:`security service <shared_fs_security_services>` yang didukung oleh share driver untuk membuat aturan akses dengan metode otentikasi untuk klien yang sesuai untuk share anda. Layanan keamanan yang didukung adalah LDAP, Kerberos dan Microsoft Active Directory.
tr_tr: Ayrıca paylaşımınıza uygun istemciler için kimlik doğrulama yöntemleri bulunan erişim kuralları oluşturmak için paylaşım sürücüsü tarafından desteklenen :ref:`güvenlik servisini <paylaşım_işleri_security_services>` seçebilir ve ekleyebilirsiniz. Desteklenen güvenlik hizmetleri LDAP, Kerberos ve Microsoft Active Directory'dir.

source: You also can configure :ref:`security services <shared_fs_security_services>` in both *share servers* and *no share servers* back-end modes. But with *no share servers* back-end mode, an administrator should set desired authentication services manually on the host. And in *share servers* mode the Shared File Systems service can be configured automatically with any existing security services supported by the share driver.
de: Sie können auch :ref:`Sicherheitsdienste <shared_fs_security_services>` in beiden *share servers* und *no share servers* Back-End-Modi konfigurieren. Aber mit *no share servers* Back-End-Modus, sollte ein Administrator die gewünschten Authentifizierungsdienste manuell auf dem Host setzen. Und in *share servers* -Modus kann der Shared File Systems Service automatisch mit allen vorhandenen Sicherheitsdiensten konfiguriert werden, die vom Share-Treiber unterstützt werden.
id: Anda juga dapat mengkonfigurasi :ref:`security services <shared_fs_security_services>` di *share server * maupun *no share server * mode back-end. Tapi dengan *no share servers* mode back-end, administrator harus mengatur layanan otentikasi yang diinginkan secara manual pada host. Dan di mode *share servers*, layanan Shared File Systems dapat dikonfigurasi secara otomatis dengan layanan keamanan yang ada yang didukung oleh driver share.
tr_tr: Hem *paylaşım sunucusu* hem de *paylaşım sunucusu yok* arka uç kiplerinde aynı zamanda :ref:`güvenlik servisleri <shared_fs_security_services>` yapılandırabilirsiniz. Ancak *paylaşım sunucusu yok* arka uç kipinde, yönetici ana bilgisayarda istediğiniz kimlik doğrulama servisleri elle ayarlamalıdır. Ve *paylaşım sunucusu* kipinde Paylaşımlı Dosya Sistemleri servisi, paylaşım sürücüsü tarafından desteklenen mevcut tüm güvenlik servisleriyle otomatik olarak yapılandırılabilir.

source: You can force some services to use specific API endpoints. Therefore, it is recommended that each OpenStack service communicating to the API of another service must be explicitly configured to access the proper internal API endpoint.
de: Sie können einige Dienste zwingen, bestimmte API-Endpunkte zu verwenden. Daher empfiehlt es sich, dass jeder OpenStack-Dienst, der mit der API eines anderen Dienstes kommuniziert, explizit konfiguriert werden muss, um auf den richtigen internen API-Endpunkt zuzugreifen.
id: Anda dapat memaksa beberapa layanan untuk menggunakan endpoint API yang spesifik. Oleh karena itu, disarankan agar setiap layanan OpenStack berkomunikasi dengan API dari layanan lain harus dikonfigurasi secara eksplisit untuk mengakses endpoint API internal yang benar.
tr_tr: Bazı servisleri özel API uç noktalarını kullanması için zorlayabilirsiniz. Bu sebeple, her bir OpenStack servisini, bir diğer servisin API'si ile haberleşmesinde uygun iç API uç noktasına erişebilmesi için özel olarak yapılandırılması önerilmektedir.
