Repository: openstack/security-doc
Catalog: security-guide/source/locale/*/LC_MESSAGES/security-guide.po
Languages: de, id, tr_tr

source: Configuration files contain critical parameters and information required for smooth functioning of the component. If an unprivileged user, either intentionally or accidentally, modifies or deletes any of the parameters or the file itself then it would cause severe availability issues resulting in a denial of service to the other end users. Thus user ownership of such critical configuration files must be set to root and group ownership must be set to manila. Additionally, the containing directory should have the same ownership to ensure that new files are owned correctly.
id: File konfigurasi berisi parameter penting dan informasi yang diperlukan untuk kelancaran komponen. Jika pengguna yang tidak memiliki hak istimewa, baik secara sengaja atau tidak sengaja, memodifikasi atau menghapus salah satu parameter atau file itu sendiri, maka hal itu akan menyebabkan masalah ketersediaan yang parah yang mengakibatkan penolakan layanan kepada pengguna akhir lainnya. Dengan demikian kepemilikan pengguna atas file konfigurasi kritis tersebut harus diatur ke root dan kepemilikan grup harus diatur ke manila. Selain itu, direktori yang berisi harus memiliki kepemilikan yang sama untuk memastikan bahwa file baru dimiliki dengan benar.

source: Configuration files contain critical parameters and information required for smooth functioning of the component. If an unprivileged user, either intentionally or accidentally, modifies or deletes any of the parameters or the file itself then it would cause severe availability issues resulting in a denial of service to the other end users. User ownership of such critical configuration files must be set to root and group ownership must be set to barbican. Additionally, the containing directory should have the same ownership to ensure that new files are owned correctly.
id: File konfigurasi berisi parameter penting dan informasi yang diperlukan untuk kelancaran komponen. Jika pengguna yang tidak memiliki hak istimewa, baik secara sengaja atau tidak sengaja, memodifikasi atau menghapus salah satu parameter atau file itu sendiri, maka hal itu akan menyebabkan masalah ketersediaan yang parah yang mengakibatkan penolakan layanan kepada pengguna akhir lainnya. Kepemilikan pengguna atas file konfigurasi kritis tersebut harus disetel ke root dan kepemilikan grup harus diatur ke barbican. Selain itu, direktori yang berisi harus memiliki kepemilikan yang sama untuk memastikan bahwa file baru dimiliki dengan benar.

source: Connections to the VM should use encrypted and authenticated protocols such as HTTPS and SSH.
id: Koneksi ke VM harus menggunakan protokol terenkripsi dan terotentikasi seperti HTTPS dan SSH.

source: Crypto plugins
id: Plugin kripto

source: Disabling ``admin_token`` means it has a value of ``<none>``.
id: Menonaktifkan ``admin_token`` berarti memiliki nilai ``<none>``.

source: Dogtag plugin
id: Plugin Dogtag

source: Fernet tokens are the supported token provider for Stein (default). Fernet is a secure messaging format explicitly designed for use in API tokens. They are lightweight (fall in range of 180 to 240 bytes) and reduce the operational overhead required to run a cloud. Authentication and authorization metadata is neatly bundled into a message packed payload, which is then encrypted and signed in as a fernet token.
id: Token Fernet adalah penyedia token yang didukung untuk Stein (default). Fernet adalah format pesan aman yang dirancang secara eksplisit untuk digunakan dalam token API. Mereka ringan (berada dalam kisaran 180 hingga 240 byte) dan mengurangi overhead operasional yang diperlukan untuk menjalankan cloud. Metadata autentikasi dan otorisasi dibundel dengan rapi ke dalam muatan pesan yang dikemas, yang kemudian dienkripsi dan masuk sebagai token fernet.

source: For details of managing security services via API, see the `Security services API <https://docs.openstack.org/api-ref/shared-file-system/index.html#security-services>`_. You also can manage security services via python-manilaclient, see `Security services CLI managing <https://docs.openstack.org/admin-guide/shared_file_systems_security_services.html>`_.
id: Untuk detail mengelola layanan keamanan melalui API, lihat `Security services API <https://docs.openstack.org/api-ref/shared-file-system/index.html#security-services>`_. Anda juga dapat mengelola layanan keamanan melalui python-manilaclient, lihat `Security services CLI managing <https://docs.openstack.org/admin-guide/shared_file_systems_security_services.html>`_.

source: For information about the current state of feature support, see `OpenStack Hypervisor Support Matrix <https://docs.openstack.org/nova/latest/user/support-matrix.html>`__.
id: Untuk informasi tentang kondisi dukungan fitur saat ini, lihat `OpenStack Hypervisor Support Matrix <https://docs.openstack.org/nova/latest/user/support-matrix.html>`__.

source: For more information about the ``lvm_type`` parameter, see sections `LVM <https://docs.openstack.org/cinder/latest/configuration/block-storage/drivers/lvm-volume-driver.html>`__ and `Oversubscription in thin provisioning <https://docs.openstack.org/cinder/latest/admin/blockstorage-over-subscription.html>`__ of the *cinder* project documentation.
id: Untuk informasi lebih lanjut tentang parameter ``lvm_type``, lihat bagian `LVM <https://docs.openstack.org/cinder/latest/configuration/block-storage/drivers/lvm-volume-driver.html>` __ dan `Oversubscription in thin provisioning <https://docs.openstack.org/cinder/latest/admin/blockstorage-over-subscription.html>` __ dari dokumentasi proyek *cinder*.

source: For more information about the ``volume_clear`` parameter, see section `Cinder Configuration Options <https://docs.openstack.org/cinder/latest/sample_config.html>`__ of the *cinder* project documentation.
id: Untuk informasi lebih lanjut tentang parameter ``volume_clear``, lihat bagian `Cinder Configuration Options <https://docs.openstack.org/cinder/latest/sample_config.html>` __ dari dokumentasi proyek *cinder*.

source: For older deployments needing this functionality, prevention is possible by using an external authentication system that locks out an account after some configured number of failed login attempts. The account then may only be unlocked with further side-channel intervention.
id: Untuk penerapan yang lebih lama yang membutuhkan fungsionalitas ini, pencegahan dimungkinkan dengan menggunakan sistem otentikasi eksternal yang mengunci akun setelah sejumlah upaya login gagal yang terkonfigurasi. Akun itu kemudian hanya dapat dibuka dengan intervensi side-channel lebih lanjut.

source: Further details on the differences between these token providers can be found here https://docs.openstack.org/keystone/stein/admin/tokens-overview.html#token-providers
id: Rincian lebih lanjut tentang perbedaan antara penyedia token ini dapat ditemukan di sini https://docs.openstack.org/keystone/stein/admin/tokens-overview.html#token-providers

source: Futher justification and details can be found in Keystone's `documentation on federation <https://docs.openstack.org/keystone/latest/admin/federation/introduction.html>`_.
id: Pembenaran dan rincian lebih lanjut dapat ditemukan di Keystone `documentation on federation <https://docs.openstack.org/keystone/latest/admin/federation/introduction.html>`_.

source: In addition, standard security best practices should be used with the VM including the following:
id: Selain itu, praktik terbaik keamanan standar harus digunakan dengan VM termasuk yang berikut:

source: In the Stein release, there are two supported token types: fernet and JWT.
id: Dalam rilis Stein, ada dua jenis token yang didukung: fernet dan JWT.

source: In the beginning of this chapter we discuss the use of both physical and virtual hardware by instances, the associated security risks, and some recommendations for mitigating those risks. Then we discuss how the Secure Encrypted Virtualization technology can be used to encrypt the memory of VMs on AMD-based machines which support the technology. We conclude the chapter with a discussion of sVirt, an open source project for integrating SELinux mandatory access controls with the virtualization components.
id: Pada awal bab ini, kami membahas penggunaan perangkat keras fisik dan virtual secara instan, risiko keamanan terkait, dan beberapa rekomendasi untuk mengurangi risiko tersebut. Kemudian kami membahas bagaimana teknologi Secure Encrypted Virtualization dapat digunakan untuk mengenkripsi memori VM pada mesin berbasis AMD yang mendukung teknologi tersebut. Kami menyimpulkan bab ini dengan diskusi sVirt, sebuah proyek open source untuk mengintegrasikan kontrol akses wajib SELinux dengan komponen virtualisasi.

source: It is important to include backup procedures and policies in the overall System Security Plan. For a good overview of OpenStack's Backup and Recovery capabilities and procedures, refer to the `OpenStack Operations Guide on backup and recovery <https://docs.openstack.org/operations-guide/ops-backup-recovery.html>`__.
id: Penting untuk memasukkan prosedur dan kebijakan cadangan dalam System Security Plan secara keseluruhan. Untuk tinjauan umum yang baik tentang kemampuan dan prosedur OpenStack's Backup dan Recovery, lihat `OpenStack Operations Guide on backup and recovery <https://docs.openstack.org/operations-guide/ops-backup-recovery.html>`__.

source: It saves time for you and your users.
id: Ini menghemat waktu untuk Anda dan pengguna Anda.

source: JSON Web Signature (JWS) tokens were introduced in the Stein release. Compared to fernet, JWS offer a potential benefit to operators by limiting the number of hosts that need to share a symmetric encryption key. This helps prevent malicious actors who might already have a foothold in your deployment from spreading into additional nodes.
id: Token JSON Web Signature (JWS) diperkenalkan dalam rilis Stein. Dibandingkan dengan fernet, JWS menawarkan potensi keuntungan bagi operator dengan membatasi jumlah host yang perlu berbagi kunci enkripsi simetris. Ini membantu mencegah aktor jahat yang mungkin sudah memiliki pijakan dalam penyebaran Anda untuk menyebar ke node tambahan.

source: JWT tokens
id: Token JWT

source: KMIP plugin
id: Plugin KMIP

source: Learn more about how to contribute to the OpenStack docs, see the `OpenStack Documentation Contributor Guide <https://docs.openstack.org/doc-contrib-guide/index.html>`__.
id: Pelajari lebih lanjut tentang bagaimana berkontribusi pada dokumen OpenStack, lihat `OpenStack Documentation Contributor Guide <https://docs.openstack.org/doc-contrib-guide/index.html>`__.

source: Many times interesting events trigger an alert which is sent to a responder for action. Frequently this alert takes the form of an email with the messages of interest. An interesting event could be a significant failure, or known health indicator of a pending failure. Two common utilities for managing alerts are `Nagios <https://www.nagios.org>`_ and `Zabbix <https://www.zabbix.com/>`_.
id: Sering kali peristiwa menarik memicu peringatan yang dikirim ke penjawab untuk bertindak. Seringkali lansiran ini berbentuk email dengan pesan menarik. Peristiwa yang menarik bisa berupa kegagalan yang signifikan, atau indikator kesehatan yang diketahui tentang kegagalan yang tertunda. Dua utilitas umum untuk mengelola peringatan adalah `Nagios <https://www.nagios.org>`_ dan `Zabbix <https://www.zabbix.com/>`_.

source: Move responsibility of password recovery process to IdP.
id: Pindahkan tanggung jawab proses pemulihan kata sandi ke IdP.

source: Neither fernet or JWT tokens require persistence. The keystone token database no longer suffers bloat as a side effect of authentication. Pruning of expired tokens happens automatically. Replication across multiple nodes is also no longer needed. As long as each keystone node shares the same repository, tokens can be created and validated instantly across all nodes.
id: Baik token fernet atau JWT tidak membutuhkan persistence. Basis data toystone token tidak lagi menderita mengasapi (suffers bloat) sebagai efek samping dari otentikasi. Pemangkasan token yang kedaluwarsa terjadi secara otomatis. Replikasi di beberapa node juga tidak diperlukan lagi. Selama setiap node keystone berbagi repositori yang sama, token dapat dibuat dan divalidasi secara instan di semua node.

source: Note that with :ref:`check_neutron_01` and permissions set to 640, root has read/write access and neutron has read access to these configuration files. The access rights can also be validated using the following command. This command will only be available on your system if it supports ACLs.
id: Perhatikan bahwa dengan :ref: `check_neutron_01` dan izin diatur ke 640, root memiliki akses read/write dan neutron memiliki akses baca ke file konfigurasi ini. Hak akses juga dapat divalidasi menggunakan perintah berikut. Perintah ini hanya akan tersedia di sistem Anda jika mendukung ACL.

source: Once a user is authenticated, a token is generated for authorization and access to an OpenStack environment. A token can have a variable life span; however the default value for expiry is one hour. The recommended expiry value should be set to a lower value that allows enough time for internal services to complete tasks. In the event that the token expires before tasks complete, the cloud may become unresponsive or stop providing services. An example of expended time during use would be the time needed by the Compute service to transfer a disk image onto the hypervisor for local caching. Fetching expired tokens when using a valid service token is allowed.
id: Setelah pengguna diautentikasi, token dihasilkan untuk otorisasi dan akses ke lingkungan OpenStack. Token dapat memiliki rentang hidup variabel; namun nilai default untuk kedaluwarsa adalah satu jam. Nilai kedaluwarsa yang disarankan harus ditetapkan ke nilai yang lebih rendah yang memungkinkan cukup waktu bagi layanan internal untuk menyelesaikan tugas. Jika token berakhir sebelum tugas selesai, cloud mungkin menjadi tidak responsif atau berhenti memberikan layanan. Contoh dari waktu yang dikeluarkan selama penggunaan adalah waktu yang dibutuhkan oleh layanan Compute untuk mentransfer image disk ke hypervisor untuk caching lokal. Mengambil token yang kedaluwarsa saat menggunakan token layanan yang valid diizinkan.

source: OpenStack Security Notes (OSSN) are created by the OpenStack Security Group (OSSG) to support the work of the VMT. OSSN address issues in supporting software and common deployment configurations. They are referenced throughout this guide. Security Notes are archived at `OSSN <https://wiki.openstack.org/wiki/OSSN>`_.
id: OpenStack Security Notes (OSSN) dibuat oleh OpenStack Security Group (OSSG) untuk mendukung pekerjaan VMT. OSSN mengatasi masalah dalam mendukung perangkat lunak dan konfigurasi penggunaan umum. Mereka dirujuk di seluruh panduan ini. Catatan Keamanan diarsipkan di `OSSN <https://wiki.openstack.org/wiki/OSSN>`_.

source: OpenStack-discuss mailing list
id: OpenStack-discuss milis

source: PKCS#11 crypto plugin
id: Plugin kripto PKCS # 11

source: Reduce burden on users. Single sign on lets a single authentication method be used to access many different services & environments.
id: Mengurangi beban pengguna. Sistem masuk tunggal memungkinkan metode otentikasi tunggal digunakan untuk mengakses berbagai layanan & lingkungan.

source: Reduced complexity makes your deployment easier to secure.
id: Berkurangnya kompleksitas membuat penyebaran Anda lebih mudah diamankan.

source: Reported security bugs that are found to be the result of a misconfiguration, or are not strictly part of OpenStack are drafted into OpenStack Security Notes (OSSNs). These include configuration issues such as ensuring Identity provider mappings as well as non-OpenStack but critical issues such as the Bashbug/Ghost or Venom vulnerabilities that affect the platform OpenStack utilizes. The current set of OSSNs is in the `Security Note wiki <https://wiki.openstack.org/wiki/Security_Notes>`_.
id: Bug keamanan yang dilaporkan yang ditemukan sebagai akibat dari kesalahan konfigurasi, atau bukan bagian dari OpenStack yang dikonsep secara otomatis ke dalam OpenStack Security Notes (OSSNs). Ini termasuk masalah konfigurasi seperti memastikan pemetaan penyedia Identity serta non-OpenStack tetapi masalah kritis seperti kerentanan Bashbug / Ghost atau Venom yang memengaruhi platform yang digunakan OpenStack. Set OSSN saat ini ada di `Security Note wiki <https://wiki.openstack.org/wiki/Security_Notes>` _.

source: SEV provides protection for data in the memory used by the running VM. However, while the first phase of SEV integration with OpenStack enables encrypted memory for VMs, importantly it does not provide the ``LAUNCH_MEASURE`` or ``LAUNCH_SECRET`` capabilities which are available with the SEV firmware. This means that data used by an SEV-protected VM may be subject to attacks from a motivated adversary who has control of the hypervisor. For example, a rogue administrator on the hypervisor machine could provide a VM image for tenants with a backdoor and spyware capable of stealing secrets, or replace the VNC server process to snoop data sent to or from the VM console including passwords which unlock full disk encryption solutions.
id: SEV memberikan perlindungan untuk data dalam memori yang digunakan oleh VM yang sedang berjalan. Namun, sementara fase pertama integrasi SEV dengan OpenStack memungkinkan memori terenkripsi untuk VM, yang penting itu tidak memberikan kemampuan ``LAUNCH_MEASURE`` atau ``LAUNCH_SECRET`` yang tersedia dengan firmware SEV. Ini berarti bahwa data yang digunakan oleh VM yang dilindungi SEV dapat terkena serangan dari musuh termotivasi yang memiliki kendali atas hypervisor. Misalnya, administrator jahat pada mesin hypervisor dapat memberikan image VM untuk penyewa dengan backdoor dan spyware yang mampu mencuri rahasia, atau mengganti proses server VNC untuk mengintai data yang dikirim ke atau dari konsol VM termasuk kata sandi yang membuka kunci enkripsi disk penuh solusi.

source: Secret store plugins
id: Plugin penyimpanan rahasia

source: Secrets Management describes a group of technologies that are designed to protect key materials within a software system. Traditionally, key management involves deployment of `Hardware Security Modules (HSM) <https://en.wikipedia.org/wiki/Hardware_security_module>`_. These devices have been physically hardened against tampering.
id: Secrets Management menguraikan sekelompok teknologi yang dirancang untuk melindungi materi kunci dalam sistem perangkat lunak. Secara tradisional, manajemen kunci (key management) melibatkan penyebaran `Hardware Security Modules (HSM) <https://en.wikipedia.org/wiki/Hardware_security_module>` _. Perangkat ini secara fisik hardened (mengeras) terhadap gangguan.

source: Secure Encrypted Virtualization
id: Secure Encrypted Virtualization (Virtualisasi Terenkripsi yang Aman)

source: Secure boot may be an option for building your cloud, but requires careful planning in terms of hardware selection. For example, ensure that you have a TPM and Intel TXT support. Then verify how the node hardware vendor populates the PCR values. For example, which values will be available for validation. Typically the PCR values listed under the software context in the table above are the ones that a cloud architect has direct control over. But even these may change as the software in the cloud is upgraded. Configuration management should be linked into the PCR policy engine to ensure that the validation is always up to date.
id: Secure boot mungkin merupakan opsi untuk membangun cloud Anda, tetapi membutuhkan perencanaan yang cermat dalam hal pemilihan perangkat keras. Misalnya, pastikan Anda memiliki dukungan TPM dan Intel TXT. Kemudian verifikasi bagaimana vendor perangkat keras node mengisi nilai-nilai PCR. Misalnya, nilai mana yang akan tersedia untuk validasi. Biasanya nilai PCR yang terdaftar di bawah konteks perangkat lunak dalam tabel di atas adalah nilai-nilai yang dimiliki oleh arsitek cloud. Tetapi bahkan ini dapat berubah ketika perangkat lunak di cloud ditingkatkan. Manajemen konfigurasi harus ditautkan ke mesin kebijakan PCR untuk memastikan bahwa validasi selalu terkini.

source: Simple crypto plugin
id: Plugin kripto sederhana

source: The "HTTPONLY" cookie attribute instructs web browsers not to allow scripts (e.g. JavaScript or VBscript) an ability to access the cookies via the DOM ``document.cookie`` object. This session ID protection is mandatory to prevent session ID stealing through XSS attacks.
id: Atribut cookie "HTTPONLY" menginstruksikan browser web untuk tidak mengizinkan skrip (mis., JavaScript atau VBscript) kemampuan untuk mengakses cookie melalui objek DOM ``document.cookie``. Perlindungan ID sesi ini adalah wajib untuk mencegah ID sesi mencuri melalui serangan XSS.

source: The OpenStack Security team is based on voluntary contributions from the OpenStack community. You can contact the security community directly in the #openstack-security channel on Freenode IRC, or by sending mail to the openstack-discuss mailing list with the [security] prefix in the subject header.
id: Tim OpenStack Security didasarkan pada kontribusi sukarela dari komunitas OpenStack. Anda dapat menghubungi komunitas keamanan secara langsung di saluran #openstack-security di Freenode IRC, atau dengan mengirim email ke daftar mailing openstack-discuss dengan awalan [security] di header subjek.

source: The VM should be well maintained, including regular security scanning and patching to ensure a continuously strong security posture for the VM.
id: VM harus dijaga dengan baik, termasuk pemindaian dan patch keamanan berkala untuk memastikan postur keamanan yang kuat dan terus-menerus untuk VM.

source: The `KVM hypervisor section of the nova configuration guide <https://docs.openstack.org/nova/latest/admin/configuration/hypervisor-kvm.html#amd-sev-secure-encrypted-virtualization>`_ contains information needed to configure the machine and hypervisor, and lists several limitations of SEV.
id: The `KVM hypervisor section of the nova configuration guide <https://docs.openstack.org/nova/latest/admin/configuration/hypervisor-kvm.html#amd-sev-secure-encrypted-virtualization>`_ berisi informasi yang diperlukan untuk mengonfigurasi mesin dan hypervisor, dan mencantumkan beberapa batasan SEV.
