Repository: openstack/security-doc
Catalog: security-guide/source/locale/*/LC_MESSAGES/security-guide.po
Languages: de, id, tr_tr

source: OpenStack and the underlying virtualization layers provide for the live migration of images between OpenStack nodes, allowing you to seamlessly perform rolling upgrades of your OpenStack compute nodes without instance downtime. However, live migrations also carry significant risk. To understand the risks involved, the following are the high-level steps performed during a live migration:
de: OpenStack und die zugrunde liegenden Virtualisierungsschichten sorgen für die Live-Migration von Abbildern zwischen OpenStack-Knoten, so dass Sie problemlos Rolling Upgrades Ihrer OpenStack-Compute-Knoten ohne Ausfallzeiten durchführen können. Allerdings tragen auch Live-Migrationen ein erhebliches Risiko. Um die damit verbundenen Risiken zu verstehen, sind die High-Level-Schritte während einer Live-Migration:
id: OpenStack dan lapisan virtualisasi yang mendasari menyediakan migrasi langsung image antara node OpenStack, yang memungkinkan Anda melakukan upgrade rolling node OpenStack tanpa downtime tanpa batas. Namun, migrasi langsung juga membawa risiko signifikan. Untuk memahami risiko yang terlibat, berikut adalah langkah tingkat tinggi yang dilakukan selama migrasi langsung:
tr_tr: OpenStack ve altta yatan sanallaştırma katmanları, OpenStack düğümleri arasında imajların canlı olarak taşınmasını sağlar ve böylece OpenStack hesaplama düğümlerinizi kesintisiz olarak sorunsuz bir şekilde güncelleyebilirsiniz. Bununla birlikte, canlı göçler de önemli risk taşıyor. İlgili riskleri anlamak için, canlı geçiş sırasında gerçekleştirilen üst düzey adımlar şunlardır:

source: OpenStack architects interpret and respond to HIPAA statements, with data encryption remaining a core practice. Currently, this would require any protected health information contained within an OpenStack deployment to be encrypted with industry standard encryption algorithms. Potential future OpenStack projects such as object encryption will facilitate HIPAA guidelines for compliance with the act.
de: OpenStack-Architekten interpretieren und reagieren auf HIPAA-Anweisungen, wobei die Datenverschlüsselung eine Kernpraxis bleibt. Derzeit würde dies erforderlich, dass alle geschützten Gesundheitsinformationen, die in einer OpenStack-Bereitstellung enthalten sind, mit Industriestandard-Verschlüsselungsalgorithmen verschlüsselt werden. Mögliche zukünftige OpenStack-Projekte wie die Objektverschlüsselung erleichtern die HIPAA-Richtlinien für die Einhaltung der Handlung.
id: Arsitek OpenStack menafsirkan dan menanggapi pernyataan HIPAA, dengan enkripsi data tetap menjadi praktik inti. Saat ini, ini memerlukan informasi kesehatan terlindungi yang terkandung dalam penerapan OpenStack untuk dienkripsi dengan algoritma enkripsi standar industri. Potensi proyek OpenStack masa depan seperti enkripsi objek akan memfasilitasi pedoman HIPAA untuk mematuhi undang-undang tersebut.
tr_tr: OpenStack mimarları, HIPAA ifadelerini yorumluyor ve yanıtlıyorlar; veri şifrelemesi çekirdek bir uygulama olmaya devam ediyor. Halen bu, bir OpenStack dağıtımında bulunan korunan sağlık bilgisinin endüstri standardı şifreleme algoritmaları ile şifrelenmesini gerektirir. Nesne şifrelemesi gibi potansiyel gelecekteki OpenStack projeleri, HIPAA kurallarını hareketle uyumu kolaylaştıracaktır.

source: OpenStack can be configured to provide remote desktop console access to instances for tenants and administrators using the Virtual Network Computer (VNC) protocol.
de: OpenStack kann so konfiguriert werden, dass der Remote-Desktop-Konsolenzugriff auf Instanzen für Tenants und Administratoren erfolgt, die das VNC-Protokoll (Virtual Network Computer) verwenden.
id: OpenStack dapat dikonfigurasi untuk menyediakan akses konsol remote desktop ke beberapa instance penyewa dan administrator menggunakan protokol Virtual Network Computer (VNC).
tr_tr: OpenStack, Sanal Ağ Bilgisayarı (VNC) protokolünü kullanan kiracılar ve yöneticiler için uzak masaüstü konsol erişimlerine izin verecek şekilde yapılandırılabilir.

source: OpenStack components communicate with each other using various protocols and communication might involve sensitive or confidential data. An attacker may try to eavesdrop on the channel in order to get access to sensitive information. Therefore all components must communicate with each other using a secured communication protocol.
de: OpenStack-Komponenten kommunizieren miteinander unter Verwendung verschiedener Protokolle, und die Kommunikation kann sensitive oder vertrauliche Daten beinhalten. Ein Angreifer kann versuchen, den Kanal zu belauschen, um Zugriff auf vertrauliche Informationen zu erhalten. Daher müssen alle Komponenten miteinander über ein gesichertes Kommunikationsprotokoll kommunizieren.
id: Komponen OpenStack berkomunikasi satu sama lain dengan menggunakan berbagai protokol dan komunikasi mungkin melibatkan data sensitif atau rahasia. Penyerang dapat mencoba menguping saluran untuk mendapatkan akses ke informasi sensitif. Oleh karena itu semua komponen harus berkomunikasi satu sama lain menggunakan protokol komunikasi yang aman.

source: OpenStack components communicate with each other using various protocols and the communication might involve sensitive / confidential data. An attacker may try to eavesdrop on the channel in order to get access to sensitive information. Thus all the components must communicate with each other using a secured communication protocol.
de: OpenStack Kompponenten kommunizieren miteinander über verschiedene Protokolle und die Kommunikation kann sensitive/vertrauliche Daten beinhalten. Ein Angreifer kann versuchen den Kanal abzuhören, um auf sensitive Informationen zuzugreifen. Daher müssen alle Komponenten untereinander Daten über ein gesichertes Kommunikationsprotokoll austauschen.
id: Komponen OpenStack berkomunikasi satu sama lain dengan menggunakan berbagai protokol dan komunikasi mungkin melibatkan data sensitif / rahasia. Penyerang dapat mencoba menguping (eavesdrop) saluran untuk mendapatkan akses ke informasi sensitif. Dengan demikian semua komponen harus saling berkomunikasi menggunakan protokol komunikasi yang aman.
tr_tr: OpenStack bileşenleri kendi aralarında çeşitli protokollerde ve hassas / gizli veri içeren bir iletişim yapabilir. Saldırgan, bu hassas bilgileri erişim sağlamak için bu kanalı dinleyebilir. Bu yüzden tüm bileşenler güvenli bir haberleşme protokolü kullanarak haberleşmelidir.

source: OpenStack components communicate with each other using various protocols and the communication might involve sensitive or confidential data. An attacker may try to eavesdrop on the channel in order to get access to sensitive information. All components must communicate with each other using a secured communication protocol.
de: OpenStack-Komponenten kommunizieren miteinander mit verschiedenen Protokollen und die Kommunikation kann sensible oder vertrauliche Daten beinhalten. Ein Angreifer kann versuchen, auf dem Kanal zu lauschen, um Zugang zu sensiblen Informationen zu erhalten. Alle Komponenten müssen über ein gesichertes Kommunikationsprotokoll miteinander kommunizieren.
id: Komponen OpenStack berkomunikasi satu sama lain dengan menggunakan berbagai protokol dan komunikasi mungkin melibatkan data sensitif atau rahasia. Penyerang dapat mencoba menguping (eavesdrop) saluran untuk mendapatkan akses ke informasi sensitif. Semua komponen harus berkomunikasi satu sama lain menggunakan protokol komunikasi aman.
tr_tr: OpenStack bileşenleri çeşitli protokolleri kullanarak birbirleriyle iletişim kurar ve iletişim hassas veya gizli verileri içerebilir. Hassas bilgilerinize erişebilmek için bir saldırgan kanalda kulak misafiri olmayı deneyebilir. Tüm bileşenler, güvenli bir iletişim protokolü kullanarak birbirleriyle iletişim kurmalıdır.

source: OpenStack components communicate with each other using various protocols and the communication might involve sensitive or confidential data. An attacker may try to eavesdrop on the channel in order to get access to sensitive information. All the components must communicate with each other using a secured communication protocol.
de: OpenStack-Komponenten kommunizieren miteinander mit verschiedenen Protokollen und die Kommunikation kann sensible oder vertrauliche Daten beinhalten. Ein Angreifer kann versuchen, auf dem Kanal zu lauschen, um Zugang zu sensiblen Informationen zu erhalten. Alle Komponenten müssen über ein gesichertes Kommunikationsprotokoll miteinander kommunizieren.
id: Komponen OpenStack berkomunikasi satu sama lain menggunakan berbagai protokol dan komunikasi mungkin melibatkan data sensitif atau rahasia. Penyerang dapat mencoba menguping (eavesdrop) saluran untuk mendapatkan akses ke informasi sensitif. Semua komponen harus berkomunikasi satu sama lain menggunakan protokol komunikasi aman.
tr_tr: OpenStack bileşenleri çeşitli protokolleri kullanarak birbirleriyle iletişim kurar ve iletişim hassas veya gizli verileri içerebilir. Hassas bilgilerinize erişebilmek için bir saldırgan kanalda kulak misafiri deneyebilir. Tüm bileşenler, güvenli bir iletişim protokolü kullanarak birbirleriyle iletişim kurmalıdır.

source: OpenStack components communicate with each other using various protocols and the communication might involve sensitive or confidential data. An attacker may try to eavesdrop on the channel in order to get access to sensitive information. Thus all the components must communicate with each other using a secured communication protocol like HTTPS.
de: OpenStack-Komponenten kommunizieren miteinander mit verschiedenen Protokollen und die Kommunikation kann sensible oder vertrauliche Daten beinhalten. Ein Angreifer kann versuchen, auf dem Kanal zu lauschen, um Zugang zu sensiblen Informationen zu erhalten. So müssen alle Komponenten mit einem gesicherten Kommunikationsprotokoll wie HTTPS miteinander kommunizieren.
id: Komponen OpenStack berkomunikasi satu sama lain menggunakan berbagai protokol dan komunikasi mungkin melibatkan data sensitif atau rahasia. Penyerang dapat mencoba menguping (eavesdrop) saluran untuk mendapatkan akses ke informasi sensitif. Dengan demikian semua komponen harus berkomunikasi satu sama lain menggunakan protokol komunikasi aman seperti HTTPS.
tr_tr: OpenStack bileşenleri çeşitli protokolleri kullanarak birbirleriyle iletişim kurar ve iletişim hassas veya gizli verileri içerebilir. Hassas bilgilerinize erişebilmek için bir saldırgan kanalda kulak misafiri olmayı deneyebilir. Böylece, tüm bileşenlerin HTTPS gibi güvenli bir iletişim protokolü kullanarak birbirleriyle iletişim kurması gerekir.

source: OpenStack components communicate with each other using various protocols and the communication might involve sensitive or confidential data. An attacker may try to eavesdrop on the channel in order to get access to sensitive information. Thus all the components must communicate with each other using a secured communication protocol.
de: OpenStack-Komponenten kommunizieren miteinander mit verschiedenen Protokollen und die Kommunikation kann sensible oder vertrauliche Daten beinhalten. Ein Angreifer kann versuchen, auf dem Kanal zu lauschen, um Zugang zu sensiblen Informationen zu erhalten. Somit müssen alle Komponenten mit einem gesicherten Kommunikationsprotokoll miteinander kommunizieren.
id: Komponen OpenStack berkomunikasi satu sama lain dengan menggunakan berbagai protokol dan komunikasi mungkin melibatkan data sensitif atau rahasia. Penyerang dapat mencoba menguping saluran untuk mendapatkan akses ke informasi sensitif. Dengan demikian semua komponen harus berkomunikasi satu sama lain menggunakan protokol komunikasi yang aman.
tr_tr: OpenStack bileşenleri çeşitli protokolleri kullanarak birbirleriyle iletişim kurar ve iletişim hassas veya gizli verileri içerebilir. Hassas bilgilerinize erişebilmek için bir saldırgan kanalda kulak misafiri deneyebilir. Böylece, tüm bileşenler, güvenli bir iletişim protokolü kullanarak birbirleriyle iletişim kurmalıdır.

source: OpenStack compute node: Management and guest
de: OpenStack Compute Knoten: Management und Gast
tr_tr: OpenStack hesaplama düğümü: Yönetim ve misafir

source: OpenStack dashboard (horizon)
de: OpenStack Dashboard (Horizont)
tr_tr: OpenStack panel (horizon)

source: OpenStack dashboard: Public and management
de: OpenStack Dashboard: Public und Management
tr_tr: OpenStack panel: Kamu ve yönetim

source: OpenStack database access model
de: OpenStack Datenbankzugriffsmodell
id: Model akses database OpenStack
tr_tr: OpenStack veritabanı erişim modeli

source: OpenStack deployments that store, process, or transmit payment card details are in scope for the PCI-DSS. All OpenStack components that are not properly segmented from systems or networks that handle payment data fall under the guidelines of the PCI-DSS. Segmentation in the context of PCI-DSS does not support multi-tenancy, but rather physical separation (host/network).
de: OpenStack-Bereitstellungen, die die Kartenkarten speichern, verarbeiten oder übertragen, sind für den PCI-DSS im Geltungsbereich. Alle OpenStack-Komponenten, die nicht ordnungsgemäß von Systemen oder Netzwerken, die Zahlungsdaten behandeln, segmentiert sind, fallen unter die Richtlinien des PCI-DSS. Die Segmentierung im Rahmen von PCI-DSS unterstützt keine Multitenants sondern eine physikalische Trennung (Host/Netzwerk).
id: Pengerahan OpenStack yang menyimpan, memproses, atau mengirimkan rincian kartu pembayaran berada dalam cakupan PCI-DSS. Semua komponen OpenStack yang tidak tersegmentasi dengan benar dari sistem atau jaringan yang menangani data pembayaran termasuk dalam pedoman PCI-DSS. Segmentasi dalam konteks PCI-DSS tidak mendukung multi-tenancy, melainkan pemisahan fisik (host/network).
tr_tr: Ödeme kartı ayrıntılarını saklayan, işleyen veya ileten OpenStack dağıtımları PCI-DSS kapsamındadır. Ödeme verilerini işleyen sistemlerden veya ağlardan düzgün şekilde bölünmemiş olan tüm OpenStack bileşenleri PCI-DSS'nin kurallarına girmektedir. PCI-DSS bağlamında segmentasyon, çoklu kiracılığı değil, fiziksel ayrımı (ana / ağ) desteklemez.

source: OpenStack does not support message-level confidence, such as message signing. Consequently, you must secure and authenticate the message transport itself. For high-availability (HA) configurations, you must perform queue-to-queue authentication and encryption.
de: OpenStack unterstützt kein Message-Level-Vertrauen, wie z.B. Message Signing. Folglich müssen Sie den Nachrichtentransport selbst sichern und authentifizieren. Für hochverfügbare (HA)-Konfigurationen müssen Sie die Authentifizierung und Verschlüsselung der Warteschlange zur Warteschlange durchführen.
id: OpenStack tidak mendukung tingkat kepercayaan pesan, seperti penandatanganan pesan. Akibatnya, Anda harus mengamankan dan mengotentikasi transportasi pesan itu sendiri. Untuk konfigurasi high-availability (HA), Anda harus melakukan otentikasi dan enkripsi queue-to-queue.
tr_tr: OpenStack ileti seviyesi gizliliği, örneğin ileti imzalama'yı desteklemez. Sonuç olarak, ileti taşınmasının kendisini güvence altına almanız ve doğrulamanız gerekir. Yüksek kullanılabilirlikli (HA) yapılandırmalar için sıradan sıraya doğru kimlik doğrulama ve şifreleme gerçekleştirmelisiniz.

source: OpenStack embraces a modular architecture to provide a set of core services that facilitates scalability and elasticity as core design tenets. This chapter briefly reviews OpenStack components, their use cases and security considerations.
de: OpenStack umfasst eine modulare Architektur, um eine Reihe von Kerndiensten bereitzustellen, die Skalierbarkeit und Elastizität als Kerndesign-Lehren erleichtern. In diesem Kapitel werden die OpenStack-Komponenten, ihre Anwendungsfälle und Sicherheitsüberlegungen kurz beschrieben.
id: OpenStack menganut arsitektur modular untuk menyediakan satu set layanan inti yang memfasilitasi skalabilitas dan elastisitas sebagai prinsip desain inti. Bab ini secara singkat mengulas komponen OpenStack, kasus penggunaan dan pertimbangan keamanan mereka.
tr_tr: OpenStack, çekirdek tasarım ilkeleri olarak ölçeklenebilirliği ve elastikiyeti kolaylaştıran bir dizi temel hizmet sunmak için modüler bir mimari içeriyor. Bu bölüm OpenStack bileşenlerini, kullanım durumlarını ve güvenlik hususlarını kısaca inceler.

source: OpenStack endpoints are HTTP services providing APIs to both end-users on public networks and to other OpenStack services on the management network. It is highly recommended that all of these requests, both internal and external, operate over TLS. To achieve this goal, API services must be deployed behind a TLS proxy that can establish and terminate TLS sessions. The following table offers a non-exhaustive list of open source software that can be used for this purpose:
de: OpenStack-Endpunkte sind HTTP-Dienste, die sowohl Endnutzern in öffentlichen Netzwerken als auch anderen OpenStack-Diensten im Management-Netzwerk APIs bereitstellen. Es wird dringend empfohlen, dass alle diese Anfragen, sowohl intern als auch extern, über TLS operieren. Um dieses Ziel zu erreichen, müssen API-Dienste hinter einem TLS-Proxy bereitgestellt werden, der TLS-Sitzungen einrichten und beenden kann. Die folgende Tabelle bietet eine nicht erschöpfende Liste von Open-Source-Software, die zu diesem Zweck verwendet werden kann:
id: Endpoint OpenStack adalah layanan HTTP yang menyediakan API kepada endpoint di jaringan publik dan layanan OpenStack lainnya di jaringan manajemen. Sangat disarankan agar semua permintaan ini, baik internal maupun eksternal, beroperasi di atas TLS. Untuk mencapai tujuan ini, layanan API harus ditempatkan di belakang proxy TLS yang dapat menetapkan dan menghentikan sesi TLS. Tabel berikut ini menawarkan daftar lengkap perangkat lunak open source yang dapat digunakan untuk tujuan ini:
tr_tr: OpenStack uç noktaları, kamu ağlarındaki hem son kullanıcılara hem de yönetim ağındaki diğer OpenStack servislerine API'ler sağlayan HTTP servisleridir. İç ve dış taleplerin hepsinin TLS üzerinden çalışması şiddetle önerilir. Bu amaca ulaşmak için, API servisleri TLS oturumlarını kurabilen ve sonlandıracak bir TLS proxy'nin arkasında konuşlandırılmalıdır. Aşağıdaki tablo, bu amaçla kullanılabilecek açık kaynak yazılımın kapsamlı bir listesini sunmaktadır:

source: OpenStack has not undergone Common Criteria certification, however many of the available hypervisors have.
de: OpenStack wurde keiner Common Criteria Zertifizierung unterzogen, aber viele der verfügbaren Hypervisoren haben eine.
id: OpenStack belum mengikuti sertifikasi Common Criteria, namun banyak hypervisor yang tersedia.
tr_tr: OpenStack, Yaygın Kıstas sertifikasına girmedi, ancak kullanılabilir hipervizörlerin birçoğu var.

source: OpenStack is a key enabler in the adoption of cloud technology and has several common deployment use cases. These are commonly known as Public, Private, and Hybrid models. The following sections use the National Institute of Standards and Technology (NIST) `definition of cloud <http://nvlpubs.nist.gov/nistpubs/Legacy/SP/nistspecialpublication800-145.pdf>`__ to introduce these different types of cloud as they apply to OpenStack.
de: OpenStack ist ein wichtiger Enabler bei der Einführung von Cloud-Technologie und hat mehrere verbreitete Anwendungsfälle. Diese sind allgemein bekannt als Public, Private und Hybrid Modelle. Die folgenden Abschnitte verwenden das Nationale Institut für Normen und Technologie (NIST) ` Definition von Cloud <http://nvlpubs.nist.gov/nistpubs/Legacy/SP/nistspecialpublication800-145.pdf>`__, um diese verschiedenen Arten von Cloud vorzustellen, wie sie für OpenStack gelten.
id: OpenStack adalah enabler kunci dalam penerapan teknologi awan dan memiliki beberapa kasus penggunaan umum. Ini umumnya dikenal sebagai model Public, Private, and Hybrid. Bagian berikut menggunakan National Institute of Standards and Technology (NIST) `definition of cloud <http://nvlpubs.nist.gov/nistpubs/Legacy/SP/nistspecialpublication800-145.pdf>`__ untuk mengenalkan berbagai jenis awan ini saat mereka mendaftar ke OpenStack.

source: OpenStack is designed to support multitenancy and those tenants will most probably have different data requirements. As a cloud builder or operator, you must ensure your OpenStack environment addresses data privacy concerns and regulations. In this chapter we will address data residency and disposal as it pertains to OpenStack implementations.
de: OpenStack wurde entwickelt, um Multitenans zu unterstützen und diese Tenants werden höchstwahrscheinlich unterschiedliche Datenanforderungen haben. Als Cloud Builder oder Betreiber müssen Sie sicherstellen, dass Ihre OpenStack Umgebungsdokumente Datenschutzbestimmungen und Vorschriften enthalten. In diesem Kapitel werden wir die Datenresidenz und die Entsorgung ansprechen, wie es sich um OpenStack-Implementierungen handelt.
id: OpenStack dirancang untuk mendukung multitenancy dan tenant (penyewa) tersebut kemungkinan besar memiliki persyaratan data yang berbeda. Sebagai pembangun atau operator awan, Anda harus memastikan lingkungan OpenStack Anda menangani masalah dan persyaratan privasi data. Dalam bab ini kita akan membahas residensi data dan pembuangan karena berkaitan dengan implementasi OpenStack.
tr_tr: OpenStack, çoklu servis kullanımını desteklemek üzere tasarlanmıştır ve bu kiracıların büyük olasılıkla farklı veri gereksinimlerine sahip olacaklarıdır. Bir bulut oluşturucu veya operatör olarak, OpenStack ortamınızın veri gizliliği endişelerinizi ve düzenlemelerinizi ele aldığından emin olun. Bu bölümde, OpenStack uygulamaları ile ilgili verilerin ikameti ve elden çıkarılması ele alınacaktır.

source: OpenStack is innovative in many ways however the process used to audit an OpenStack deployment is fairly common. Auditors will evaluate a process by two criteria: Is the control designed effectively and if the control is operating effectively. An understanding of how an auditor evaluates if a control is designed and operating effectively will be discussed in the section called :doc:`understanding-the-audit-process`.
de: OpenStack ist in vielerlei Hinsicht innovativ, aber der Prozess, der zur Prüfung einer OpenStack-Implementierung verwendet wird, ist ziemlich normal. Auditoren werden einen Prozess nach zwei Kriterien auswerten: Ist die Steuerung effektiv konzipiert und funktioniert die Steuerung effektiv. Ein Verständnis dafür, wie ein Auditor auswertet, ob eine Kontrolle konzipiert und effektiv betrieben wird, wird im Abschnitt :doc: `Verständnis des Audit-Prozesses` besprochen.
id: OpenStack inovatif dalam banyak hal namun proses yang digunakan untuk mengaudit penyebaran OpenStack cukup umum terjadi. Auditor akan mengevaluasi suatu proses dengan dua kriteria: Apakah pengendalian dirancang secara efektif dan jika pengendaliannya berjalan efektif. Pemahaman tentang bagaimana auditor mengevaluasi jika suatu pengendalian dirancang dan beroperasi secara efektif akan dibahas di bagian yang disebut :doc:`understanding-the-audit-process`.
tr_tr: OpenStack pek çok açıdan yenilikçi olmakla birlikte, bir OpenStack dağıtımını denetleyen süreç oldukça yaygındır. Denetçiler, bir süreci iki kritere göre değerlendirecektir: Kontrol etkin bir şekilde tasarlanmış mı ve kontrol etkin bir şekilde çalışıyor mu? Denetçinin, bir denetim tasarlanıp tasarlanmadığında nasıl değer biçtiğini anlayabilmek için :doc:`understanding-the-audit-process` bölümünde tartışılacaktır.
