Repository: openstack/security-doc
Catalog: security-guide/source/locale/*/LC_MESSAGES/security-guide.po
Languages: de, id, tr_tr

source: ``firewall_driver`` must be set to ``nova.virt.firewall.NoopFirewallDriver`` so that nova-compute does not perform iptables-based filtering itself.
de: ``firewall_driver``muss auf ``nova.virt.firewall.NoopFirewallDriver`` gesetzt sein, damit nova-compute keine iptables-basierte Filterung selbst durchführt.
id: ``firewall_driver`` harus disetel ke ``nova.virt.firewall.NoopFirewallDriver`` sehingga nova-compute tidak melakukan penyaringan berbasis iptables itu sendiri.
tr_tr: ``firewall_driver``, ``nova.virt.firewall.NoopFirewallDriver`` olarak ayarlanmalıdır, böylece nova-compute iptables tabanlı filtrelemeyi kendisi gerçekleştirmez.

source: ``max-burst-kbps``: burst buffer
de: ``max-burst-kbps``: Burst-Puffer
tr_tr: ``max-burst-kbps``: patlatma arabelleği

source: ``max-kbps``: bandwidth
de: ``max-kbps``: bandbreite
tr_tr: ``max-kbps``: bant genişliği

source: ``security_group_api`` must be set to ``neutron`` so that all security group requests are proxied to the OpenStack Networking service.
de: ``security_group_api``muss auf ``neutron``gesetzt sein, damit alle Sicherheitsgruppenanforderungen mit dem OpenStack Networking Service in Verbindung stehen.
id: ``security_group_api`` harus disetel ke ``neutron`` sehingga semua permintaan grup keamanan diproksikan ke layanan OpenStack Networking.
tr_tr: ``security_group_api``, ``neutron`` olarak ayarlanmalıdır, böylece tüm güvenlik grubu istekleri OpenStack Ağ servisine yönlendirilir.

source: `http://www.cl.cam.ac.uk/~rja14/Papers/serpent.pdf <http://www.cl.cam.ac.uk/~rja14/Papers/serpent.pdf>`_
de: `http://www.cl.cam.ac.uk/~rja14/Papiere/serpent.pdf <http://www.cl.cam.ac.uk/~rja14/Papers/serpent.pdf>`_

source: blog.malchuk.ru, OpenStack VNC Security. 2013. `Secure Connections to VNC ports <http://blog.malchuk.ru/2013/05/21/47>`_
de: blog.malchuk.ru, OpenStack VNC Sicherheit. 2013. `Sichere Verbindungen zu VNC-Ports <http://blog.malchuk.ru/2013/05/21/47>`_
tr_tr: blog.malchuk.ru, OpenStack VNC Güvenliği. 2013. `VNC portlarına Güvenli Bağlantı <http://blog.malchuk.ru/2013/05/21/47>`_

source: blog.sflow.com, sflow: Host sFlow distributed agent. 2012. http://blog.sflow.com/2012/01/host-sflow-distributed-agent.html
de: blog.sflow.com, sflow: Host sFlow verteilter Agent. 2012. http://blog.sflow.com/2012/01/host-sflow-distributed-agent.html

source: blog.sflow.com, sflow: LAN and WAN. 2009. http://blog.sflow.com/2009/09/lan-and-wan.html
de: blog.sflow.com, sflow: LAN und WAN. 2009. http://blog.sflow.com/2009/09/lan-and-wan.html

source: blog.sflow.com, sflow: Rapidly detecting large flows sFlow vs. NetFlow/IPFIX. 2013. http://blog.sflow.com/2013/01/rapidly-detecting-large-flows-sflow-vs.html
de: blog.sflow.com, sflow: Schnelle Erkennung großer Flüsse sFlow vs. NetFlow/IPFIX. 2013. http://blog.sflow.com/2013/01/rapidly-detecting-large-flows-sflow-vs.html

source: bugzilla.redhat.com, Bug 913607 - RFE: Support Tunnelling SPICE over websockets. 2013. `RedHat bug 913607 <https://bugzilla.redhat.com/show_bug.cgi?id=913607>`_.
de: bugzilla.redhat.com, Bug 913607 - RFE: Stützen Tunneling SPICE über Websockets. 2013. `RedHat Bug 913607 <https://bugzilla.redhat.com/show_bug.cgi?id=913607>`_.
tr_tr: bugzilla.redhat.com, Hata 913607 - RFE: Web Soketleri üzerinden Destek Tünel Oluşturma SPICE. `RedHat hatası 913607 <https://bugzilla.redhat.com/show_bug.cgi?id=913607>`_.

source: iSCSI initiator service
de: iSCSI-Initiatordienst
tr_tr: iSCSI başlatıcı servisi

source: keystone listener process (Python): Python process that consumes keystone events published by the keystone service.
de: Keystone-Listener-Prozess (Python): Python-Prozess, der Keystone-Ereignisse vereint, die vom Keystone-Service veröffentlicht werden.
id: keystone listener process (Python): Proses Python yang mengkonsumsi keystone event yang diterbitkan oleh layanan keystone.
tr_tr: keystone dinleyici süreci (Python): Keystone servisi tarafından yayınlanan keystone olaylarını tüketen Python işlemi.

source: network provider services (SDN server/services)
de: Netzwerkanbieterdienste (SDN-Server/Dienste)
id: layanan penyedia jaringan (SDN server/services)
tr_tr: ağ sağlayıcı servisleri (SDN sunucu/servisler)

source: neutron server (*neutron-server* and *neutron-\*-plugin*)
de: Neutron Server (*Neutron Server* und *Neutron-\*-Plugin*)
tr_tr: neutron sunucu (*neutron-server* ve *neutron-\*-plugin*)

source: oasis-open.org, OASIS Key Management Interoperability Protocol (KMIP). 2014. `KMIP <https://www.oasis-open.org/committees/tc_home.php?wg_abbrev=kmip>`__
de: oasis-open.org, OASIS Key Management Interoperabilitätsprotokoll (KMIP). 2014. `KMIP <https://www.oasis-open.org/committees/tc_home.php?wg_abbrev=kmip>`__
tr_tr: oasis-open.org, OASIS Anahtar Yönetim Birlikte Çalışabilirlik Protokolü (KMIP). 2014. `KMIP <https://www.oasis-open.org/committees/tc_home.php?wg_abbrev=kmip>`__

source: of OpenStack Configuration Reference and the `Oversubscription in thin provisioning <https://docs.openstack.org/admin-guide/blockstorage_over_subscription.html>`__ of OpenStack Administrator Guide.
de: von OpenStack Configuration Reference und die `Oversubscription in Thin Provisioning <https://docs.openstack.org/admin-guide/blockstorage_over_subscription.html>`__ von OpenStack Administrator Guide.

source: or
de: oder
id: atau
tr_tr: ya da

source: pending
de: steht aus
id: tertunda

source: sVirt isolation is provided regardless of the guest operating system running inside the virtual machine. Linux or Windows VMs can be used. Additionally, many Linux distributions provide SELinux within the operating system, allowing the virtual machine to protect internal virtual resources from threats.
de: sVirt-Isolation wird unabhängig vom Gastbetriebssystem, das innerhalb der virtuellen Maschine läuft, bereitgestellt. Linux oder Windows VMs können verwendet werden. Darüber hinaus bieten viele Linux-Distributionen SELinux innerhalb des Betriebssystems, so dass die virtuelle Maschine interne virtuelle Ressourcen vor Bedrohungen schützen kann.
id: Isolasi sVirt disediakan terlepas dari sistem operasi guest yang berjalan di dalam mesin virtual. Linux atau Windows VMs dapat digunakan. Selain itu, banyak distribusi Linux menyediakan SELinux dalam sistem operasi, memungkinkan mesin virtual melindungi sumber daya virtual internal dari ancaman.
tr_tr: Sanal makine içinde çalışan konuk işletim sisteminden bağımsız olarak sVirt izolasyonu sağlanır. Linux veya Windows VM'leri kullanılabilir. Buna ek olarak, birçok Linux dağıtımı, sanal makinenin dahili sanal kaynakları tehditlerden korumasına izin veren işletim sistemi içinde SELinux'u sağlar.

source: sVirt: SELinux and virtualization
de: sVirt: SELinux und Virtualisierung
tr_tr: sVirt: SELinux ve sanallaştırma

source: **Nathanael Burton**, National Security Agency
tr_tr: **Nathanael Burton**, Ulusal Güvenlik Ajansı

source: **no share servers mode**
tr_tr: **paylaşım sunucusu kipi yok**

source: **share servers mode**
tr_tr: **paylaşım sunucusu kipi**

source: 168 bits
tr_tr: 168 bit

source: :term:`Secure shell (SSH)<secure shell (SSH)>`
tr_tr: :term:`Güvenli kabuk (SSH)<güvenli kabuk (SSH)>`

source: Address Space Layout Randomization (ASLR)
tr_tr: Adres Uzayı Düzen Rastgeleleştirilmesi (ASLR)

source: Allowed hosts
id: Host yang diizinkan
tr_tr: İzin verilen makineler

source: Audit
tr_tr: Denetim

source: Bare metal server sanitization
id: Sanitasi server Bare Metal
tr_tr: Düz sunucu temizleme

source: Booleans
tr_tr: Booleanlar

source: Certificate Revocation Lists (CRL)
tr_tr: Sertifika İptal Listesi (CRL)

source: Check-Identity-07: insecure_debug false in ``/etc/keystone/keystone.conf``
id: Check-Identity-07: Insecure_debug salah di ``/etc/keystone/keystone.conf``
tr_tr: Check-Identity-07: ``/etc/keystone/keystone.conf`` dosyasındaki insecure_debug false mu?

source: Community cloud
id: Awan komunitas
tr_tr: Topluluk bulutu

source: Compiler hardening
id: Pengerasan kompilator
tr_tr: Derleyici sıkılaştırması

source: Compliance
id: Kepatuhan
tr_tr: Uyum

source: Compliance maintenance
id: Pemeliharaan Kepatuhan
tr_tr: Uyumluluk bakımı

source: Config option
id: Opsi konfig
tr_tr: Yapılandırma seçeneği

source: Control tailoring:
id: Kontrol menyesuaikan:
tr_tr: Kontrol hazırlığı:

source: Cookies
tr_tr: Çerezler

source: Cross Origin Resource Sharing (CORS)
tr_tr: Çapraz Köken Kaynak Paylaşımı (CORS)

source: Cross Site Request Forgery (CSRF)
tr_tr: Siteler Arası Talep Sahteciliği (CSRF)

source: Cross Site Scripting (XSS)
tr_tr: Siteler Arası Komut Çalıştırma (XSS)

source: Cross-Frame Scripting (XFS)
tr_tr: Çerçeveler Arası Komut Dosyası Çalıştırma (XFS)

source: DHCP agent (*neutron-dhcp-agent*)
id: Agen DHCP (*neutron-dhcp-agent*)
tr_tr: DHCP aracı (*neutron-dhcp-agent*)

source: Dashboard
id: Dasbor
tr_tr: Kontrol Paneli

source: Data processing service
id: Layanan pengolahan data
tr_tr: Veri işleme servisi

source: Denial of service
tr_tr: Hizmet reddi

source: Deployment
id: Pengerahan
tr_tr: Yayına alma

source: Domains
id: Domain-domain
tr_tr: Alanlar

source: Federated keystone
tr_tr: Federe keystone

source: Firewalls
id: Firewall
tr_tr: Güvenlik duvarları

source: Front-end caching
id: Caching front-end
tr_tr: Ön yüz önbellekleme

source: Government standards
id: Standar Pemerintah
tr_tr: Hükümet standartları

source: HTTP Strict Transport Security (HSTS)
tr_tr: HTTP Sıkı Taşıma Güvenliği (HSTS)

source: HTTP strict transport security
id: Keamanan transportasi ketat HTTP
tr_tr: HTTP sıkı taşıma güvenliği

source: Hardening Compute deployments
id: Pengerasan Pengerahan Compute
tr_tr: Hesaplama dağıtımlarını sıkılaştırmak

source: Hardware
tr_tr: Donanım

source: Hardware inventory
id: Inventarisasi perangkat keras
tr_tr: Donanım envanteri

source: Hybrid cloud
id: Awan hibrida
tr_tr: Karma bulut

source: Hypervisor vs. baremetal
id: Hypervisor versus baremetal
tr_tr: Hipervizör mü düz mü

source: I/O MMU
tr_tr: G/Ç MMU

source: Identity Provider (IdP)
tr_tr: Kimlik Sağlayıcı (IdP)

source: Identity service
id: Layanan Identity
tr_tr: Kimik servisi

source: Image service
id: Layanan Image
tr_tr: İmaj servisi

source: In ``my.cnf``:
id: Di ``my.cnf``:
tr_tr: ``my.cnf`` dosyasında:

source: In ``postgresql.conf``:
id: Di ``postgresql.conf``:
tr_tr: ``postgresql.conf`` dosyasında:

source: Information Security Management system (ISMS)
tr_tr: Bilgi Güvenliği Yönetim Sistemi (ISMS)

source: Intel Trusted Execution Technology
tr_tr: Intel Guvenli Çalıştırma Teknolojisi

source: Intrusion detection system
id: Sistem pendeteksi intrusi
tr_tr: Saldırı tespit sistemi

source: KVM Kernel Samepage Merging
tr_tr: KVM Çekirdek Aynı Sayfa Birleştirme

source: L3 agent (*neutron-l3-agent*)
id: Agen L3 (*neutron-l3-agent*)
tr_tr: L3 aracı (*neutron-l3-agent*)

source: L=1024, N=160 bits
tr_tr: L=1024, N=160 bit

source: MAC Policy
tr_tr: MAC İlkesi

source: Management
tr_tr: Yönetim

source: Mandatory Access Control
tr_tr: Zorunlu Erişim Kontrolü

source: Mapping
tr_tr: Eşleştirme

source: Message Digest
tr_tr: İleti Özeti

source: Messaging server
id: Server Messaging
tr_tr: Mesajlaşma sunucusu

source: Multi-host DHCP-agent
tr_tr: Çoklu sunuculu DHCP aracı

source: Networking resource policy engine
id: Mesin kebijakan sumber daya jaringan
tr_tr: Ağ kaynak ilkesi motoru

source: Never eXecute (NX)
tr_tr: Asla Çalıştırma (NX)

source: No share servers mode
tr_tr: paylaşım sunucusu yok kipi

source: Object Reuse
tr_tr: Nesne Yeniden Kullanımı

source: OpenStack Identity: Management
tr_tr: OpenStack Kimlik: Yönetim

source: OpenStack vulnerability management team
id: Tim manajemen kerentanan OpenStack
tr_tr: OpenStack zafiyet yönetim takımı

source: OpenStack.org, ReleaseNotes/Liberty. 2015. `OpenStack Liberty Release Notes <https://wiki.openstack.org/wiki/ReleaseNotes/Liberty>`__
tr_tr: OpenStack.org, ReleaseNotes/Liberty. 2015. `OpenStack Liberty Sürüm Notları <https://wiki.openstack.org/wiki/ReleaseNotes/Liberty>`__

source: Option ROM code
id: Opsi kode ROM
tr_tr: Seçenek ROM kodu

source: Perfect forward secrecy
id: Kerahasiaan maju yang sempurna
tr_tr: Mükemmel ileri gizliliği

source: Ports
tr_tr: Portlar

source: Position Independent Executable (PIE)
tr_tr: Konum Bağımsız Çalıştırılabilir (PIE)

source: Private cloud
id: Awan pribadi
tr_tr: Özel bulut

source: Public
id: Publik
tr_tr: Ortak

source: Public cloud
id: Awan publik
tr_tr: Kamu bulutu

source: Quality of Service (QoS)
tr_tr: Hizmet Kalitesi (QoS)

source: RELocation Read-Only (RELRO)
tr_tr: Salt-Okunur yer değiştirme (RELRO)

source: Role-Based Access Control
tr_tr: Rol-Tabanlı Erişim Kontrolü

source: SAML assertion
tr_tr: SAML iddiası

source: Scoped token
tr_tr: Kapsamlı belirteç

source: Secure Communication
tr_tr: Güvenli İletişim

source: Secure shell (SSH)
tr_tr: Güvenli kabuk (SSH)

source: Security Management
tr_tr: Güvenlik Yönetimi

source: Service Provider (SP)
tr_tr: Servis Sağlayıcı (SP)

source: Session back end
id: Sesi back end
tr_tr: Oturum arka ucu

source: Share servers mode
tr_tr: Paylaşım sunucusu kipi

source: Software
tr_tr: Yazılım

source: Software inventory
id: Inventarisasi perangkat lunak
tr_tr: Yazılım envanteri

source: Stack canaries
tr_tr: Yığın kanaryaları

source: Storage Encryption
tr_tr: Depolama Şifreleme

source: System inventory
id: Inventarisasi sistem
tr_tr: Sistem envanteri

source: TSF Protection
tr_tr: TSF Koruma

source: Tenants
tr_tr: Kiracılar

source: Triage
tr_tr: Aciliyetine göre sıralama

source: Unscoped token
tr_tr: Kapsam dışı belirteç

source: VLANs
id: VLAN
tr_tr: VLAN'lar

source: Virtual Network Computer (VNC)
tr_tr: Sanal Ağ Bilgisayarı (VNC)

source: Volume Wiping
tr_tr: Hacim Silme

source: XEN transparent page sharing
tr_tr: XEN şeffaf sayfa paylaşımı

source: `Center for Internet Security (CIS) Benchmarks <https://www.cisecurity.org/cis-benchmarks/>`_
tr_tr: `İnternet Güvenliği Merkezi (CIS) Testleri <https://www.cisecurity.org/cis-benchmarks/>`_

source: `Cloud Security Alliance (CSA) Common Control Matrix (CCM) <https://cloudsecurityalliance.org/media/news/csa-releases-new-ccm-caiq-v3-0-1/>`_
tr_tr: `Bulut Güvenlik Birliği (CSA) Yaygın Kontrol Matrisi (CCM) <https://cloudsecurityalliance.org/media/news/csa-releases-new-ccm-caiq-v3-0-1/>`_

source: `Hadoop secure mode docs <https://hadoop.apache.org/docs/current/hadoop-project-dist/hadoop-common/SecureMode.html>`_
tr_tr: `Hadoop güvenli kip belgelendirmesi <https://hadoop.apache.org/docs/current/hadoop-project-dist/hadoop-common/SecureMode.html>`_

source: `Hardening Walkthrough <https://wiki.debian.org/HardeningWalkthrough>`_
tr_tr: `Sıkılaştırma Yolu <https://wiki.debian.org/HardeningWalkthrough>`_

source: `MySQL Pluggable Authentication <http://dev.mysql.com/doc/refman/5.5/en/pluggable-authentication.html>`__
tr_tr: `MySQL Takılabilir Kimlik Doğrulama <http://dev.mysql.com/doc/refman/5.5/en/pluggable-authentication.html>`__

source: `Spark Security <https://spark.apache.org/docs/latest/security.html>`_
tr_tr: `Spark Güvenliği <https://spark.apache.org/docs/latest/security.html>`_

source: `Trusted Security Principles <http://www.aicpa.org/interestareas/informationtechnology/resources/soc/trustservices/pages/trust%20services%20principles—an%20overview.aspx>`_
tr_tr: `Güvenilen Güvenlik Prensipleri <http://www.aicpa.org/interestareas/informationtechnology/resources/soc/trustservices/pages/trust%20services%20principles—an%20overview.aspx>`_

source: `Xen VTd Howto <http://wiki.xen.org/wiki/VTd_HowTo>`_
tr_tr: `Xen VTd Nasıl <http://wiki.xen.org/wiki/VTd_HowTo>`_

source: n/a
tr_tr: yok

source: no share servers
tr_tr: paylaşım sunucusu yok

source: plugin agent (*neutron-\*-agent*)
tr_tr: eklenti aracı (*neutron-\*-agent*)

source: share servers
tr_tr: paylaşım sunucusu

source: **Fail:** If ``admin_token`` under ``[DEFAULT]`` section is set and ``AdminTokenAuthMiddleware`` exists in ``keystone-paste.ini``.
id: **Fail:** Jika ``admin_token`` di bawah bagian ``[DEFAULT] `` disetel dan ``AdminTokenAuthMiddleware`` ada di ``keystone-paste.ini``.

source: **Fail:** If permissions are not set to at least 640/750.
id: **Fail:** Jika izin tidak disetel ke setidaknya 640/750.

source: **Fail:** If value of parameter ``auth_strategy`` under ``[api]`` or ``[DEFAULT]`` section is set to ``noauth`` or ``noauth2``.
id: **Fail:** Jika nilai parameter ``auth_strategy`` di bawah `` [api] `` atau bagian `` [DEFAULT] `` diatur ke `` noauth`` atau `` noauth2``.

source: **Fail:** If value of parameter ``backend`` under ``[key_manager]`` section in ``/etc/cinder/cinder.conf`` is not set, or if the value of parameter ``backend`` under ``[key_manager]`` section in ``/etc/nova/nova.conf`` is not set, or if the instructions in the documentation referenced above are not properly followed.
id: **Fail:** Jika nilai parameter ``backend`` di bawah bagian ``[key_manager]`` di ``/etc/cinder/cinder.conf`` tidak diatur, atau jika nilai parameter ``backend`` di bawah bagian ``[key_manager]`` di ``/etc/nova/nova.conf`` tidak diatur, atau jika petunjuk dalam dokumentasi yang disebutkan di atas tidak diikuti dengan benar.

source: **Fail:** If value of parameter ``copy_from`` in ``/etc/glance/policy.json`` is not set.
id: **Fail:** Jika nilai parameter ``copy_from`` di ``/etc/glance/policy.json``` tidak diatur.

source: **Fail:** If value of parameter ``www_authenticate_uri`` under ``[keystone_authtoken]`` section in ``/etc/cinder/cinder.conf`` is not set to Identity API endpoint starting with ``https://`` or value of parameter ``insecure`` under the same ``[keystone_authtoken]`` section in the same ``/etc/cinder/cinder.conf`` is set to ``True``.
id: **Fail:** Jika nilai parameter `` www_authenticate_uri`` di bawah `` [keystone_authtoken] `` bagian di ``/etc/cinder/cinder.conf`` tidak disetel ke Identity API endpoint yang dimulai dengan `` https: // `` atau nilai parameter ``insecure`` di bawah bagian `` [keystone_authtoken] `` yang sama `` di ``/etc/cinder/cinder.conf`` yang sama diatur ke ``True``.

source: **Fail:** If value of parameter ``www_authenticate_uri`` under ``[keystone_authtoken]`` section in ``/etc/glance/glance-api.conf`` is not set to Identity API endpoint starting with ``https://``, or value of parameter ``insecure`` under the same ``[keystone_authtoken]`` section in the same ``/etc/glance/glance-api.conf`` is set to ``True``.
id: **Fail:** Jika nilai parameter `` www_authenticate_uri`` di bawah bagian ``[keystone_authtoken]`` dalam ``/etc/glance/glance-api.conf`` tidak disetel ke titik akhir API Identitas yang dimulai dengan `` https: // `` , atau nilai parameter ``insecure`` di bawah bagian ``[keystone_authtoken]`` yang sama di ``/etc/glance/glance-api.conf`` yang sama disetel ke``True``.

source: **Fail:** If value of parameter ``www_authenticate_uri`` under ``[keystone_authtoken]`` section in ``/etc/neutron/neutron.conf`` is not set to Identity API endpoint starting with ``https://`` or value of parameter ``insecure`` under the same ``[keystone_authtoken]`` section in the same ``/etc/neutron/neutron.conf`` is set to ``True``.
id: **Fail:** Jika nilai parameter `` www_authenticate_uri`` di bawah bagian ``[keystone_authtoken]`` di ``/etc/neutron/neutron.conf`` tidak disetel ke titik akhir API Identitas yang dimulai dengan ``https: // `` atau nilai dari parameter `` insecure`` di bawah bagian ``[keystone_authtoken] `` yang sama di ``/etc/neutron/neutron.conf`` yang sama diatur ke ``True``.

source: **Fail:** If value of parameter ``www_authenticate_uri`` under ``[keystone_authtoken]`` section in ``/etc/nova/nova.conf`` is not set to Identity API endpoint starting with ``https://`` or value of parameter ``insecure`` under the same ``[keystone_authtoken]`` section in the same ``/etc/nova/nova.conf`` is set to ``True``.
id: **Fail:** Jika nilai parameter `` www_authenticate_uri`` di bawah bagian `` [keystone_authtoken]`` di ``/etc/nova/nova.conf`` tidak disetel ke Identity API endpoint yang dimulai dengan `` https: // `` atau nilai dari parameter `` insecure`` di bawah bagian ``[keystone_authtoken] `` yang sama di ``/etc/nova/nova.conf`` yang sama diatur ke ``True``.

source: **Pass:** If 1) the value of parameter ``backend`` under the ``[key_manager]`` section in ``/etc/cinder/cinder.conf`` is set, 2) the value of parameter ``backend`` under ``[key_manager]`` in ``/etc/nova/nova.conf`` is set, and 3) if the instructions in the documentation referenced above are properly followed.
id: ** Pass:** Jika 1) nilai parameter ``backend`` di bawah bagian ``[key_manager]`` di ``/etc/cinder/cinder.conf`` disetel, 2) nilai parameter ``backend`` di bawah ``[key_manager] `` di ``/etc/nova/nova.conf`` disetel, dan 3) jika petunjuk dalam dokumentasi yang disebutkan di atas diikuti dengan benar.

source: **Pass:** If ``admin_token`` under ``[DEFAULT]`` section in ``/etc/keystone/keystone.conf`` is disabled. And, ``AdminTokenAuthMiddleware`` under ``[filter:admin_token_auth]`` is deleted from ``/etc/keystone/keystone-paste.ini``
id: **Pass:** Jika ``admin_token`` di bawah bagian ``[DEFAULT]`` di ``/etc/keystone/keystone.conf`` dinonaktifkan. Dan, ``AdminTokenAuthMiddleware`` di bawah ``[filter:admin_token_auth]`` dihapus dari ``/etc/keystone/keystone-paste.ini``

source: **Pass:** If permissions are set to 640 or stricter, or the containing directory is set to 750.
id: **Pass:** Jika izin diatur ke 640 atau lebih ketat, atau direktori yang mengandung diatur ke 750.

source: **Pass:** If permissions are set to 640 or stricter, or the containing directory is set to 750. The permissions of 640 translates into owner r/w, group r, and no rights to others i.e. "u=rw,g=r,o=".
id: **Pass:**Jika izin diatur ke 640 atau lebih ketat, atau direktori yang berisi diatur ke 750. Izin 640 diterjemahkan ke dalam pemilik r / w, grup r, dan tidak ada hak untuk orang lain i.e. "u=rw,g=r,o=".

source: **Pass:** If permissions are set to 640 or stricter, or the containing directory is set to 750. The permissions of 640 translates into owner r/w, group r, and no rights to others i.e. "u=rw,g=r,o=". Note that with :ref:`check_shared_fs_01` and permissions set to 640, root has read/write access and manila has read access to these configuration files. The access rights can also be validated using the following command. This command will only be available on your system if it supports ACLs.
id: **Pass:** Jika izin ditetapkan ke 640 atau lebih ketat, atau direktori yang berisi diatur ke 750. Izin 640 diterjemahkan ke dalam pemilik r / w, grup r, dan tidak ada hak kepada orang lain yaitu "u = rw, g = r, o =" . Perhatikan bahwa dengan :ref: `check_shared_fs_01` dan izin disetel ke 640, root memiliki akses read/write dan manila telah membaca akses ke file konfigurasi ini. Hak akses juga dapat divalidasi menggunakan perintah berikut. Perintah ini hanya akan tersedia di sistem Anda jika mendukung ACL.

source: **Pass:** If permissions are set to 640 or stricter, or the containing directory is set to 750. The permissions of 640 translates into owner r/w, group r, and no rights to others, for example "u=rw,g=r,o=".
id: **Pass:** Jika izin ditetapkan ke 640 atau lebih ketat, atau direktori yang berisi diatur ke 750. Izin 640 diterjemahkan ke dalam pemilik r / w, grup r, dan tidak ada hak kepada orang lain, misalnya "u=rw,g=r,o=".
