Repository: openstack/security-doc
Catalog: security-guide/source/locale/*/LC_MESSAGES/security-guide.po
Languages: de, id, tr_tr

source: Session cookies should be set to HTTPONLY:
de: Session-Cookies sollten auf HTTPONLY gesetzt sein:
id: Cookie sesi harus diatur ke HTTPONLY:
tr_tr: Oturum çerezleri HTTPONLY olmalıdır:

source: Setting Identity service as Identity Provider
de: Einstellung Identity Service als Identity Provider
tr_tr: Kimlik servisini kimlik sağlayıcısı olarak ayarlama

source: Setting ``ENFORCE_PASSWORD_CHECK`` to True will display an 'Admin Password' field on the Change Password form to verify that it is indeed the admin logged-in who wants to change the password.
de: Wenn Sie ``ENFORCE_PASSWORD_CHECK`` auf True setzen, wird ein Feld ' Admin-Passwort' im Formular 'Passwort ändern' angezeigt, um zu überprüfen, ob es sich um den angemeldeten Administrator handelt, der das Passwort ändern möchte.
id: Menetapkan ``ENFORCE_PASSWORD_CHECK`` ke True akan menampilkan field 'Admin Password' pada form Change Password untuk memverifikasi bahwa memang admin logged-in yang ingin mengganti kata sandinya.
tr_tr: ``ENFORCE_PASSWORD_CHECK`` parametresini True olarak ayarlamak, 'Yönetici Parolası' alanını, Parola Değiştirme formunda, parolayı değiştirmek isteyenin yönetici olduğunu doğrulamak için gösterir.

source: Several cryptography algorithms are available within OpenStack for identification and authorization, data transfer and protection of data at rest. When selecting a hypervisor, we recommend the following algorithms and implementation standards:
de: Mehrere Kryptographiealgorithmen stehen in OpenStack zur Identifikation und Autorisierung, Datenübertragung und zum Schutz von Daten zur Verfügung. Bei der Auswahl eines Hypervisor empfehlen wir folgende Algorithmen und Implementierungsstandards:
id: Beberapa algoritma kriptografi tersedia di dalam OpenStack untuk identifikasi dan otorisasi, transfer data dan perlindungan data saat istirahat. Saat memilih hypervisor, kami menganjurkan algoritma dan standar implementasi berikut:
tr_tr: OpenStack içinde tanımlama ve yetkilendirme, veri aktarımı ve duran verilerinin korunması için birçok şifreleme algoritması bulunmaktadır. Bir hipervizör seçerken aşağıdaki algoritmaları ve uygulama standartlarını öneriyoruz:

source: Several features related to image signing are now available in OpenStack. As of the Mitaka release, the Image service can verify these signed images, and, to provide a full chain of trust, the Compute service has the option to perform image signature verification prior to image boot. Successful signature validation before image boot ensures the signed image hasn't changed. With this feature enabled, unauthorized modification of images (e.g., modifying the image to include malware or rootkits) can be detected.
de: Im OpenStack stehen nun mehrere Funktionen zur Abbildunterzeichnung zur Verfügung. Abgesehen von der Mitaka-Version kann der Image-Service diese signierten Abbilder verifizieren und, um eine vollständige Vertrauenskette zu liefern, hat der Compute-Dienst die Möglichkeit, die Abbildsignaturprüfung vor dem Abbild-Boot durchzuführen. Eine erfolgreiche Signaturvalidierung vor dem Abbildstart sorgt dafür, dass das signierte Abbild sich nicht geändert hat. Wenn diese Funktion aktiviert ist, kann eine nicht autorisierte Änderung von Abbildern (z. B. das Ändern des Abbildes auf Malware oder Rootkits) erkannt werden.
id: Beberapa fitur yang terkait dengan penandatanganan image sekarang tersedia di OpenStack. Pada rilis Mitaka, layanan Image dapat memverifikasi image yang ditandatangani ini, dan, untuk menyediakan rantai kepercayaan penuh, layanan Compute memiliki opsi untuk melakukan verifikasi tanda tangan image sebelum melakukan booting image. Validasi tanda tangan yang berhasil sebelum boot image memastikan image yang ditandatangani tidak berubah. Dengan fitur ini diaktifkan, modifikasi image yang tidak sah (mis., memodifikasi image untuk menyertakan perangkat lunak perusak atau rootkit) dapat terdeteksi.
tr_tr: İmaj imzalama ile ilgili birçok özellik artık OpenStack'da mevcuttur. Mitaka sürümünden itibaren İmaj servisi imzalanmış imajları doğrulayabilir ve tam bir güven zinciri sağlamak için Hesaplama servisi imaj önyüklemeden önce imza doğrulamasını gerçekleştirme seçeneğine sahiptir. İmaj önyüklemeden önce imzanın geçerliliği başarılı bir şekilde imzalanmış imajın değişmediğinden emin olabilirsiniz. Bu özellik etkinleştirildiğinde, imajların yetkisiz olarak değiştirilmesi (ör. Kötü amaçlı yazılım veya rootkit'leri içerecek şekilde görüntüyü değiştirme) tespit edilebilir.

source: Several of the components use databases though it is not explicitly called out. Securing database access is yet another security concern, and consequently discussed in more detail later in this guide.
de: Einige Komponenten verwenden Datenbanken, obwohl sie nicht explizit aufgerufen werden. Die Sicherung des Datenbankzugriffs ist ein weiteres Sicherheitsrisiko und wird daher später in diesem Handbuch ausführlicher erläutert.
id: Beberapa komponen menggunakan database meskipun tidak secara eksplisit dipanggil. Pengamanan akses database adalah masalah keamanan lainnya, dan akibatnya dibahas lebih rinci nanti dalam panduan ini.

source: Share access control
de: Freigabe Zugriffskontrolle
id: Share (membagi) kontrol akses
tr_tr: Paylaşım erişim kontrolü

source: Share back ends modes
de: Share Back-End-Modi
tr_tr: Arka uç kiplerini paylaşmak

source: Share drivers use data in the security service to configure newly created share servers.
de: Freigabe-Treiber verwenden Daten im Sicherheitsdienst, um neu erstellte Freigabe-Server zu konfigurieren.
id: Share driver menggunakan data dalam layanan keamanan untuk mengkonfigurasi share server yang baru dibuat.
tr_tr: Paylaşım sürücüleri, yeni oluşturulan paylaşım sunucularını yapılandırmak için güvenlik servisindeki verileri kullanmaktadır.

source: Share type access control
de: Freigabetypen Zugriffskontrolle
id: Bagikan jenis kontrol akses
tr_tr: Paylaşım türü erişim kontrolü

source: Share types can be created as *public* and *private*. This is the level of visibility for the share type that defines whether other tenants can or cannot see it in a share types list and use it to create a new share.
de: Freigabetypen können als *public* und *private* erstellt werden. Dies ist die Sichtbarkeit für die Freigabeart, die festlegt, ob andere Tenant es in einer Freigabesatzliste sehen oder nicht sehen können und es verwenden, um eine neue Freigabe zu erstellen.
id: Jenis share dapat dibuat sebagai *public* dan *private*. Ini adalah tingkat visibilitas untuk tipe share yang menentukan apakah penyewa lain dapat atau tidak dapat melihatnya dalam daftar jenis share dan menggunakannya untuk membuat share baru.
tr_tr: Paylaşım türleri, *genel* ve *gizli* olarak oluşturulabilir. Bu, diğer kiracıların bir paylaşım türleri listesinde görebileceğini veya göremediğini tanımlayan paylaşım türü için görünürlük seviyesidir ve bunu yeni bir paylaşım oluşturmak için kullanır.

source: Shared File Systems
de: Gemeinsame Dateisysteme
id: Shared File Systems (sistem file bersama)
tr_tr: Paylaşımlı Dosya Sistemleri

source: Shared File Systems service has its own role-based access policies. They determine which user can access which objects in which way, and are defined in the service's ``policy.json`` file.
de: Shared File Systems Service hat seine eigenen rollenbasierten Zugriffsrichtlinien. Sie bestimmen, welcher Benutzer auf welche Objekte auf diese Weise zugreifen kann und in der ``policy.json``-Datei des Dienstes definiert ist.
id: Layanan Shared File Systems memiliki kebijakan akses berbasis perannya sendiri. Mereka menentukan pengguna mana yang dapat mengakses objek mana dengan cara mana, dan didefinisikan di file ``policy.json`` layanan.
tr_tr: Paylaşımlı Dosya Sistemleri servisinin kendi rol tabanlı erişim ilkeleri vardır. Hangi kullanıcının hangi nesneye hangi yoldan erişebileceğini ve servisin ``policy.json`` dosyasında tanımlandığını belirlerler.

source: Shawn Wells is the Director, Innovation Programs at Red Hat, focused on improving the process of adopting, contributing to, and managing open source technologies within the U.S. Government. Additionally, Shawn is an upstream maintainer of the SCAP Security Guide project which forms virtualization and operating system hardening policy with the U.S. Military, NSA, and DISA. Formerly aa NSA civilian, Shawn developed SIGINT collection systems utilizing large distributed computing infrastructures.
de: Shawn Wells ist der Direktor Innovationsprogramme bei Red Hat, konzentriert sich auf die Verbesserung der Prozess der Annahme, Beitrag zu und Verwaltung von Open-Source-Technologien in der US-Regierung. Darüber hinaus ist Shawn ein Upstream-Betreuer des SCAP Security Guide-Projekts, das die Virtualisierungs- und Betriebssystemhärtungspolitik mit dem US Military, NSA und DISA bildet. Früher als NSA Zivilangestellter, entwickelte Shawn großen verteilten Recheninfrastrukturen bei SIGINT.
id: Shawn Wells adalah Direktur, Innovation Programs di Red Hat, yang berfokus pada peningkatan proses adopsi, kontribusi, dan pengelolaan teknologi open source di dalam Pemerintah A.S. Selain itu, Shawn adalah pengelola hulu dari proyek SCAP Security Guide yang membentuk kebijakan pengerasan sistem virtualisasi dan operasi dengan AS, NSA, dan DISA. Dahulu aa NSA sipil, Shawn mengembangkan sistem pengumpulan SIGINT yang memanfaatkan infrastruktur komputasi terdistribusi besar.
tr_tr: Shawn Wells, ABD Hükümeti içerisindeki açık kaynak teknolojilerini benimsemek, katkıda bulunmak ve yönetme sürecini geliştirmek üzerine odaklanan Red Hat'taki Yenilik Programı Yöneticisi'dir. Buna ek olarak, Shawn, ABD Askeri, NSA ve DISA ile sanallaştırma ve işletim sistemi sertleştirme politikası oluşturan SCAP Güvenlik Kılavuzu projesinin bir üst düzey sürdürücüsüdür. Eskiden bir NSA sivili olan Shawn, büyük dağıtık bilgisayar altyapıları kullanan SIGINT toplama sistemlerini geliştirdi.

source: Signed public key certificates are data structures that have verifiable data of an entity, its public key along with some other attributes. These certificates are issued by a Certificate Authority (CA). As the certificates are signed by a CA that is trusted, once verified, the public key associated with the entity is guaranteed to be associated with the said entity. The most common standard used to define these certificates is the :term:`X.509` standard. The :term:`X.509` v3 which is the current standard is described in detail in `RFC5280 <http://tools.ietf.org/html/5280>`_. Certificates are issued by CAs as a mechanism to prove the identity of online entities. The CA digitally signs the certificate by creating a message digest from the certificate and encrypting the digest with its private key.
de: Signierte Public-Key-Zertifikate sind Datenstrukturen, die nachvollziehbare Daten einer Entität, ihren öffentlichen Schlüssel zusammen mit einigen anderen Attributen haben. Diese Zertifikate werden von einer Zertifizierungsstelle (CA) ausgestellt. Da die Zertifikate von einer Zertifizierungsstelle unterzeichnet werden, die vertrauenswürdig ist, wird ein einmal verifizierter öffentlicher Schlüssel, der mit dem Unternehmen verknüpft ist, mit der Entität verbunden. Der häufigste Standard für die Festlegung dieser Zertifikate ist der Begriff: `X.509` Standard. Der :term:`X.509` v3, der der aktuelle Standard ist, ist ausführlich in` RFC5280 beschrieben <http://tools.ietf.org/html/5280>`_. Zertifikate werden von CAs als Mechanismus ausgestellt, um die Identität von Online-Einheiten nachzuweisen. Die CA unterschreibt das Zertifikat digital, indem sie eine Nachricht aus dem Zertifikat erstellt und den Digest mit seinem privaten Schlüssel verschlüsselt.
id: Sertifikat kunci publik yang masuk adalah struktur data yang memiliki data yang dapat diverifikasi dari suatu entitas, kunci publiknya beserta beberapa atribut lainnya. Sertifikat ini dikeluarkan oleh Certificate Authority (CA). Karena sertifikat ditandatangani oleh CA yang dipercaya, setelah diverifikasi, kunci publik yang terkait dengan entitas dijamin terkait dengan entitas tersebut. Standar yang paling umum digunakan untuk mendefinisikan sertifikat ini adalah : erm: `X.509` standard. The :term: `X.509` v3 yang merupakan standar saat ini dijelaskan secara rinci di `RFC5280 <http://tools.ietf.org/html/5280> `_. Sertifikat dikeluarkan oleh CA sebagai mekanisme untuk membuktikan identitas entitas online. CA secara digital menandatangani sertifikat dengan membuat pesan yang dicerna dari sertifikat dan mengenkripsi mencerna dengan kunci privatnya.
tr_tr: İmzalı kamu anahtarı sertifikaları, bir varlığın doğrulanabilir verisine, diğer anahtara ve diğer bazı niteliklere sahip olan veri yapılarıdır. Bu sertifikalar bir Sertifika Otoritesi (CA) tarafından verilir. Sertifikalar, güvenilir olan bir CA tarafından imzalanmış olduğundan, doğrulandıktan sonra varlık ile ilişkili ortak anahtarın söz konusu varlıkla ilişkilendirilmesi garanti edilir. Bu sertifikaları tanımlamak için kullanılan en yaygın standart :term:`X.509` standardıdır. Şu andaki standart olan :term:`X.509` v3, `RFC5280 <http://tools.ietf.org/html/5280>`_ adresinde ayrıntılı olarak açıklanmıştır. Sertifikalar, çevrimiçi varlıklar kimliğini kanıtlamak için bir mekanizma olarak CA'lar tarafından verilir. CA, sertifikadan bir ileti özeti oluşturarak ve özetini kendi özel anahtarıyla şifreleyerek sertifikaya sayısal olarak imzalar.

source: Similar to host-based tools, the selection and configuration of a network-based intrusion detection tool is deployment specific. `Snort <https://www.snort.org/>`__ is the leading open source networking intrusion detection tool, and a good starting place to learn more.
de: Ähnlich wie bei Host-basierten Tools ist die Auswahl und Konfiguration eines netzwerkbasierten Intrusion Detection-Tools implementierungsspezifisch. `Snort <https://www.snort.org/>`__ ist das führende Open-Source-Netzwerk-Intrusion Detection Tool und ein guter Ausgangspunkt, um mehr zu lernen.
id: Serupa dengan alat berbasis host, pemilihan dan konfigurasi alat deteksi intrusi berbasis jaringan adalah pengerahan yang spesifik. `Snort <https://www.snort.org/>` __ adalah alat deteksi intrusi jaringan sumber terbuka terkemuka, dan tempat awal yang baik untuk belajar lebih banyak.
tr_tr: Sunucu tabanlı araçlara benzer şekilde, bir ağa dayalı hırsızsızlık algılama aracının seçimi ve yapılandırması dağıtıma özgüdür. `Snort <https://www.snort.org/>`__, lider açık kaynaklı ağ saldırı tespit aracıdır ve daha fazla bilgi edinmek için iyi bir başlangıç noktasıdır.

source: Similar to other OpenStack projects, the Shared File Systems service is registered with the Identity service, so you can find API endpoints of the share service v1 and v2 using **manila endpoints** command:
de: Ähnlich wie bei anderen OpenStack-Projekten ist der Shared File Systems Service mit dem Identity Service registriert, so dass Sie API Endpunkte des Share Service v1 und v2 mit **manila endpoints** Befehl finden können:
id: Serupa dengan proyek OpenStack lainnya, layanan Shared File Systems didaftarkan pada layanan Identity, sehingga Anda dapat menemukan API endpoint dari layanan share v1 dan v2 menggunakan perintah **manila endpoints **:
tr_tr: Diğer OpenStack projelerine benzer şekilde Paylaşımlı Dosya Sistemleri servisi Kimlik servisiyle kayıtlı olduğundan **manila endpoints ** komutunu kullanarak paylaşım servisi v1 ve v2'nin API bitiş noktalarını bulabilirsiniz:

source: Similar to previous check (:ref:`check_block_05`), we recommend that all components communicate with each other using a secured communication protocol.
de: Ähnlich wie bei der vorherigen Prüfung (:ref:`check_block_05`) empfehlen wir, dass alle Komponenten mit einem gesicherten Kommunikationsprotokoll miteinander kommunizieren.
id: Serupa dengan sebelumnya cek (:ref:`check_block_05`), kami merekomendasikan agar semua komponen berkomunikasi satu sama lain menggunakan protokol komunikasi aman.
tr_tr: Bir önceki kontrole benzer olarak (:ref`check_block_05`), tüm bileşenlerin birbiriyle güvenli bir haberleşme protokolüyle haberleşmesini öneriyoruz.

source: Similar to previous check (:ref:`check_shared_fs_05`), it is recommended all the components must communicate with each other using a secured communication protocol.
de: Ähnlich wie bei der vorherigen Prüfung (:ref:`check_shared_fs_05`) empfiehlt es sich, dass alle Komponenten über ein gesichertes Kommunikationsprotokoll miteinander kommunizieren müssen.
id: Serupa dengan cek sebelumnya (:ref:`check_shared_fs_05`), disarankan semua komponen harus berkomunikasi satu sama lain menggunakan protokol komunikasi aman.
tr_tr: Önceki kontrole benzer olarak (:ref:`check_shared_fs_05`), tüm bileşenlerin birbirleriyle güvenli bir iletişim protokolü kullanarak iletişim kurmaları önerilir.

source: Similar to the previous check, it is recommended not to reveal password fields.
de: Ähnlich wie bei der vorherigen Prüfung wird empfohlen, keine Passwortfelder zu veröffentlichen.
id: Serupa dengan cek sebelumnya, disarankan untuk tidak mengungkapkan field kata kunci.
tr_tr: Bir önceki kontrole benzer olarak, parola alanlarını ortaya çıkarmanız önerilmez.

source: Similar to the previous check, it is recommended to enable secure communication on API server.
de: Ähnlich wie bei der vorherigen Prüfung wird empfohlen, eine sichere Kommunikation auf dem API-Server zu ermöglichen.
id: Serupa dengan cek sebelumnya, disarankan untuk mengaktifkan komunikasi yang aman di server API.
tr_tr: Önceki denetime benzer şekilde, API sunucusunda güvenli iletişimi etkinleştirmeniz önerilir.

source: Similar to the previous check, it is recommended to set strict access permissions for such configuration files.
de: Ähnlich wie bei der vorherigen Prüfung empfiehlt es sich, strenge Zugriffsberechtigungen für solche Konfigurationsdateien festzulegen.
id: Serupa dengan cek sebelumnya, disarankan untuk menetapkan izin akses yang ketat untuk file konfigurasi tersebut.
tr_tr: Önceki denetimine benzer şekilde, bu yapılandırma dosyaları için sıkı erişim izinlerini ayarlamanız önerilir.

source: Similar to the previous check, we recommend setting strict access permissions for such configuration files.
de: Ähnlich wie bei der vorherigen Prüfung empfehlen wir die Einstellung von strengen Zugriffsberechtigungen für solche Konfigurationsdateien.
id: Serupa dengan cek sebelumnya, kami menyarankan untuk menetapkan izin akses yang ketat untuk file konfigurasi tersebut.
tr_tr: Önceki kontrole benzer olarak, bu tip yapılandırma dosyaları için de sıkı erişim yetkileri ayarlamanızı öneririz.

source: Similar to the previous check, we recommend to set strict access permissions for such configuration files.
de: Ähnlich wie bei der vorherigen Prüfung empfehlen wir, strenge Zugriffsberechtigungen für solche Konfigurationsdateien festzulegen.
id: Serupa dengan cek sebelumnya, kami menyarankan untuk menetapkan izin akses yang ketat untuk file konfigurasi tersebut.
tr_tr: Bir önceki kontrole benzer olarak, yapılandırma dosyalarının erişim izinlerini sıkı olarak ayarlanmasını öneriyoruz.

source: Similar to the previous check, we recommend you set strict access permissions for such configuration files.
de: Ähnlich wie bei der vorherigen Prüfung empfehlen wir Ihnen, strenge Zugriffsberechtigungen für solche Konfigurationsdateien festzulegen.
id: Serupa dengan cek sebelumnya, sebaiknya Anda menetapkan izin akses yang ketat untuk file konfigurasi tersebut.
tr_tr: Önceki kontrole benzer şekilde, bu yapılandırma dosyaları için sıkı erişim izinlerini ayarlamanızı öneririz.

source: Similar to the previous check, we recommended to set strict access permissions for such configuration files.
de: Ähnlich wie bei der vorherigen Prüfung wurde empfohlen, für solche Konfigurationsdateien strenge Zugriffsberechtigungen festzulegen.
id: Serupa dengan cek sebelumnya, kami merekomendasikan untuk menetapkan izin akses yang ketat untuk file konfigurasi tersebut.

source: Simple Authentication and Security Layer (SASL) is a framework for authentication and data security in Internet protocols. Both RabbitMQ and Qpid offer SASL and other pluggable authentication mechanisms beyond simple user names and passwords that allow for increased authentication security. While RabbitMQ supports SASL, support in OpenStack does not currently allow for requesting a specific SASL authentication mechanism. RabbitMQ support in OpenStack allows for either user name and password authentication over an unencrypted connection or user name and password in conjunction with X.509 client certificates to establish the secure TLS connection.
de: Einfache Authentifizierung und Sicherheit Layer (SASL) ist ein Framework für die Authentifizierung und Datensicherheit in Internet-Protokolle. Sowohl RabbitMQ als auch Qpid bieten SASL und andere steckbare Authentifizierungsmechanismen über einfache Benutzernamen und Passwörter hinaus, die eine erhöhte Authentifizierungssicherheit ermöglichen. Während RabbitMQ SASL unterstützt, unterstützt die Unterstützung in OpenStack derzeit nicht die Anforderung eines bestimmten SASL-Authentifizierungsmechanismus. Die RabbitMQ-Unterstützung in OpenStack ermöglicht entweder Benutzername und Passwort-Authentifizierung über eine unverschlüsselte Verbindung oder Benutzername und Passwort in Verbindung mit X.509-Client-Zertifikaten, um die sichere TLS-Verbindung herzustellen.
id: Simple Authentication and Security Layer (SASL) adalah kerangka kerja untuk otentikasi dan keamanan data dalam protokol Internet. Kedua RabbitMQ dan Qpid menawarkan SASL dan mekanisme otentikasi pluggable lainnya di luar nama pengguna dan password sederhana yang memungkinkan peningkatan keamanan otentikasi. Sementara RabbitMQ mendukung SASL, dukungan di OpenStack saat ini tidak mengizinkan mekanisme otentikasi SASL yang spesifik. Dukungan RabbitMQ di OpenStack memungkinkan otentikasi nama pengguna dan password melalui koneksi atau nama pengguna dan password yang tidak dienkripsi bersamaan dengan sertifikat klien X.509 untuk menetapkan koneksi TLS yang aman.
tr_tr: Basit Kimlik Doğrulama ve Güvenlik Katmanı (SASL), Internet protokollerinde kimlik doğrulama ve veri güvenliği için bir çatıdır. Hem RabbitMQ hem de Qpid, basit kullanıcı adlarının ve parolalarının ötesinde, artan kimlik doğrulama güvenliğine izin veren SASL ve diğer takılabilir kimlik doğrulama mekanizmalarını sunar. RabbitMQ, SASL'yi desteklerken, OpenStack'deki destek şu anda belirli bir SASL kimlik doğrulama mekanizması talep etmeye izin vermiyor. OpenStack'deki RabbitMQ desteği, şifrelenmemiş bir bağlantı üzerinden kullanıcı adı ve parola kimlik doğrulamasına veya güvenli TLS bağlantısını oluşturmak için X.509 istemci sertifikalarıyla birlikte kullanıcı adı ve parolasına izin verir.

source: Simple Protocol for Independent Computing Environments (SPICE)
de: Einfaches Protokoll für unabhängige Rechenumgebungen (SPICE)
tr_tr: Bağımsız Hesaplama Ortamları için Basit Protokol (SPICE)
