Repository: openstack/security-doc
Catalog: security-guide/source/locale/*/LC_MESSAGES/security-guide.po
Languages: de, id, tr_tr

source: If the option of using Apache is not feasible, or for performance you wish to offload your TLS work, you may employ a dedicated network device load balancer. This is a common way to provide redundancy and load balancing when using multiple proxy nodes.
de: Wenn die Möglichkeit der Verwendung von Apache nicht möglich ist oder für die Leistung, die Sie Ihre TLS-Arbeit auslösen möchten, können Sie einen dedizierten Netzwerkgerät Load Balancer verwenden. Dies ist ein häufiger Weg, um Redundanz und Lastverteilung bei der Verwendung mehrerer Proxy-Knoten zur Verfügung zu stellen.
id: Jika pilihan untuk menggunakan Apache tidak layak, atau untuk kinerja yang Anda inginkan untuk melepaskan pekerjaan TLS Anda, Anda dapat menggunakan perangkat penyeimbang beban jaringan khusus. Ini adalah cara yang umum untuk memberikan redundansi dan load balancing saat menggunakan beberapa node proxy.
tr_tr: Apache'yi kullanma seçeneği uygun değilse veya TLS çalışmalarınızı boşaltmak istediğiniz performans için özel bir ağ aygıtı yük dengeleyici kullanabilirsiniz. Bu, çoklu vekil düğümleri kullanıldığında yedeklilik sağlamak ve yük dengelemek için yaygın bir yöntemdir.

source: If there is a sufficient business case for keeping live migration enabled, then libvirtd can provide encrypted tunnels for the live migrations. However, this feature is not currently exposed in either the OpenStack Dashboard or nova-client commands, and can only be accessed through manual configuration of libvirtd. The live migration process then changes to the following high-level steps:
de: Wenn es einen ausreichenden Business-Fall für die Live-Migration ermöglicht, dann kann libvirtd verschlüsselte Tunnel für die Live-Migrationen anbieten. Diese Funktion wird jedoch derzeit weder im OpenStack Dashboard noch in den nova-client-Befehlen angeboten und kann nur über die manuelle Konfiguration von libvirtd abgerufen werden. Der Live-Migrationsprozess wechselt dann zu den folgenden High-Level-Schritten:
id: Jika ada kasus bisnis yang memadai untuk mengaktifkan migrasi aktif, libvirtd dapat menyediakan terowongan (tunnel) terenkripsi untuk migrasi langsung. Namun, fitur ini saat ini tidak terbuka di OpenStack Dashboard atau perintah nova-client, dan hanya dapat diakses melalui konfigurasi manual libvirtd. Proses migrasi langsung kemudian berubah ke langkah tingkat tinggi berikut:
tr_tr: Canlı geçiş'i etkinleştirmek için yeterli bir iş durumu olursa, libvirtd canlı geçişler için şifrelenmiş tüneller sağlayabilir. Bununla birlikte, bu özellik şu anda hem OpenStack Panel'de hem de nova-client komutlarında bulunmamaktadır ve yalnızca libvirtd'in manuel yapılandırması aracılığıyla erişilebilir. Daha sonra canlı geçiş işlemi aşağıdaki üst düzey adımlara geçer:

source: If using a version of Open vSwitch that supports ARP field matching, you can help mitigate this risk by enabling the ``prevent_arp_spoofing`` option for the Open vSwitch agent. This option prevents instances from performing spoof attacks; it does not protect them from spoof attacks. Note that this setting is expected to be removed in Ocata, with the behavior becoming permanently active.
de: Wenn Sie eine Version von Open vSwitch verwenden, die ARP-Feld-Matching unterstützt, können Sie dieses Risiko reduzieren, indem Sie die `` prevent_arp_spoofing``Option für den Open vSwitch Agent aktivieren. Diese Option verhindert, dass Instanzen Spoof-Angriffe ausführen können. es schützt sie nicht vor Spoofangriffen. Beachten Sie, dass diese Einstellung in Ocata entfernt werden soll, wobei das Verhalten dauerhaft aktiv wird.
id: Jika menggunakan versi Open vSwitch yang mendukung pencocokan ARP field, Anda dapat membantu mengurangi risiko ini dengan mengaktifkan opsi ``prevention_arp_spoofing`` untuk agen Open vSwitch. Pilihan ini mencegah terjadinya serangan spoof; itu tidak melindungi mereka dari serangan spoof. Perhatikan bahwa pengaturan ini diharapkan dapat dihapus di Ocata, dengan perilaku menjadi aktif secara permanen.
tr_tr: Open vSwitch'in ARP alan eşlemesini destekleyen bir sürümünü kullanıyorsanız, Open vSwitch aracı için ``prevent_arp_spoofing`` seçeneğini etkinleştirerek bu riski azaltabilirsiniz. Bu seçenek, örneklerin spoof saldırıları gerçekleştirmesini önler; onları parodi saldırılarından korumaz. Ocata'da bu ayarın kalıcı olarak aktif hale gelmesiyle birlikte kaldırılması bekleniyor.

source: If you are running with SELinux enabled ensure that the file has the appropriate SELinux context to access the linked file. For example, if you have the file in ``/var/www/cgi-bin`` location, you can do this by running:
de: Wenn Sie SELinux aktiviert haben, stellen Sie sicher, dass die Datei über den entsprechenden SELinux-Kontext verfügt, um auf die verknüpfte Datei zuzugreifen. Zum Beispiel, wenn Sie die Datei in ``/var/www/cgi-bin`` haben, können Sie dies tun, indem Sie:
tr_tr: SELinux ile çalıştırıyorsanız, dosyanın bağlantılı dosyaya erişmek için uygun SELinux bağlamına sahip olduğundan emin olun. Örneğin, dosyayı ``/var/www/cgi-bin`` konumundaysa, bunu aşağıdakileri yaparak yapabilirsiniz:

source: If you are using an HTTPS proxy in front of your web server, rather than using an HTTP server with HTTPS functionality, modify the ``SECURE_PROXY_SSL_HEADER`` variable. Refer to the `Django documentation <https://docs.djangoproject.com/>`_ for information about modifying the ``SECURE_PROXY_SSL_HEADER`` variable.
de: Wenn Sie einen HTTPS-Proxy vor Ihrem Webserver verwenden, anstatt einen HTTP-Server mit HTTPS-Funktionalität zu verwenden, ändern Sie die Variable ``SECURE_PROXY_SSL_HEADER``. Beziehen Sie sich auf die `Django Dokumentation <https://docs.djangoproject.com/>`_ für Informationen über die Änderung der ``SECURE_PROXY_SSL_HEADER``Variable.
id: Jika Anda menggunakan proxy HTTPS di depan server web Anda, daripada menggunakan server HTTP dengan fungsionalitas HTTPS, ubah variabel ``SECURE_PROXY_SSL_HEADER``. Lihat `Django documentation <https://docs.djangoproject.com/> `_ untuk informasi tentang memodifikasi variabel ``SECURE_PROXY_SSL_HEADER``.
tr_tr: HTTPS işlevselliğine sahip bir HTTP sunucusu kullanmak yerine, web sunucunuzun önünde bir HTTPS vekil kullanıyorsanız, ``SECURE_PROXY_SSL_HEADER`` değişkenini değiştirin. ``SECURE_PROXY_SSL_HEADER`` değişkenini değiştirmeyle ilgili bilgi için `Django belgeleri <https://docs.djangoproject.com/>` ne bakın.

source: If you choose to offload your TLS, ensure that the network link between the load balancer and your proxy nodes are on a private (V)LAN segment such that other nodes on the network (possibly compromised) cannot wiretap (sniff) the unencrypted traffic. If such a breach were to occur, the attacker could gain access to end-point client or cloud administrator credentials and access the cloud data.
de: Wenn Sie sich dafür entscheiden, Ihre TLS zu entlasten, stellen Sie sicher, dass sich die Netzwerkverbindung zwischen dem Load Balancer und Ihren Proxy-Knoten auf einem privaten (V) LAN-Segment befindet, so dass andere Knoten im Netzwerk (möglicherweise kompromittiert) den unverschlüsselten Verkehr nicht verteilen können. Wenn ein solcher Bruch auftreten würde, könnte der Angreifer Zugang zu Endpunkt-Client- oder Cloud-Administrator-Anmeldeinformationen erhalten und auf die Cloud-Daten zugreifen.
id: Jika Anda memilih untuk melepaskan TLS Anda, pastikan bahwa hubungan jaringan antara penyeimbang beban dan nodus proxy Anda berada pada segmen private (V)LAN sehingga node lain di jaringan (kemungkinan dikompromikan) tidak dapat menyadap (mengendus) lalu lintas yang tidak dienkripsi. Jika pelanggaran semacam itu terjadi, penyerang bisa mendapatkan akses ke kredensial klien endpoint atau kredensial administrator awan dan mengakses data awan.
tr_tr: TLS'inizi boşaltmayı seçerseniz, yük dengeleyici ve vekil düğümleriniz arasındaki ağ bağlantısının özel (V)LAN segmentinde olduğundan emin olun; böylece ağdaki diğer düğümler (muhtemelen tehlikeye düşen) şifrelenmemiş trafiği dinleyemezler (sniff). Böyle bir ihlal ortaya çıkarsa, saldırgan uç nokta istemcisine veya bulut yöneticisi kimlik bilgilerine erişebilir ve bulut verisine erişebilir.

source: If you do not follow this recommendation regarding second-level domains, avoid a cookie-backed session store and employ HTTP Strict Transport Security (HSTS). When deployed on a subdomain, the dashboard's security is equivalent to the least secure application deployed on the same second-level domain.
de: Wenn Sie diese Empfehlung nicht auf Domains der zweiten Ebene befolgen, vermeiden Sie einen Cookie-unterstützten Session Store und verwenden HTTP Strict Transport Security (HSTS). Bei der Bereitstellung auf einer Subdomain entspricht die Sicherheit des Dashboards der am wenigsten sicheren Anwendung, die auf derselben Domäne der zweiten Ebene bereitgestellt wird.
id: Jika Anda tidak mengikuti saran ini mengenai domain tingkat kedua, hindaricookie-backed session dan gunakan HTTP Strict Transport Security (HSTS). Saat ditempatkan di subdomain, keamanan dasbor setara dengan aplikasi yang paling tidak aman yang diterapkan pada domain tingkat kedua yang sama.
tr_tr: İkinci düzey alanlarla ilgili bu öneriyi takip etmiyorsanız, çerez destekli bir oturum deposundan kaçının ve HTTP Sıkı Taşıma Güvenliği (HSTS) kullanın. Bir alt alana dağıtıldığında, gösterge tablosunun güvenliği, aynı ikinci düzey alana yerleştirilen en az güvenli uygulama ile eşdeğerdir.

source: If you have a firewall in place, configure it to allow TLS traffic. For example:
de: Wenn Sie eine Firewall vorhanden haben, konfigurieren Sie sie, um TLS-Verkehr zuzulassen. Beispielsweise:
tr_tr: Bir güvenlik duvarınız varsa, TLS trafiğine izin verecek şekilde yapılandırın. Örneğin:

source: If you intend for your network to support more than 4094 tenants VLAN is probably not the correct option for you as multiple 'hacks' are required to extend the VLAN tags to more than 4094 tenants.
de: Wenn Sie beabsichtigen, dass Ihr Netzwerk mehr als 4094 Tenant unterstützt, ist VLAN wahrscheinlich nicht die richtige Option für Sie, da mehrere 'Hacks' erforderlich sind, um die VLAN-Tags auf mehr als 4094 Tenant zu erweitern.
id: Jika Anda ingin jaringan Anda mendukung lebih dari 4094 penyewa VLAN mungkin bukan pilihan yang tepat untuk Anda karena beberapa 'hacks' diperlukan untuk memperpanjang tag VLAN ke lebih dari 4094 penyewa.
tr_tr: Şebekenizin 4094'den fazla kiracıyı desteklemeyi düşünüyorsanız, VLAN etiketleri 4094'ten fazla kiracıya genişletmek için birden fazla 'hile' gerektiği için VLAN muhtemelen sizin için doğru seçenek değildir.

source: If you use a web interface to interact with the :term:`BMC <BMC (Baseboard Management Controller)>`/IPMI, always use the TLS interface, such as HTTPS or port 443. This TLS interface should **NOT** use self-signed certificates, as is often default, but should have trusted certificates using the correctly defined fully qualified domain names (FQDNs).
de: Wenn Sie ein Web-Interface verwenden, um mit dem :term:`BMC zu interagieren <BMC (Baseboard Management Controller)>`/ IPMI, verwenden Sie immer die TLS-Schnittstelle wie HTTPS oder Port 443. Diese TLS-Schnittstelle sollte **NICHT** selbst signierte Zertifikate verwenden, wie es oft Standard ist, aber sollten vertrauenswürdige Zertifikate mit den korrekt definierten vollständig qualifizierten Domainnamen haben (FQDNs).
id: Jika Anda menggunakan antarmuka web untuk berinteraksi dengan :term:`BMC <BMC (Baseboard Management Controller)>`/IPMI, selalu gunakan antarmuka TLS, seperti HTTPS atau port 443. Antarmuka TLS ini seharusnya **NOT** menggunakan sertifikat yang ditandatangani sendiri, seperti yang sering default, namun harus memiliki sertifikat terpercaya dengan menggunakan nama domain yang memenuhi syarat dengan benar (FQDNs).
tr_tr: :term:`BMC <BMC (Taban Kartı Yönetim Denetleyicisi)>` / IPMI ile etkileşim kurmak için bir web arabirimi kullanıyorsanız: , her zaman HTTPS veya port 443 gibi TLS arabirimini kullanın. Bu TLS arabirimi kendiliğinden imzalanmış sertifikalar ile **kullanmayın **, varsayılan olarak gelir, ancak doğru tanımlanmış tam nitelikli alan adlarını (FQDN'ler) kullanarak güvenilir sertifikalara sahip olmalıdır.

source: If you use the HTTP/WSGI server for Identity, you should enable TLS on the HTTP/WSGI server.
de: Wenn Sie den HTTP/WSGI-Server für Identity verwenden, sollten Sie TLS auf dem HTTP/WSGI-Server aktivieren.
id: Jika Anda menggunakan server HTTP/WSGI I untuk Identity, Anda harus mengaktifkan TLS di server HTTP/WSGI.
tr_tr: Kimlik için HTTP/WSGI sunucusunu kullanırsanız, HTTP/WSGI sunucusunda TLS'yi etkinleştirmelisiniz.

source: If your architecture allows for shared storage and and if you have configured your cache correctly, we recommend setting your ``SESSION_ENGINE`` to ``django.contrib.sessions.backends.cache`` and using it as cache-based session backend with memcached as the cache. Memcached is an efficient in-memory key-value store for chunks of data that can be used in a high availability and distributed environment and is easy to configure. However, you need to ensure that there is no data leakage. Memcached makes use of spare RAM to store frequently accessed data blocks, acting like memory cache for repeatedly accessed information. Since memcached utilizes local memory, there is no overhead of database and file system usage leading to direct access of data from RAM rather than from disk.
de: Wenn Ihre Architektur eine gemeinsame Speicherung ermöglicht und wenn Sie Ihren Cache korrekt konfiguriert haben, empfehlen wir Ihnen, Ihre `` SESSION_ENGINE``auf ``django.contrib.sessions.backends.cache``zu setzen und es als Cache-basiertes Session-Backend memcached als Cache zu verwenden. Memcached ist ein effizienter In-Memory-Key-Value-Store für Datenblöcke, die in einer hochverfügbaren und verteilten Umgebung eingesetzt werden können und einfach zu konfigurieren ist. Allerdings müssen Sie sicherstellen, dass es keine Datenleckage gibt. Memcached nutzt den Spare- RAM, um häufig zugegriffene Datenblöcke zu speichern, die wie Speicher-Cache für wiederholt zugegriffene Informationen wirken. Da memcached den lokalen Speicher nutzt, gibt es keinen Overhead der Datenbank- und Dateisystemverwendung, was zu einem direkten Zugriff von Daten aus dem RAM und nicht von der Festplatte führt.
id: Jika arsitektur Anda mengizinkan penyimpanan bersama dan dan jika Anda telah mengonfigurasi cache dengan benar, sebaiknya setel ``SESSION_ENGINE` ke ``django.contrib.sessions.backends.cache`` dan gunakan sebagai backend sesi berbasis cache dengan Memcached sebagai cache. Memcached adalah penyimpanan key-value dalam memori yang efisien untuk potongan data yang dapat digunakan dalam ketersediaan tinggi dan lingkungan terdistribusi dan mudah dikonfigurasi. Namun, Anda perlu memastikan bahwa tidak ada kebocoran data. Memcached menggunakan RAM cadangan untuk menyimpan blok data yang sering diakses, berfungsi seperti cache memori untuk informasi yang diakses berulang kali. Karena memcached memanfaatkan memori lokal, tidak ada overhead penggunaan sistem database dan file yang menyebabkan akses data langsung dari RAM dan bukan dari disk.
tr_tr: Mimariniz paylaşılan depolama alanına izin veriyorsa ve önbelleğinizi doğru bir şekilde yapılandırdıysanız, ``SESSION_ENGINE`` öğesini ``django.contrib.sessions.backends.cache`` olarak ayarlamanızı ve önbellek tabanlı oturum arka planı olarak kullanmanızı öneririz. Önbellek olarak memcached. Memcached, yüksek erişilebilirlik ve dağıtık ortamlarda kullanılabilen ve yapılandırılması kolay veri yığınları için etkin bir bellek içi anahtar/değer depolamasıdır. Bununla birlikte, veri sızıntısı olmadığından emin olmanız gerekir. Memcached sık erişilen veri bloklarını depolamak için boştaki RAM'i kullanır, tekrar tekrar erişilen bilgiler için bellek önbellek gibi davranıyor. Memcached, yerel belleği kullandığından, veri tabanından ve disk sisteminden RAM'den doğrudan erişime neden olan dosya sistemi kullanımı yükü yoktur.

source: If your database server is configured for TLS transport, you will need to specify the certificate authority information for use with the initial connection string in the SQLAlchemy query.
de: Wenn Ihr Datenbankserver für den TLS-Transport konfiguriert ist, müssen Sie die Zertifikatsautoritätsinformationen für die Verwendung mit der anfänglichen Verbindungszeichenfolge in der SQLAlchemy-Abfrage angeben.
id: Jika server database Anda dikonfigurasi untuk transport TLS, Anda harus menentukan informasi otoritas sertifikat untuk digunakan dengan string koneksi awal dalam query SQLAlchemy.
tr_tr: Veritabanı sunucunuz TLS aktarımı için yapılandırılmışsa, SQLAlchemy sorgusundaki ilk bağlantı dizesiyle birlikte kullanmak üzere sertifika otoritesi bilgilerini belirtmeniz gerekir.

source: If your database server is configured to require X.509 certificates for authentication you will need to specify the appropriate SQLAlchemy query parameters for the database back end. These parameters specify the certificate, private key, and certificate authority information for use with the initial connection string.
de: Wenn Ihr Datenbankserver so konfiguriert ist, dass er X.509-Zertifikate für die Authentifizierung benötigt, müssen Sie die entsprechenden SQLAlchemy-Abfrageparameter für das Datenbankende festlegen. Diese Parameter geben den Zertifikat, den privaten Schlüssel und die Zertifikatsautoritätsinformationen für die Verwendung mit der anfänglichen Verbindungszeichenfolge an.
id: Jika server database Anda dikonfigurasi untuk meminta sertifikat X.509 untuk otentikasi, Anda perlu menentukan parameter kueri SQLAlchemy yang sesuai untuk database back end. Parameter ini menentukan sertifikat, private key, dan informasi otoritas sertifikat untuk digunakan dengan string koneksi awal.
tr_tr: Veritabanı sunucunuz, kimlik doğrulaması için X.509 sertifikaları isteyecek şekilde yapılandırılmışsa, veritabanı arka uç için uygun SQLAlchemy sorgu parametrelerini belirtmeniz gerekir. Bu parametreler, ilk bağlantı dizesiyle birlikte kullanılmak üzere sertifika, özel anahtar ve sertifika yetkisi bilgilerini belirtir.

source: If your deployment does not require full virtual machine backups, we recommend excluding the ``/var/lib/nova/instances`` directory as it will be as large as the combined space of each vm running on that node. If your deployment does require full VM backups, you will need to ensure this directory is backed up successfully.
de: Wenn Ihre Bereitstellung keine vollständigen Sicherungen für virtuelle Maschinen erfordert, empfehlen wir, das ``/var/lib/nova/ instances``-Verzeichnis auszuschließen, da es so groß ist wie der kombinierte Speicherplatz für jede VM, die auf diesem Knoten läuft. Wenn Ihre Bereitstellung vollständige VM-Sicherungen erfordert, müssen Sie sicherstellen, dass dieses Verzeichnis erfolgreich gesichert wird.
id: Jika penggelaran Anda tidak memerlukan backup mesin virtual sepenuhnya, sebaiknya tidak menyertakan direktori ``/var/lib/nova/instances`` karena akan sama besarnya dengan ruang gabungan dari setiap vm yang berjalan pada node tersebut. Jika penempatan Anda memerlukan backup VM penuh, Anda harus memastikan agar direktori ini berhasil dicadangkan dengan sukses.
tr_tr: Dağıtımınız tam sanal makine yedeklemelerini gerektirmezse, bu düğümde çalışan her bir vm'nin birleşik alanıyla aynı olacak şekilde ``/var/lib/nova/instances`` dizini hariç tutulmasını öneririz. Dağıtımınızda tam VM yedekleme gerekiyorsa, bu dizinin başarıyla yedeklendiğinden emin olmanız gerekir.

source: If your deployment of OpenStack provides multiple external access points into different security domains it is important that you limit the project's ability to attach multiple vNICs to multiple external access points—this would bridge these security domains and could lead to unforeseen security compromise. It is possible mitigate this risk by utilizing the host aggregates functionality provided by OpenStack Compute or through splitting the project VMs into multiple project projects with different virtual network configurations.
de: Wenn Ihre Installation von OpenStack mehrere externe Zugriffspunkte in verschiedene Sicherheitsdomänen bereitstellt, ist es wichtig, dass Sie die Fähigkeit des Projekts einschränken, mehrere vNICs an mehrere externe Zugriffspunkte anzuhängen - dies würde diese Sicherheitsdomänen überbrücken und zu unvorhergesehenen Sicherheitskompromissen führen. Es ist möglich, dieses Risiko durch die Nutzung der Host-Aggregate-Funktionalität von OpenStack Compute oder durch die Aufteilung der Projekt-VMs in mehrere Projekt-Projekte mit verschiedenen virtuellen Netzwerk-Konfigurationen zu mildern.
id: Jika penggelaran OpenStack Anda menyediakan beberapa jalur akses eksternal ke domain keamanan yang berbeda, penting bagi Anda untuk membatasi kemampuan proyek untuk menghubungkan beberapa vNIC ke beberapa access point eksternal - ini akan menjembatani domain keamanan ini dan dapat menyebabkan kompromi keamanan yang tak terduga. Hal ini dimungkinkan mengurangi risiko ini dengan memanfaatkan fungsi agregat host yang disediakan oleh OpenStack Compute atau melalui pemisahan proyek VM menjadi beberapa proyek dengan konfigurasi jaringan virtual yang berbeda.
tr_tr: OpenStack'ın dağıtımınız farklı güvenlik alanlarına birden fazla harici erişim noktası sağlıyorsa, projenin birden fazla vNIC'yi birden fazla harici erişim noktasına bağlama yeteneğini sınırlamanız önemlidir - bu güvenlik alanlarını köprülemekte ve öngörülemeyen güvenlik zorluğuna neden olabilmektedir. OpenStack Hesaplama tarafından sağlanan sunucu toplamaları işlevini kullanarak veya proje sanal makine birimlerini farklı sanal ağ yapılandırmalarına sahip birden çok proje projesine bölerek bu riski azaltmak mümkündür.

source: Image Storage
de: Abbildspeicher
id: Image Storage (penyimpanan image)
tr_tr: İmaj Deposu

source: Image based filters
de: Abbildbasierte Filter
id: Filter berbasis image
tr_tr: İmaj tabanlı filtreler

source: Image creation process
de: Abbilderstellungsprozess
id: Proses pembuatan image
tr_tr: İmaj oluşturma süreci

source: Image service delay delete feature
de: Funktion Abbilddienst verzögertes Löschen
id: Fitur penghapusan penundaan layanan Image
tr_tr: İmah servisi gecikmeli silme özelliği

source: Image services include discovering, registering, and retrieving virtual machine images. Glance has a RESTful API that allows querying of VM image metadata as well as retrieval of the actual image.
de: Abbilddienste umfassen das Ergründen, Registrieren und Abrufen von virtuellen Maschinenabbildern. Glance hat eine RESTful API, die das Abfragen von VM-Abbild-Metadaten sowie das Abrufen des aktuellen Abbildes ermöglicht.
id: Layanan Image meliputi menemukan, mendaftar, dan mengambil image mesin virtual. Glance memiliki RESTful API yang memungkinkan kueri metadata mage VM serta pengambilan image sebenarnya.
tr_tr: İmaj servisleri, sanal makine imajlarını keşfetmek, kaydetmek ve almaktır. Glance, VM imaj metaverilerini sorgulamaya ve gerçek imajı elde etmeye izin veren RESTful bir API'ye sahiptir.

source: Image signature verification
de: Abbildsignaturprüfung
id: Verifikasi tanda tangan (signature) image
tr_tr: İmaj imza doğrulama
