Repository: openstack/security-doc
Catalog: security-guide/source/locale/*/LC_MESSAGES/security-guide.po
Languages: de, id, tr_tr

source: The OpenStack Documentation provides guidance on how to create and upload an image to the Image service. Additionally it is assumed that you have a process by which you install and harden operating systems. Thus, the following items will provide additional guidance on how to ensure your images are transferred securely into OpenStack. There are a variety of options for obtaining images. Each has specific steps that help validate the image's provenance.
de: Die OpenStack-Dokumentation enthält Anleitungen zum Erstellen und Hochladen eines Abbildes in den Abbilddienst. Darüber hinaus wird davon ausgegangen, dass Sie einen Prozess haben, mit dem Sie Betriebssysteme installieren und härten. So werden die folgenden Punkte zusätzliche Hinweise geben, wie Sie sicherstellen können, dass Ihre Abbilder sicher in OpenStack übertragen werden. Es gibt eine Vielzahl von Optionen für den Erhalt von Abbildern. Jeder hat spezifische Schritte, die helfen, die Provenienz des Abbildes zu validieren.
id: OpenStack Documentation memberikan panduan bagaimana membuat dan mengunggah image ke layanan Image. Selain itu diasumsikan bahwa Anda memiliki proses di mana Anda menginstal dan mengeras sistem operasi. Dengan demikian, item berikut akan memberikan panduan tambahan tentang bagaimana memastikan image Anda ditransfer dengan aman ke dalam OpenStack. Ada berbagai pilihan untuk mendapatkan image. Masing-masing memiliki langkah-langkah khusus yang membantu memvalidasi asalnya image.
tr_tr: OpenStack Belgelendirmesi, İmaj servisine bir imajın nasıl oluşturulacağı ve yükleneceği konusunda rehberlik eder. Buna ek olarak, işletim sistemlerini yüklemek ve sıkılaştırmak için bir işleminiz olduğunu varsaymaktadır. Bu nedenle, aşağıdaki öğeler, imajlarınızın OpenStack'e güvenli bir şekilde nasıl aktarılmasını sağlayacak ek rehberlik sağlayacaktır. İmaj elde etmek için çeşitli seçenekler bulunmaktadır. Her birinin, imajın kimliğini doğrulamaya yardımcı olan belirli adımları vardır.

source: The OpenStack Identity service (keystone) supports multiple methods of authentication, including user name & password, LDAP, and external authentication methods. Upon successful authentication, The Identity service provides the user with an authorization token used for subsequent service requests.
de: Der OpenStack Identity Service (Keystone) unterstützt mehrere Authentifizierungsmethoden, einschließlich Benutzername & Passwort, LDAP und externe Authentifizierungsmethoden. Nach erfolgreicher Authentifizierung bietet der Identity-Dienst dem Benutzer ein Berechtigungs-Token, das für nachfolgende Service-Anfragen verwendet wird.
id: Layanan OpenStack Identity (keystone) mendukung beberapa metode otentikasi, termasuk nama pengguna & password, LDAP, dan metode otentikasi eksternal. Setelah otentikasi berhasil, layanan Identitas memberi pengguna sebuah token otorisasi yang digunakan untuk permintaan layanan berikutnya.
tr_tr: OpenStack Kimlik servisi (keystone), kullanıcı adı ve parola, LDAP ve harici kimlik doğrulama yöntemleri de dahil olmak üzere birden çok kimlik doğrulama yöntemini desteklemektedir. Kimlik doğrulama işlemi başarıyla tamamlandıktan sonra, Kimlik servisi kullanıcıya sonraki hizmet talepleri için kullanılan bir yetkilendirme belirteci sunar.

source: The OpenStack Identity service supports Cloud Auditing Data Federation (CADF) notification, providing auditing data for compliance with security, operational, and business processes. For more information, see the `Keystone developer documentation <https://docs.openstack.org/keystone/latest/advanced-topics/event_notifications.html#auditing-with-cadf>`_.
de: Der OpenStack Identity Service unterstützt die Überwachung von Cloud Auditing Data Federation (CADF) und stellt Auditdaten zur Einhaltung von Sicherheits-, Betriebs- und Geschäftsprozessen zur Verfügung. Weitere Informationen finden Sie in der `Keystone-Entwicklerdokumentation <https://docs.openstack.org/keystone/latest/advanced-topics/event_notifications.html#auditing-with-cadf>`_.
id: Layanan OpenStack Identity mendukung pemberitahuan Cloud Auditing Data Federation (CADF), memberikan data audit untuk mematuhi proses keamanan, operasional, dan bisnis. Untuk informasi lebih lanjut, lihat `Keystone developer documentation <https://docs.openstack.org/keystone/latest/advanced-topics/event_notifications.html#auditing-with-cadf>`_.

source: The OpenStack Management Utilities are open-source Python command-line clients that make API calls. There is a client for each OpenStack service (for example, nova, glance). In addition to the standard CLI client, most of the services have a management command-line utility which makes direct calls to the database. These dedicated management utilities are slowly being deprecated.
de: Die OpenStack Management Utilities sind Open-Source-Python-Befehlszeilenclients, die API-Aufrufe tätigen. Es gibt einen Client für jeden OpenStack Service (z.B. nova, glance). Zusätzlich zum Standard-CLI-Client verfügen die meisten Dienste über ein Management-Befehlszeilenprogramm, das direkte Anrufe in die Datenbank macht. Diese dedizierten Management-Dienstprogramme werden langsam veraltet.
id: OpenStack Management Utilities adalah klien command-line Python open-source yang membuat panggilan API. Ada klien untuk setiap layanan OpenStack (misalnya, nova, glance). Selain klien CLI standar, sebagian besar layanan memiliki utilitas command-line manajemen yang membuat panggilan langsung ke database. Utilitas manajemen dedicated ini perlahan tidak digunakan lagi.
tr_tr: OpenStack Yönetim Yardımcı Programları, API çağrıları yapan açık kaynaklı Python komut satırı istemcileridir. Her OpenStack servisi için bir istemci vardır (örneğin, nova, glance). Standart CLI istemcisine ek olarak, servislerin çoğunda veritabanına doğrudan çağrı yapan bir yönetim komut satırı yardımcı programı bulunur. Bu özel yönetim yardımcı programları yavaş yavaş kullanımdan kaldırılıyor.

source: The OpenStack Networking components are:
de: Die OpenStack Networking Komponenten sind:
id: Komponen OpenStack Networking adalah:
tr_tr: OpenStack Ağ bileşenleri:

source: The OpenStack Networking service (neutron) enables the end-user or tenant to define, utilize, and consume networking resources. OpenStack Networking provides a tenant-facing API for defining network connectivity and IP addressing for instances in the cloud, in addition to orchestrating the network configuration. With the transition to an API-centric networking service, cloud architects and administrators should take into consideration best practices to secure physical and virtual network infrastructure and services.
de: Der OpenStack Networking Service (Neutron) ermöglicht es dem Endbenutzer oder Tenant, Netzwerkressourcen zu definieren, zu nutzen und zu verbrauchen. OpenStack Networking bietet eine Patente-API zur Definition von Netzwerkkonnektivität und IP-Adressierung für Instanzen in der Cloud, zusätzlich zur Orchestrierung der Netzwerkkonfiguration. Mit dem Übergang zu einem API-zentrierten Netzwerkdienst sollten Cloud-Architekten und Administratoren bewährte Verfahren zur Sicherung physischer und virtueller Netzwerkinfrastruktur und -dienste berücksichtigen.
id: Layanan OpenStack Networking (neutron) memungkinkan end-user atau penyewa untuk menentukan, memanfaatkan, dan mengkonsumsi sumber daya jaringan. OpenStack Networking menyediakan tenant-facing API untuk menentukan konektivitas jaringan dan pengalamatan IP untuk instance di awan, selain mengatur konfigurasi jaringan. Dengan transisi ke layanan jaringan API-centric, arsitek dan administrator awan harus mempertimbangkan best practice (praktik terbaik) untuk mengamankan infrastruktur dan layanan jaringan fisik dan virtual.
tr_tr: OpenStack Ağ Servisi (neutron) son kullanıcının veya kiracının ağ kaynaklarını tanımlamasına, kullanmasına ve kullanmasına olanak tanır. OpenStack Ağ, ağ yapılandırmasının yanı sıra buluttaki örnekler için ağ bağlantısını ve IP adreslemeyi tanımlamak için kiracıya bakan bir API sağlar. Bir API merkezli ağ hizmetine geçişle bulut mimarları ve yöneticileri, fiziksel ve sanal ağ altyapısını ve servisleri güvenli hale getirmek için en iyi yöntemleri göz önünde bulundurmalıdır.

source: The OpenStack Networking service provides security group functionality using a mechanism that is more flexible and powerful than the security group capabilities built into OpenStack Compute. Thus, ``nova.conf`` should always disable built-in security groups and proxy all security group calls to the OpenStack Networking API when using OpenStack Networking. Failure to do so results in conflicting security policies being simultaneously applied by both services. To proxy security groups to OpenStack Networking, use the following configuration values:
de: Der OpenStack Networking-Dienst bietet Sicherheitsgruppen-Funktionalität mit einem Mechanismus, der flexibler und leistungsfähiger ist als die Sicherheitsgruppen-Funktionen, die in OpenStack Compute integriert sind. So sollte ``nova.conf`` immer integrierte Sicherheitsgruppen deaktivieren und alle Sicherheitsgruppenkontakte an die OpenStack Networking API bei der Verwendung von OpenStack Networking veröffentlichen. Andernfalls führt dies zu widersprüchlichen Sicherheitsrichtlinien, die gleichzeitig von beiden Diensten angewendet werden. Um die Sicherheitsgruppen an OpenStack Networking zu verweigern, verwenden Sie die folgenden Konfigurationswerte:
id: Layanan OpenStack Networking menyediakan fungsionalitas kelompok keamanan dengan menggunakan mekanisme yang lebih fleksibel dan kuat daripada kemampuan kelompok keamanan yang ada di dalam OpenStack Compute. Dengan demikian, ``nova.conf`` harus selalu menonaktifkan grup keamanan bawaan dan proxy semua grup keamanan menghubungi OpenStack Networking API saat menggunakan OpenStack Networking. Kegagalan untuk melakukannya menghasilkan kebijakan keamanan yang saling bertentangan yang secara bersamaan diterapkan oleh kedua layanan tersebut. Untuk mengelompokkan grup keamanan ke OpenStack Networking, gunakan nilai konfigurasi berikut:
tr_tr: OpenStack Ağ Servisi, OpenStack Hesaplama'da yerleşik güvenlik grubu yeteneklerinden daha esnek ve güçlü bir mekanizma kullanarak güvenlik grubu işlevselliğini sağlar. Bu nedenle, ``nova.conf``, yerleşik güvenlik gruplarını daima devre dışı bırakmalı ve OpenStack Ağ'ı kullanırken tüm güvenlik grubu çağrılarını OpenStack Ağ API'sine yönlendirmelidir. Bunun yapılmaması, çakışan güvenlik politikalarının her iki servis tarafından aynı anda uygulanmasına neden olur. Güvenlik gruplarını OpenStack Ağ'a yönlendirmek için aşağıdaki yapılandırma değerlerini kullanın:

source: The OpenStack Security Group would like to acknowledge contributions from the following organizations that were instrumental in making this book possible. The organizations are:
de: Die OpenStack Security Group möchte die Beiträge der folgenden Organisationen anerkennen, die bei der Durchführung dieses Buches maßgeblich waren. Die Organisationen sind:
id: OpenStack Security Group ingin mengakui kontribusi dari organisasi berikut yang berperan dalam membuat buku ini menjadi ada. Organisasi adalah:
tr_tr: OpenStack Güvenlik Grubu, bu kitabın hazırlanmasına yardımcı olan aşağıdaki organizasyonlara katkılarından dolayı teşekkür ediyor. Organizasyonlar şunlardır:

source: The OpenStack Security Guide is the result of a five day sprint of collaborative work of many individuals. The purpose of this document is to provide the best practice guidelines for deploying a secure OpenStack cloud. It is designed to reflect the current state of security within the OpenStack community and provide frameworks for decision making where listing specific security controls are not feasible due to complexity or other environment specific details.
de: Der OpenStack Security Guide ist das Ergebnis eines Fünf-Tage-Sprints von kollaborativen Arbeiten vieler Einzelpersonen. Ziel dieses Dokuments ist es, die Best Practice-Richtlinien für den Einsatz einer sicheren OpenStack-Cloud bereitzustellen. Es ist entworfen, um den aktuellen Stand der Sicherheit innerhalb der OpenStack-Community zu reflektieren und Rahmenbedingungen für Entscheidungsfindung zu schaffen, bei denen die Auflistung spezifische Sicherheitskontrollen aufgrund von Komplexität oder anderen umweltbezogenen Details nicht möglich sind.
id: OpenStack Security Guide adalah hasil sprint lima hari kerja kolaboratif banyak individu. Tujuan dari dokumen ini adalah untuk memberikan panduan praktik terbaik untuk menerapkan awan OpenStack yang aman. Ini dirancang untuk mencerminkan keadaan keamanan saat ini dalam komunitas OpenStack dan menyediakan kerangka kerja untuk pengambilan keputusan di mana daftar kontrol keamanan tertentu tidak dimungkinkan karena kompleksitas atau rincian spesifik lingkungan lainnya.
tr_tr: OpenStack Güvenlik Kılavuzu, pek çok kişinin birlikte çalıştığı beş günlük bir sprint sonucudur. Bu belgenin amacı, güvenli bir OpenStack bulutunu yayına almak için en iyi uygulama kılavuzlarını sağlamaktır. OpenStack topluluğunda mevcut güvenlik durumunu yansıtmak ve karmaşıklık veya diğer çevreye özgü ayrıntılar nedeniyle listelemede belirli güvenlik denetimlerinin mümkün olmadığı karar verme için çatılar sağlamak üzere tasarlanmıştır.

source: The OpenStack Security Project (OSSP) has worked with the VMT to agree that an architectural review of the best practice deployment for a project is an appropriate form of security review, balancing the need for review with the resource requirements for a project of the scale of OpenStack. Security architecture review is also often referred to as *threat analysis*, *security analysis* or *threat modeling*. In the context of OpenStack security review, these terms are synonymous for an architectural security review which may identify defects in the design of a project or reference architecture, and may lead to further investigative work to verify parts of the implementation.
de: Das OpenStack Security Project (OSSP) hat mit der VMT zusammengearbeitet, um zuzustimmen, dass eine architektonische Überprüfung der Best Practice-Implementierung für ein Projekt eine angemessene Form der Sicherheitsüberprüfung ist, die die Notwendigkeit einer Überprüfung mit den Ressourcenanforderungen für ein Projekt der Skala ausgleicht OpenStack Security Architecture Review wird auch oft als *Bedrohungsanalyse*, *Sicherheitsanalyse* oder *Bedrohungsmodellierung* bezeichnet. Im Rahmen der OpenStack-Sicherheitsüberprüfung sind diese Begriffe gleichbedeutend mit einer architektonischen Sicherheitsüberprüfung, die Fehler bei der Gestaltung einer Projekt- oder Referenzarchitektur erkennen kann und zu weiteren Untersuchungsarbeiten führen kann, um Teile der Implementierung zu überprüfen.
id: OpenStack Security Project (OSSP) telah bekerja dengan VMT untuk menyetujui bahwa tinjauan arsitektur penerapan praktik terbaik untuk sebuah proyek adalah bentuk tinjauan keamanan yang sesuai, menyeimbangkan kebutuhan untuk ditinjau dengan persyaratan sumber daya untuk proyek skala OpenStack. Tinjauan arsitektur keamanan juga sering disebut sebagai *threat analysis*, *security analysis* atau *threat modeling*. Dalam konteks tinjauan keamanan OpenStack, istilah-istilah ini identik untuk tinjauan keamanan arsitektural yang dapat mengidentifikasi cacat pada desain proyek atau arsitektur referensi, dan dapat menyebabkan pekerjaan investigasi lebih lanjut untuk memverifikasi bagian-bagian dari pelaksanaan.
tr_tr: OpenStack Güvenlik Projesi (OSSP), OpenStack ölçeğinde bir proje için en iyi uygulama dağıtımının mimari bir incelemesinin, güvenlik incelemesinin uygun bir biçimi olduğuna ve bir ölçekli projenin kaynak gereksinimleriyle gözden geçirme gereksinimini dengelemesi konusunda VMT ile birlikte çalışmıştır. Güvenlik mimarisi incelemesine genellikle *tehdit analizi*, *güvenlik analizi* veya *tehdit modelleme* denir. OpenStack güvenlik incelemesi bağlamında, bu terimler, bir proje veya referans mimarisi tasarımındaki kusurları belirleyebilecek ve uygulamanın parçalarını doğrulamak için daha fazla araştırma çalışmalarına yol açabilecek mimari bir güvenlik incelemesi için eşanlamlıdır.

source: The OpenStack Security team is based on voluntary contributions from the OpenStack community. You can contact the security community directly in the #openstack-security channel on Freenode IRC, or by sending mail to the openstack-dev mailing list with the [security] prefix in the subject header.
de: Das OpenStack Security Team basiert auf freiwilligen Beiträgen der OpenStack Community. Sie können die Sicherheits-Community direkt im #openstack-security-Kanal auf Freenode IRC kontaktieren oder per E-Mail an die openstack-dev Mailingliste mit dem [security] Präfix im Betreffkopf senden.

source: The OpenStack components are only a small fraction of the software in a cloud. It is important to keep up to date with all of these other components, too. While certain data sources will be deployment specific, it is important that a cloud administrator subscribe to the necessary mailing lists in order to receive notification of any security updates applicable to the organization's environment. Often this is as simple as tracking an upstream Linux distribution.
de: Die OpenStack-Komponenten sind nur ein kleiner Bruchteil der Software in einer Cloud. Es ist wichtig, auch mit all diesen anderen Komponenten auf dem Laufenden zu bleiben. Während bestimmte Datenquellen implementierungsspezifisch sein werden, ist es wichtig, dass ein Cloud-Administrator die notwendigen Mailinglisten abonniert, um die Benachrichtigung über alle Sicherheitsupdates zu erhalten, die für die Umgebung der Organisation gelten. Oft ist das so einfach wie die Verfolgung einer Upstream-Linux-Distribution.
id: Komponen OpenStack hanya sebagian kecil dari perangkat lunak di awan. Penting untuk tetap up to date dengan semua komponen lainnya juga. Sementara sumber data tertentu akan diterapkan secara khusus, administrator awan harus berlangganan milis yang diperlukan untuk menerima pemberitahuan tentang pembaruan keamanan apa pun yang berlaku untuk lingkungan organisasi. Seringkali ini sesederhana melacak distribusi Linux hulu.
tr_tr: OpenStack bileşenleri bir buluttaki yazılımın yalnızca küçük bir bölümüdür. Bu diğer bileşenlerle de güncel tutmak önemlidir. Bazı veri kaynakları dağıtıma özgü olmakla birlikte, bir bulut yöneticisinin, organizasyonun ortamına uygulanabilir tüm güvenlik güncelleştirmelerini bildirmek için gerekli posta listelerine abone olması önemlidir. Genellikle bu, bir akış yukarı Linux dağıtımını izlemek kadar basittir.

source: The OpenStack dashboard (horizon) provides administrators and tenants with a web-based graphical interface to provision and access cloud-based resources. The dashboard communicates with the back-end services through calls to the OpenStack API.
de: Das OpenStack Dashboard (Horizont) bietet Administratoren und Tenants eine webbasierte grafische Oberfläche zur Bereitstellung und zum Zugriff auf Cloud-basierte Ressourcen. Das Dashboard kommuniziert mit den Back-End-Diensten über Anrufe an die OpenStack API.
id: Dasbor OpenStack (horizon) menyediakan administrator dan penyewa dengan antarmuka grafis berbasis web untuk menyediakan dan mengakses sumber daya berbasis awan. Dasbor berkomunikasi dengan layanan back-end melalui panggilan ke API OpenStack.
tr_tr: OpenStack paneli (horizon), yöneticilere ve kiracılara bulut tabanlı kaynaklar oluşturmak ve bunlara erişmek için web tabanlı bir grafik arayüz sağlar. Panel, OpenStack API çağrıları aracılığıyla arka uç servisleri ile iletişim kurar.

source: The OpenStack dashboard is designed to discourage developers from introducing cross-site scripting vulnerabilities with custom dashboards as threads can be introduced. Dashboards that utilize multiple instances of JavaScript should be audited for vulnerabilities such as inappropriate use of the ``@csrf_exempt`` decorator. Any dashboard that does not follow these recommended security settings should be carefully evaluated before restrictions are relaxed.
de: Das OpenStack-Dashboard wurde entwickelt, um Entwickler davon abzuhalten, Cross-Site-Scripting-Schwachstellen mit benutzerdefinierten Dashboards einzuführen, da Threads eingeführt werden können. Dashboards, die mehrere Instanzen von JavaScript nutzen, sollten auf Schwachstellen wie die unangemessene Verwendung des ``@csrf_exempt``Dekorators geprüft werden. Jedes Dashboard, das diesen empfohlenen Sicherheitseinstellungen nicht folgt, sollte sorgfältig ausgewertet werden, bevor die Beschränkungen entspannt werden.
id: Dasbor OpenStack dirancang untuk mencegah pengembang mengenalkan kerentanan skrip lintas situs dengan dasbor kustom sebagai thread dapat diperkenalkan. Dasbor yang menggunakan beberapa instance JavaScript harus diaudit untuk kerentanan seperti penggunaan dekorator ```@csrf_exempt` yang tidak tepat. Setiap dasbor yang tidak mengikuti pengaturan keamanan yang disarankan ini harus dievaluasi secara hati-hati sebelum batasan rileks.
tr_tr: OpenStack paneli, geliştiricilerin çapraz site komut dosyası çalıştırma güvenlik açıklarını, özel panellerle başlatmalarından vazgeçirmek için tasarlanmıştır. Birden fazla JavaScript örneğini kullanan paneller, ``@csrf_exempt`` dekoratörünün uygun olmayan kullanımı gibi güvenlik açıkları açısından denetlenmelidir. Önerilen bu güvenlik ayarlarını takip etmeyen herhangi bir panel, kısıtlamalar rahatlamadan önce dikkatlice değerlendirilmelidir.

source: The PKCS#11 crypto plugin can be used to interface with a Hardware Security Module (HSM) using the PKCS#11 protocol. Secrets are encrypted (and decrypted on retrieval) by a project specific Key Encryption Key (KEK) which resides in the HSM. Since a different KEK is used for each project, and since the KEKs are stored inside an HSM (instead of in plaintext in the configuration file) the PKCS#11 plugin is much more secure than the simple crypto plugin. It is the most popular back end amongst Barbican deployments.
de: Das PKCS#11-Crypto-Plugin kann zur Verbindung mit einem Hardware-Sicherheitsmodul (HSM) unter Verwendung des PKCS#11-Protokolls verwendet werden. Secrets werden durch einen projektspezifischen Key Encryption Key (KEK), der sich im HSM befindet, verschlüsselt (und beim Entschlüsseln entschlüsselt). Da für jedes Projekt ein anderes KEK verwendet wird und die KEKs innerhalb eines HSM (statt in Klartext in der Konfigurationsdatei) gespeichert werden, ist das Plugin PKCS #11 wesentlich sicherer als das einfache Krypto-Plugin. Es ist das beliebteste Back-End unter den Barbican-Einsätzen.
id: Plugin kripto PKCS # 11 dapat digunakan untuk berinteraksi dengan Hardware Security Module (HSM) menggunakan protokol PKCS # 11. Rahasia dienkripsi (dan didekripsi saat pengambilan) oleh Key Key Enkripsi (KEK) spesifik proyek yang berada di HSM. Karena KEK yang berbeda digunakan untuk setiap proyek, dan karena KEK disimpan di dalam sebuah HSM (bukan di plaintext dalam file konfigurasi) plugin PKCS # 11 jauh lebih aman daripada plugin kripto sederhana. Ini adalah bagian belakang yang paling populer di antara penyebaran Barbican.
