Repository: openstack/security-doc
Catalog: security-guide/source/locale/*/LC_MESSAGES/security-guide.po
Languages: de, id, tr_tr

source: The maturity of a given hypervisor product or project is critical to your security posture as well. Product maturity has a number of effects once you have deployed your cloud:
de: Die Reife eines gegebenen Hypervisor Produkts oder Projektes ist auch für Ihre Sicherheitsposition entscheidend. Die Produktreife hat eine Reihe von Effekten, sobald Sie Ihre Cloud eingesetzt haben:
id: Kematangan produk atau proyek hypervisor yang diberikan sangat penting untuk postur keamanan Anda. Kematangan produk memiliki sejumlah efek setelah Anda memasang awan Anda:
tr_tr: Belirli bir hipervizör ürününün veya projenin olgunluğu güvenlik durumunuz için de kritik önem taşır. Bulutunuzu yayına aldıktan sonra ürün olgunluğunun bir takım etkileri vardır:

source: The maturity of a given product or project is critical to your security posture. Product maturity has a number of effects after you deploy your cloud:
de: Die Reife eines bestimmten Produkts oder Projektes ist entscheidend für Ihre Sicherheitsposition. Die Produktreife hat nach der Bereitstellung Ihrer Cloud eine Reihe von Effekten:
id: Kematangan produk atau proyek tertentu sangat penting untuk postur keamanan Anda. Kematangan produk memiliki sejumlah efek setelah Anda menyebarkan awan Anda:
tr_tr: Verili bir ürünün veya projenin olgunluğu güvenlik durumunuz için kritik önem taşır. Bulutunuzu yayına aldıktan sonra ürünün olgunluğunun bir takım etkileri vardır:

source: The method for configuring your web server to start and run as a non-root user varies by web server and operating system.
de: Die Methode zum Konfigurieren Ihres Webservers zum Starten und Ausführen als Nicht-Root-Benutzer variiert je nach Webserver und Betriebssystem.
id: Metode untuk mengonfigurasi server web Anda agar dijalankan dan dijalankan sebagai pengguna non-root berbeda-beda menurut server web dan sistem operasi.
tr_tr: Web sunucunuzu root olmayan bir kullanıcı olarak başlatılacak ve çalıştırılacak şekilde yapılandırma yöntemi web sunucusu ve işletim sistemine göre değişir.

source: The more familiar your team is with a given product, its configuration, and its eccentricities, the fewer configuration mistakes are made. Additionally, having staff expertise spread across an organization increases availability of your systems, allows segregation of duties, and mitigates problems in the event that a team member is unavailable.
de: Je vertrauter Ihr Team mit einem gegebenen Produkt, seiner Konfiguration und seinen Exzentrizitäten ist, desto weniger Konfigurationsfehler werden gemacht. Darüber hinaus, mit Personal-Know-how über eine Organisation verteilt erhöhen die Verfügbarkeit Ihrer Systeme, ermöglicht die Trennung von Aufgaben und lindert Probleme für den Fall, dass ein Team-Mitglied nicht verfügbar ist.
id: Semakin akrab tim Anda dengan produk tertentu, konfigurasinya, dan eksentrisitasnya, semakin sedikit kesalahan konfigurasi yang dibuat. Selain itu, memiliki keahlian staf yang tersebar di seluruh organisasi meningkatkan ketersediaan sistem Anda, memungkinkan pemisahan tugas, dan mengurangi masalah jika anggota tim tidak tersedia.
tr_tr: Ekibinizin belirli bir ürüne, yapılandırmasına ve dışmerkezliliğe ne kadar çok tanıdıkça, yapılandırma hataları o kadar az olur. Ek olarak, personel tecrübesi bir organizasyona yayılmış olmak sisteminizin kullanılabilirliğini artırır, görevlerin ayrımlaşmasına izin verir ve bir ekip üyesinin bulunmaması halinde sorunları azaltır.

source: The most common frameworks for auditing and evaluating a cloud deployment include the previously mentioned ISO 27001/2 Information Security standard, ISACA's Control Objectives for Information and Related Technology (COBIT) framework, Committee of Sponsoring Organizations of the Treadway Commission (COSO), and Information Technology Infrastructure Library (ITIL). It is very common for audits to include areas of focus from one or more of these frameworks. Fortunately there is a lot of overlap between the frameworks, so an organization that adopts one will be in a good position come audit time.
de: Die gängigsten Rahmenbedingungen für die Auditierung und Bewertung eines Cloud-Einsatzes sind der bereits erwähnte ISO 27001/2 Information Security-Standard, das ISACA-Rahmensystem für Informations- und zugehörige Technologie (COBIT), Committee of Sponsoring Organizations of the Treadway Commission (COSO) und Information Technologie-Infrastruktur-Bibliothek (ITIL). Es ist für Audits sehr geläufig, einen oder mehreren Bereiche dieser Frameworks im Auge zu behalten. Glücklicherweise gibt es eine Menge von Überschneidungen zwischen den Frameworks, so dass eine Organisation, die eine nimmt, eine guten Position in der Audit-Zeit bekommt.
id: Kerangka kerja yang paling umum untuk mengaudit dan mengevaluasi penerapan cloud termasuk standar Information Security 27001/2 yang telah disebutkan sebelumnya, kerangka ISACA's Control Objectives for Information and Related Technology (COBIT), Committee of Sponsoring Organizations of the Treadway Commission (COSO), dan Information Technology Infrastructure Library (ITIL). Hal ini sangat umum untuk audit untuk memasukkan area fokus dari satu atau lebih kerangka kerja ini. Untungnya ada banyak tumpang tindih antara kerangka kerja, sehingga organisasi yang mengadopsi seseorang akan berada dalam posisi yang baik datang waktu audit.
tr_tr: Bulut dağıtımının denetlenmesi ve değerlendirilmesi için en yaygın çerçeveler, daha önce bahsedilen ISO 27001/2 Bilgi Güvenliği standardı, ISACA'nın Bilgi ve İlgili Teknoloji için Kontrol Hedefi (COBIT) çerçevesi, Treadway Komisyonunun Sponsor Kuruluşları Komitesi (COSO) ve Bilgi Teknoloji Altyapı Kütüphanesi (ITIL). Denetimlerin, bu alanlardan bir veya daha fazlasından odaklanma alanlarını dahil etmesi çok yaygındır. Neyse ki, çerçeveler arasında çok fazla örtüşme var, bu nedenle, bir tanesi benimseyen bir organizasyon denetim zamanında iyi bir konuma gelecektir.

source: The network authentication protocol which works on the basis of tickets to allow nodes communicating over a non-secure network to prove their identity to one another in a secure manner.
de: Das Netzwerk-Authentifizierungsprotokoll, das auf der Basis von Tickets arbeitet, um es den Knoten zu ermöglichen, über ein nicht sicheres Netzwerk zu kommunizieren, um ihre Identität auf sichere Weise zu beweisen.
id: Protokol otentikasi jaringan yang bekerja berdasarkan tiket untuk memungkinkan node berkomunikasi melalui jaringan yang tidak aman untuk membuktikan identitas mereka satu sama lain secara aman.
tr_tr: Düğümler üzerinde çalışan, güvenli olmayan bir ağ üzerinden iletişim kuranların kimliğini birbirleriyle güvenli bir şekilde kanıtlamak için çalışan ağ kimlik doğrulama protokolü.

source: The neutron-l3-agent, used by many plug-ins to implement L3 forwarding, supports only IPv4 forwarding.
de: Der Neutron-l3-Agent, der von vielen Plug-Ins verwendet wird, um L3-Weiterleitung zu implementieren, unterstützt nur die IPv4-Weiterleitung.
id: Agen neutron-l3-agent, yang digunakan oleh banyak plug-in untuk mengimplementasikan forwarding L3, hanya mendukung penerusan IPv4.
tr_tr: Birçok eklenti tarafından L3 iletmeyi uygulamak için kullanılan neutron-l3-agent yalnızca IPv4 iletmeyi destekler.

source: The newly created file will be stored under ``/etc/shibboleth/sp-key.pem``
de: Die neu erstellte Datei wird unter ``/etc/shibboleth/sp-key.pem``gespeichert
tr_tr: Yeni oluşturulan dosya şuranın altındadır: ``/etc/shibboleth/sp-key.pem``

source: The nova command-line utility can return a URL for SPICE console for access by a SPICE-html client.
de: Das nova-Befehlszeilenprogramm kann eine URL für die SPICE-Konsole für den Zugriff durch einen SPICE-html-Client zurückgeben.
id: Utilitas command-line nova dapat mengembalikan URL untuk konsol SPICE untuk akses oleh klien SPICE-html.
tr_tr: Nova komut satırı programı, SPICE-html istemcisi tarafından erişmek için SPICE konsolu için bir URL döndürebilir.

source: The option ``saml2`` may be different in your deployment, but do not use a wildcard value. Otherwise every Federated protocol will be handled by Shibboleth.
de: Die Option ``saml2``kann in Ihrer Bereitstellung unterschiedlich sein, aber keinen Wildcard-Wert verwenden. Andernfalls wird jedes Föderierte Protokoll von Shibboleth behandelt.
tr_tr: ``saml2`` seçeneği dağıtımınızda farklı olabilir, ancak bir joker karakter değeri kullanmayın. Aksi halde, Federasyona ait her protokol Shibboleth tarafından ele alınır.

source: The option exists for implementers to encrypt tenant data wherever it is stored on disk or transported over a network, such as the OpenStack volume encryption feature described below. This is above and beyond the general recommendation that users encrypt their own data before sending it to their provider.
de: Die Option existiert für Implementierer, um Tenantdaten zu verschlüsseln, wo immer sie auf einer Festplatte gespeichert oder über ein Netzwerk transportiert werden, wie z. B. die unten beschriebene OpenStack-Volume-Verschlüsselungsfunktion. Dies ist über die allgemeine Empfehlung hinaus, dass die Benutzer ihre eigenen Daten verschlüsseln, bevor sie sie an ihren Provider senden.
id: Pilihan ada bagi pelaksana untuk mengenkripsi data penyewa dimanapun disimpan di disk atau diangkut melalui jaringan, seperti fitur enkripsi volume OpenStack yang dijelaskan di bawah ini. Ini di atas dan di luar rekomendasi umum bahwa pengguna mengenkripsi data mereka sendiri sebelum mengirimkannya ke penyedia mereka.
tr_tr: Uygulayıcılar, kiracı verilerini disk üzerinde saklandığı veya aşağıda açıklanan OpenStack hacim şifreleme özelliği gibi bir ağ üzerinden taşınan yerde şifrelemek için uygulayıcılar için geçerlidir. Kullanıcıların kendi verilerini sağlayıcılarına göndermeden önce şifrelemesi genel tavsiyedir.

source: The parameter ``max_request_body_size`` defines the maximum body size per request in bytes. If the maximum size is not defined, the attacker could craft an arbitrary request of large size causing the service to crash and finally resulting in Denial Of Service attack. Assigning the maximum value ensures that any malicious oversized request gets blocked ensuring continued availability of the component.
de: Der Parameter ``max_request_body_size`` definiert die maximale Körpergröße pro Anfrage in Bytes. Wenn die maximale Größe nicht definiert ist, könnte der Angreifer eine beliebige Anforderung von großer Größe erstellen, die den Dienst zum Absturz bringt und schließlich zu einem Denial Of Service- Angriff führt. Die Zuweisung des Maximalwertes stellt sicher, dass jede böswillige überdimensionierte Anfrage blockiert wird, um eine fortgesetzte Verfügbarkeit der Komponente sicherzustellen.
id: Parameter ``max_request_body_size`` mendefinisikan ukuran body maksimum per permintaan dalam satuan byte. Jika ukuran maksimum tidak ditentukan, penyerang bisa mengajukan permintaan semaunya (arbitrary) dengan ukuran besar menyebabkan layanan mogok dan akhirnya mengakibatkan serangan Denial Of Service. Menetapkan nilai maksimum memastikan bahwa permintaan besar yang berbahaya diblokir untuk memastikan ketersediaan komponen yang dilanjutkan.
tr_tr: ``Max_request_body_size`` parametresi, istek başına maksimum gövde boyutunu bayt olarak tanımlar. Maksimum boyut tanımlanmadıysa, saldırgan büyük boyutlu rastgele bir istekte bulunarak servisin çökmesine neden olabilir ve nihayet Hizmet Reddi'ne neden olabilir. Maksimum değeri atamak, kötü niyetli büyük boyutlu talebin engellenmesini sağlayarak bileşen kullanımının devamlılığını sağlar.

source: The permissions of a file can be examined my moving into the directory the file is contained in and running the :command:`ls -lh` command. This will show the permissions, owner, and group that have access to the file, as well as other information such as the last time the file was modified and when it was created.
de: Die Berechtigungen einer Datei können untersucht werden, wenn sie in das Verzeichnis verschoben wird, in der die Datei enthalten ist und man :command:`ls -lh` ausführt. Dies zeigt die Berechtigungen, Besitzer und Gruppen, die Zugriff auf die Datei haben, sowie andere Informationen wie das letzte Mal, wenn die Datei geändert wurde und wann sie erstellt wurde.
id: Perizinan sebuah file dapat diperiksa untuk pindah ke direktori file berisi dan menjalankan perintah :command:`ls -lh`. Ini akan menunjukkan hak akses, pemilik, dan grup yang memiliki akses ke file, serta informasi lainnya seperti terakhir kali file tersebut dimodifikasi dan kapan dibuat.
tr_tr: Bir dosyanın izinleri, dosyanın bulunduğu dizine girip şu komut çalıştırılarak incelenebilir :command:`ls -lh` komutu. Bu, dosyaya erişimi olan izinleri, sahibi ve grubu ve dosyanın son değiştirilme zamanı ve ne zaman oluşturulduğu gibi diğer bilgileri gösterir.

source: The policy enforcement middleware enables fine-grained access control to OpenStack resources. The behaviour of the policy is discussed in depth in :ref:`policy-section`.
de: Die Policy Enforcement Middleware ermöglicht eine feinkörnige Zugriffskontrolle auf OpenStack-Ressourcen. Das Verhalten der Politik wird ausführlich diskutiert in :ref:`policy-section`.
id: Middleware penegakan kebijakan memungkinkan kontrol akses fine-grained ke sumber daya OpenStack. Perilaku kebijakan dibahas secara mendalam di :ref:`policy-section`.
tr_tr: Politika uygulama orta katmanı, OpenStack kaynaklarına ince ayarlı erişim kontrolü sağlar. Politikanın davranışı şurada ele alınmaktadır :ref:`policy-section`.

source: The port ``8786`` is the default port for the Shared File Systems service. It may be changed to any other port, but this change should also be made in the configuration file to option ``osapi_share_listen_port`` which defaults to ``8786``.
de: Der Port ``8786`` ist der Standard-Port für den Shared File Systems Service. Es kann in einen anderen Port geändert werden, aber diese Änderung sollte auch in der Konfigurationsdatei zur Option `` osapi_share_listen_port``vorgenommen werden, die standardmäßig ``8786`` ist.
id: Port ``8786`` adalah port default untuk layanan Shared File Systems. Ini bisa diubah ke port lain, tapi perubahan ini juga harus dilakukan pada file konfigurasi ke opsi ``osapi_share_listen_port`` yang defaultnya ke ``8786``.
tr_tr: ``8786`` portu, Paylaşımlı Dosya Sistemleri servisinin varsayılan portudur. Diğer herhangi bir porta değiştirilebilir, ancak bu değişikliğin yapılandırma dosyasında ``osapi_share_listen_port`` seçeneğine yapılması gerekir; varsayılan değeri ``8786``.

source: The prescriptive defense for each form of attack is beyond the scope of this document. The above diagram can assist you in making an informed decision about which types of threats, and threat actors, should be protected against. For commercial public cloud deployments this might include prevention against serious crime. For those deploying private clouds for government use, more stringent protective mechanisms should be in place, including carefully protected facilities and supply chains. In contrast, those standing up basic development or test environments will likely require less restrictive controls (middle of the spectrum).
de: Die präskriptive Verteidigung für jede Form des Angriffs geht über den Rahmen dieses Dokuments hinaus. Das obige Diagramm kann Ihnen helfen, eine fundierte Entscheidung darüber zu treffen, vor welche Arten von Bedrohungen und Bedrohungsakteure geschützt werden sollen. Für kommerzielle öffentliche Cloud-Implementierungen könnte dies die Prävention gegen schweres Verbrechen beinhalten. Für diejenigen, die private Clouds für die staatliche Nutzung einsetzen, sollten strengere Schutzmechanismen vorhanden sein, einschließlich sorgfältig geschützter Einrichtungen und Lieferketten. Im Gegensatz dazu werden diejenigen, die Grundentwicklungs- oder Testumgebungen aufbauen, wahrscheinlich weniger restriktive Kontrollen (Mitte des Spektrums) erfordern.
id: Pertahanan preskriptif untuk setiap bentuk serangan berada di luar cakupan dokumen ini. Diagram di atas dapat membantu Anda dalam membuat keputusan tentang jenis ancaman, dan aktor ancaman, yang harus dilindungi. Untuk penyebaran awan publik komersial, ini mungkin mencakup pencegahan terhadap kejahatan serius. Bagi mereka yang menggunakan awan private untuk penggunaan pemerintah, mekanisme perlindungan yang lebih ketat harus ada, termasuk fasilitas dan rantai pasokan yang dilindungi secara hati-hati. Sebaliknya, mereka yang berdiri di lingkungan pengembangan atau pengujian dasar kemungkinan akan memerlukan kontrol yang kurang ketat (di tengah spektrum).
tr_tr: Her bir saldırı biçimi için kuralcı savunma bu belgenin kapsamı dışındadır. Yukarıdaki şema, hangi tehdit türleri ve tehdit aktörleri hakkında bilgilendirilmiş bir karar vermenize yardımcı olabilir. Ticari kamuya açık bulut konuşlandırmaları için bu, ciddi suçlardan korunmayı içerebilir. Devletin kullanımı için özel bulutlar kullananlar için dikkatle korunan tesisler ve tedarik zincirleri de dahil daha sıkı koruma mekanizmaları olmalıdır. Buna karşın, temel geliştirme veya test ortamlarını ayakta tutanlar muhtemelen daha az kısıtlayıcı kontroller (spektrumun ortasında) gerektirir.

source: The privacy and isolation of data has consistently been cited as the primary barrier to cloud adoption over the past few years. Concerns over who owns data in the cloud and whether the cloud operator can be ultimately trusted as a custodian of this data have been significant issues in the past.
de: Die Privatsphäre und die Isolierung von Daten wurde in den vergangenen Jahren konsequent als die primäre Barriere für die Cloud-Adoption bezeichnet. Sorgen darüber, wer Daten in der Cloud besitzt und ob der Cloud-Operator letztlich als Depotbank dieser Daten vertraut werden kann, war in der Vergangenheit bedeutsame Themen.
id: Privasi dan isolasi data secara konsisten telah disebut sebagai penghalang utama untuk adopsi awan selama beberapa tahun terakhir. Kekhawatiran atas siapa yang memiliki data di awan dan apakah operator awan pada akhirnya dapat dipercaya sebagai penjaga data ini telah menjadi isu penting di masa lalu.
tr_tr: Verilerin gizliliği ve izolasyonu, son yıllarda bulut benimsenmesinin başlıca engeli olarak gösterildi. Bulutta veri sahibi olanın ve bulut operatörünün bu verilerin bir saklama sorumlusu olarak nihai olarak güvenilir olup olmayacağı konusundaki endişeler geçmişte önemli konular olmuştur.

source: The process does not end with a single external audit. Most certifications require continual compliance activities which means repeating the audit process periodically. We recommend integrating automated compliance verification tools into a cloud to ensure that it is compliant at all times. This should be in done in addition to other security monitoring tools. Remember that the goal is both security and compliance. Failing on either of these fronts will significantly complicate future audits.
de: Der Prozess endet nicht mit einem externen Audit. Die meisten Zertifizierungen erfordern kontinuierliche Compliance-Aktivitäten, was bedeutet, dass der Auditprozess regelmäßig wiederholt wird. Wir empfehlen die Integration von automatisierten Compliance-Verifikationstools in eine Cloud, um sicherzustellen, dass sie jederzeit kompatibel ist. Dies sollte zusätzlich zu anderen Sicherheitsüberwachungswerkzeugen erfolgen. Denken Sie daran, dass das Ziel sowohl Sicherheit als auch Compliance ist. Das Fehlen auf einer dieser Fronten wird die zukünftigen Audits erheblich erschweren.
id: Prosesnya tidak diakhiri dengan audit eksternal tunggal. Sebagian besar sertifikasi memerlukan kegiatan kepatuhan terus-menerus yang berarti mengulangi proses audit secara berkala. Sebaiknya integrasikan alat verifikasi kepatuhan otomatis ke dalam awan untuk memastikannya sesuai setiap saat. Ini harus dilakukan selain alat pemantauan keamanan lainnya. Ingat bahwa tujuannya adalah keamanan dan kepatuhan. Gagal pada salah satu front ini akan secara signifikan mempersulit audit di masa depan.
tr_tr: Süreç tek bir harici denetimle bitmiyor. Birçok sertifikada, denetim sürecinin periyodik olarak tekrarlanması anlamına gelen sürekli uyumluluk faaliyetleri gerekir. Otomatik uyumluluk doğrulama araçlarını, her zaman uyumlu olduğundan emin olmak için bir buluta entegre etmenizi öneririz. Bu, diğer güvenlik izleme araçlarına ek olarak yapılmalıdır. Hedefin hem güvenlik hem de uygunluk olduğunu unutmayın. Bu cephelerden birinde başarısızlık halen gelecek denetimleri zorlaştıracaktır.

source: The process of engaging an OpenStack cloud is started through the querying of an API endpoint. While there are different challenges for public and private endpoints, these are high value assets that can pose a significant risk if compromised.
de: Der Weg zu einer OpenStack-Cloud beginnt durch die Abfrage eines API-Endpunkts. Zwar gibt es unterschiedliche Herausforderungen für öffentliche und private Endpunkte, das sind kritische Resourcen, die ein erhebliches Risiko darstellen können, wenn sie kompromittiert werden.
id: Proses melibatkan awan OpenStack dimulai melalui kueri API endpoint. Meskipun ada tantangan yang berbeda untuk endpoint publik dan private, ini adalah aset bernilai tinggi yang dapat menimbulkan risiko signifikan jika dikompromikan.
tr_tr: OpenStack bulut ortamına başlamak, API uç noktalarına sorgu atmaktan geçer. Genel ve özel uç noktalarının farklı zorlukları olduğu gibi, bunlar kötüye kullanıldığında büyük bir risk taşıyacak değerli verilerdir.

source: The protocol used
de: Das verwendete Protokoll
id: Protokol yang digunakan
tr_tr: Kullanılan protokol

source: The public security domain is an entirely untrusted area of the cloud infrastructure. It can refer to the Internet as a whole or simply to networks over which you have no authority. Any data that transits this domain with confidentiality or integrity requirements should be protected using compensating controls.
de: Die öffentliche Sicherheitsdomäne ist ein vollständig nicht vertrauenswürdiger Bereich der Cloud-Infrastruktur. Es kann sich auf das Internet als Ganzes beziehen oder einfach auf Netzwerke, über die Sie keine Autorität haben. Alle Daten, die diese Domain mit Vertraulichkeit oder Integritätsanforderungen überträgt, sollten mit Kompensationskontrollen geschützt werden.
id: Domain keamanan publik adalah wilayah yang sepenuhnya tidak dipercaya dari infrastruktur awan. Ini bisa merujuk ke Internet secara keseluruhan atau hanya ke jaringan tempat Anda tidak memiliki otoritas. Setiap data yang transit domain ini dengan persyaratan kerahasiaan atau integritas harus dilindungi dengan menggunakan kontrol kompensasi.
tr_tr: Kamu güvenliği alanı, bulut altyapısının tamamen güvenilmeyen bir alandır. Internet'i bir bütün olarak veya sadece üzerinde yetkisi olmayan şebekelere yönlendirir. Bu alanı gizlilik veya bütünlük gereklilikleriyle geçiren veriler telafi eden kontroller kullanılarak korunmalıdır.

source: The purpose of an architecture page is to document the architecture, purpose and security controls of a service or project. It should document the best practice deployment of that project.
de: Der Zweck einer Architektur-Seite ist es, die Architektur, Zweck und Sicherheitskontrollen eines Dienstes oder Projekts zu dokumentieren. Es sollte den Best Practice-Einsatz dieses Projekts dokumentieren.
id: Tujuan dari halaman arsitektur adalah untuk mendokumentasikan kontrol arsitektur, tujuan dan keamanan suatu layanan atau proyek. Ini harus mendokumentasikan penyebaran praktik terbaik dari proyek itu.
tr_tr: Bir mimari sayfasının amacı, bir hizmetin veya projenin mimari, amaç ve güvenlik kontrollerini belgelemektir. Bu proje için en iyi uygulama dağıtımını belgelemelidir.
