Repository: openstack/security-doc
Catalog: security-guide/source/locale/*/LC_MESSAGES/security-guide.po
Languages: de, id, tr_tr

source: Clients' configuration data for authentication and authorization can be stored by :ref:`security services <shared_fs_security_services>`. Such protocols as LDAP, Kerberos, or Microsoft Active Directory authentication service can be configured and used.
de: Die Konfigurationsdaten der Clients für die Authentifizierung und die Autorisierung können gespeichert werden durch :ref:`security services <shared_fs_security_services>` Solche Protokolle wie LDAP-, Kerberos- oder Microsoft Active Directory-Authentifizierungsdienst können konfiguriert und verwendet werden.
id: Data konfigurasi klien untuk otentikasi dan otorisasi dapat disimpan oleh :ref:`security services <shared_fs_security_services>`. Protokol seperti layanan otentikasi LDAP, Kerberos, atau Microsoft Active Directory dapat dikonfigurasi dan digunakan.
tr_tr: Kimlik doğrulama ve yetkilendirme için müşterilerin yapılandırma verileri :ref: `güvenlik servisleri <shared_fs_security_services>` tarafından saklanabilir. LDAP, Kerberos veya Microsoft Active Directory kimlik doğrulama servisi gibi protokoller yapılandırılabilir ve kullanılabilir.

source: Cloud admin
de: Cloud-Administrator
tr_tr: Bulut yöneticisi

source: Cloud administrators must define a user with the role of admin for each service, as described in the `OpenStack Administrator Guide <https://docs.openstack.org/admin-guide/index.html>`__. This service account provides the service with the authorization to authenticate users.
de: Cloud-Administratoren müssen einen Benutzer mit der Rolle von admin für jeden Dienst definieren, wie im `OpenStack Administrator Guide beschrieben <https://docs.openstack.org/admin-guide/index.html>`__. Dieses Dienstkonto stellt den Dienst mit der Berechtigung zur Authentifizierung von Benutzern zur Verfügung.
id: Administrator awan harus menentukan pengguna dengan peran admin untuk setiap layanan, seperti yang dijelaskan di `OpenStack Administrator Guide <https://docs.openstack.org/admin-guide/index.html>`__. Akun layanan ini menyediakan layanan dengan otorisasi untuk mengotentikasi pengguna.
tr_tr: Bulut yöneticileri, `OpenStack Yönetici Kılavuzu <https://docs.openstack.org/admin-guide/index.html>`__ 'de tanımlandığı gibi, her servis için yönetici rolü olan bir kullanıcı tanımlamalıdır. Bu servis hesabı, servisi kullanıcıları kimlik doğrulaması için yetkilendirerek sağlar.

source: Cloud administrators will use the administrative APIs to manage resource quotas.
de: Cloud-Administratoren werden die administrativen APIs verwenden, um Ressourcenquoten zu verwalten.
id: Cloud administrator akan menggunakan API administratif untuk mengelola kuota sumber daya.
tr_tr: Bulut yöneticileri kaynak kotalarını yönetmek için yönetimsel API'leri kullanır.

source: Cloud types
de: Cloud-Typen
id: Tipe awan
tr_tr: Bulut türleri

source: Cloud user
de: Cloud-Benutzer
tr_tr: Bulut kullanıcısı

source: Clouds without stringent compliance requirements for written documentation might benefit from having a Configuration Management Database (CMDB). CMDBs are normally used for hardware asset tracking and overall life-cycle management. By leveraging a CMDB, an organization can quickly identify cloud infrastructure hardware such as compute nodes, storage nodes, or network devices. A CMDB can assist in identifying assets that exist on the network which may have vulnerabilities due to inadequate maintenance, inadequate protection, or being displaced and forgotten. An OpenStack provisioning system can provide some basic CMDB functions if the underlying hardware supports the necessary auto-discovery features.
de: Clouds ohne strenge Compliance-Anforderungen für die schriftliche Dokumentation können von einer Configuration Management Database (CMDB) profitieren. CMDBs werden normalerweise für die Hardware-Asset-Tracking und das gesamte Life-Cycle-Management verwendet. Durch die Nutzung einer CMDB kann eine Organisation schnell Cloud-Infrastruktur-Hardware wie Compute-Knoten, Speicherknoten oder Netzwerkgeräte identifizieren. Ein CMDB kann bei der Identifizierung von Vermögenswerten, die im Netzwerk vorhanden sind, helfen, die aufgrund unzureichender Wartung, unzureichendem Schutz oder Verschiebung und Vergessen von Schwachstellen auftreten können. Ein OpenStack-Provisioning-System kann einige grundlegende CMDB-Funktionen bereitstellen, wenn die zugrunde liegende Hardware die notwendigen Auto-Discovery-Funktionen unterstützt.
id: Awan (Cloud) tanpa persyaratan kepatuhan yang ketat untuk dokumentasi tertulis mungkin akan mendapat manfaat dari memiliki Configuration Management Database (CMDB). CMDB biasanya digunakan untuk pelacakan aset perangkat keras dan pengelolaan siklus hidup secara keseluruhan. Dengan memanfaatkan CMDB, sebuah organisasi dapat dengan cepat mengidentifikasi perangkat keras infrastruktur awan seperti komputasi node, node penyimpanan, atau perangkat jaringan. CMDB dapat membantu mengidentifikasi aset yang ada pada jaringan yang mungkin memiliki kerentanan karena pemeliharaan yang tidak memadai, perlindungan yang tidak memadai, atau dipindahkan dan dilupakan. Sistem provisioning OpenStack dapat menyediakan beberapa fungsi dasar CMDB jika perangkat keras yang mendasari mendukung fitur penemuan otomatis yang diperlukan.

source: Cody Bunch is a Private Cloud architect with Rackspace. Cody has co-authored an update to "The OpenStack Cookbook" as well as books on VMware automation.
de: Cody Bunch ist ein Private Cloud Architekt mit Rackspace. Cody hat ein Update zu "The OpenStack Cookbook" sowie Bücher über VMware Automation verfasst.
id: Cody Bunch adalah arsitek Private Cloud dengan Rackspace. Cody telah turut menulis pembaruan untuk "The OpenStack Cookbook" dan juga buku tentang otomatisasi VMware.
tr_tr: Cody Bunch, Rackspace ile Özel Bulut mimarı. Cody, "The OpenStack Cookbook" a ait bir güncellemenin yanı sıra VMware otomasyonu üzerine kitaplar da hazırladı.

source: Collection of containers; not user accounts or authentication. Which users are associated with the account and how they may access it depends on the authentication system used. See :ref:`Object_Storage_authentication`.
de: Sammlung von Containern; nicht Benutzerkonten oder Authentifizierung. Welche Benutzer mit dem Konto verknüpft sind und wie sie darauf zugreifen können, hängt vom verwendeten Authentifizierungssystem ab. Siehe :ref:`Object_Storage_authentication`.
id: Koleksi kontainer; bukan akun pengguna atau autentikasi. Pengguna mana yang terkait dengan akun dan bagaimana mereka dapat mengaksesnya bergantung pada sistem autentikasi yang digunakan. Lihat :ref: `Object_Storage_authentication`.
tr_tr: Kapsayıcıların koleksiyonu; kullanıcı hesapları veya kimlik doğrulaması değil. Hangi kullanıcılar hesapla ilişkilendirilir ve kullanıcılara nasıl erişebildikleri, kullanılan kimlik doğrulama sistemine bağlıdır. Bakınız :ref:`Object_Storage_authentication`.

source: Collection of objects. Metadata on the container is available for ACLs. The meaning of ACLs is dependent on the authentication system used.
de: Sammlung von Objekten. Metadaten auf dem Container sind für ACLs verfügbar. Die Bedeutung von ACLs hängt vom verwendeten Authentifizierungssystem ab.
id: Koleksi obyek. Metadata pada kontainer tersedia untuk ACL. Arti ACL tergantung pada sistem otentikasi yang digunakan.
tr_tr: Nesnelerin toplanması. Kapsayıcıdaki metaveriler, ACL'ler için kullanılabilir. ACL'lerin anlamı kullanılan doğrulama sistemine bağlıdır.

source: Combining configuration management and security auditing tools creates a powerful combination. The auditing tools will highlight deployment concerns. And the configuration management tools simplify the process of changing each system to address the audit concerns. Used together in this fashion, these tools help to maintain a cloud that satisfies security requirements ranging from basic hardening to compliance validation.
de: Die Kombination von Konfigurationsmanagement und Security Auditing Tools schafft eine leistungsstarke Kombination. Die Audit-Tools werden die Einsatzbedürfnisse hervorheben. Und die Konfigurations-Management-Tools vereinfachen den Prozess der Änderung jedes Systems, um die Prüfungsfragen zu adressieren. Auf diese Weise zusammengebracht, helfen diese Werkzeuge, eine Cloud zu pflegen, die die Sicherheitsanforderungen von der Grundhärtung bis zur Compliance-Validierung erfüllt.
id: Menggabungkan alat manajemen konfigurasi dan keamanan audit menciptakan kombinasi yang hebat. Alat audit akan menyoroti masalah penerapan. Dan alat manajemen konfigurasi menyederhanakan proses perubahan setiap sistem untuk mengatasi masalah audit. Digunakan bersamaan dengan cara ini, alat ini membantu menjaga awan yang memenuhi persyaratan keamanan mulai dari pengerasan (hardening) dasar sampai validasi kepatuhan.
tr_tr: Yapılandırma yönetimini ve güvenlik denetim araçlarını birleştirmek, güçlü bir kombinasyon oluşturur. Denetim araçları, dağıtım endişelerini vurgulayacaktır. Yapılandırma yönetimi araçları, denetim endişelerini gidermek için her bir sistemin değiştirilme sürecini basitleştirir. Bu araçlar birlikte kullanıldığında bu araçlar, temel güvenlik zorunluluğundan uygunluğun doğrulanmasına kadar değişen güvenlik gereksinimlerini karşılayan bir bulutun korunmasına yardımcı olur.

source: Command line interface to interact with the Shared File Systems service via ``manila-api`` and also a Python module to interact programmatically with the Shared File Systems service.
de: Befehlszeilenschnittstelle, um mit dem Shared File Systems Service über `` manila-api``und auch ein Python-Modul zu interagieren, um programmgesteuert mit dem Shared File Systems Service zu interagieren.
id: Antarmuka command line untuk berinteraksi dengan layanan Shared File Systems melalui ``manila-api`` dan juga modul Python untuk berinteraksi secara terprogram dengan layanan Shared File Systems.
tr_tr: ``manila-api`` yoluyla Paylaşımlı Dosya Sistemleri servisiyle ve programlı olarak Paylaşımlı Dosya Sistemleri servisiyle etkileşime giren bir Python modülü ile etkileşim kurmak için komut satırı arabirimi.

source: Commercial standards
de: Gewerbliche Standards
id: Standar komersial
tr_tr: Kurumsal standartlar

source: Common Criteria
de: Gemeinsame Kriterien
id: Kriteria Umum
tr_tr: Ortak Kriter

source: Common Criteria is an internationally standardized software evaluation process, used by governments and commercial companies to validate software technologies perform as advertised. In the government sector, NSTISSP No. 11 mandates that U.S. Government agencies only procure software which has been Common Criteria certified, a policy which has been in place since July 2002.
de: Common Criteria ist ein international standardisierter Software-Evaluierungsprozess, der von Regierungen und kommerziellen Unternehmen genutzt wird, um Software-Technologien zu validieren, wie beworben. Im Regierungssektor beauftragt NSTISSP Nr. 11, dass US-Regierungsbehörden nur Software bescheinigen, die Common Criteria zertifiziert wurde, eine Politik, die seit Juli 2002 stattfindet.
id: Kriteria umum adalah proses evaluasi perangkat lunak yang distandarkan secara internasional, yang digunakan oleh pemerintah dan perusahaan komersial untuk memvalidasi kinerja teknologi perangkat lunak seperti yang diiklankan. Di sektor pemerintah, NSTISSP No. 11 mengamanatkan bahwa instansi Pemerintah A.S. hanya menyediakan perangkat lunak yang telah disertifikasi oleh Common Criteria (kriteria umum), sebuah kebijakan yang telah ada sejak Juli 2002.
tr_tr: Ortak Ölçütler, hükümetler ve ticari şirketler tarafından yazılım teknolojilerinin reklamını yaptığını doğrulamak için kullanılan, uluslararası düzeyde standartlaştırılmış bir yazılım değerlendirme sürecidir. Devlet sektöründe NSTISSP No. 11, ABD Devlet kurumlarının yalnızca Temmuz 2002'den beri yürürlükte olan bir politika olan Ortak Ölçütler sertifikalı bir yazılım tedarik etmesini zorunlu kılar.

source: Common control frameworks
de: Gemeinsame Kontrollrahmen
id: Kerangka kerja kontrol yang umum
tr_tr: Yaygın kontrol çatıları

source: Common criteria
de: Gemeinsame Kriterien
id: Kriteria umum (Common Criteria)
tr_tr: Yaygın kıstaslar

source: Common feature that applications use to provide users a convenience is to cache the password locally in the browser (on the client machine) and having it 'pre-typed' in all subsequent requests. While this feature can be perceived as extremely friendly for the average user, at the same time, it introduces a flaw, as the user account becomes easily accessible to anyone that uses the same account on the client machine and thus may lead to compromise of the user account.
de: Gemeinsames Merkmal, das Anwendungen verwenden, um den Benutzern eine Bequemlichkeit zu bieten, besteht darin, das Passwort lokal im Browser (auf dem Client-Rechner) zwischenzuspeichern und es in allen nachfolgenden Anfragen vorangestellt zu haben. Während diese Funktion als äußerst freundlich für den durchschnittlichen Benutzer wahrgenommen werden kann, führt sie gleichzeitig einen Fehler ein, da das Benutzerkonto für jedermann, der das gleiche Konto auf dem Clientcomputer verwendet, leicht zugänglich ist und somit zu Kompromissen des Benutzerkonto.
id: Fitur umum yang digunakan untuk memberikan kenyamanan bagi pengguna adalah meng-cache kata sandi secara lokal di browser (di mesin klien) dan memilikinya 'pre-typed'' di semua permintaan berikutnya. Meskipun fitur ini dapat dianggap sangat ramah bagi pengguna rata-rata, pada saat bersamaan, ia memperkenalkan kekurangan, karena akun pengguna mudah diakses oleh siapa saja yang menggunakan akun yang sama di mesin klien dan karenanya dapat menyebabkan kompromi terhadap akun pengguna.
tr_tr: Uygulamaların kullanıcılara kolaylık sağlamak için kullandığı ortak özellik parolanın yerel olarak tarayıcıda (istemci makinesinde) önbellekte tutulması ve sonraki tüm isteklerde 'önceden yazılmış' olmasıdır. Bu özellik ortalama kullanıcı için son derece samimi olarak algılanabilirken aynı zamanda kullanıcı hesabına aynı hesabı kullanan istemci makinede kullanıcı hesabı kolayca erişilebileceği için bir kusur ortaya koymaktadır ve bu nedenle kullanıcı hesabının ele geçirilmesine sebep olabilir.

source: Common solutions for providing rate-limiting are :term:`Nginx`, HAProxy, OpenRepose, or Apache Modules such as mod_ratelimit, mod_qos, or mod_security.
de: Gemeinsame Lösungen für die Bereitstellung von Ratenbegrenzungen sind :term:`Nginx`, HAProxy, OpenRepose oder Apache Module wie mod_ratelimit, mod_qos oder mod_security.
id: Solusi umum untuk memberikan rate-limiting adalah :term:`Nginx`, HAProxy, OpenRepose, atau Modul Apache seperti mod_ratelimit, mod_qos, atau mod_security.
tr_tr: Oran-sınırlama sağlarken yaygın çözümler :term:`Nginx`, HAProxy, OpenRepose, ya da mod_ratelimit, mod_qos, veya mod_security gibi Apache modülleridir.

source: Commonly, implementers add middleware to extend OpenStack's base functionality. We recommend implementers make careful consideration of the potential exposure introduced by the addition of non-standard software components to their HTTP request pipeline.
de: Häufig fügen Implementierer Middleware hinzu, um die Basisfunktionalität von OpenStack zu erweitern. Wir empfehlen, dass die Implementierer die potenzielle Exposition sorgfältig berücksichtigen, die durch die Hinzufügung von Nicht-Standard-Softwarekomponenten in ihre HTTP-Anforderungspipeline eingeführt wird.
id: Umumnya, pelaksana menambahkan middleware untuk memperluas fungsionalitas dasar OpenStack. Sebaiknya pelaksana membuat pertimbangan cermat terhadap paparan potensial yang diperkenalkan oleh penambahan komponen perangkat lunak non-standar ke pipeline permintaan HTTP mereka.
tr_tr: Genellikle, uygulayıcılar OpenStack'in temel işlevselliğini genişletmek için orta katman ekler. Uygulayıcıları, standart olmayan yazılım bileşenlerini HTTP istek hattına ekleyerek ortaya çıkabilecek potansiyel maruziyeti dikkatle incelemenizi öneririz.

source: Compared to PKI and PKIZ tokens, fernet tokens are smaller in size; usually kept under a 250 byte limit. For PKI and PKIZ tokens, bigger service catalogs will result in longer token lengths. This pattern does not exist with fernet tokens because the contents of the encrypted payload is kept to minimum.
de: Im Vergleich zu PKI- und PKIZ-Token sind Farnet-Token kleiner; in der Regel unter einer 250-Byte-Grenze gehalten. Für PKI- und PKIZ-Token werden größere Servicekataloge zu längeren Token-Längen führen. Dieses Muster existiert nicht mit Fernet-Token, da der Inhalt der verschlüsselten Nutzlast auf Minimum gehalten wird.
tr_tr: PKI ve PKIZ belirteçleriyle karşılaştırıldığında, fernet belirteçleri daha küçük boyuttadır; genellikle 250 bayt sınırı altında tutulur. PKI ve PKIZ belirteçleri için, daha büyük servis katalogları daha uzun belirteç uzunluklarıyla sonuçlanır. Şifreli yükün içeriği minimum tutulduğu için, bu model fernet belirteçlerinde mevcut değildir.

source: Compartmentalize
de: Kompartimentieren
id: Kompartementalisasi
tr_tr: Bölümler ayırmak

source: Compiler hardening makes it more difficult to attack the QEMU process. However, if an attacker does succeed, you want to limit the impact of the attack. Mandatory access controls accomplish this by restricting the privileges on QEMU process to only what is needed. This can be accomplished by using sVirt, SELinux, or AppArmor. When using sVirt, SELinux is configured to run each QEMU process under a separate security context. AppArmor can be configured to provide similar functionality. We provide more details on sVirt and instance isolation in the section below :ref:`hardening-the-virtualization-layers-svirt-selinux-and-virtualization`.
de: Compiler-Hardening macht es schwieriger, den QEMU-Prozess anzugreifen. Allerdings, wenn ein Angreifer erfolgreich ist, wollen Sie die Auswirkungen des Angriffs begrenzen. Obligatorische Zugriffskontrollen führen dies durch die Beschränkung der Privilegien auf den QEMU-Prozess nur auf das, was benötigt wird. Dies kann durch die Verwendung von sVirt, SELinux oder AppArmor erreicht werden. Bei der Verwendung von sVirt ist SELinux so konfiguriert, dass jeder QEMU-Prozess unter einem separaten Sicherheitskontext ausgeführt wird. AppArmor kann so konfiguriert werden, dass es eine ähnliche Funktionalität bietet. Weitere Informationen über sVirt und Instanzisolation finden Sie im folgenden Abschnitt :ref:`hardening-the-virtualization-layers-svirt-selinux-and-virtualization`.
id: Pengerasan kompilator membuatnya lebih sulit untuk menyerang proses QEMU. Namun, jika penyerang berhasil, Anda ingin membatasi dampak serangan tersebut. Kontrol akses wajib melakukan hal ini dengan membatasi hak istimewa pada proses QEMU hanya dengan apa yang dibutuhkan. Hal ini bisa dilakukan dengan menggunakan sVirt, SELinux, atau AppArmor. Saat menggunakan sVirt, SELinux dikonfigurasi untuk menjalankan setiap proses QEMU di bawah konteks keamanan yang terpisah. AppArmor dapat dikonfigurasi untuk menyediakan fungsionalitas serupa. Kami memberikan rincian lebih lanjut tentang isolasi sVirt dan instance di bagian di bawah ini :ref:`hardening-the-virtualization-layers-svirt-selinux-and-virtualization`.
tr_tr: Derleyici sıkılaştırması, QEMU işlemine saldırmanın daha zor olmasını sağlar. Ancak, bir saldırgan başarılı olursa saldırının etkisini sınırlamak istersiniz. Zorunlu erişim denetimleri, QEMU işlemindeki ayrıcalıkların yalnızca ihtiyaç duyulan şeye kısıtlanmasıyla bunu başarır. Bu, sVirt, SELinux veya AppArmor kullanılarak başarılabilir. SVirt'i kullanırken, SELinux her QEMU işlemini ayrı bir güvenlik bağlamında yürütmek üzere yapılandırılmıştır. AppArmor, benzer işlevler sağlamak üzere yapılandırılabilir. Aşağıdaki bölümde sVirt ve örnek izolasyonu hakkında daha fazla ayrıntı var :ref:`hardening-the-virtualization-layers-svirt-selinux-and-virtualization`.

source: Compliance activities
de: Compliance-Aktivitäten
id: Aktivitas Kepatuhan
tr_tr: Uyum faaliyetleri

source: Compliance and security are not exclusive, and must be addressed together. OpenStack deployments are unlikely to satisfy compliance requirements without security hardening. The listing below provides an OpenStack architect foundational knowledge and guidance to achieve compliance against commercial and government certifications and standards.
de: Compliance und Sicherheit sind nicht exklusiv und müssen gemeinsam angesprochen werden. OpenStack-Implementierungen sind unwahrscheinlich, dass sie Compliance-Anforderungen ohne Security Hardening erfüllen. Die untenstehende Auflistung bietet dem OpenStack Architekten fundamentale Kenntnisse und Anleitungen, um die Einhaltung von Handels- und Regierungszertifikaten und -normen zu erreichen.
id: Kepatuhan dan keamanan tidak eksklusif, dan harus diatasi bersama. Penerapan OpenStack tidak mungkin memenuhi persyaratan kepatuhan tanpa pengerasan keamanan. Daftar di bawah ini memberi pengetahuan dan panduan dasar bagi para pendiri OpenStack untuk mendapatkan kepatuhan terhadap standar dan sertifikasi pemerintah dan komersial.
tr_tr: Uyum ve güvenlik birbirinden ayrı değildir ve birlikte ele alınmalıdır. OpenStack dağıtımları güvenlik zorlaması olmadan uyumluluk gereksinimlerini karşılamak pek olası değildir. Aşağıdaki listede, ticari ve devlet sertifikalarına ve standartlarına uyumu sağlamak için bir OpenStack mimarı için temel bilgi ve rehberlik bulunmaktadır.

source: Compliance overview
de: Compliance-Übersicht
id: Ikhtisar Kepatuhan
tr_tr: Uyumluluk genel görünümü

source: Components
de: Komponenten
id: Komponen
tr_tr: Bileşenler

source: Components, services, and applications within the OpenStack ecosystem or dependencies of OpenStack are implemented or can be configured to use TLS libraries. The TLS and HTTP services within OpenStack are typically implemented using OpenSSL which has a module that has been validated for FIPS 140-2. However, keep in mind that each application or service can still introduce weaknesses in how they use the OpenSSL libraries.
de: Komponenten, Services und Anwendungen innerhalb des OpenStack-Ökosystems oder Abhängigkeiten von OpenStack werden implementiert oder können für die Verwendung von TLS-Bibliotheken konfiguriert werden. Die TLS- und HTTP-Dienste in OpenStack werden in der Regel mit OpenSSL implementiert, die über ein Modul verfügt, das für FIPS 140-2 validiert wurde. Beachten Sie jedoch, dass jede Anwendung oder jede Dienstleistung immer noch Schwächen einführen kann, wie sie die OpenSSL-Bibliotheken verwenden.
id: Komponen, layanan, dan aplikasi dalam ekosistem OpenStack atau dependensi OpenStack diimplementasikan atau dapat dikonfigurasi untuk menggunakan perpustakaan TLS. Layanan TLS dan HTTP dalam OpenStack biasanya diimplementasikan dengan menggunakan OpenSSL yang memiliki modul yang telah divalidasi untuk FIPS 140-2. Namun, perlu diingat bahwa setiap aplikasi atau layanan masih dapat mengenalkan kelemahan dalam bagaimana mereka menggunakan perpustakaan OpenSSL.
tr_tr: OpenStack ekosistemindeki bileşenler, servisler ve uygulamalar veya OpenStack'in bağımlılıkları uygulanır veya TLS kitaplıklarını kullanacak şekilde yapılandırılabilir. OpenStack içindeki TLS ve HTTP servisleri genellikle FIPS 140-2 için doğrulanmış bir modülü olan OpenSSL kullanılarak gerçekleştirilir. Bununla birlikte, her uygulamanın veya servisin hala OpenSSL kitaplıklarını kullandıklarında zayıf yönleri olabileceğini unutmayın.
