Repository: openstack/security-doc
Catalog: security-guide/source/locale/*/LC_MESSAGES/security-guide.po
Languages: de, id, tr_tr

source: The Fieldwork phase is the most visible portion of the audit. This is where the auditors are onsite, interviewing the control owners, documenting the controls that are in place, and identifying any issues. It is important to note that the auditors will use a two part process for evaluating the controls in place. The first part is evaluating the design effectiveness of the control. This is where the auditor will evaluate whether the control is capable of effectively preventing or detecting and correcting weaknesses and deficiencies. A control must pass this test to be evaluated in the second phase. This is because with a control that is designed ineffectually, there is no point considering whether it is operating effectively. The second part is operational effectiveness. Operational effectiveness testing will determine how the control was applied, the consistency with which the control was applied and by whom or by what means the control was applied. A control may depend upon other controls (indirect controls) and, if they do, additional evidence that demonstrates the operating effectiveness of those indirect controls may be required for the auditor to determine the overall operating effectiveness of the control.
de: Die Fieldwork-Phase ist der sichtbarste Teil des Audits. Hier sind die Auditoren vor Ort, interviewen die Kontrollbesitzer, dokumentieren die Kontrollen, die vorhanden sind, und die Identifizierung von Problemen. Es ist wichtig zu beachten, dass die Abschlussprüfer ein zweistufiges Verfahren zur Bewertung der vorhandenen Kontrollen verwenden werden. Der erste Teil bewertet die Designwirksamkeit der Kontrolle. Hier wird der Prüfer beurteilen, ob die Kontrolle in der Lage ist, Schwächen und Mängel wirksam zu verhindern oder zu erkennen und zu korrigieren. Eine Kontrolle muss diesen Test in der zweiten Phase auswerten. Dies ist, weil mit einer Kontrolle, die ineffizient konzipiert ist, gibt es keinen Sinn zu prüfen, ob es effektiv funktioniert. Der zweite Teil ist die operative Wirksamkeit. Operative Wirksamkeitsprüfungen bestimmen, wie die Kontrolle angewendet wurde, die Konsistenz, mit der die Kontrolle angewendet wurde und von wem oder durch welche Mittel die Kontrolle angewandt wurde. Eine Kontrolle kann von anderen Kontrollen abhängen (indirekte Kontrollen), und wenn sie dies tun, können zusätzliche Beweise für die operative Wirksamkeit dieser indirekten Kontrollen erforderlich sein, damit der Abschlussprüfer die Gesamtbetriebswirksamkeit der Kontrolle festlegt.
id: Tahap Fieldwork adalah bagian audit yang paling terlihat. Di sinilah auditor berada di tempat, mewawancarai pemilik kontrol, mendokumentasikan kontrol yang ada, dan mengidentifikasi masalah apa pun. Penting untuk dicatat bahwa auditor akan menggunakan dua bagian proses untuk mengevaluasi kontrol yang ada. Bagian pertama adalah mengevaluasi keefektifan desain kontrol. Di sinilah auditor akan mengevaluasi apakah pengendalian mampu secara efektif mencegah atau mendeteksi dan memperbaiki kelemahan dan kekurangan. Suatu kontrol harus lulus uji ini untuk dievaluasi pada tahap kedua. Ini karena dengan kontrol yang dirancang tidak efektif, tidak ada gunanya mempertimbangkan apakah operasi itu berjalan efektif. Bagian kedua adalah efektivitas operasional. Pengujian efektivitas operasional akan menentukan bagaimana kontrol diterapkan, konsistensi pengendalian diterapkan dan oleh siapa atau dengan cara apa kontrol diterapkan. Pengendalian mungkin bergantung pada kontrol lain (kontrol tidak langsung) dan, jika memang, bukti tambahan yang menunjukkan efektivitas operasi dari kontrol tidak langsung tersebut mungkin diperlukan auditor untuk menentukan keseluruhan efektivitas operasi pengendalian.
tr_tr: Saha çalışması aşaması, denetimin en görünür kısmıdır. Burası denetçilerin yerinde oldukları, denetim sahiplerine gözden geçirme yaptıkları, yerinde denetimleri belgeleyen ve herhangi bir sorunu tanımlayan yerdir. Denetçilerin denetimleri yerinde değerlendirmek için iki parçalı bir süreç kullanacaklarına dikkat etmek önemlidir. Birinci bölüm, kontrolün tasarım etkinliğini değerlendirmektir. Burası denetçinin, kontrolün zayıflıkları ve eksiklikleri etkili bir şekilde önleyebileceğini veya algılayıp düzeltebildiğini değerlendireceği yerdir. Bir kontrol, bu testi ikinci aşamada değerlendirilmek üzere geçmelidir. Bunun nedeni, etkisiz olarak tasarlanmış bir kontrolle etkin bir şekilde çalışıp çalışmadığına bakmaksızın bir nokta yoktur. İkinci bölüm operasyonel etkinliktir. Operasyonel etkinlik testi, kontrolün nasıl uygulandığını, kontrolün uygulandığı tutarlılığı ve kontrolü kimin veya hangi yöntemle uygulandığını belirleyecektir. Bir kontrol, diğer kontrollere (dolaylı kontroller) bağlı olabilir ve eğer yaparsa, bu dolaylı kontrollerin işletme verimliliğini gösteren ilave kanıtlar, denetçinin kontrolün genel işletme etkinliğini belirlemesi gerekebilir.

source: The Generic driver we use in example does not support any of the security services, thus with NFS shared file system protocol we can grant access only through the IP address:
de: Der generische Treiber, den wir im Beispiel verwenden, unterstützt keine der Sicherheitsdienste, also mit dem NFS-Dateisystemprotokoll können wir nur über die IP-Adresse Zugriff gewähren:
id: Driver Generik yang kami gunakan misalnya tidak mendukung layanan keamanan apa pun, sehingga dengan protokol sistem file shared NFS kami dapat memberikan akses hanya melalui alamat IP:
tr_tr: Örnek olarak kullandığımız genel sürücü herhangi bir güvenlik servisini desteklemez, dolayısıyla NFS paylaşımlı dosya sistemi protokolüyle yalnızca IP adresi üzerinden erişim izni verebiliriz:

source: The Health Insurance Portability and Accountability Act (HIPAA) is a United States congressional act that governs the collection, storage, use and destruction of patient health records. The act states that Protected Health Information (PHI) must be rendered "unusable, unreadable, or indecipherable" to unauthorized persons and that encryption for data 'at-rest' and 'inflight' should be addressed.
de: Der Health Insurance Portability and Accountability Act (HIPAA) ist ein Kongressgesetz der Vereinigten Staaten, das die Erhebung, Speicherung, Nutzung und Zerstörung von Patientengesundheitsakten regelt. Das Gesetz besagt, dass geschützte Gesundheitsinformationen (PHI) für unberechtigte Personen unbrauchbar, unlesbar oder unentzifferbar gemacht werden müssen und dass die Verschlüsselung für Daten "atrest" und "inflight" angegangen werden sollte.
id: The Health Insurance Portability and Accountability Act (HIPAA) adalah keputusan kongres Amerika Serikat yang mengatur pengumpulan, penyimpanan, penggunaan dan penghancuran catatan kesehatan pasien. Keputusan tersebut menyatakan bahwa Protected Health Information (PHI) harus diberikan "unusable, unreadable, or indecipherable" kepada orang-orang yang tidak berwenang dan bahwa enkripsi untuk data 'at-rest' dan 'inflight' harus ditangani.
tr_tr: Sağlık Sigortası Taşınabilirliği ve Hesap Verebilirlik Yasası (HIPAA), hasta sağlık kayıtlarının toplanmasını, depolanmasını, kullanılmasını ve tahrip edilmesini yöneten Birleşik Devletler Kongresi yasasıdır. Yasaya göre Korunan Sağlık Bilgisi (PHI), yetkisiz kişilere "kullanılamaz, okunamıyor veya okunaksız hale getirilmelidir" ve verilerin "dinlenme" ve "uçuş için" şifrelenmesi için ele alınmalıdır.

source: The IOMMU feature is marketed as VT-d by Intel and AMD-Vi by AMD.
de: Die IOMMU-Funktion wird von Intel und AMD-Vi von AMD als VT-d vermarktet.
id: Fitur IOMMU dipasarkan sebagai VT-d oleh Intel dan AMD-Vi oleh AMD.
tr_tr: IOMMU özelliği Intel tarafından VT-d, AMD tarafından AMD-Vi olarak pazarlanmaktadır.

source: The ISO 27001 Information Security standard and certification has been used for many years to evaluate and distinguish an organizations alignment with information Security best practices. The standard is comprised of two parts: Mandatory Clauses that define the Information Security Management System (ISMS) and Annex A which contains a list of controls organized by domain.
de: Die ISO 27001 Information Security Standard und Zertifizierung wurde seit vielen Jahren verwendet, um zu bewerten und zu unterscheiden, ob eine Organisation mit Informationen zu Security Best Practices ausgerichtet ist. Der Standard besteht aus zwei Teilen: Obligatorische Klauseln, die das Information Security Management System (ISMS) und Anhang A definieren, der eine Liste von Kontrollen enthält, die nach Domänen organisiert sind.
id: Sertifikasi dan standar ISO 27001 Information Security telah digunakan bertahun-tahun untuk mengevaluasi dan membedakan penyelarasan organisasi dengan informasi praktik terbaik keamanan. Standar ini terdiri dari dua bagian: Mandatory Clause yang menetapkan Information Security Management System (ISMS) dan Annex A yang berisi daftar kontrol yang diatur oleh domain.
tr_tr: ISO 27001 Bilgi Güvenliği standardı ve sertifikası, kuruluşların Bilgi En iyi güvenlik uygulamaları ile uyumlaştırmasını değerlendirmek ve ayırmak için uzun yıllardır kullanılmaktadır. Standart, iki bölümden oluşur: Bilgi Güvenliği Yönetim Sistemini (ISMS) tanımlayan Zorunlu Hükümler ve etki alanı tarafından düzenlenen denetimlerin bir listesini içeren Ek A.

source: The ISO/IEC 27001/2 standards replace BS7799-2, and are specifications for an Information Security Management System (ISMS). An ISMS is a comprehensive set of policies and processes that an organization creates and maintains to manage risk to information assets. These risks are based upon the confidentiality, integrity, and availability (CIA) of user information. The CIA security triad has been used as a foundation for much of the chapters in this book.
de: Die ISO/IEC 27001/2-Normen ersetzen BS7799-2 und sind Spezifikationen für ein Information Security Management System (ISMS). Ein ISMS ist eine umfassende Reihe von Richtlinien und Prozessen, die eine Organisation erstellt und verwaltet, um das Risiko für Informationsvermögen zu verwalten. Diese Risiken basieren auf der Vertraulichkeit, Integrität und Verfügbarkeit (CIA) von Benutzerinformationen. Die CIA-Sicherheitstriade wurde als Grundlage für einen Großteil der Kapitel in diesem Buch verwendet.
id: Standar ISO / IEC 27001/2 menggantikan BS7799-2, dan merupakan spesifikasi untuk Information Security Management System (ISMS). ISMS adalah serangkaian kebijakan dan proses yang komprehensif yang diciptakan dan dikelola oleh sebuah organisasi untuk mengelola risiko terhadap aset informasi. Risiko ini didasarkan pada confidentiality, integrity, and availability (CIA) informasi pengguna. Triad keamanan CIA telah digunakan sebagai landasan bagi sebagian besar bab dalam buku ini.
tr_tr: ISO/IEC 27001/2 standartları BS7799-2'nin yerini almış ve bir Bilgi Güvenliği Yönetim Sistemi (ISMS) için şartnamelerdir. Bir ISMS, bir kuruluşun bilgi varlıkları için riski yönetmek için oluşturduğu ve koruduğu kapsamlı bir politika ve süreçler dizisidir. Bu riskler, kullanıcı bilgilerinin gizliliği, bütünlüğü ve kullanılabilirliği (CIA) temel alır. CIA güvenlik üçlüsü bu kitabın pek çok bölümünün temeli olarak kullanılmıştır.

source: The Identity V3 API supports multiple domains. Users of different domains may be represented in different authentication back ends and even have different attributes that must be mapped to a single set of roles and privileges, that are used in the policy definitions to access the various service resources.
de: Die Identity V3 API unterstützt mehrere Domains. Benutzer von verschiedenen Domänen können in verschiedenen Authentifizierungs-Backends dargestellt werden und haben sogar unterschiedliche Attribute, die auf einen einzelnen Satz von Rollen und Berechtigungen abgebildet werden müssen, die in den Richtliniendefinitionen verwendet werden, um auf die verschiedenen Dienstressourcen zuzugreifen.
id: Identity V3 API mendukung beberapa domain. Pengguna domain yang berbeda dapat diwakili dalam otentikasi yang berbeda dan bahkan memiliki atribut yang berbeda yang harus dipetakan ke satu set peran dan hak istimewa, yang digunakan dalam definisi kebijakan untuk mengakses berbagai sumber layanan.
tr_tr: Kimlik V3 API, birden çok alanı destekler. Farklı etki alanlarının kullanıcıları farklı kimlik doğrulama bitiş noktalarında temsil edilebilir ve çeşitli servis kaynaklarına erişmek için ilke tanımlarında kullanılan tek bir rol ve ayrıcalık grubuna eşleştirilmesi gereken farklı niteliklere sahip olabilirler.

source: The Identity service **MUST NOT** be allowed to write to LDAP services used for authentication outside of the OpenStack deployment as this would allow a sufficiently privileged keystone user to make changes to the LDAP directory. This would allow privilege escalation within the wider organization or facilitate unauthorized access to other information and resources. In such a deployment, user provisioning would be out of the realm of the OpenStack deployment.
de: Der Identitätsdienst **DARF NICHT** auf LDAP-Dienste schreiben, die für die Authentifizierung außerhalb der OpenStack-Bereitstellung verwendet werden, da dies einem ausreichend privilegierten Keystone-Benutzer erlauben würde, Änderungen am LDAP-Verzeichnis vorzunehmen. Dies würde eine Privileg-Eskalation innerhalb der größeren Organisation ermöglichen oder den unbefugten Zugriff auf andere Informationen und Ressourcen erleichtern. In einer solchen Bereitstellung wäre die Bereitstellung von Nutzern außerhalb des Bereichs der OpenStack-Installation.
id: Layanan Identity **MUST NOT** diizinkan untuk menulis ke layanan LDAP yang digunakan untuk otentikasi di luar penerapan OpenStack karena hal ini akan memungkinkan keystone user yang memiliki hak istimewa untuk membuat perubahan pada direktori LDAP. Hal ini akan memungkinkan eskalasi hak istimewa di dalam organisasi yang lebih luas atau memfasilitasi akses tidak sah ke informasi dan sumber daya lainnya. Dalam penyebaran seperti itu, user provisioning akan berada di luar wilayah penerapan OpenStack.
tr_tr: Kimlik servisi, OpenStack dağıtımının dışında kimlik doğrulaması için kullanılan LDAP hizmetlerine yazmaya izin *VERİLMEMELİDİR*, ayrıcalıklı bir keystone kullanıcısının LDAP dizininde değişiklikler yapmasına izin vermelidir. Bu, daha geniş bir organizasyonda ayrıcalık yükselmesine izin verecek veya diğer bilgilere ve kaynaklara yetkisiz erişimi kolaylaştıracaktır. Böyle bir dağıtımda, kullanıcı yetkilendirme işlemi OpenStack dağıtımının dışında olur.

source: The Identity service administrator can create as many groups as there are SAML attributes, whatever the mapping calls for.
de: Der Identity Service Administrator kann so viele Gruppen wie SAML Attribute erstellen, was auch immer die Mapping fordert.
tr_tr: Kimlik servisi yöneticisi, haritalama ne olursa olsun, SAML nitelikleri kadar çok grup oluşturabilir.

source: The Identity service can be used for authentication in the Shared File Systems service. See details of the Identity service security in :doc:`../identity` section.
de: Der Identity-Dienst kann für die Authentifizierung im Shared File Systems Service verwendet werden. Siehe Details der Identity Service Security in :doc:`../ identity` Abschnitt.
id: Layanan Identity dapat digunakan untuk otentikasi dalam layanan Shared File Systems. Lihat rincian keamanan layanan Identity di bagian :doc:`../identity`.
tr_tr: Kimlik servisi, Paylaşımlı Dosya Sistemleri servisinde kimlik doğrulama için kullanılabilir. Kimlik hizmeti güvenliği ile ilgili ayrıntılar için :doc:`../identity` bölümüne bakınız.

source: The Identity service can directly provide end-user authentication, or can be configured to use external authentication methods to conform to an organization's security policies and requirements.
de: Der Identity-Dienst kann direkt eine Endbenutzer-Authentifizierung bereitstellen oder kann so konfiguriert werden, dass er externe Authentifizierungsmethoden verwendet, um den Sicherheitsrichtlinien und Anforderungen eines Unternehmens entsprechen zu können.
id: Layanan Identity dapat secara langsung memberikan otentikasi pengguna akhir, atau dapat dikonfigurasi untuk menggunakan metode otentikasi eksternal agar sesuai dengan kebijakan dan persyaratan keamanan organisasi.
tr_tr: Kimlik servisi, son kullanıcının kimlik doğrulamasını doğrudan sağlayabilir veya organizasyonun güvenlik ilkelerine ve gereksinimlerine uymak için harici kimlik doğrulama yöntemleri kullanacak şekilde yapılandırılabilir.

source: The Identity service can store user credentials in an SQL Database, or may use an LDAP-compliant directory server. The Identity database may be separate from databases used by other OpenStack services to reduce the risk of a compromise of the stored credentials.
de: Der Identitätsdienst kann Benutzeranmeldeinformationen in einer SQL-Datenbank speichern oder einen LDAP-kompatiblen Verzeichnisserver verwenden. Die Identitätsdatenbank kann von Datenbanken getrennt sein, die von anderen OpenStack-Diensten verwendet werden, um das Risiko eines Kompromisses der gespeicherten Anmeldeinformationen zu verringern.
id: Layanan Identitas dapat menyimpan kredensial pengguna di Database SQL, atau mungkin menggunakan server direktori LDAP-compliant. Database Identitas mungkin terpisah dari database yang digunakan oleh layanan OpenStack lainnya untuk mengurangi risiko kompromi kredensial yang tersimpan.
tr_tr: Kimlik servisi kullanıcı kimlik bilgilerini bir SQL Veritabanında saklayabilir veya LDAP uyumlu bir dizin sunucusu kullanabilir. Kimlik veritabanı, depolanmış kimlik bilgilerinin ele geçirme riskini azaltmak için diğer OpenStack servisleri tarafından kullanılan veritabanlarından ayrı olabilir.

source: The Identity service catalog should be aware of your internal URLs. While this feature is not utilized by default, it may be leveraged through configuration. Additionally, it should be forward-compatible with expectant changes once this behavior becomes the default.
de: Der Identitätsdienstkatalog sollte sich Ihrer internen URLs bewusst sein. Während dieses Merkmal nicht standardmäßig verwendet wird, kann es durch die Konfiguration genutzt werden. Darüber hinaus sollte es vorwärtskompatibel mit zu erwartenden Änderungen sein, sobald dieses Verhalten zum Standard wird.
id: Katalog layanan identitas harus mengetahui URL internal Anda. Sementara fitur ini tidak digunakan secara default, mungkin leveraged melalui konfigurasi. Selain itu, harus kompatibel dengan perubahan yang harus dilakukan jika perilaku ini menjadi default.
tr_tr: Kimlik servis kataloğunun sizin iç URL'lerinizden haberdar olması gerekiyor. Bu özelliklik öntanımlı olarak gelmemekle fakat yapılandırma ile ayarlanabilir. Ek olarak, bu davranışın öntanımlı olduktan sonra değişiklikler için ileri uyumlu olmalıdır.

source: The Identity service does not provide a method to limit access to accounts after repeated unsuccessful login attempts. A pattern of repetitive failed login attempts is generally an indicator of brute-force attacks (refer to :ref:`introduction_attack_types`). This type of attack is more prevalent in public cloud deployments.
de: Der Identitätsdienst stellt keine Methode zur Verfügung, um den Zugriff auf Konten nach wiederholten erfolglosen Anmeldeversuchen zu begrenzen. Ein Muster von repetitiven fehlgeschlagenen Anmeldeversuchen ist in der Regel ein Indikator für Brute-Force-Angriffe (siehe :ref:`introduction_attack_types`). Diese Art von Angriff ist häufiger in öffentlichen Cloud-Implementierungen.

source: The Identity service supports client authentication for TLS which may be enabled. TLS client authentication provides an additional authentication factor, in addition to the user name and password, that provides greater reliability on user identification. It reduces the risk of unauthorized access when user names and passwords may be compromised. However, there is additional administrative overhead and cost to issue certificates to users that may not be feasible in every deployment.
de: Der Identity Service unterstützt die Client-Authentifizierung für TLS, die aktiviert werden kann. Die TLS-Client-Authentifizierung bietet neben dem Benutzernamen und dem Kennwort einen zusätzlichen Authentifizierungsfaktor, der eine höhere Zuverlässigkeit für die Benutzeridentifizierung bietet. Es verringert das Risiko eines unbefugten Zugriffs, wenn Benutzernamen und Passwörter beeinträchtigt werden können. Allerdings gibt es zusätzliche administrative Overhead und Kosten für die Ausstellung von Zertifikaten an Benutzer, die möglicherweise nicht möglich sind, in jedem Einsatz.
id: Layanan Identitas mendukung otentikasi klien untuk TLS yang mungkin diaktifkan. Otentikasi klien TLS memberikan faktor otentikasi tambahan, selain nama pengguna dan kata sandi, yang memberikan keandalan yang lebih besar pada identifikasi pengguna. Ini mengurangi risiko akses tidak sah saat nama pengguna dan kata sandi dapat dikompromikan. Namun, ada biaya administrasi tambahan dan biaya untuk menerbitkan sertifikat kepada pengguna yang mungkin tidak layak dilakukan di setiap penempatan.
tr_tr: Kimlik servisi, etkinleştirilebilen TLS için istemci kimlik doğrulamasını desteklemektedir. TLS istemci kimlik doğrulaması, kullanıcı kimliği üzerinde daha fazla güvenilirlik sağlayan kullanıcı adı ve parola yanı sıra ek bir doğrulama faktörü sağlar. Kullanıcı adları ve parolalar tehlikeye atıldığında, yetkisiz erişim riskini azaltır. Bununla birlikte, her dağıtımda uygulanması mümkün olmayan sertifikalar için kullanıcılara sertifika vermek için ek yönetim yükü ve maliyet vardır.

source: The Identity service supports the notion of groups and roles. Users belong to groups while a group has a list of roles. OpenStack services reference the roles of the user attempting to access the service. The OpenStack policy enforcer middleware takes into consideration the policy rule associated with each resource then the user's group/roles and association to determine if access is allowed to the requested resource.
de: Der Identitätsdienst unterstützt den Begriff der Gruppen und Rollen. Benutzer gehören zu Gruppen, während eine Gruppe eine Liste von Rollen hat. OpenStack-Dienste verweisen auf die Rollen des Benutzers, die versuchen, auf den Dienst zuzugreifen. Die OpenStack Policy Enforcer Middleware berücksichtigt die Richtlinienregel, die jeder Ressource zugeordnet ist, dann die Gruppe/Rollen und Assoziationen des Benutzers, um festzustellen, ob der Zugriff auf die angeforderte Ressource erlaubt ist.
id: Layanan Identitas mendukung gagasan tentang kelompok dan peran. Pengguna termasuk dalam kelompok sementara sebuah kelompok memiliki daftar peran. Layanan OpenStack merujuk pada peran pengguna yang mencoba mengakses layanan ini. Middleware penegakan kebijakan OpenStack mempertimbangkan aturan kebijakan yang terkait dengan setiap sumber daya, maka kelompok/peran pengguna dan asosiasi menentukan apakah akses diizinkan ke sumber yang diminta.
tr_tr: Kimlik servisi, grupların ve rollerin kavramını desteklemektedir. Kullanıcılar gruplara aitken, bir grup rollerin bir listesine sahiptir. OpenStack servisleri, servise erişmeye çalışan kullanıcının rollerini referans alır. OpenStack ilke uygulayıcı ara katmanı, her kaynağa ilişkin ilke kuralını, ardından kullanıcının grubunu / rollerini ve ilişkilendirmeyi, erişimin istenen kaynağa izin verilip verilmeyeceğini belirlemek için dikkate alır.
