Repository: openstack/security-doc
Catalog: security-guide/source/locale/*/LC_MESSAGES/security-guide.po
Languages: de, id, tr_tr

source: This table illustrates a generic approach to measuring the impact of a vulnerability based on where it occurs in your deployment and the effect. For example, a single level privilege escalation on a Compute API node potentially allows a standard user of the API to escalate to have the same privileges as the root user on the node.
de: Diese Tabelle veranschaulicht einen generischen Ansatz zur Messung der Auswirkungen einer Schwachstelle, basierend darauf, wo sie in Ihrem Einsatz und dem Effekt auftritt. Beispielsweise ermöglicht eine einstufige Privileg-Eskalation auf einem Compute-API-Knoten möglicherweise, dass ein Standardbenutzer der API eskaliert, um die gleichen Berechtigungen wie der Root-Benutzer auf dem Knoten zu haben.
id: Tabel ini menggambarkan pendekatan generik untuk mengukur dampak kerentanan berdasarkan pada mana hal itu terjadi dalam penerapan dan pengaruhnya. Sebagai contoh, eskalasi hak istimewa tingkat tunggal pada node Compute API berpotensi memungkinkan pengguna standar API meningkat untuk memiliki hak istimewa yang sama seperti pengguna root di node.
tr_tr: Bu tablo, güvenlik açığının dağıtımınızdaki yerini ve etkisini temel alan genel bir yaklaşım göstermektedir. Örneğin, Bir Hesaplama API düğümündeki tek düzey ayrıcalık artışı, API'nın standart bir kullanıcısının düğümdeki root kullanıcıyla aynı ayrıcalıklara sahip olmak üzere iletilmesini sağlar.

source: This value should be initially set with a cryptographically secure random number generator and consistent across all nodes. Ensure that it is protected with proper ACLs and that you have a backup copy to avoid data loss.
de: Dieser Wert sollte zunächst mit einem kryptographisch gesicherten Zufallszahlengenerator eingestellt und über alle Knoten hinweg konsistent sein. Stellen Sie sicher, dass es mit den richtigen ACLs geschützt ist und dass Sie eine Sicherungskopie haben, um Datenverlust zu vermeiden.
id: Nilai ini pada awalnya harus ditetapkan dengan generator bilangan acak yang aman secara kriptografi dan konsisten di semua simpul. Pastikan itu dilindungi dengan ACL yang benar dan Anda memiliki salinan cadangan untuk menghindari kehilangan data.
tr_tr: Bu değer başlangıçta şifreleme açısından güvenli bir rasgele sayı üreteci ile ayarlanmalı ve tüm düğümlerde tutarlı olmalıdır. Doğru ACL'lerle korunduğundan ve veri kaybını önlemek için bir yedek kopyanız olduğundan emin olun.

source: Those deploying MySQL or PostgreSQL are advised to refer to existing security guidance. Some references are listed below:
de: Die Bereitstellung von MySQL oder PostgreSQL wird empfohlen, sich auf bestehende Sicherheitsberatung zu beziehen. Einige Referenzen sind unten aufgeführt:
id: Mereka yang menggunakan MySQL atau PostgreSQL disarankan untuk merujuk pada panduan keamanan yang ada. Beberapa referensi tercantum di bawah ini:
tr_tr: MySQL veya PostgreSQL'i kullananlara mevcut güvenlik rehberlerine başvurmaları önerilir. Bazı referanslar aşağıda listelenmiştir:

source: Those drivers that support the CIFS shared file system protocol in most cases can be configured to use Active Directory and manage access through the user authentication.
de: Die Treiber, die das CIFS-Dateisystemprotokoll in den meisten Fällen unterstützen, können so konfiguriert werden, dass sie Active Directory verwenden und den Zugriff über die Benutzerauthentifizierung verwalten.
id: Driver yang mendukung protokol sistem berkas bersama CIFS dalam banyak kasus dapat dikonfigurasi untuk menggunakan Active Directory dan mengelola akses melalui otentikasi pengguna.
tr_tr: Çoğu durumda CIFS paylaşımlı dosya sistemi protokolünü destekleyen sürücüler, Active Directory'i kullanacak ve kullanıcı kimlik doğrulaması aracılığıyla erişimi yönetecek şekilde yapılandırılabilir.

source: Threat actors
de: Bedrohungsakteure
id: Aktor ancaman
tr_tr: Tehdit aktörleri

source: Threat analysis
de: Threat-Analyse
id: Analisis ancaman

source: Threat classification, actors and attack vectors
de: Bedrohungsklassifikation, Akteure und Angriffsvektoren
id: Klasifikasi ancaman, aktor dan vektor serangan
tr_tr: Tehdit sınıflandırması, aktörler ve saldırı vektörleri

source: Throughout the book, we refer to several types of OpenStack cloud users: :term:`administrator`, :term:`operator`, and :term:`user`. We use these terms to identify the level of security access each role has, although, in reality, we understand that varying roles are often held by the same individual.
de: Während des Buches verweisen wir auf verschiedene Arten von OpenStack-Cloud-Nutzern: :term:`administrator`, :term:`operator` und :term: `user`. Wir verwenden diese Begriffe, um das Niveau des Sicherheitszugriffs zu identifizieren, den jede Rolle hat, obwohl wir in Wirklichkeit verstehen, dass unterschiedliche Rollen oft von derselben Person gehalten werden.
id: Sepanjang buku ini, kami mengacu pada beberapa jenis pengguna awan OpenStack: :term:`administrator`, :term:`operator`, dan :term:`user`.Kami menggunakan istilah ini untuk mengidentifikasi tingkat akses keamanan yang dimiliki masing-masing peran, walaupun, pada kenyataannya, kami memahami bahwa berbagai peran seringkali dipegang oleh individu yang sama.
tr_tr: Kitap boyunca, OpenStack bulut kullanıcılarının çeşitli türlerine değiniyoruz :term:`yönetici`, :term:`operatör` ve :term:`kullanıcı`. Her bir rolün sahip olduğu güvenlik erişim düzeyini belirlemek için bu terimleri kullanıyoruz, ancak gerçekte, değişen rollerin genellikle aynı kişi tarafından bulunduğunu anlıyoruz.

source: Thus now users in demo tenant can see the private share type and use it in the share creation:
de: So können nun User im demo-Tenant den Private-Share-Typ sehen und ihn in der Freigabe-Erstellung verwenden:
id: Jadi sekarang pengguna di penyewa demo dapat melihat jenis share pribadi dan menggunakannya dalam pembuatan share:
tr_tr: Böylece demo kiracısındaki kullanıcılar gizli paylaşım türünü görebilir ve bunu paylaşım yaratmada kullanabilir:

source: Thus, as an administrator, you can configure a back end to use specific authentication service via network and it will store users. The authentication service can operate with clients without the Shared File System and the Identity service.
de: So können Sie als Administrator ein Backend konfigurieren, um einen bestimmten Authentifizierungsdienst über das Netzwerk zu nutzen und die Benutzer zu speichern. Der Authentifizierungsdienst kann mit Clients ohne das Shared File System und den Identity Service betrieben werden.
id: Dengan demikian, sebagai administrator, Anda dapat mengkonfigurasi back end untuk menggunakan layanan otentikasi tertentu melalui jaringan dan akan menyimpan pengguna. Layanan otentikasi dapat beroperasi dengan klien tanpa Shared File System dan layanan Identity.
tr_tr: Böylece, bir yönetici olarak, ağ üzerinden özel kimlik doğrulama servisini kullanacak bir arka uç yapılandırabilir ve kullanıcıları saklar. Kimlik doğrulama servisi, Paylaşımlı Dosya Sistemi ve Kimlik servisi olmayan istemcilerle birlikte çalışabilir.

source: Thus, it is required to create the necessary Identity service groups that correspond to the Identity Provider’s groups; additionally, these groups should be assigned roles on one or more projects or domains. For example, groups here refers to the Identity service groups that should be created so that when mapping from the SAML attribute ``Employees``, you can map it to a Identity service group ``devs``.
de: So ist es erforderlich, die notwendigen Identitätsdienstgruppen zu erstellen, die den Gruppen des Identitätsanbieters entsprechen. Darüber hinaus sollten diese Gruppen Rollen auf einem oder mehreren Projekten oder Domains zugeordnet werden. Zum Beispiel bezieht sich die Gruppe hier auf die Identitätsdienstgruppen, die so angelegt werden sollen, dass sie bei der Zuordnung aus dem SAML-Attribut ``Employees``eine Identity Service Group ``devs``abbilden können.
tr_tr: Bu nedenle, Kimlik Sağlayıcı'nın gruplarına karşılık gelen gerekli Kimlik servisi gruplarını oluşturmak zorunludur; Ayrıca, bu gruplara bir veya daha fazla proje veya alan adı üzerinde roller verilmelidir. Örneğin, buradaki gruplar, SAML özniteliği ``Çalışanlar`` dan eşleştirilirken, onu bir Kimlik servisi grubuna ``geliştiriciler`` e eşleyebilmek için oluşturulması gereken Kimlik servisi gruplarına atıfta bulunur.

source: Timeliness and availability of updates
de: Aktualität und Verfügbarkeit von Updates
id: Ketepatan waktu dan ketersediaan update
tr_tr: Güncellemelerin zamanlaması ve kullanılabilirliği

source: Title, version information, contact details
de: Titel, Versionsinformationen, Kontaktdaten
id: Judul, informasi versi, rincian kontak
tr_tr: Başlık, sürüm bilgisi, iletişim detayları

source: To address the often mentioned concern of tenant data privacy and limiting cloud provider liability, there is greater interest within the OpenStack community to make data encryption more ubiquitous. It is relatively easy for an end-user to encrypt their data prior to saving it to the cloud, and this is a viable path for tenant objects such as media files, database archives among others. In some instances, client-side encryption is utilized to encrypt data held by the virtualization technologies which requires client interaction, such as presenting keys, to decrypt data for future use. To seamlessly secure the data and have it accessible without burdening the client with having to manage their keys and interactively provide them calls for a key management service within OpenStack. Providing encryption and key management services as part of OpenStack eases data-at-rest security adoption and addresses customer concerns about privacy or misuse of data, while also limiting cloud provider liability. This can help reduce a provider's liability when handling tenant data during an incident investigation in multi-tenant public clouds.
de: Um die oft erwähnte Sorge der Tenant Datenschutz und Begrenzung der Cloud-Anbieter Haftung, gibt es ein größeres Interesse in der OpenStack-Community, um die Datenverschlüsselung mehr ubiquitär. Es ist relativ einfach für einen Endbenutzer, ihre Daten vor dem Speichern in die Cloud zu verschlüsseln, und dies ist ein lebensfähiger Pfad für Tenantobjekte wie z.B. Mediendateien, Datenbankarchive. In einigen Fällen wird eine clientseitige Verschlüsselung verwendet, um Daten zu verschlüsseln, die von den Virtualisierungstechnologien gehalten werden, die eine Client-Interaktion erfordern, wie zum Beispiel die Präsentation von Schlüsseln, um Daten für die zukünftige Verwendung zu entschlüsseln. Um die Daten nahtlos zu sichern und zugänglich zu machen, ohne den Kunden zu belasten, dass sie ihre Schlüssel verwalten müssen und sie interaktiv in der Lage sind, ihnen einen Schlüsselverwaltungsdienst innerhalb von OpenStack zukommen zu lassen. Die Bereitstellung von Verschlüsselungs- und Schlüsselverwaltungsdiensten als Teil von OpenStack erleichtert die Datenüberwachung und richtet sich auf Kundenbedenken hinsichtlich der Privatsphäre oder des Missbrauchs von Daten und beschränkt gleichzeitig die Haftung des Cloud-Providers. Dies kann dazu beitragen, die Haftung eines Anbieters bei der Behandlung von Tenantdaten während einer Vorfalluntersuchung bei Mehrpächter-Public Clouds zu reduzieren.
id: Untuk mengatasi kekhawatiran privasi data penyewa yang sering disebutkan dan membatasi tanggung jawab penyedia cloud, ada ketertarikan yang lebih besar dalam komunitas OpenStack untuk membuat enkripsi data lebih banyak terjadi di mana-mana. Adalah relatif mudah bagi end-user untuk mengenkripsi data mereka sebelum menyimpannya ke awan, dan ini adalah jalur yang layak untuk objek penyewa seperti file media, arsip database, dan lain-lain. Dalam beberapa instance, enkripsi sisi klien digunakan untuk mengenkripsi data yang dimiliki oleh teknologi virtualisasi yang memerlukan interaksi klien, seperti menghadirkan kunci, untuk mendekripsi data untuk penggunaan masa depan. Untuk mengamankan data secara mulus dan memilikinya dapat diakses tanpa membebani klien karena harus mengelola kunci mereka dan secara interaktif memberi mereka panggilan untuk layanan manajemen kunci di dalam OpenStack. Menyediakan layanan pengelolaan enkripsi dan kunci sebagai bagian dari OpenStack memudahkan adopsi keamanan data dan atasi penggunaan dan menanggapi kekhawatiran pelanggan tentang privasi atau penyalahgunaan data, sekaligus juga membatasi tanggung jawab penyedia cloud. Ini dapat membantu mengurangi tanggung jawab penyedia saat menangani data penyewa selama penyelidikan insiden di awan publik multi-penyewa.
tr_tr: Sıklıkla bahsedilen kiracı veri gizliliği ve bulut sağlayıcı sorumluluğunun sınırlandırılması konusunu ele almak için, OpenStack topluluğunda veri şifrelemesini her yerde daha yaygın hale getirmek için daha fazla ilgi var. Son kullanıcıların verilerini buluta kaydetmeden önce şifrelenmesi nispeten kolaydır ve bu, medya dosyaları, diğerleri arasında veritabanı arşivleri gibi kiracı nesnelerin uygulanabilir bir yoludur. Bazı durumlarda, istemci tarafında şifreleme, ileride kullanılmak üzere verilerin şifresini çözmek için anahtarların sunulması gibi müşteri etkileşimini gerektiren sanallaştırma teknolojilerinin elinde tuttuğu verileri şifrelemek için kullanılır. Verileri sorunsuz bir şekilde korumak ve müşteriyi anahtarlarını yönetmek zorunda kalmadan yüklemek ve onları etkileşimli olarak sağlamak için OpenStack içinde bir anahtar yönetim servisi çağırın. OpenStack'in bir parçası olan şifreleme ve anahtar yönetimi servislerinin sağlanması, veri gizliliği veya veri kötüye kullanımı konusundaki müşteri kaygılarını gidermek ve bulut tedarikçisinin sorumluluğunu da sınırlandırırken, dinlenme esnasında veri alımını kolaylaştırıyor. Bu, çok kiracı bulut bulutlarında bir olay soruşturması sırasında kiracının verilerini ele alırken bir sağlayıcının sorumluluğunu azaltmaya yardımcı olabilir.

source: To aid OpenStack architects in the protection of personal data, we recommend OpenStack architects review the NIST publication 800-122, titled "*Guide to Protecting the Confidentiality of Personally Identifiable Information (PII)*." This guide steps through the process of protecting:
de: Um den OpenStack-Architekten beim Schutz personenbezogener Daten zu helfen, empfehlen wir OpenStack-Architekten, die NIST-Publikation 800-122 mit dem Titel "* Guide zum Schutz der Vertraulichkeit persönlich identifizierbarer Informationen (PII) * zu überprüfen." Dieser Guide führt durch den Prozess des Schutzes:
id: Untuk membantu arsitek OpenStack dalam melindungi data pribadi, kami merekomendasikan arsitek OpenStack meninjau publikasi NIST 800-122, yang berjudul "*Guide to Protecting the Confidentiality of Personally Identifiable Information (PII)*." Panduan ini melangkah melalui proses perlindungan:
tr_tr: OpenStack mimarlarına kişisel verilerin korunmasına yardımcı olmak için OpenStack mimarlarının NIST yayını 800-122 "* Kişisel Tanınabilir Bilginin Gizliliğini Korumaya İlişkin Kılavuz (PII)*." başlıklı incelemesini öneriyoruz. Bu rehber, koruma süreci boyunca adımlar atmaktadır:

source: To deny access for a specified project, use :command:`manila type-access-remove <share_type> <project_id>` command.
de: Um den Zugriff für ein bestimmtes Projekt zu verweigern, verwenden Sie :command: `manila type-access-remove <share_type><project_id>`Befehl.
id: Untuk menolak akses untuk proyek tertentu, gunakan perintah :command:`manila type-access-remove <share_type> <project_id>` .
tr_tr: Belirli bir proje için erişimi reddetmek için :command:`manila type-access-remove <share_type> <project_id>` komutunu kullanın.

source: To disable the nova-conductor, place the following into your ``nova.conf`` file (on your compute hosts):
de: Um den nova-conductor zu deaktivieren, platzieren Sie folgendes in Ihre `` nova.conf``-Datei (auf Ihrem Compute-Hosts):
id: Untuk menonaktifkan nova-conductor, tempatkan hal berikut ke file ``nova.conf`` Anda (pada host komputasi Anda):
tr_tr: Nova-conductor'u devre dışı bırakmak için, aşağıdakileri ``nova.conf`` dosyanıza (bilgisayarlarınız üzerinde) yerleştirin:

source: To ease the administrative burden of managing SELinux, many enterprise Linux platforms utilize SELinux Booleans to quickly change the security posture of sVirt.
de: Um den administrativen Aufwand für die Verwaltung von SELinux zu erleichtern, nutzen viele Enterprise-Linux-Plattformen SELinux Booleans, um schnell die Sicherheitsposition von sVirt zu ändern.
id: Untuk memudahkan beban administrasi pengelolaan SELinux, banyak platform perusahaan Linux memanfaatkan SELinux Boolean untuk segera mengubah postur keamanan dari sVirt.
tr_tr: SELinux'u idare etmenin yükünü hafifletmek için birçok kurumsal Linux platformu, SELinux Booleanlarını kullanarak sVirt'in güvenlik durumunu hızla değiştirir.

source: To enable Federation, perform the following steps:
de: Um Federation zu aktivieren, führen Sie die folgenden Schritte aus:
tr_tr: Federasyonu etkinleştirmek için aşağıdaki adımları uygulayın:

source: To enable memcached, execute the following:
de: Um memcached zu aktivieren, führen Sie folgendes aus:
id: Untuk mengaktifkan memcached, jalankan perintah berikut:
tr_tr: Memcached'i etkinleştirmek için aşağıdakini çalıştırın:

source: To enforce policies, you can configure services, host-based firewalls (such as iptables), local policy (SELinux or AppArmor), and optionally global network policy.
de: Um Richtlinien zu erzwingen, können Sie Dienste, Host-basierte Firewalls (wie iptables), lokale Richtlinien (SELinux oder AppArmor) und optional globale Netzwerkrichtlinien konfigurieren.
id: Untuk menerapkan kebijakan, Anda dapat mengonfigurasi layanan, firewall berbasis host (seperti iptables), kebijakan lokal (SELinux atau AppArmor), dan kebijakan jaringan global pilihan.
tr_tr: Kuralları uygulamak için, hizmetleri, ana bilgisayar tabanlı güvenlik duvarlarını (iptables gibi), yerel kuralı (SELinux veya AppArmor) ve isteğe bağlı olarak genel ağ ilkesini yapılandırabilirsiniz.

source: To isolate sensitive data communication between the OpenStack Networking services and other OpenStack core services, configure these communication channels to only allow communication over an isolated management network.
de: Um eine sensible Datenkommunikation zwischen den OpenStack Networking-Diensten und anderen OpenStack-Kerndiensten zu isolieren, konfigurieren Sie diese Kommunikationskanäle nur, um die Kommunikation über ein isoliertes Management-Netzwerk zu ermöglichen.
id: Untuk mengisolasi komunikasi data sensitif antara layanan OpenStack Networking dan layanan inti OpenStack lainnya, konfigurasikan saluran komunikasi ini hanya untuk mengizinkan komunikasi melalui jaringan manajemen yang terisolasi.
tr_tr: OpenStack Ağ servisleri ve diğer OpenStack çekirdek servisleri arasındaki hassas veri iletişimini izole etmek için, bu iletişim kanallarını sadece izole bir yönetim ağı üzerinden iletişim kurmak üzere yapılandırın.

source: To isolate sensitive database communications between the services and the database, we strongly recommend that the database server(s) be configured to only allow communications to and from the database over an isolated management network. This is achieved by restricting the interface or IP address on which the database server binds a network socket for incoming client connections.
de: Um die sensible Datenbankkommunikation zwischen den Diensten und der Datenbank zu isolieren, empfiehlt es sich dringend, dass der Datenbankserver so konfiguriert ist, dass er nur über ein isoliertes Verwaltungsnetzwerk die Kommunikation von und aus der Datenbank ermöglicht. Dies wird durch die Beschränkung der Schnittstelle oder der IP-Adresse erreicht, auf der der Datenbankserver einen Netzwerksockel für eingehende Clientverbindungen bindet.
id: Untuk mengisolasi komunikasi basis data sensitif antara layanan dan database, kami sangat menyarankan agar server database dikonfigurasi agar hanya mengizinkan komunikasi ke dan dari database melalui jaringan manajemen yang terisolasi. Hal ini dicapai dengan membatasi antarmuka atau alamat IP yang digunakan server database untuk mengikat soket jaringan untuk koneksi klien yang masuk.
tr_tr: Servisler ve veritabanı arasındaki hassas veritabanı iletişimini izole etmek için, veritabanı sunucularının yalnızca izole bir yönetim ağı üzerinden veritabanına ve veritabanına iletişim sağlamak üzere yapılandırılmasını öneririz. Bu, veritabanı sunucusunun gelen istemci bağlantıları için ağ soketini bağladığı arabirimi veya IP adresini sınırlandırarak sağlanır.

source: To provide a community driven facility for knowledge capture and dissemination
de: Um eine gemeinschaftsorientierte Einrichtung zur Wissenserfassung und -verbreitung zur Verfügung zu stellen
id: Menyediakan fasilitas berbasis komunitas untuk menangkap dan menyebarkan pengetahuan
tr_tr: Bilgi edinme ve yayma için topluma dayalı bir olanak sağlamak

source: To provide access to Docker Swarm or Kubernetes using the native clients (``docker`` or ``kubectl`` respectively) magnum uses TLS certificates. To store the certificates, it is recommended to use Barbican , or the Magnum Database (``x590keypair``).
de: Um Zugriff auf einen Docker Swarm oder Kubernetes zur Verfügung zu stellen, benutzen Sie native Clients (``docker`` oder ``kubectl``). Magnum benutzt TLS Zertifikate. Zur Speicherung der Zertifikate wird Barbican empfohlen, oder die Magnum Datenbank (``x590keypair``).
id: Untuk menyediakan akses ke Docker Swarm atau Kubernetes menggunakan klien asli (``docker`` atau ``kubectl`` masing-masing) magnum menggunakan sertifikat TLS. Untuk menyimpan sertifikat, disarankan untuk menggunakan Barbican, atau Database Magnum (``x590keypair``).

source: To reduce security risks from orphan instances on a user, tenant, or domain deletion in the Identity service there is discussion to generate notifications in the system and have OpenStack components respond to these events as appropriate such as terminating instances, disconnecting attached volumes, reclaiming CPU and storage resources and so on.
de: Um die Sicherheitsrisiken von Orphan-Instanzen auf Benutzer-, Tenant- oder Domain-Deletion im Identity-Service zu reduzieren, gibt es Diskussionen, um Benachrichtigungen im System zu generieren und OpenStack-Komponenten auf diese Ereignisse zu reagieren, wie z. B. das Beenden von Instanzen, das Trennen der angehängten Volumes, die Wiederherstellung der CPU und Speicherressourcen und so weiter.
id: Untuk mengurangi risiko keamanan dari instance tanpa induk (orphan) pada pengguna, penyewa, atau penghapusan domain di layanan Identity, ada diskusi untuk menghasilkan pemberitahuan di sistem dan apakah komponen OpenStack merespons kejadian ini jika sesuai, misalnya menghentikan instance, melepaskan volume terikat, reklamasi CPU dan sumber daya penyimpanan dan sebagainya.
tr_tr: Kimlik servisindeki bir kullanıcı, kiracı veya alan adı silinmesindeki yetimlik örneklerinden gelen güvenlik risklerini azaltmak için, sistemde bildirimler oluşturmak ve OpenStack bileşenleri bu olaylara uygun olarak örnekleri sonlandırmak, ekteki birimlerin bağlantısını kesmek, CPU'yu geri almak ve depolama kaynakları vb.

source: To register an internal URL for an endpoint:
de: Um eine interne URL für einen Endpunkt zu registrieren:
id: Untuk mendaftarkan URL internal untuk endpoint:
tr_tr: Bir uç nokta için iç URL kayıt etmek için:
