Repository: openstack/security-doc
Catalog: security-guide/source/locale/*/LC_MESSAGES/security-guide.po
Languages: de, id, tr_tr

source: For information about the current state of feature support, see `OpenStack Hypervisor Support Matrix <https://wiki.openstack.org/wiki/HypervisorSupportMatrix>`__.
de: Informationen über den aktuellen Status der Feature-Unterstützung finden Sie unter `OpenStack Hypervisor Support Matrix <https://wiki.openstack.org/wiki/HypervisorSupportMatrix>`__.

source: For installations in which the controller will have limited access to all the instances of a cluster, due to limits on floating IP addresses or security rules, indirect access may be configured. This allows some instances to be designated as proxy gateways to the other instances of the cluster.
de: Für Installationen, in denen der Controller Zugriff auf alle Instanzen eines Clusters hat, aufgrund von Einschränkungen für Floating-IP-Adressen oder Sicherheitsregeln, kann indirekter Zugriff konfiguriert werden. Dies ermöglicht, dass einige Instanzen als Proxy-Gateways zu den anderen Instanzen des Clusters bezeichnet werden.
id: Untuk instalasi di mana pengendali akan memiliki akses terbatas ke semua instance cluster karena batasan pada alamat IP mengambang (floating IP address) atau peraturan keamanan, akses tidak langsung dapat dikonfigurasi. Hal ini memungkinkan beberapa instance ditunjuk sebagai gateway proxy ke instance cluster lainnya.
tr_tr: Değişken IP adresleri veya güvenlik kurallarının sınırları nedeniyle denetleyicinin tüm küme örneklerine sınırlı erişimi olacak olan kurulumlarda dolaylı erişim yapılandırılabilir. Bu, bazı örneklerin kümenin diğer örneklerine vekil geçitleri olarak atanmasına izin verir.

source: For instance, analyzing the access logs of Identity service or its replacement authentication system would alert us to failed logins, frequency, origin IP, whether the events are restricted to select accounts and other pertinent information. Log analysis supports detection.
de: Zum Beispiel würde die Analyse der Zugriffsprotokolle des Identitätsdienstes oder seines Ersatz-Authentifizierungssystems uns auf fehlgeschlagene Anmeldungen, Häufigkeit, Ursprungs-IP, benachrichtigen, ob die Ereignisse auf ausgewählte Konten und andere relevante Informationen beschränkt sind. Log-Analyse unterstützt die Erkennung.
id: Misalnya, menganalisis log akses dari layanan Identity atau sistem autentikasi penggantiannya akan mengingatkan kita pada login, frekuensi, IP asal yang salah, apakah kejadian dibatasi untuk memilih akun dan informasi terkait lainnya. Analisis log mendukung deteksi.
tr_tr: Örneğin, Kimlik servisinin veya onun yerine geçen kimlik doğrulama sisteminin erişim günlüklerini analiz etmek, başarısız oturum açma sayıları, sıklık, kaynak IP'si, olayların seçilen hesaplar ve diğer ilgili bilgilerle sınırlandırılıp bırakılmadığına dair bizi uyaracaktır. Günlük analizi, algılamayı destekler.

source: For more details on setting up a certificate manager for Magnum, see the `Container Infrastructure Management service <https://docs.openstack.org/magnum/latest/install/>`_ documentation.
de: Für mehr Details zu den Einstellungen des Zertifikatsmanagers in Magnum, schauen Sie doe `Container Infrastructure Management service <https://docs.openstack.org/magnum/latest/install/>`_ Dokumentation.
id: Untuk rincian lebih lanjut tentang membuat manajer sertifikat untuk Magnum, lihat dokumentasi `Container Infrastructure Management service <https://docs.openstack.org/magnum/latest/install/>`_.

source: For more details on the service see the `OpenStack Glance documentation <https://docs.openstack.org/glance/latest/>`__.
de: Weitere Informationen zum Service finden Sie in der `OpenStack Glance Dokumentation <https://docs.openstack.org/glance/latest/>`__.
id: Untuk rincian lebih lanjut tentang layanan ini, lihat `OpenStack Glance documentation <https://docs.openstack.org/glance/latest/>`__.

source: For more details see `FedRAMP <http://www.gsa.gov/portal/category/102371>`_.
de: Für weitere Details siehe `FedRAMP <http://www.gsa.gov/portal/category/102371>`_.
id: Untuk lebih jelasnya lihat `FedRAMP <http://www.gsa.gov/portal/category/102371>`_.
tr_tr: Daha fazla bilgi için bkz. `FedRAMP <http://www.gsa.gov/portal/category/102371>`_.

source: For more details see `ISO 27001 <http://www.27000.org/iso-27001.htm>`_.
de: Für weitere Details siehe `ISO 27001 <http://www.27000.org/iso-27001.htm> `_.
id: Untuk lebih jelasnya lihat `ISO 27001 <http://www.27000.org/iso-27001.htm>`_.
tr_tr: Daha fazla bilgi için bkz. `ISO 27001 <http://www.27000.org/iso-27001.htm>`_.

source: For more details see `PCI security standards <https://www.pcisecuritystandards.org/security_standards/>`_.
de: Weitere Details finden Sie unter `PCI security standards <https://www.pcisecuritystandards.org/security_standards/>`_.
id: Untuk lebih jelasnya lihat `PCI security standards <https://www.pcisecuritystandards.org/security_standards/>`_.
tr_tr: Daha fazla bilgi için bkz. `PCI güvenlik standartları <https://www.pcisecuritystandards.org/security_standards/>`_.

source: For more details see `The International Traffic in Arms Regulations (ITAR) <https://www.pmddtc.state.gov/regulations_laws/itar.html>`_.
de: Für weitere Details siehe `The International Traffic in Arms Regulations (ITAR) <https://www.pmddtc.state.gov/regulations_laws/itar.html>`_.
id: Untuk lebih jelasnya lihat `The International Traffic in Arms Regulations (ITAR) <https://www.pmddtc.state.gov/regulations_laws/itar.html>`_.
tr_tr: Daha fazla bilgi için bkz. `Silaha Düzenlemelerinde Uluslararası Trafik (ITAR) <https://www.pmddtc.state.gov/regulations_laws/itar.html>`_.

source: For more details see the `AICPA Report on Controls at a Service Organization Relevant to Security, Availability, Processing Integrity, Confidentiality or Privacy <http://www.aicpa.org/InterestAreas/FRC/AssuranceAdvisoryServices/Pages/AICPASOC2Report.aspx>`_.
de: Für weitere Details siehe `AICPA Report on Controls at a Service Organization Relevant to Security, Availability, Processing Integrity, Confidentiality or Privacy <http://www.aicpa.org/InterestAreas/FRC/AssuranceAdvisoryServices/Pages/AICPASOC2Report.aspx>`_.
id: Untuk lebih jelasnya lihat `AICPA Report on Controls at a Service Organization Relevant to Security, Availability, Processing Integrity, Confidentiality or Privacy <http://www.aicpa.org/InterestAreas/FRC/AssuranceAdvisoryServices/Pages/AICPASOC2Report.aspx>`_.
tr_tr: Daha fazla ayrıntı için bkz. `Güvenlik, Kullanılabilirlik, İşleme Dürüstlüğü, Gizlilik veya Gizlilikle İlgili Bir Servis Organizasyonundaki Kontroller Üzerine AICPA Raporu <http://www.aicpa.org/InterestAreas/FRC/AssuranceAdvisoryServices/Pages/AICPASOC2Report.aspx>` _.

source: For more details see the `AICPA Report on Controls at a Service Organization Relevant to User Entities' Internal Control over Financial Reporting <http://www.aicpa.org/InterestAreas/FRC/AssuranceAdvisoryServices/Pages/AICPASOC1Report.aspx>`_.
de: Für weitere Details siehe den `AICPA-Report über Kontrollen bei einer Serviceorganisation, die für die interne Kontrolle der Benutzerorganisationen für die Finanzberichterstattung relevant ist <http://www.aicpa.org/InterestAreas/FRC/AssuranceAdvisoryServices/Pages/AICPASOC1Report.aspx>`_.
id: Untuk lebih jelasnya lihat `AICPA Report on Controls at a Service Organization Relevant to User Entities' Internal Control over Financial Reporting <http://www.aicpa.org/InterestAreas/FRC/AssuranceAdvisoryServices/Pages/AICPASOC1Report.aspx>`_.
tr_tr: Daha fazla bilgi için, `Mali Raporlama İç Kontrolü <http://www.aicpa.org/InterestAreas/FRC/AssuranceAdvisoryServices/Pages/AICPASOC1Report.aspx>`_ 'ndeki 'Kullanıcı Varlıklarıyla İlgili Bir Hizmet Organizasyonundaki Kontroller Üzerindeki AICPA Raporuna' bakınız.

source: For more details see the `AICPA Trust Services Report for Service Organizations <http://www.aicpa.org/InterestAreas/FRC/AssuranceAdvisoryServices/Pages/AICPASOC3Report.aspx>`_.
de: Weitere Informationen finden Sie im `AICPA Trust Services Report for Service-Organizationen <http://www.aicpa.org/InterestAreas/FRC/AssuranceAdvisoryServices/Pages/AICPASOC3Report.aspx> `_.
id: Untuk lebih jelasnya lihat `AICPA Trust Services Report for Service Organizations <http://www.aicpa.org/InterestAreas/FRC/AssuranceAdvisoryServices/Pages/AICPASOC3Report.aspx>`_.
tr_tr: Daha fazla ayrıntı için bkz. `AICPA Hizmet Kuruluşları İçin Güven Hizmetleri Raporu <http://www.aicpa.org/InterestAreas/FRC/AssuranceAdvisoryServices/Pages/AICPASOC3Report.aspx>`_.

source: For more details see the `Health Insurance Portability And Accountability Act <https://www.cms.gov/Regulations-and-Guidance/HIPAA-Administrative-Simplification/HIPAAGenInfo/downloads/HIPAALaw.pdf>`_.
de: Für weitere Details siehe `Health Insurance Portability And Accountability Act <https://www.cms.gov/Regulations-and-Guidance/HIPAA-Administrative-Simplification/HIPAAGenInfo/downloads/HIPAALaw.pdf>`_.
id: Untuk lebih jelasnya lihat `Health Insurance Portability And Accountability Act <https://www.cms.gov/Regulations-and-Guidance/HIPAA-Administrative-Simplification/HIPAAGenInfo/downloads/HIPAALaw.pdf>`_.
tr_tr: Daha fazla bilgi için bkz. `Sağlık Sigortası Taşınabilirliği ve Hesap Verebilirlik Yasası <https://www.cms.gov/Regulations-and-Guidance/HIPAA-Administrative-Simplification/HIPAAGenInfo/downloads/HIPAALaw.pdf>`_.

source: For more details, see `How to create a TLS Loadbalancer <https://wiki.openstack.org/wiki/Network/LBaaS/docs/how-to-create-tls-loadbalancer>`_ and `Deploy a TLS-terminated HTTPS load balancer <https://docs.openstack.org/octavia/latest/user/guides/basic-cookbook.html#deploy-a-tls-terminated-https-load-balancer>`_.
de: Für mehr Details, schauen Sie `How to create a TLS Loadbalancer <https://wiki.openstack.org/wiki/Network/LBaaS/docs/how-to-create-tls-loadbalancer>`_ und `Deploy a TLS-terminated HTTPS load balancer <https://docs.openstack.org/octavia/latest/user/guides/basic-cookbook.html#deploy-a-tls-terminated-https-load-balancer>`_.
id: Untuk lebih jelasnya, lihat `How to create a TLS Loadbalancer <https://wiki.openstack.org/wiki/Network/LBaaS/docs/how-to-create-tls-loadbalancer>`_ dan `Deploy a TLS-terminated HTTPS load balancer <https://docs.openstack.org/octavia/latest/user/guides/basic-cookbook.html#deploy-a-tls-terminated-https-load-balancer>`_.

source: For more details, see `Object Encryption <https://docs.openstack.org/swift/pike/overview_encryption.html>`_ within the official swift documentation.
de: Für mehr Details, schauen Sie `Object Encryption <https://docs.openstack.org/swift/pike/overview_encryption.html>`_ in der offiziellen Swift Dokumentation.
id: Untuk lebih jelasnya, lihat `Object Encryption <https://docs.openstack.org/swift/pike/overview_encryption.html>`_ dalam dokumentasi swift resmi.

source: For more details, see the `Data Encryption section <https://docs.openstack.org/security-guide/tenant-data/data-encryption.html>`_. and `Volume encryption <https://docs.openstack.org/ocata/config-reference/block-storage/volume-encryption.html>`_.
de: Für mehr Details, schauen Sie die `Data Encryption section <https://docs.openstack.org/security-guide/tenant-data/data-encryption.html>`_. and `Volume encryption <https://docs.openstack.org/ocata/config-reference/block-storage/volume-encryption.html>`_.
id: Untuk lebih jelasnya, lihat `Data Encryption section <https://docs.openstack.org/security-guide/tenant-data/data-encryption.html>`_. and `Volume encryption <https://docs.openstack.org/ocata/config-reference/block-storage/volume-encryption.html>`_.

source: For more details, see the `Ephemeral disk encryption documentation <https://docs.openstack.org/security-guide/tenant-data/data-encryption.html#ephemeral-disk-encryption>`_.
de: Für mehr Details, schauen Sie die `Ephemeral disk encryption documentation <https://docs.openstack.org/security-guide/tenant-data/data-encryption.html#ephemeral-disk-encryption>`_.
id: Untuk lebih jelasnya, lihat `Ephemeral disk encryption documentation <https://docs.openstack.org/security-guide/tenant-data/data-encryption.html#ephemeral-disk-encryption>`_.

source: For more details, see the `Trusted Images documentation <https://docs.openstack.org/security-guide/instance-management/security-services-for-instances.html#trusted-images/>`_.
de: Für mehr Details, schauen Sie die `Trusted Images documentation <https://docs.openstack.org/security-guide/instance-management/security-services-for-instances.html#trusted-images/>`_.
id: Untuk lebih jelasnya, lihat `Trusted Images documentation <https://docs.openstack.org/security-guide/instance-management/security-services-for-instances.html#trusted-images/>`_.

source: For more information about Paste Deploy, see `Python Paste Deployment documentation <http://pythonpaste.org/deploy/>`__.
de: Weitere Informationen über Paste Deploy finden Sie unter `Python Paste Deployment-Dokumentation <http://pythonpaste.org/deploy/>`__.
id: Untuk informasi lebih lanjut tentang Paste Deploy, lihat `Python Paste Deployment documentation <http://pythonpaste.org/deploy/>`__.
tr_tr: Paste Deploy hakkında daha fazla bilgi için `Python Paste Deployment belgelendirmesi <http://pythonpaste.org/deploy/>`__.

source: For more information about the ``lvm_type`` parameter, see the `LVM Block Storage section <https://docs.openstack.org/ocata/config-reference/block-storage/drivers/lvm-volume-driver.html>`__
de: Weitere Informationen zum Parameter ``lvm_type``finden Sie im Abschnitt `LVM Block Storage section <https://docs.openstack.org/ocata/config-reference/block-storage/drivers/lvm-volume-driver.html>`__

source: For more information about the ``volume_clear`` parameter, see the `Block Storage sample configuration files <https://docs.openstack.org/ocata/config-reference/block-storage/samples/index.html>`__ of OpenStack Configuration Reference.
de: Weitere Informationen zum Parameter ``volume_clear``finden Sie in den Konfigurationsdateien des Blockspeicher-Beispiels <https://docs.openstack.org/ocata/config-reference/block-storage/samples/index.html>`__ der OpenStack-Konfigurationsreferenz.

source: For more information on RabbitMQ SSL configuration see:
de: Weitere Informationen zur RabbitMQ SSL-Konfiguration finden Sie unter:
id: Untuk informasi lebih lanjut tentang konfigurasi SSL RabbitMQ lihat:
tr_tr: RabbitMQ SSL yapılandırması hakkında daha fazla bilgi için bkz.:

source: For more information on the deployment, operation, or implementation of Object Storage encryption, see the swift Developer Documentation on `Object Encryption <https://docs.openstack.org/swift/latest/overview_encryption.html>`_.
de: Weitere Informationen über die Bereitstellung, den Betrieb oder die Implementierung der Objektspeicher-Verschlüsselung finden Sie in der ausführlichen Entwicklerdokumentation zu `Objektverschlüsselung <https://docs.openstack.org/swift/latest/overview_encryption.html>`_.
id: Untuk informasi lebih lanjut tentang penerapan, pengoperasian, atau penerapan enkripsi Obyek Penyimpanan, lihat Dokumentasi Pengembang yang cepat pada `Object Encryption <https://docs.openstack.org/swift/latest/overview_encryption.html>`_.

source: For more information on the rootwrap project, please see the official documentation: `https://wiki.openstack.org/wiki/Rootwrap <https://wiki.openstack.org/wiki/Rootwrap>`_
de: Weitere Informationen zum Rootwrap-Projekt finden Sie in der offiziellen Dokumentation: `https://wiki.openstack.org/wiki/Rootwrap <https://wiki.openstack.org/wiki/Rootwrap>`_
id: Untuk informasi lebih lanjut tentang proyek rootwrap, silakan lihat dokumentasi resmi :`https://wiki.openstack.org/wiki/Rootwrap <https://wiki.openstack.org/wiki/Rootwrap>`_
tr_tr: Rootwrap projesi ile ilgili daha fazla bilgi içi, resmi belgelendirmeye bakın: `https://wiki.openstack.org/wiki/Rootwrap <https://wiki.openstack.org/wiki/Rootwrap>`_

source: For more information, see `Shibboleth Service Provider Configuration <https://wiki.shibboleth.net/confluence/display/SHIB2/Configuration>`__.
de: Weitere Informationen finden Sie unter `Shibboleth Service Provider-Konfiguration <https://wiki.shibboleth.net/confluence/display/SHIB2/Configuration>`__.
tr_tr: Daha fazla bilgi için, bkz. `Shibboleth Servis Sağlayıcı Yapıladırması <https://wiki.shibboleth.net/confluence/display/SHIB2/Configuration>`__.

source: For more information, see the `Sahara advanced configuration guide <https://docs.openstack.org/sahara/latest/admin/advanced-configuration-guide.html#external-key-manager-usage>`_.
de: Für mehr Information, schauen Sie `Sahara advanced configuration guide <https://docs.openstack.org/sahara/latest/admin/advanced-configuration-guide.html#external-key-manager-usage>`_.
id: Untuk informasi lebih lanjut, lihat `Sahara advanced configuration guide <https://docs.openstack.org/sahara/latest/admin/advanced-configuration-guide.html#external-key-manager-usage>`_.

source: For production environments we recommend controlling the security groups manually and creating a set of group rules that are appropriate for the installation. In this manner the operator can ensure that the default security group will contain all the appropriate rules. For an expanded discussion of security groups please see :ref:`networking-security-groups`.
de: Für Produktionsumgebungen empfehlen wir, die Sicherheitsgruppen manuell zu steuern und einen Satz von Gruppenregeln zu erstellen, die für die Installation geeignet sind. Auf diese Weise kann der Betreiber sicherstellen, dass die Standard-Sicherheitsgruppe alle entsprechenden Regeln enthält. Für eine erweiterte Diskussion über Sicherheitsgruppen siehe :ref:`networking-security-groups`.
id: Untuk lingkungan produksi sebaiknya Anda mengendalikan kelompok keamanan secara manual dan membuat seperangkat aturan kelompok yang sesuai untuk pemasangan. Dengan cara ini, operator dapat memastikan bahwa grup keamanan default akan berisi semua peraturan yang sesuai. Untuk diskusi kelompok keamanan yang diperluas, lihat :ref:`networking-security-groups`.
tr_tr: Üretim ortamları için, güvenlik gruplarını elle kontrol etmenizi ve kurulum için uygun grup kuralları seti hazırlamanızı öneririz. Bu şekilde, operatör, varsayılan güvenlik grubunun tüm uygun kuralları içereceğinden emin olabilir. Güvenlik gruplarının genişletilmiş bir tartışması için lütfen bakınız :ref:`networking-security-groups`.

source: For publicly facing services, the threats are pretty straightforward. Users will be authenticating against horizon and keystone with their username and password. Users will also be accessing the API endpoints for other services using their keystone tokens. If this network traffic is unencrypted, passwords and tokens can be intercepted by an attacker using a man-in-the-middle attack. The attacker can then use these valid credentials to perform malicious operations. All real deployments should be using SSL/TLS to protect publicly facing services.
de: Für öffentlich zugängliche Dienstleistungen sind die Bedrohungen ziemlich einfach. Die Benutzer werden sich gegen den Horizon und den Keystone mit ihrem Benutzernamen und Passwort benennen. Benutzer werden auch Zugriff auf die API-Endpunkte für andere Dienste mit ihren Keystone-Token haben. Wenn dieser Netzwerkverkehr unverschlüsselt ist, können Passwörter und Token von einem Angreifer mit einem Man-in-the-Middle-Angriff abgefangen werden. Der Angreifer kann dann diese gültigen Anmeldeinformationen verwenden, um böswillige Operationen durchzuführen. Alle realen Einsätze sollten SSL/TLS verwenden, um öffentlich zugängliche Dienstleistungen zu schützen.
id: Untuk layanan yang dihadapi publik, ancamannya sangat mudah. Pengguna akan melakukan otentikasi terhadap horizon dan keystone dengan nama pengguna dan kata sandinya. Pengguna juga akan mengakses API endpoint untuk layanan lain menggunakan token kunci mereka. Jika lalu lintas jaringan ini tidak terenkripsi, kata sandi dan tanda dapat dicegat oleh penyerang menggunakan serangan man-in-the-middle. Penyerang kemudian dapat menggunakan kredensial yang valid ini untuk melakukan operasi berbahaya. Semua penerapan sebenarnya harus menggunakan SSL/TLS untuk melindungi layanan yang dihadapi secara publik.
tr_tr: Kamuya açık servisler için tehditler oldukça basittir. Kullanıcılar horizon ve keystone'a kullanıcı adı ve parolasıyla kimlik doğrulaması yapacaklardır. Kullanıcılar ayrıca, keystone belirteçlerini kullanarak diğer hizmetler için API uç noktalarına erişiyor olacaklardır. Bu ağ trafiği şifrelenmemişse, parolalar ve belirteçler bir saldırgan tarafından bir ortada-adam saldırısı kullanılarak erişilebilir. Saldırgan, daha sonra bu geçerli kimlik bilgilerini kötü amaçlı işlemleri gerçekleştirmek için kullanabilir. Tüm gerçek dağıtımlar, servisleri korumak için SSL/TLS kullanmalıdır.
