Repository: openstack/security-doc
Catalog: security-guide/source/locale/*/LC_MESSAGES/security-guide.po
Languages: de, id, tr_tr

source: To restrict the interface or IP address on which the OpenStack Networking API service binds a network socket for incoming client connections, specify the bind\_host and bind\_port in the neutron.conf file as shown:
de: Um die Schnittstelle oder die IP-Adresse zu beschränken, auf die der OpenStack Networking API-Dienst einen Netzwerksocket für eingehende Clientverbindungen bindet, geben Sie die bind\_host an und bind\_port in der Datei neutron.conf wie folgt:
id: Untuk membatasi antarmuka atau alamat IP di mana layanan OpenStack Networking API mengikat soket jaringan untuk koneksi klien yang masuk, tentukan bind\_host dan bind\_port di file neutron.conf seperti yang ditunjukkan:
tr_tr: OpenStack Ağ API servisinin, gelen istemci bağlantıları için bir ağ soketini bağladığı arabirimi veya IP adresini sınırlamak için, gösterildiği gibi neutron.conf dosyasında bind\_host ve bind\_port değişkenlerini belirtin:

source: To secure OpenStack Networking, you must understand how the workflow process for tenant instance creation needs to be mapped to security domains.
de: Um OpenStack Networking zu sichern, müssen Sie verstehen, wie der Workflow-Prozess für die Tenantinstanz-Erstellung auf Sicherheitsdomänen abgebildet werden muss.
id: Untuk mengamankan OpenStack Networking, Anda harus memahami bagaimana proses alur kerja untuk pembuatan instance penyewa perlu dipetakan ke domain keamanan.
tr_tr: OpenStack Ağını güvence altına almak için, kiracı örneği oluşturma için iş akışı sürecinin güvenlik alanlarına nasıl eşleştirilmesi gerektiğini anlamalısınız.

source: To start Federated authentication a user must access the dedicated URL with Identity Provider’s and Protocol’s identifiers stored within a protected URL. The URL has a format of: ``/v3/OS-FEDERATION/identity_providers/{identity_provider}/protocols/{protocol}/auth``.
de: Um die föderierte Authentifizierung zu starten, muss ein Benutzer auf die dedizierte URL zugreifen, wobei Identifikationsanbieter und Protokolle in einer geschützten URL gespeichert sind. Die URL hat ein Format von: ``/v3 /OS-FEDERATION/identity_providers/{identity_provider}/protocols/{protocol}/auth``.
tr_tr: Federe kimlik doğrulamasını başlatmak için kullanıcı, Kimlik Sağlayıcı ve Protokolün tanımlayıcılarını içeren ve korunan bir URL'de saklanan ayrılmış URL'ye erişmelidir. URL'nin bir biçimi vardır: ``/v3/OS-FEDERATION/identity_providers/{kimlik_kaynağı}/protocols/{protokol}/auth``.

source: To the cloud administrator, the API provides an overall view of the size and state of the cloud deployment and allows the creation of users, tenants/projects, assigning users to tenants/projects, and specifying resource quotas on a per tenant/project basis.
de: Für den Cloud-Administrator bietet die API einen Überblick über die Größe und den Zustand der Cloud-Bereitstellung und ermöglicht die Erstellung von Benutzern, Tenants/Projekten, die Zuordnung von Benutzern zu Tenants/Projekten und die Angabe von Ressourcenquoten pro Tenant/Projektbasis.
id: Untuk administrator awan, API menyediakan keseluruhan tampilan ukuran dan keadaan penyebaran awan dan memungkinkan pembuatan pengguna, penyewa / proyek, menugaskan pengguna ke penyewa / proyek, dan menentukan kuota sumber daya berdasarkan per penyewa / proyek.
tr_tr: Bulut yöneticisine, API, bulut dağıtımının boyut ve durumunun genel bir görünümünü sağlar ve kullanıcıların, kiracıların/projelerin oluşturulmasını, kullanıcıları kiracılara/projelere atamanın ve kiracı/proje bazında kaynak kotalarının belirlenmesini sağlar.

source: To use ephemeral disk encryption, set **option**: 'enabled = true'
de: Um die ephemeren Datenträgerverschlüsselung zu verwenden, setzen Sie **pption**: 'enabled = true'
id: Untuk menggunakan enkripsi disk fana, setel **option**: 'enabled = true'
tr_tr: Geçici disk şifreleme kullanmak için, **option**: 'enabled = true' ayarlayın

source: To utilize Federation, create the following in the Identity service: Identity Provider, Mapping, Protocol.
de: Um Föderation zu nutzen, erschaffen Sie Folgendes im Identity Service: Identity Provider, Mapping, Protocol.
tr_tr: Federasyonu kullanmak için Kimlik servisinde aşağıdakileri oluşturun: Kimlik Sağlayıcı, Eşleme, Protokol.

source: To verify further, perform these steps after completing the volume encryption setup and creating the volume-type for LUKS as described in the documentation referenced above.
de: Um dies zu überprüfen, führen Sie diese Schritte aus, nachdem Sie das Volume-Verschlüsselungs-Setup abgeschlossen haben und den Datenträgertyp für LUKS erstellen, wie in der oben genannten Dokumentation beschrieben.
id: Untuk memverifikasi lebih lanjut, lakukan langkah-langkah ini setelah menyelesaikan penyiapan enkripsi volume dan buat tipe volume untuk LUKS seperti yang dijelaskan dalam dokumentasi yang disebutkan di atas.
tr_tr: Daha fazla doğrulamak için, hacim şifreleme kurulumunu tamamladıktan ve LUKS için hacim türünü oluşturduktan sonra yukarıda atıfta bulunulan belgelendirmede açıklandığı gibi bu adımları uygulayın.

source: To verify that access rules (ACL) were configured correctly for a share, you can list its permissions.
de: Um zu überprüfen, ob Zugriffsregeln (ACL) für eine Freigabe korrekt konfiguriert wurden, können Sie ihre Berechtigungen auflisten.
id: Untuk memverifikasi bahwa aturan akses (ACL) telah dikonfigurasi dengan benar untuk sebuah share, Anda dapat mendaftarkan perizinannya.
tr_tr: Bir paylaşım için erişim kurallarının (ACL) doğru yapılandırıldığını doğrulamak için izinlerini listeleyebilirsiniz.

source: Tokens
de: Token
tr_tr: Belirteçler

source: Too much time is spent administering identities in various service providers.
de: Zu viel Zeit wird vergeutet in die Vergabe von Identitäten bei verschiedenen Dienstleistern.
tr_tr: Kimliklerin çeşitli servis sağlayıcılara verilmesi çok fazla zaman harcanıyor.

source: Track, document and verify media sanitization and disposal actions.
de: Medien-Sanierungs- und Entsorgungsmaßnahmen verfolgen, dokumentieren und verifizieren.
id: Melacak, mendokumentasikan dan memverifikasi tindakan sanitasi dan pembuangan media.
tr_tr: Medya temizlenmesini ve atma eylemlerini takip edin, belgeleyin ve doğrulayın.

source: Traditionally, memory de-duplication systems are vulnerable to side channel attacks. Both KSM and TPS have demonstrated to be vulnerable to some form of attack. In academic studies, attackers were able to identify software packages and versions running on neighboring virtual machines as well as software downloads and other sensitive information through analyzing memory access times on the attacker VM.
de: Traditionell sind Speicher-Deduplizierungssysteme anfällig für Seitenkanalangriffe. Sowohl KSM als auch TPS haben gezeigt, dass sie anfällig für irgendeine Form von Angriff sind. In akademischen Studien konnten Angreifer Softwarepakete und Versionen, die auf benachbarten virtuellen Maschinen laufen, sowie Software-Downloads und andere sensible Informationen identifizieren, indem sie die Speicherzugriffszeiten auf den Angreifer VM analysierten.
id: Secara tradisional, sistem de-duplication memori rentan terhadap serangan saluran samping. KSM dan TPS telah menunjukkan rentan terhadap beberapa bentuk serangan. Dalam studi akademis, penyerang dapat mengidentifikasi paket dan versi perangkat lunak yang berjalan pada mesin virtual tetangga serta unduhan perangkat lunak dan informasi sensitif lainnya melalui analisis waktu akses memori pada VM penyerang.
tr_tr: Geleneksel olarak bellek çoğaltma sistemleri, yan kanal saldırılarına karşı savunmasızdır. Hem KSM hem de TPS, bazı saldırı şekillerine karşı savunmasız olduklarını gösterdi. Akademik çalışmalarda saldırganlar, saldırgan VM üzerindeki bellek erişim sürelerini analiz ederek komşu sanal makinelerde çalışan yazılım paketlerini ve sürümlerini, yazılım yüklemelerini ve diğer hassas bilgileri tespit edebiliyorlardı.

source: Traffic inspection needs for load balancing.
de: Traffic Inspektionsbedarf für Lastverteilung.
id: Inspeksi lalu lintas membutuhkan load balancing.
tr_tr: Yük dengeleme için trafik inceleme ihtiyaçları.

source: Transfer memory
de: Speicher übertragen
id: Transfer memori
tr_tr: Bellek aktarımı

source: Transfer state
de: Transferzustand
id: Transfer status
tr_tr: Aktarım durumu

source: Transport Layer Security (TLS) provides authentication between services and persons using X.509 certificates. Although the default mode for TLS is server-side only authentication, certificates may also be used for client authentication.
de: Transport Layer Security (TLS) bietet die Authentifizierung zwischen Diensten und Personen mit X.509 Zertifikaten. Obwohl der Standardmodus für TLS eine serverseitige Authentifizierung ist, können auch Zertifikate für die Clientauthentifizierung verwendet werden.
id: Transport Layer Security (TLS) menyediakan otentikasi antara layanan dan orang-orang yang menggunakan sertifikat X.509. Meskipun mode default untuk TLS hanya otentikasi sisi server, sertifikat juga dapat digunakan untuk otentikasi klien.
tr_tr: Aktarım Katmanı Güvenliği (TLS), X.509 sertifikalarını kullanan kişiler ve kişiler arasında kimlik doğrulama sağlar. TLS için varsayılan kip sunucu tarafında yalnızca kimlik doğrulaması olmasına rağmen, istemciler kimlik doğrulaması için de sertifika kullanılabilir.

source: Trust Services are a set of professional attestation and advisory services based on a core set of principles and criteria that address the risks and opportunities of IT-enabled systems and privacy programs. Commonly known as the SOC audits, the principles define what the requirement is and it is the organizations responsibility to define the control that meets the requirement.
de: Trust Services sind eine Reihe von professionellen Bescheinigungen und Beratungsdienste, die auf einem Kernsatz von Prinzipien und Kriterien basieren, die die Risiken und Chancen von IT-fähigen Systemen und Datenschutzprogrammen betreffen. Häufig als SOC-Audits bekannt, definieren die Prinzipien, was die Anforderung ist und es ist die Organisation Verantwortung, die Kontrolle zu definieren, die die Anforderung erfüllt.
id: Trust Services adalah satu set pengesahan profesional dan layanan konsultasi berdasarkan seperangkat prinsip dan kriteria inti yang membahas risiko dan peluang sistem dan program perlindungan TI. Biasanya dikenal sebagai audit SOC, prinsip-prinsip tersebut menentukan apa persyaratannya dan tanggung jawab organisasi untuk menentukan kontrol yang memenuhi persyaratan.
tr_tr: Güven Servisleri, BT destekli sistemlerin ve gizlilik programlarının risk ve fırsatlarını ele alan temel bir dizi ilke ve kritere dayanan bir dizi profesyonel onaylama ve danışmanlık hizmetidir. SOC denetimleri olarak yaygın olarak bilinen ilkeler, gereksinimin ne olduğunu tanımlar ve gereksinimi karşılayan denetimi tanımlamak organizasyonların sorumluluğundadır.

source: Trusted images
de: Vertrauenswürdige Abbilder
id: Images tepercaya
tr_tr: Güvenilen imajlar

source: Trusted processes for managing the life cycle of disk images are required, as are all the previously mentioned issues with respect to data security.
de: Vertrauenswürdige Prozesse zur Verwaltung des Lebenszyklus von Plattenabbildern sind erforderlich, ebenso wie alle oben erwähnten Probleme in Bezug auf Datensicherheit.
id: Proses tepercaya untuk mengelola siklus hidup image disk diperlukan, seperti juga semua masalah yang disebutkan sebelumnya sehubungan dengan keamanan data.
tr_tr: Disk imajlarının yaşam döngüsünü yönetmek için güvenilir süreçler gereklidir ve veri güvenliği ile ilgili daha önce bahsedilen tüm sorunlar da gereklidir.

source: Type
de: Art
id: Tipe
tr_tr: Tip

source: Type 1 - report on the fairness of the presentation of management's description of the service organization's system and the suitability of the design of the controls to achieve the related control objectives included in the description as of a specified date.
de: Typ 1 - Report über die Fairness der Darstellung der Beschreibung des Systems der Dienstleistungsorganisation und die Eignung der Gestaltung der Kontrollen zur Erreichung der damit verbundenen Kontrollziele in der Beschreibung zu einem bestimmten Datum.
id: Tipe 1 - melaporkan kewajaran penyajian deskripsi manajemen tentang sistem organisasi layanan dan kesesuaian rancangan kontrol untuk mencapai tujuan pengendalian terkait yang termasuk dalam deskripsi pada tanggal yang ditentukan.
tr_tr: Tür 1 - servis organizasyonunun sistemi ile ilgili yönetim açıklamalarının sunumunun ve bu denetimin tasarımın belirli bir tarihte tanımlamaya dahil edilen ilgili kontrol hedeflerini gerçekleştirmeye uygunluğunu rapor eder.

source: Type 2 - report on the fairness of the presentation of management's description of the service organization's system and the suitability of the design and operating effectiveness of the controls to achieve the related control objectives included in the description throughout a specified period
de: Typ 2 - Report über die Fairness der Darstellung der Beschreibung des Systems der Dienstleistungsorganisation und die Eignung des Entwurfs und der betrieblichen Wirksamkeit der Kontrollen, um die damit verbundenen Kontrollziele in der Beschreibung während eines bestimmten Zeitraums zu erreichen
id: Tipe 2 - melaporkan kewajaran penyajian deskripsi manajemen tentang sistem organisasi layanan dan kesesuaian desain dan efektivitas operasi kontrol untuk mencapai tujuan pengendalian terkait yang termasuk dalam deskripsi selama periode tertentu.
tr_tr: Tür 2 - servis organizasyonunun sistemi ile ilgili yönetimin açıklamasının sunumunun adilliği ve açıklamalara dahil edilen ilgili kontrol hedeflerini belirli bir süre boyunca gerçekleştirmek için kontrollerin tasarımının ve işletme etkililiğinin uygunluğunu rapor eder

source: Type 2 - report on the fairness of the presentation of management's description of the service organization's system and the suitability of the design and operating effectiveness of the controls to achieve the related control objectives included in the description throughout a specified period.
de: Typ 2 - Report über die Fairness der Darstellung der Beschreibung des Systems der Dienstleistungsorganisation und die Eignung des Entwurfs und der betrieblichen Wirksamkeit der Kontrollen, um die damit verbundenen Kontrollziele in der Beschreibung während eines bestimmten Zeitraums zu erreichen.
id: Tipe 2 - melaporkan keadilan penyajian deskripsi manajemen tentang sistem organisasi layanan dan kesesuaian desain dan efektivitas operasi kontrol untuk mencapai tujuan pengendalian terkait yang termasuk dalam deskripsi sepanjang periode yang ditentukan.
tr_tr: Tür 2 - servis organizasyonunun sistemi ile ilgili yönetim açıklamalarının sunumunun adilliği ve açıklamalara dahil edilen ilgili kontrol hedeflerini belirli bir süre boyunca yerine getirmek için kontrollerin tasarım ve işletme verimliliğinin uygunluğunu rapor eder.

source: Typically a metal box with spinning disks, ethernet ports, and some kind of software that allows network clients to read and write files on the disks. There are also software-only storage controllers that run on arbitrary hardware, clustered controllers which may run allow a multiple physical devices to appear as a single storage controller, or purely virtual storage controllers.
de: In der Regel ein Metall-Box mit Spinndisketten, Ethernet-Ports und eine Art von Software, die Netzwerk-Clients erlaubt, Dateien auf Festplatten zu lesen und zu schreiben. Es gibt auch Software-only-Speicher-Controller, die auf beliebigen Hardware laufen, Cluster-Controller, die ausgeführt werden können, ermöglichen es, dass mehrere physikalische Geräte als ein einziger Speichercontroller oder rein virtuelle Speichercontroller erscheinen.
id: Biasanya kotak logam dengan disk berputar, port ethernet, dan beberapa jenis perangkat lunak yang memungkinkan klien jaringan membaca dan menulis file di disk. Ada juga controller penyimpanan software-only yang berjalan di perangkat keras sembarangan, controller kluster yang berjalan menigizinkan beberapa perangkat fisik muncul sebagai controller penyimpanan tunggal, atau controller penyimpanan virtual yang murni
tr_tr: Tipik olarak, dönen diskler, ethernet bağlantı noktaları ve ağ istemcilerinin disklerdeki dosyaları okumasına ve yazmasına olanak tanıyan bir tür yazılım içeren bir metal kutu. Ayrıca rastgele donanım üzerinde çalışan, yalnızca birden fazla fiziksel aygıtın tek bir depolama denetleyicisi olarak görünmesine veya tamamen sanal depolama denetleyicilerine izin verebilen kümelenmiş denetleyicilerde çalışan salt yazılımlı depolama denetleyicileri de vardır.

source: Typically this is achieved through Copy-On-Write (COW) mechanisms. These mechanisms have been shown to be vulnerable to side-channel attacks where one VM can infer something about the state of another and might not be appropriate for multi-tenant environments where not all tenants are trusted or share the same levels of trust.
de: Typischerweise wird dies durch Copy-On-Write (COW)-Mechanismen erreicht. Diese Mechanismen haben sich als anfällig für Side-Channel-Angriffe, wo eine VM etwas über den Zustand eines anderen erfahren kann und ist nicht geeignet für Multi-Tenant-Umgebungen, wo nicht alle Tenant vertraut sind oder das gleiche Maß an Vertrauen teilen.
id: Biasanya hal ini dicapai melalui mekanisme Copy-On-Write (COW). Mekanisme ini terbukti rentan terhadap serangan saluran samping di mana satu VM dapat menyimpulkan sesuatu tentang keadaan lain dan mungkin tidak sesuai untuk lingkungan multi-tenant dimana tidak semua penyewa dipercaya atau memiliki tingkat kepercayaan yang sama.
tr_tr: Tipik olarak bu, Kopyalama Üzerinde Yazma (COW) mekanizmaları aracılığıyla gerçekleştirilir. Bu mekanizmaların, bir VM'nin bir diğerinin durumuyla ilgili bir çıkarım yapabileceği ve tüm kiracıların güvenilir olmadığı veya aynı düzeyde güven paylaştığı çok kiracı ortamlar için uygun olmayabileceği yan kanal saldırılarına karşı savunmasız olduğu gösterilmiştir.

source: Typically used for compute instance-to-instance traffic, the guest security domain handles compute data generated by instances on the cloud but not services that support the operation of the cloud, such as API calls.
de: Typisch für die Compute von Instanz-zu-Instanz-Verkehr verwendet, die Gast-Security-Domäne verarbeitet Compute-Daten, die von Instanzen auf der Cloud erzeugt werden, aber nicht Dienste, die den Betrieb der Cloud unterstützen, wie z. B. API-Aufrufe.
id: Biasanya digunakan untuk menghitung lalu lintas instance-to-instance, domain keamanan tamu menangani data yang dihasilkan oleh kejadian di awan namun bukan layanan yang mendukung pengoperasian awan, seperti panggilan API.
tr_tr: Hesaplama örnekten örneğe trafiği için genellikle kullanılan konuk güvenlik alanı, bulut üzerindeki örnekler tarafından üretilen hesaplama verilerini işler ancak bulut işlemini destekleyen API çağrıları gibi hizmetleri desteklemez.

source: Typically, when an SSH daemon is installed, host keys will be generated. It is necessary that the hosts have sufficient entropy during host key generation. Insufficient entropy during host key generation can result in the possibility to eavesdrop on SSH sessions.
de: In der Regel, wenn ein SSH-Daemon installiert ist, werden Host-Keys generiert. Es ist notwendig, dass die Hosts eine ausreichende Entropie während der Host-Key-Generierung haben. Eine unzureichende Entropie während der Host-Key-Generierung kann dazu führen, dass die SSH-Sitzungen abgehört werden können.
id: Biasanya, ketika daemon SSH terinstal, host key akan dihasilkan. Hal ini diperlukan agar host memiliki entropi yang cukup selama generasi host key. Entropi yang tidak mencukupi selama generasi host key dapat mengakibatkan kemungkinan untuk menguping (eavesdrop) sesi SSH.
tr_tr: Genellikle, bir SSH servisi yüklendiğinde, sunucu anahtarları oluşturulur. Sunucuların ana anahtar oluşturma sırasında yeterli entropi göstermeleri gerekir. Ana anahtar oluşturma sırasında yetersiz entropi, SSH oturumlarını dinleme olasılığına neden olabilir.

source: US Export restrictions on cryptography systems have been lifted and no longer need to be supported.
de: US Exportbeschränkungen für Kryptographie-Systeme wurden aufgehoben und müssen nicht mehr unterstützt werden.
id: Pembatasan US Export pada sistem kriptografi telah dicabut dan tidak perlu lagi didukung.
tr_tr: ABD şifreleme sistemleri üzerindeki ihracat kısıtlamaları kaldırıldı ve artık desteklenmesi gerekmiyor.

source: UUID tokens
de: UUID-Token
tr_tr: UUID belirteçler

source: Understanding the audit process
de: Verständnis des Prüfungsprozesses
id: Memahami proses audit
tr_tr: Denetim sürecini anlamak

source: Unfortunately, this solution complicates the task of more fine-grained access control and the ability to audit data access. Because the nova-conductor service receives requests over RPC, it highlights the importance of improving the security of messaging. Any node with access to the message queue may execute these methods provided by the nova-conductor and effectively modifying the database.
de: Leider kompliziert diese Lösung die Aufgabe der feinkörnigeren Zutrittskontrolle und die Möglichkeit, den Datenzugriff zu prüfen. Da der Nova-Conductor-Service Anfragen über RPC erhält, hebt er die Bedeutung der Verbesserung der Sicherheit von Messaging hervor. Jeder Knoten mit Zugriff auf die Nachrichtenwarteschlange kann diese vom Nova-Conductor bereitgestellten Methoden ausführen und die Datenbank effektiv modifizieren.
id: Sayangnya, solusi ini mempersulit tugas kontrol akses yang lebih halus dan kemampuan untuk mengaudit akses data. Karena layanan nova-conductor menerima permintaan di atas RPC, ini menyoroti pentingnya meningkatkan keamanan pesan. Setiap node dengan akses ke antrian pesan (message queue) dapat menjalankan metode yang disediakan oleh konduktor nova dan memodifikasi database secara efektif.
tr_tr: Maalesef, bu çözüm, daha hassas erişim kontrolü ve veri erişimini denetleme becerisini zorlaştırıyor. nova-conductor servisi, RPC üzerinden istek aldığından mesajlaşma güvenliğini artırmanın önemini vurgular. Mesaj sırasına erişimi olan herhangi bir düğüm, nova-conductor'un sağladığı bu yöntemleri uygulayabilir ve veritabanını etkili bir şekilde değiştirebilir.
