Repository: openstack/security-doc
Catalog: security-guide/source/locale/*/LC_MESSAGES/security-guide.po
Languages: de, id, tr_tr

source: Mandatory Access Control (MAC) restricts access to objects based on labels assigned to subjects and objects. Sensitivity labels are automatically attached to processes and objects. The access control policy enforced using these labels is derived from the :term:`Bell-LaPadula model`. SELinux categories are attached to virtual machines and its resources. The access control policy enforced using these categories grant virtual machines access to resources if the category of the virtual machine is identical to the category of the accessed resource. The TOE implements non-hierarchical categories to control access to virtual machines.
de: Mandatory Access Control (MAC) beschränkt den Zugriff auf Objekte auf der Grundlage von Etiketten, die Themen und Objekten zugeordnet sind. Sensitivitätsetiketten werden automatisch an Prozesse und Objekte angehängt. Die mit diesen Etiketten erzwungene Zutrittskontrollpolitik ergibt sich aus dem :term:`Bell-LaPadula model`. SELinux-Kategorien sind an virtuelle Maschinen und deren Ressourcen angehängt. Die mit diesen Kategorien erzwungene Zugriffskontrollrichtlinie gewährt virtuellen Maschinen Zugriff auf Ressourcen, wenn die Kategorie der virtuellen Maschine mit der Kategorie der zugegriffenen Ressource identisch ist. Der TOE implementiert nicht hierarchische Kategorien, um den Zugriff auf virtuelle Maschinen zu kontrollieren.
id: Mandatory Access Control (MAC) membatasi akses ke objek berdasarkan label yang ditetapkan untuk subjek dan objek. Label sensitivitas secara otomatis melekat pada proses dan objek. Kebijakan kontrol akses yang diberlakukan dengan menggunakan label ini berasal dari :term:`Bell-LaPadula model`. Kategori SELinux dilekatkan pada mesin virtual dan sumber dayanya. Kebijakan kontrol akses yang diberlakukan dengan menggunakan kategori ini memberi akses mesin virtual ke sumber daya jika kategori mesin virtual identik dengan kategori sumber daya yang diakses. TOE menerapkan kategori non-hierarkis untuk mengendalikan akses ke mesin virtual.
tr_tr: Zorunlu Erişim Kontrolü (MAC), nesnelere ve nesnelere atanmış etiketler temelinde erişimi sınırlar. Duyarlılık etiketleri, süreçlere ve nesnelere otomatik olarak eklenir. Bu etiketleri kullanarak uygulanan erişim kontrolü politikası :term:`"Bell-LaPadula modeli`nden türetilmiştir. SELinux kategorileri sanal makinelere ve kaynaklarına bağlıdır. Bu kategorileri kullanarak uygulanan erişim denetimi ilkesi, sanal makinenin kategorisi erişilen kaynak kategorisine eşitse, sanal makinelere kaynaklara erişim hakkı verir. TOE, sanal makinelere erişimi kontrol etmek için hiyerarşik olmayan kategoriler uygular.

source: Mandatory access controls
de: Obligatorische Zugriffskontrollen
id: Kontrol akses wajib (Mandatory Access Control)
tr_tr: Sorunlu erişim kontrolleri

source: Mandatory access controls affect all users on the system, including root, and it is the kernel's job to review the activity against the current security policy. If the activity isn't within the allowed policy, it is blocked, even for the root user. Review the discussion on sVirt, SELinux, and AppArmor below for more details.
de: Obligatorische Zugriffskontrollen beeinflussen alle Benutzer auf dem System, einschließlich Root, und es ist die Aufgabe des Kernels, die Aktivität gegen die aktuelle Sicherheitsrichtlinie zu überprüfen. Wenn die Aktivität nicht innerhalb der erlaubten Richtlinie liegt, wird sie auch für den Root-Benutzer gesperrt. Überprüfen Sie die Diskussion über sVirt, SELinux und AppArmor unten für weitere Details.
id: Kontrol akses wajib mempengaruhi semua pengguna di sistem, termasuk root, dan ini adalah tugas kernel untuk meninjau aktivitas terhadap kebijakan keamanan saat ini. Jika aktivitas tidak sesuai dengan kebijakan yang diijinkan, maka hal itu diblokir, bahkan untuk pengguna root. Tinjaulah diskusi di sVirt, SELinux, dan AppArmor di bawah ini untuk lebih jelasnya.
tr_tr: Zorunlu erişim denetimleri, root dahil sistemler üzerindeki tüm kullanıcıları etkiler ve etkinliği mevcut güvenlik ilkesine göre gözden geçirmek çekirdeğin görevi olur. Etkinlik izin verilen politikanın içinde değilse, root kullanıcısı için bile engellenir. Daha fazla ayrıntı için aşağıdaki sVirt, SELinux ve AppArmor tartışmalarını inceleyin.

source: Many hypervisors offer a functionality known as PCI passthrough. This allows an instance to have direct access to a piece of hardware on the node. For example, this could be used to allow instances to access video cards or GPUs offering the compute unified device architecture (CUDA) for high performance computation. This feature carries two types of security risks: direct memory access and hardware infection.
de: Viele Hypervisoren bieten eine Funktionalität, die als PCI-Passthrough bekannt ist. Dies ermöglicht eine Instanz direkten Zugriff auf ein Stück Hardware auf dem Knoten. Zum Beispiel könnte dies verwendet werden, um Instanzen zu ermöglichen, auf Videokarten oder GPUs zuzugreifen, die die Berechnungseinheit der Unified Device Architecture (CUDA) für die Hochleistungsberechnung anbieten. Diese Funktion trägt zwei Arten von Sicherheitsrisiken: direkter Speicherzugriff und Hardwareinfektion.
id: Banyak hypervisor menawarkan fungsionalitas yang dikenal sebagai passthrough PCI. Hal ini memungkinkan sebuah instance untuk memiliki akses langsung ke perangkat keras pada node. Misalnya, ini bisa digunakan untuk mengizinkan instance mengakses kartu video atau GPU yang menawarkan compute unified device architecture (CUDA) untuk perhitungan kinerja tinggi. Fitur ini membawa dua jenis risiko keamanan: akses memori langsung dan infeksi perangkat keras.
tr_tr: Birçok hipervizör, PCI geçidi olarak bilinen bir işlevsellik sunar. Bu, bir örneğin düğüm üzerindeki bir donanıma doğrudan erişmesini sağlar. Örneğin, bu, örneklerin yüksek performanslı hesaplama için birleştirilmiş cihaz mimarisi (CUDA) hesaplayan ekran kartlarına veya GPU'lara erişmesine izin vermek için kullanılabilir. Bu özellik iki tür güvenlik riski taşır: doğrudan bellek erişimi ve donanım enfeksiyonu.

source: Many hypervisors use memory optimization techniques to overcommit memory to guest virtual machines. This is a useful feature that allows you to deploy very dense compute clusters. One way to achieve this is through de-duplication or sharing of memory pages. When two virtual machines have identical data in memory, there are advantages to having them reference the same memory.
de: Viele Hypervisoren nutzen Speicheroptimierungstechniken, um Speicher auf virtuelle Gastsystemen überzubelegen. Dies ist eine nützliche Funktion, mit der Sie sehr dichte Rechencluster einsetzen können. Eine Möglichkeit, dies zu erreichen, ist durch De-Duplizierung oder Freigabe von Speicherseiten. Wenn zwei virtuelle Maschinen identische Daten im Speicher haben, gibt es Vorteile, um sie auf denselben Speicher zu verweisen.
id: Banyak hypervisor menggunakan teknik pengoptimalan memori untuk overcommit memory ke mesin virtual guest. Ini adalah fitur berguna yang memungkinkan Anda untuk menggunakan cluster komputasi yang sangat padat. Salah satu cara untuk mencapainya adalah melalui de-duplicatio atau pembagian halaman memori. Ketika dua mesin virtual memiliki data yang sama dalam memori, ada keuntungan untuk meminta mereka untuk merujuk memori yang sama.
tr_tr: Çoğu hipervizör, bellek konuk sanal makinelere aşırı yüklemek için bellek optimizasyon teknikleri kullanır. Bu, çok yoğun hesap kümeleri dağıtmanıza olanak tanıyan kullanışlı bir özelliktir. Bunu başarmanın bir yolu, bellek sayfalarının çoğaltılması veya paylaşılmasıdır. İki sanal makine, bellekte aynı verilere sahip olduğunda, aynı belleğe başvurmalarının avantajları vardır.

source: Many modern Linux distributions already build QEMU with compiler hardening enabled, we recommend verifying your existing executable before proceeding. One tool that can assist you with this verification is called `checksec.sh <http://www.trapkit.de/tools/checksec.html>`_
de: Viele moderne Linux-Distributionen bauen bereits QEMU mit aktiviertem Compiler Hardening, wir empfehlen Ihnen, Ihre vorhandene ausführbare Datei zu überprüfen, bevor Sie fortfahren. Ein Werkzeug, das Sie bei dieser Überprüfung unterstützen kann, heißt `checksec.sh` <http://www.trapkit.de/tools/checksec.html>`_
id: Banyak distribusi Linux modern yang sudah membangun QEMU dengan pengerasan kompilator, kami sarankan untuk memverifikasi executable yang ada sebelum melanjutkan. Salah satu alat yang dapat membantu Anda dengan verifikasi ini disebut `checksec.sh <http://www.trapkit.de/tools/checksec.html>`_
tr_tr: Birçok modern Linux dağıtımı zaten derleyici sıkılaştırma etkin QEMU oluşturur, devam etmeden önce varolan çalıştırılabilir dosyanın doğrulanmasını öneririz. Bu doğrulamayla size yardımcı olabilecek bir araç `checksec.sh <http://www.trapkit.de/tools/checksec.html>`_ olarak adlandırılır

source: Many operating systems now provide compartmentalization support. Linux supports namespaces to assign processes into independent domains. Other parts of this guide cover system compartmentalization in more detail.
de: Viele Betriebssysteme bieten jetzt Kompartimentierungsunterstützung. Linux unterstützt Namespaces, um Prozesse in unabhängige Domänen zu vergeben. Andere Teile dieser Anleitung decken die Systemabteilung genauer ab.
id: Banyak sistem operasi sekarang menyediakan dukungan kompartementalisasi. Linux mendukung namespace untuk menetapkan proses ke dalam domain independen. Bagian lain dari panduan ini mencakup kompartementalisasi sistem secara lebih rinci.
tr_tr: Pek çok işletim sistemi artık bölümlendirme desteği sağlamaktadır. Linux süreçleri bağımsız alanlara atamak için isim alanlarını destekler. Bu kılavuzun diğer kısımları sistem bölümlemesini daha ayrıntılı olarak kapsar.

source: Many organizations have an established Public Key Infrastructure with their own Certification Authority (CA), certificate policies, and management for which they should use to issue certificates for internal OpenStack users or services. Organizations in which the public security domain is Internet facing will additionally need certificates signed by a widely recognized public CA. For cryptographic communications over the management network, it is recommended one not use a public CA. Instead, we expect and recommend most deployments deploy their own internal CA.
de: Viele Organisationen verfügen über eine etablierte Public Key Infrastructure mit einer eigenen Zertifizierungsstelle (CA), Zertifikatsrichtlinien und Management, für die sie Zertifikate für interne OpenStack-Benutzer oder -Dienste ausstellen sollen. Organisationen, in denen die public Sicherheits-Domain zum Internet gerichtet ist, benötigt zusätzlich von einer anerkannten öffentlichen CA unterzeichnete Zertifikate. Für die kryptografische Kommunikation über das Management-Netzwerk wird empfohlen, dass man keine öffentliche CA verwendet. Stattdessen erwarten wir und empfehlen den meisten Bereitstellungen, ihre eigene interne CA bereitzustellen.
id: Banyak organisasi memiliki Public Key Infrastructure yang mapan dengan Certification Authority (CA) mereka sendiri, kebijakan sertifikat, dan manajemen yang harus mereka gunakan untuk menerbitkan sertifikat untuk pengguna atau layanan OpenStack internal. Organisasi di mana domain keamanan publik yang dihadapi Internet juga memerlukan sertifikat yang ditandatangani oleh CA publik yang diakui secara luas. Untuk komunikasi kriptografi melalui jaringan manajemen, disarankan agar tidak menggunakan CA publik. Sebagai gantinya, kami mengharapkan dan merekomendasikan sebagian besar penerapan menggunakan CA internal mereka sendiri.
tr_tr: Birçok organizasyon, kendi OpenStack kullanıcıları veya servisleri için sertifika vermek üzere kullanmaları gereken kendi Sertifika Otoritesi (CA), sertifika ilkeleri ve yönetimi olan bir Genel Anahtar Altyapısına sahiptir. Kamu güvenliği alanının İnternet'e baktığı organizasyonlar ayrıca, yaygın olarak tanınan bir genel CA tarafından imzalanmış sertifikalara ihtiyaç duyacaktır. Yönetim ağı üzerinden şifreleme iletişimi için, genel bir CA kullanmamaları önerilir. Bunun yerine, çoğu dağıtımın kendi dahili CA'sını kurmasını bekliyoruz ve öneriyoruz.

source: Many organizations typically deploy web applications at subdomains of an overarching organization domain. It is natural for users to expect a domain of the form ``openstack.example.org``. In this context, there are often applications which are deployed in the same second-level namespace. This name structure is convenient and simplifies name server maintenance.
de: Viele Organisationen stellen in der Regel Webanwendungen in Subdomains einer übergreifenden Organisationsdomäne bereit. Es ist natürlich für Benutzer, eine Domain der Form ``openstack.example.org``zu erwarten. In diesem Zusammenhang gibt es häufig Anwendungen, die im selben Namespace der zweiten Ebene eingesetzt werden. Diese Namensstruktur ist bequem und vereinfacht die Wartung des Nameservers.
id: Banyak organisasi biasanya menyebarkan aplikasi web di subdomain dari domain organisasi yang melindunginya (overarching). Adalah wajar bagi pengguna untuk mengharapkan sebuah domain dengan bentuk ``openstack.example.org``. Dalam konteks ini, sering ada aplikasi yang digunakan dalam namespace second-level yang sama. Struktur nama ini nyaman dan menyederhanakan pemeliharaan server nama.
tr_tr: Birçok organizasyon, genelde, web uygulamaları, kapsamlı bir organizasyon alanının alt alanlarına yerleştirir. Kullanıcıların ``openstack.example.org`` şeklinde bir alanı beklemesi doğaldır. Bu bağlamda, genellikle aynı ikinci düzey alan alanına dağıtılan uygulamalar vardır. Bu isim yapısı kullanışlıdır ve isim sunucusu bakımını basitleştirir.

source: Many times interesting events trigger an alert which is sent to a responder for action. Frequently this alert takes the form of an email with the messages of interest. An interesting event could be a significant failure, or known health indicator of a pending failure. Two common utilities for managing alerts are `Nagios <https://www.nagios.org>`_ and `Zabbix <http://www.zabbix.com>`_.
de: Viele interessante Ereignisse lösen einen Alarm aus, der an einen Responder geschickt wird. Häufig nimmt diese Warnung die Form einer E-Mail mit den Nachrichten von Interesse. Ein interessantes Ereignis könnte ein erhebliches Versagen sein, oder bekannte Gesundheits-Indikatoren eines ausstehenden Versagens. Zwei gemeinsame Dienstprogramme für die Verwaltung von Warnungen sind `Nagios <https://www.nagios.org>``und `Zabbix <http://www.zabbix.com>`_.

source: MapR Technologies, Apache Hadoop for the MapR Converged Data Platform. 2016. `MapR project <https://www.mapr.com/products/mapr-distribution-including-apache-hadoop>`__
de: MapR Technologies, Apache Hadoop für die MapR Converged Data Platform. 2016. `MapR-Projekt <https://www.mapr.com/products/mapr-distribution-including-apache-hadoop>`__
tr_tr: MapR Teknolojileri, MapR Tümleşik Veri Platformu için Apache Hadoop. 2016. `MapR projesi <https://www.mapr.com/products/mapr-distribution-including-apache-hadoop>`__

source: Medium
de: Mittel
tr_tr: Orta

source: Medium / low
de: Mittel/niedrig
tr_tr: Orta / düşük

source: Message queue process isolation and policy
de: Message Queue Prozess Isolation und Policy
id: Isolasi proses antrian pesan dan kebijakan
tr_tr: Mesaj kuyruğu işlemi izolasyonu ve politikası

source: Message queue service processes should be isolated from each other and other processes on a machine.
de: Message-Queue-Service-Prozesse sollten voneinander getrennt sein und andere Prozesse auf einer Maschine.
id: Proses pelayanan antrian pesan harus diisolasi satu sama lain dan proses lainnya pada mesin.
tr_tr: Mesaj kuyruğu servis işlemleri birbirinden ve diğer makinelerdeki işlemlerden izole edilmelidir.

source: Message queues effectively facilitate command and control functions across OpenStack deployments. Once access to the queue is permitted, no further authorization checks are performed. Services accessible through the queue do validate the contexts and tokens within the actual message payload. However, you must note the expiration date of the token because tokens are potentially re-playable and can authorize other services in the infrastructure.
de: Message-Warteschlangen erleichtern Befehls- und Kontrollfunktionen in OpenStack-Bereitstellungen. Sobald der Zugriff auf die Warteschlange erlaubt ist, werden keine weiteren Berechtigungsprüfungen durchgeführt. Services, die über die Warteschlange zugänglich sind, validieren die Kontexte und Token innerhalb der aktuellen Nachrichten-Payload. Allerdings müssen Sie das Ablaufdatum des Tokens beachten, da Token möglicherweise wieder spielbar sind und andere Dienste in der Infrastruktur autorisieren können.
id: Antrian pesan secara efektif memfasilitasi fungsi perintah dan kontrol di seluruh penerapan OpenStack. Setelah akses ke antrian diizinkan, tidak ada pemeriksaan otorisasi lebih lanjut yang dilakukan. Layanan yang dapat diakses melalui antrian memvalidasi konteks dan token di dalam muatan pesan aktual. Namun, Anda harus mencatat tanggal kedaluwarsa token karena token berpotensi dimainkan ulang dan dapat memberi otorisasi pada layanan lain di infrastruktur.
tr_tr: Mesaj kuyrukları, OpenStack dağıtımlarında komut ve kontrol fonksiyonlarını etkin bir şekilde kolaylaştırır. Sıra erişimine izin verildiğinde başka yetkilendirme denetimi yapılmaz. Sırada erişilebilen hizmetler gerçek mesaj yükü içindeki bağlamları ve belirteçleri doğrulamaktadır. Bununla birlikte, belirteçlerin son kullanma tarihini not etmeniz gerekir çünkü belirteçler potansiyel olarak oynatılabilir ve altyapıda diğer hizmetlere yetki verebilir.

source: Message queuing
de: Nachrichtenwarteschlangen
id: Antrian pesan
tr_tr: Mesaj kuyruklama

source: Message queuing services facilitate inter-process communication in OpenStack. OpenStack supports these message queuing service back ends:
de: Message Queuing Services erleichtern die Interprozesskommunikation in OpenStack. OpenStack unterstützt diese Message-Warteschlangen-Service-Backends:
id: Layanan antrian pesan memudahkan komunikasi antar proses di OpenStack. OpenStack mendukung layanan antrian pesan ini kembali:
tr_tr: Mesaj kuyruklama servisleri, OpenStack'te süreçler arası iletişimi kolaylaştırır. OpenStack bu mesaj kuyruklama servisinin arka uçlarını desteklemektedir:

source: Messaging is used for internal communication between several OpenStack services. By default, OpenStack uses message queues based on the :term:`AMQP <Advanced Message Queuing Protocol (AMQP)>`. Like most OpenStack services, AMQP supports pluggable components. Today the implementation back end could be RabbitMQ, Qpid, or ZeroMQ.
de: Nachrichten werden zur internen Kommunikation zwischen verschiedenen OpenStack-Diensten benutzt. Grundsätzlich benutzt OpenStack Nachrichten-Warteschlangen basierend auf :term:`AMQP <Advanced Message Queuing Protocol (AMQP)>`. Wie die meisten OpenStack Dienste unterstützt AMQP steckbare Komponenten. Heute kann als Backend RabbitMQ, Qpid oder ZeroMQ implementiert werden.
id: Messaging digunakan untuk komunikasi internal antara beberapa layanan OpenStack. Secara default, OpenStack menggunakan antrian pesan berdasarkan :term:`AMQP <Advanced Message Queuing Protocol (AMQP)>`. Seperti kebanyakan layanan OpenStack, AMQP mendukung komponen pluggable. Saat ini penerapan back end bisa berupa RabbitMQ, Qpid, atau ZeroMQ.

source: Messaging security
de: Messaging-Sicherheit
id: Keamanan pesan
tr_tr: Mesajlaşma güvenliği

source: Messaging transport security
de: Messaging-Transportsicherheit
id: Keamanan pengiriman pesan
tr_tr: Mesajlaşma taşıma güvenliği

source: Metadata stored by an OpenStack cloud includes the following non-exhaustive items:
de: Metadaten, die von einer OpenStack-Cloud gespeichert werden, enthalten die folgenden nicht erschöpfenden Elemente:
id: Metadata yang disimpan oleh awan OpenStack mencakup item berikut yang tidak lengkap (non-exhaustive):
tr_tr: Bir OpenStack bulutu tarafından saklanan metaverileri, aşağıdaki kapsamlı olmayan öğeleri içerir:

source: Migration network
de: Migrationsnetzwerk
id: Jaringan migrasi
tr_tr: Göç ağı

source: Minimizing the QEMU code base
de: Minimierung der QEMU-Codebasis
id: Meminimalkan basis kode QEMU
tr_tr: QEMU kod tabanını küçültmek

source: Minimizing the code base.
de: Minimierung der Codebasis.
id: Meminimalkan basis kode.
tr_tr: Kod tabanını küçültmek.

source: Mitigate ARP spoofing
de: Mildern von ARP-Spoofing
id: Mengurangi spoofing ARP
tr_tr: ARP aldatmayı azaltmak

source: Mode
de: Modus
tr_tr: Kip

source: Monitor the traffic on the management network. The anomalies might be easier to track than on the busier compute nodes.
de: Überwachen Sie den Verkehr im Management-Netzwerk. Die Anomalien sind vielleicht einfacher zu verfolgen als auf den belebten Rechenknoten.
id: Pantau lalu lintas di jaringan manajemen. Anomali mungkin lebih mudah dilacak daripada pada node komptasi yang sibuk.
tr_tr: Yönetim ağındaki trafiği izleyin. Anomalilerin, daha yoğun işleyen düğümlerden daha kolay izlenebilir.

source: Monitoring and logging
de: Überwachung und Protokollierung
id: Pemantauan dan logging
tr_tr: İzleme ve günlükleme

source: Monitoring is a critical component of IT infrastructure, we recommend the `Compute logfiles <https://docs.openstack.org/newton/config-reference/compute/logs.html>`_ be monitored and analyzed so that meaningful alerts can be created.
de: Monitoring ist ein wichtiger Bestandteil der IT-Infrastruktur, wir empfehlen die `Compute Log-Dateien <https://docs.openstack.org/newton/config-reference/compute/logs.html>`_ zu überwachen und zu analysieren, so dass sinnvolle Alarme erstellt werden können.
id: Pemantauan merupakan komponen penting dari infrastruktur TI, kami merekomendasikan `Compute logfiles <https://docs.openstack.org/newton/config-reference/compute/logs.html>`_ dipantau dan dianalisis sehingga peringatan yang berarti dapat diciptakan.
tr_tr: İzleme, BT altyapısı için önemli bir bileşendir, anlamlı uyarıların oluşturulabilmesi için `İşleme günlük dosyalarını <https://docs.openstack.org/newton/config-reference/compute/logs.html>`_ izlemeyi ve analiz etmeyi öneriyoruz.

source: Monitoring the output of the service controller is a powerful forensic tool, as described more thoroughly in :doc:`../monitoring-logging`. The Data processing service controller offers a few options for setting the location and level of logging.
de: Die Überwachung des Ausgangssignals des Service-Controllers ist ein leistungsfähiges forensisches Werkzeug, wie ausführlicher beschrieben in :doc:`../monitoring-logging`. Der Data Processing Service Controller bietet einige Optionen für die Einstellung der Lage und der Ebene der Protokollierung.
id: Pemantauan output dari pengontrol layanan adalah alat forensik yang hebat, seperti yang dijelaskan lebih teliti di :doc:`../monitoring-logging`. Pengontrol layanan pengolahan data menawarkan beberapa pilihan untuk mengatur lokasi dan tingkat logging.
tr_tr: Servis denetleyicisinin çıktısını izlemek, daha kapsamlı bir şekilde açıklandığı gibi güçlü bir adli araçtır :doc:`../monitoring-logging`. Veri işleme servis denetleyicisi, günlüğe kaydetme konumunu ve seviyesini ayarlamak için birkaç seçenek sunar.

source: Monitoring use cases
de: Überwachung von Anwendungsfällen
id: Memantau kasus penggunaan
tr_tr: İzleme kullanım örnekleri

source: Monitoring, alerting, and reporting
de: Überwachung, Alarmierung und Reporting
id: Monitoring, peringatan, dan pelaporan
tr_tr: İzleme, uyarı ve raporlama
