Repository: openstack/security-doc
Catalog: security-guide/source/locale/*/LC_MESSAGES/security-guide.po
Languages: de, id, tr_tr

source: **Pass:** If permissions are set to 640 or stricter, or the containing directory is set to 750. The permissions of 640/750 translates into owner r/w, group r, and no rights to others i.e. "u=rw,g=r,o=". Note that with :ref:`check_block_01` and permissions set to 640, root has read/write access and cinder has read access to these configuration files. The access rights can also be validated using the following command. This command will only be available on your system if it supports ACLs.
id: **Pass:** Jika izin diatur ke 640 atau lebih ketat, atau direktori yang berisi diatur ke 750. Izin 640/750 diterjemahkan ke dalam pemilik r / w, grup r, dan tidak ada hak kepada orang lain yaitu "u = rw , g = r, o = ". Perhatikan bahwa dengan :ref: `check_block_01` dan izin diatur ke 640, root memiliki akses baca / tulis dan cinder memiliki akses baca ke file konfigurasi ini. Hak akses juga dapat divalidasi menggunakan perintah berikut. Perintah ini hanya akan tersedia di sistem Anda jika mendukung ACL.

source: **Pass:** If permissions are set to 640 or stricter, or the containing directory is set to 750. The permissions of 640/750 translates into owner r/w, group r, and no rights to others. For example, "u=rw,g=r,o=".
id: **Pass:** Jika izin diatur ke 640 atau lebih ketat, atau direktori yang berisi diatur ke 750. Izin 640/750 diterjemahkan ke dalam pemilik r/w, group r, dan tidak ada hak kepada orang lain. Misalnya, "u=rw,g=r,o=".

source: **Pass:** If permissions are set to 640 or stricter, or the containing directory is set to 750. The permissions of 640/750 translates into owner r/w, group r, and no rights to others. For example, ``u=rw,g=r,o=``.
id: **Pass:** Jika izin diatur ke 640 atau lebih ketat, atau direktori yang berisi diatur ke 750. Izin 640/750 diterjemahkan ke dalam pemilik r/w, grup r, dan tidak ada hak kepada orang lain. Sebagai contoh, ``u=rw,g=r,o=``.

source: **Pass:** If value of parameter ``auth_strategy`` under ``[api]`` or ``[DEFAULT]`` section in ``/etc/nova/nova.conf`` is set to ``keystone``.
id: **Pass:** Jika nilai parameter `` auth_strategy`` di bawah ``[api]`` atau bagian``[DEFAULT]`` di ``/etc/nova/nova.conf``diatur ke ``keystone``.

source: **Pass:** If value of parameter ``copy_from`` in ``/etc/glance/policy.json`` is set to a restricted value, for example ``role:admin``.
id: **Pass:* Jika nilai parameter ``copy_from`` di ``/etc/glance/policy.json`` diatur ke nilai yang dibatasi, misalnya ``role: admin``.

source: **Pass:** If value of parameter ``www_authenticate_uri`` under ``[keystone_authtoken]`` section in ``/etc/cinder/cinder.conf`` is set to Identity API endpoint starting with ``https://`` and value of parameter ``insecure`` under the same ``[keystone_authtoken]`` section in the same ``/etc/cinder/cinder.conf`` is set to ``False``.
id: **Pass:** Jika nilai parameter ``www_authenticate_uri`` di bawah `` [keystone_authtoken] `` bagian di ``/etc/cinder/cinder.conf`` diatur ke titik akhir API Identitas yang dimulai dengan ``https://`` dan nilai parameter ``insecure`` di bawah bagian `` [keystone_authtoken] `` yang sama di ``/etc/cinder/cinder.conf`` yang sama diatur ke ``False``.

source: **Pass:** If value of parameter ``www_authenticate_uri`` under ``[keystone_authtoken]`` section in ``/etc/glance/glance-api.conf`` is set to the Identity API endpoint starting with ``https://``, and the value of the parameter ``insecure`` is under the same ``[keystone_authtoken]`` section in the same ``/etc/glance/glance-registry.conf`` is set to ``False``.
id: **Pass:** Jika nilai parameter `` www_authenticate_uri`` di bawah bagian ``[keystone_authtoken] `` di ``/etc/glance/glance-api.conf`` diatur ke titik akhir API Identity yang dimulai dengan `` https: // `` , dan nilai parameter `` insecure`` berada di bawah bagian ``[keystone_authtoken] `` yang sama di ``/etc/glance/glance-registry.conf`` yang sama diatur ke``False``.

source: **Pass:** If value of parameter ``www_authenticate_uri`` under ``[keystone_authtoken]`` section in ``/etc/neutron/neutron.conf`` is set to Identity API endpoint starting with ``https://`` and value of parameter ``insecure`` under the same ``[keystone_authtoken]`` section in the same ``/etc/neutron/neutron.conf`` is set to ``False``.
id: **Pass:** Jika nilai parameter `` www_authenticate_uri`` di bawah bagian ``[keystone_authtoken] `` di ``/etc/neutron/neutron.conf`` diatur ke titik akhir API Identitas mulai dengan `` https: // `` dan nilai dari parameter `` insecure`` di bawah bagian ``[keystone_authtoken] `` yang sama di ``/etc/neutron/neutron.conf`` yang sama diatur ke ``False``.

source: **Pass:** If value of parameter ``www_authenticate_uri`` under ``[keystone_authtoken]`` section in ``/etc/nova/nova.conf`` is set to Identity API endpoint starting with ``https://`` and value of parameter ``insecure`` under the same ``[keystone_authtoken]`` section in the same ``/etc/nova/nova.conf`` is set to ``False``.
id: **Pass:** Jika nilai parameter `` www_authenticate_uri`` di bawah bagian ``[keystone_authtoken]`` di ``/etc/nova/nova.conf`` diatur ke titik akhir API Identitas yang dimulai dengan `` https: // `` dan nilai dari parameter `` insecure`` di bawah bagian ``[keystone_authtoken] `` yang sama di ``/etc/nova/nova.conf`` yang sama diset ke `` False``.

source: :term:`Federated Identity<federated identity>` is a mechanism to establish trusts between IdPs and SPs, in this case, between Identity Providers and the services provided by an OpenStack Cloud. It provides a secure way to use existing credentials to access cloud resources such as servers, volumes, and databases, across multiple endpoints. The credential is maintained by the user's IdP.
id: :term:`Federated Identity<federated identity>` adalah mekanisme untuk membangun kepercayaan antara IdPs dan SPs, dalam hal ini, antara Identity Providers dan layanan yang disediakan oleh OpenStack Cloud. Ini memberikan cara aman untuk menggunakan kredensial yang ada untuk mengakses sumber daya cloud seperti server, volume, dan basis data, di berbagai endpoints. Kredensial dipertahankan oleh IdP pengguna.

source: A bootloader password should be used on the VM.
id: Sandi bootloader harus digunakan pada VM.

source: A broader restriction is also possible: if the containing directory is set to 750, the guarantee is made that newly created files inside this directory would have the desired permissions.
id: Pembatasan yang lebih luas juga dimungkinkan: jika direktori yang berisi diatur ke 750, jaminan dibuat bahwa file yang baru dibuat di dalam direktori ini akan memiliki izin yang diinginkan.

source: A full disk encryption solution should be used by the VM.
id: Solusi enkripsi disk lengkap harus digunakan oleh VM.

source: A local directory can also be used (``local``), but is considered insecure and not suitable for a production environment.
id: Direktori lokal juga dapat digunakan (``local``), tetapi dianggap tidak aman dan tidak cocok untuk lingkungan produksi.

source: Additional security tools and processes should be considered and used for the VM appropriate to the level of sensitivity of the data.
id: Alat dan proses keamanan tambahan harus dipertimbangkan dan digunakan untuk VM yang sesuai dengan tingkat sensitivitas data.

source: Additionally, it is possible for tenants of a bare metal system to modify system firmware. TPM technology, described in :ref:`management-secure-bootstrapping`, provides a solution for detecting unauthorized firmware changes.
id: Selain itu, dimungkinkan bagi penyewa sistem bare metal untuk memodifikasi firmware sistem. Teknologi TPM, dijelaskan dalam :ref: `manajemen-aman-bootstrapping`, menyediakan solusi untuk mendeteksi perubahan firmware yang tidak sah.

source: Administrators can enable instance signature verification by setting the ``verify_glance_signatures`` flag to ``True`` in the ``/etc/nova/nova.conf`` file. When enabled, the Compute service automatically validates the signed instance when it is retrieved from the Image service. If this verification fails, the boot won't occur. The OpenStack Operations Guide provides guidance on how to create and upload a signed image, and how to use this feature. For more information, see `Adding Signed Images <https://docs.openstack.org/operations-guide/ops-user-facing-operations.html#adding-signed-images>`_ in the Operations Guide.
id: Administrator dapat mengaktifkan verifikasi instance signature dengan mengatur flag ``verify_glance_signatures`` ke ``True`` dalam file ``/etc/nova/nova.conf``. Saat diaktifkan, layanan Compute secara otomatis memvalidasi instance yang ditandatangani ketika diambil dari layanan Image. Jika verifikasi ini gagal, boot tidak akan terjadi. OpenStack Operations Guide memberikan panduan tentang cara membuat dan mengunggah image yang ditandatangani, dan cara menggunakan fitur ini. Untuk informasi lebih lanjut, lihat`Adding Signed Images <https://docs.openstack.org/operations-guide/ops-user-facing-operations.html#adding-signed-images>`_ di Operations Guide.

source: After Ocata:
id: Setelah Ocata:

source: After you are notified of a security update, the next step is to determine how critical this update is to a given cloud deployment. In this case, it is useful to have a pre-defined policy. Existing vulnerability rating systems such as the common vulnerability scoring system (CVSS) do not properly account for cloud deployments.
id: Setelah Anda diberitahu tentang pembaruan keamanan, langkah selanjutnya adalah menentukan seberapa penting pembaruan ini untuk penyebaran cloud yang diberikan. Dalam hal ini, penting untuk memiliki kebijakan yang telah ditentukan sebelumnya. Sistem peringkat kerentanan yang ada seperti common vulnerability scoring system (CVSS) tidak memperhitungkan dengan benar penyebaran cloud.

source: All bugs, OSSAs and OSSNs are publicly disseminated through the openstack-discuss mailing list with the [security] topic in the subject line. We recommend subscribing to this list as well as mail filtering rules that ensure OSSNs, OSSAs, and other important advisories are not missed. The openstack-discuss mailinglist is managed through `http://lists.openstack.org/cgi-bin/mailman/listinfo/openstack-discuss <http://lists.openstack.org/cgi-bin/mailman/listinfo/openstack-discuss>`_. The openstack-discuss uses tags as defined in the `Project Team Guide <https://docs.openstack.org/project-team-guide/open-community.html#mailing-lists>`_.
id: Semua bug, OSSA, dan OSSN disebarluaskan kepada publik melalui mailing list openstack-mendiskusikan dengan topik [security] di baris subjek. Kami menyarankan untuk berlangganan list ini serta aturan penyaringan surat yang memastikan OSSN, OSSA, dan nasihat penting lainnya tidak dilewatkan. Milis openstack-mendiskusikan dikelola melalui`http://lists.openstack.org/cgi-bin/mailman/listinfo/openstack-discuss <http://lists.openstack.org/cgi-bin/mailman/listinfo/openstack-discuss>`_. The openstack-discuss menggunakan tag seperti yang didefinisikan dalam `Project Team Guide <https://docs.openstack.org/project-team-guide/open-community.html#mailing-lists>`_.

source: All bugs, OSSAs and OSSNs are publicly disseminated through the openstack-discuss mailinglist with the [security] topic in the subject line. We recommend subscribing to this list as well as mail filtering rules that ensure OSSNs, OSSAs, and other important advisories are not missed. The openstack-discuss mailinglist is managed through `OpenStack Development Mailing List <http://lists.openstack.org/cgi-bin/mailman/listinfo/openstack-discuss>`_. The openstack-discuss uses tags as defined in the `Project Team Guide <https://docs.openstack.org/project-team-guide/open-community.html#mailing-lists>`_.
id: Semua bug, OSSA dan OSSN disebarluaskan kepada publik melalui mailinglist openstack-discuss dengan topik [security] di baris subjek. Kami menyarankan untuk berlangganan mailinglist ini serta aturan penyaringan mail yang memastikan OSSN, OSSA, dan nasihat penting lainnya tidak dilewatkan. Milis openstack-discuss dikelola melalui `OpenStack Development Mailing List <http://lists.openstack.org/cgi-bin/mailman/listinfo/openstack-discuss>` _. The openstack-discuss menggunakan tag sebagaimana didefinisikan dalam `Project Team Guide <https://docs.openstack.org/project-team-guide/open-community.html#mailing-lists>` _.

source: An administrator can create and delete share types, and also manage extra specifications that give them meaning inside the Shared File Systems service. Tenants can list the share types and can use them to create new shares. For details of managing the share types, see `Shared File Systems API <https://docs.openstack.org/api-ref/shared-file-system/index.html#share-types>`_ and `Share types managing <https://docs.openstack.org/admin-guide/shared_file_systems_share_types.html>`_ documentation.
id: Administrator dapat membuat dan menghapus tipe berbagi, dan juga mengelola spesifikasi tambahan yang memberi makna pada layanan Shared File Systems. Penyewa (tenants) dapat membuat daftar jenis share dan dapat menggunakannya untuk membuat share baru. Untuk perincian mengelola tipe share, lihat `Shared File Systems API <https://docs.openstack.org/api-ref/shared-file-system/index.html#share-types>`_ dan dokumentasi `Share types managing <https://docs.openstack.org/admin-guide/shared_file_systems_share_types.html>`_.

source: Applications store and retrieve data in Object Storage via an industry-standard HTTP RESTful API. Back end components of Object Storage follow the same RESTful model, although some APIs, such as those managing durability, are kept private to the cluster. For more details on the API see the `OpenStack Storage API <https://docs.openstack.org/api-ref/object-store/>`_.
id: Aplikasi menyimpan dan mengambil data dalam Object Storage melaluiindustry-standard HTTP RESTful API. Komponen back end Object Storage mengikuti model RESTful yang sama, meskipun beberapa API, seperti yang mengelola daya tahan, dirahasiakan ke cluster. Untuk detail lebih lanjut tentang API lihat `OpenStack Storage API <https://docs.openstack.org/api-ref/object-store/>`_.

source: As of the Newton release, the Identity service can limit access to accounts after repeated unsuccessful login attempts. A pattern of repetitive failed login attempts is generally an indicator of brute-force attacks (refer to :ref:`introduction_attack_types`). This type of attack is more prevalent in public cloud deployments.
id: Pada rilis Newton, layanan Identity dapat membatasi akses ke akun setelah upaya login yang berulang kali gagal. Pola upaya masuk berulang yang gagal umumnya merupakan indikator serangan brute-force (lihat :ref:`introduction_attack_types`). Jenis serangan ini lebih lazim dalam penyebaran cloud publik.

source: Before Ocata:
id: Sebelum Ocata:

source: Before we delve into the configurations, we briefly discuss the ciphers' configuration element and its format. A more exhaustive treatment on available ciphers and the OpenSSL cipher list format can be found at: `ciphers <https://www.openssl.org/docs/manmaster/man1/ciphers.html>`_.
id: Sebelum kita mempelajari konfigurasi, kita membahas secara singkat elemen konfigurasi cipher dan formatnya. Perawatan yang lebih lengkap tentang cipher yang tersedia dan format daftar cipher OpenSSL dapat ditemukan di: `ciphers <https://www.openssl.org/docs/manmaster/man1/ciphers.html>`_.

source: Centralize account management to prevent duplication of effort inside OpenStack infrastructure.
id: Manajemen akun terpusat untuk mencegah duplikasi upaya di dalam infrastruktur OpenStack.

source: Check-Image-05: Are masked port scans prevented?
id: Check-Image-05: Apakah scan port tertutup (masked) dicegah?

source: Compute instances store and retrieve block storage via industry-standard storage protocols such as iSCSI, ATA over Ethernet, or Fibre-Channel. These resources are managed and configured via OpenStack native standard HTTP RESTful API. For more details on the API see the `OpenStack Block Storage documentation <https://docs.openstack.org/api-ref/block-storage/>`__.
id: Compute instances menyimpan dan mengambil penyimpanan blok melalui protokol penyimpanan sindustry-standard seperti iSCSI, ATA over Ethernet, atau Fibre-Channel. Sumber daya ini dikelola dan dikonfigurasikan melalui OpenStack native standard HTTP RESTful API. Untuk detail lebih lanjut tentang API lihat `OpenStack Block Storage documentation <https://docs.openstack.org/api-ref/block-storage/>`__.

source: Configuration files contain critical parameters and information required for smooth functioning of the component. If an unprivileged user, either intentionally or accidentally modifies or deletes any of the parameters or the file itself then it would cause severe availability issues causing a denial of service to the other end users. Thus user and group ownership of such critical configuration files must be set to that component owner. Additionally, the containing directory should have the same ownership to ensure that new files are owned correctly.
id: File konfigurasi berisi parameter penting dan informasi yang diperlukan untuk kelancaran komponen. Jika pengguna yang tidak memiliki hak istimewa, baik secara sengaja atau tidak sengaja memodifikasi atau menghapus salah satu parameter atau file itu sendiri, maka itu akan menyebabkan masalah ketersediaan yang parah yang menyebabkan penolakan layanan kepada pengguna akhir lainnya. Dengan demikian, kepemilikan pengguna dan grup atas file konfigurasi kritis tersebut harus diatur ke pemilik komponen tersebut. Selain itu, direktori yang berisi harus memiliki kepemilikan yang sama untuk memastikan bahwa file baru dimiliki dengan benar.

source: Configuration files contain critical parameters and information required for smooth functioning of the component. If an unprivileged user, either intentionally or accidentally modifies or deletes any of the parameters or the file itself then it would cause severe availability issues causing a denial of service to the other end users. Thus user ownership of such critical configuration files must be set to root and group ownership must be set to neutron. Additionally, the containing directory should have the same ownership to ensure that new files are owned correctly.
id: File konfigurasi berisi parameter penting dan informasi yang diperlukan untuk kelancaran komponen. Jika pengguna yang tidak memiliki hak istimewa, baik secara sengaja atau tidak sengaja memodifikasi atau menghapus salah satu parameter atau file itu sendiri, maka itu akan menyebabkan masalah ketersediaan yang parah yang menyebabkan penolakan layanan kepada pengguna akhir lainnya. Dengan demikian kepemilikan pengguna atas file konfigurasi kritis tersebut harus diatur ke root dan kepemilikan grup harus diatur ke neutron. Selain itu, direktori yang berisi harus memiliki kepemilikan yang sama untuk memastikan bahwa file baru dimiliki dengan benar.

source: Configuration files contain critical parameters and information required for smooth functioning of the component. If an unprivileged user, either intentionally or accidentally, modifies or deletes any of the parameters or the file itself then it would cause severe availability issues causing a denial of service to the other end users. User ownership of such critical configuration files must be set to ``root`` and group ownership must be set to ``nova``. Additionally, the containing directory should have the same ownership to ensure that new files are owned correctly.
id: File konfigurasi berisi parameter penting dan informasi yang diperlukan untuk kelancaran komponen. Jika pengguna yang tidak memiliki hak istimewa, baik sengaja atau tidak sengaja, memodifikasi atau menghapus salah satu parameter atau file itu sendiri, maka itu akan menyebabkan masalah ketersediaan yang parah yang menyebabkan penolakan layanan kepada pengguna akhir lainnya. Kepemilikan pengguna atas file konfigurasi kritis tersebut harus diatur ke ``root`` dan kepemilikan grup harus diatur ke ``nova``. Selain itu, direktori yang berisi harus memiliki kepemilikan yang sama untuk memastikan bahwa file baru dimiliki dengan benar.

source: Configuration files contain critical parameters and information required for smooth functioning of the component. If an unprivileged user, either intentionally or accidentally, modifies or deletes any of the parameters or the file itself then it would cause severe availability issues resulting in a denial of service to the other end users. Therefore, user ownership of such critical configuration files must be set to ``root`` and group ownership must be set to ``glance``. Additionally, the containing directory should have the same ownership to ensure that new files are owned correctly.
id: File konfigurasi berisi parameter penting dan informasi yang diperlukan untuk kelancaran komponen. Jika pengguna yang tidak memiliki hak istimewa, baik secara sengaja atau tidak sengaja, memodifikasi atau menghapus salah satu parameter atau file itu sendiri, maka hal itu akan menyebabkan masalah ketersediaan yang parah yang mengakibatkan penolakan layanan kepada pengguna akhir lainnya. Oleh karena itu, kepemilikan pengguna atas file konfigurasi kritis tersebut harus diatur ke ``root`` dan kepemilikan grup harus diatur ke ``glance``. Selain itu, direktori yang berisi harus memiliki kepemilikan yang sama untuk memastikan bahwa file baru dimiliki dengan benar.

source: Configuration files contain critical parameters and information required for smooth functioning of the component. If an unprivileged user, either intentionally or accidentally, modifies or deletes any of the parameters or the file itself then it would cause severe availability issues resulting in a denial of service to the other end users. Thus user ownership of such critical configuration files must be set to root and group ownership must be set to cinder. Additionally, the containing directory should have the same ownership to ensure that new files are owned correctly.
id: File konfigurasi berisi parameter penting dan informasi yang diperlukan untuk kelancaran komponen. Jika pengguna yang tidak memiliki hak istimewa, baik secara sengaja atau tidak sengaja, memodifikasi atau menghapus salah satu parameter atau file itu sendiri, maka hal itu akan menyebabkan masalah ketersediaan yang parah yang mengakibatkan penolakan layanan kepada pengguna akhir lainnya. Dengan demikian kepemilikan pengguna atas file konfigurasi kritis tersebut harus diatur ke root dan kepemilikan grup harus diatur ke cinder. Selain itu, direktori yang berisi harus memiliki kepemilikan yang sama untuk memastikan bahwa file baru dimiliki dengan benar.
