Repository: openstack/security-doc
Catalog: security-guide/source/locale/*/LC_MESSAGES/security-guide.po
Languages: de, id, tr_tr

source: Security considerations for data processing should focus on data privacy and secure communications to provisioned clusters.
de: Sicherheitsüberlegungen für die Datenverarbeitung sollten sich auf den Datenschutz und die sichere Kommunikation mit versorgten Clustern konzentrieren.
id: Pertimbangan keamanan untuk pengolahan data harus berfokus pada privasi data dan komunikasi yang aman ke kelompok yang ada.
tr_tr: Veri işleme için güvenlik konuları, veri gizliliği ve sağlanan kümelere güvenli iletişim konularına odaklanmalıdır.

source: Security considerations for memory optimization
de: Sicherheitsüberlegungen zur Speicheroptimierung
id: Pertimbangan keamanan untuk pengoptimalan memori
tr_tr: Bellek eniyileştirme için güvenlik hususları

source: Security domains
de: Sicherheitsdomänen
id: Domain keamanan
tr_tr: Güvenlik alanları

source: Security domains(s)
de: Sicherheitsdomänen
tr_tr: Güvenlik alanları

source: Security function
de: Sicherheitsfunktion
id: Security Function (fungsi keamanan)
tr_tr: Güvenlik fonksiyonu

source: Security groups
de: Sicherheitsgruppen
id: Kelompok keamanan
tr_tr: Güvenlik Grupları

source: Security groups allow administrators and tenants the ability to specify the type of traffic, and direction (ingress/egress) that is allowed to pass through a virtual interface port. Security groups rules are stateful L2-L4 traffic filters.
de: Sicherheitsgruppen erlauben Administratoren und Tenants die Möglichkeit, die Art des Verkehrs und die Richtung (Ingress/Egress) anzugeben, die durch einen virtuellen Schnittstellenport passieren darf. Sicherheitsgruppenregeln sind staatliche L2-L4-Verkehrsfilter.
id: Kelompok keamanan memungkinkan administrator dan penyewa kemampuan untuk menentukan jenis lalu lintas, dan arah (ingress/egress) yang diizinkan melewati port antarmuka virtual. Aturan kelompok keamanan adalah filter lalu lintas L2-L4 stateful.
tr_tr: Güvenlik grupları, yöneticilere ve kiracılara bir sanal arabirim bağlantı noktasından geçmesine izin verilen trafik türünü ve yönünü (giriş/çıkış) belirtme olanağına olanak tanır. Güvenlik grupları kuralları, durum bilgisi olan L2-L4 trafik filtreleridir.

source: Security may be enhanced by requiring X.509 client certificates for authentication. Authenticating to the database in this manner provides greater identity assurance of the client making the connection to the database and ensures that the communications are encrypted.
de: Die Sicherheit kann durch die Erstellung von X.509-Clientzertifikaten für die Authentifizierung erweitert werden. Die Authentifizierung auf die Datenbank auf diese Weise ermöglicht eine bessere Identitätssicherung des Clients, der die Verbindung zur Datenbank herstellt und sicherstellt, dass die Kommunikation verschlüsselt wird.
id: Keamanan dapat ditingkatkan dengan mewajibkan sertifikat klien X.509 untuk otentikasi. Mengotentikasi ke database dengan cara ini memberikan jaminan identitas yang lebih besar dari klien yang membuat koneksi ke database dan memastikan bahwa komunikasi dienkripsi.
tr_tr: Kimlik doğrulama için X.509 istemci sertifikası isteyerek güvenlik arttırılabilir. Veritabanına bu şekilde kimlik doğrulama yapılması, müşteriye veritabanına bağlantı kurma konusunda daha fazla kimlik güvencesi sağlar ve iletişimlerin şifrelenmesini sağlar.

source: Security monitoring controls such as intrusion detection software, antivirus software, and spyware detection and removal utilities can generate logs that show when and how an attack or intrusion took place. Deploying these tools on the cloud machines provides value and protection. Cloud users, those running instances on the cloud, may also want to run such tools on their instances.
de: Sicherheitsüberwachungssteuerungen wie Intrusion Detection Software, Antivirensoftware und Spyware-Erkennungs- und Entfernungsprogramme können Protokolle erzeugen, die zeigen, wann und wie ein Angriff oder ein Eindringen stattgefunden hat. Die Bereitstellung dieser Tools auf den Cloud-Maschinen bietet Wert und Schutz. Cloud-Benutzer, die laufende Instanzen auf der Cloud, können auch solche Tools auf ihren Instanzen laufen lassen.
id: Kontrol pemantauan keamanan seperti perangkat lunak deteksi intrusi, perangkat lunak antivirus, dan deteksi spyware dan utilitas penghapusan dapat menghasilkan log yang menunjukkan kapan dan bagaimana serangan atau gangguan terjadi. Penerapan alat ini pada mesin awan memberikan nilai dan perlindungan. Pengguna awan, mereka yang menjalankan instance di atas awan, mungkin juga ingin menjalankan alat semacam itu pada instance mereka.
tr_tr: Saldırı tespit yazılımı, antivirüs yazılımı ve casus yazılım algılama ve kaldırma yardımcı programları gibi güvenlik izleme kontrolleri, saldırı veya izinsiz girişin ne zaman ve nasıl gerçekleştiğini gösteren günlükler oluşturabilir. Bu araçların bulut makinelerine yerleştirilmesi değer ve koruma sağlar. Bulut üzerinde örneği çalıştıran Bulut kullanıcıları, örneklerinde bu araçları da çalıştırmak isteyebilir.

source: Security principles
de: Sicherheitsprinzipien
id: Prinsip Keamanan
tr_tr: Güvenlik prensipleri

source: Security references for database back ends
de: Sicherheitsreferenzen für Datenbank-Backends
id: Referensi keamanan untuk database back end
tr_tr: Veritabanı arka uçları için güvenlik referansları

source: Security review
de: Sicherheitsüberprüfung
id: Ulasan keamanan
tr_tr: Güvenlik incelemesi

source: Security review by the OSSP is expected to be the normal route for new projects and for cases where third parties have not performed security reviews or are unable to share their results. Information for projects that require a security review by the OSSP will be available in the upcoming security review process.
de: Die Sicherheitsüberprüfung durch die OSSP wird voraussichtlich die normale Route für neue Projekte und für Fälle, in denen Dritte keine Sicherheitsüberprüfungen durchgeführt haben oder nicht in der Lage sind, ihre Ergebnisse zu teilen. Informationen für Projekte, die eine Sicherheitsüberprüfung durch die OSSP erfordern, werden im bevorstehenden Sicherheitsüberprüfungsprozess zur Verfügung stehen.
id: Review keamanan oleh OSSP diharapkan menjadi rute normal untuk proyek baru dan untuk kasus dimana pihak ketiga belum melakukan review keamanan atau tidak dapat membagikan hasilnya. Informasi untuk proyek yang memerlukan review keamanan oleh OSSP akan tersedia dalam proses review keamanan yang akan datang.
tr_tr: OSSP tarafından yapılan güvenlik incelemesinin, yeni projelerin ve üçüncü şahısların güvenlik incelemeleri yapmadığı veya sonuçlarını paylaşamadığı durumlarda normal yol olması beklenmektedir. OSSP tarafından bir güvenlik incelemesi gerektiren projeler için bilgi gelecek güvenlik inceleme sürecinde kullanıma açılacaktır.

source: Security reviews
de: Sicherheitsauswertungen
id: Tinjauan keamanan
tr_tr: Güvenlik gözden geçirmeleri

source: Security services
de: Sicherheitsdienste
id: Layanan keamanan
tr_tr: Güvenlik servisleri

source: Security services for instances
de: Sicherheitsdienste für Instanzen
id: Layanan Security untuk instance
tr_tr: Örnekler için güvenlik servisleri

source: Security services management
de: Sicherheitsdienstverwaltung
id: Manajemen layanan keamanan
tr_tr: Güvenlik servisleri yönetimi

source: Security training
de: Sicherheitstraining
id: Pelatihan keamanan
tr_tr: Güvenlik eğitimi

source: Security updates are critical to any IaaS deployment, whether private or public. Vulnerable systems expand attack surfaces, and are obvious targets for attackers. Common scanning technologies and vulnerability notification services can help mitigate this threat. It is important that scans are authenticated and that mitigation strategies extend beyond simple perimeter hardening. Multi-tenant architectures such as OpenStack are particularly prone to hypervisor vulnerabilities, making this a critical part of the system for vulnerability management.
de: Sicherheitsupdates sind entscheidend für jede IaaS-Implementierung, ob privat oder öffentlich. Anfällige Systeme erweitern Angriffsflächen und sind offensichtliche Ziele für Angreifer. Gemeinsame Scan-Technologien und Schwachstellen-Benachrichtigungsdienste können dazu beitragen, diese Bedrohung zu verringern. Es ist wichtig, dass die Scans authentifiziert werden und dass die Abschwächungsstrategien über das einfache Hardening hinausgehen. Multi-Tenant-Architekturen wie OpenStack sind besonders anfällig für Hypervisor-Schwachstellen und machen dies zu einem kritischen Bestandteil des Systems für das Schwachstellenmanagement.
id: Pembaruan keamanan sangat penting untuk penyebaran IaaS, baik pribadi maupun publik. Sistem yang rentan memperluas permukaan serangan, dan merupakan target yang jelas bagi penyerang. Teknologi pemindaian umum dan layanan pemberitahuan kerentanan dapat membantu mengurangi ancaman ini. Penting agar pemindaian diautentikasi dan strategi mitigasi melampaui pengerasan perimeter sederhana. Arsitektur multi-tenant seperti OpenStack sangat rentan terhadap kerentanan hypervisor, menjadikannya bagian penting dari sistem pengelolaan kerentanan.
tr_tr: Güvenlik güncelleştirmeleri, özel veya herkese açık olan herhangi bir IaaS dağıtımında kritik önem taşır. Güvenlik açığı olan sistemler saldırı yüzeylerini genişletir ve saldırganlar için bariz hedeflerdir. Sık kullanılan tarama teknolojileri ve güvenlik açığı bildirim hizmetleri, bu tehdidi azaltmaya yardımcı olabilir. Taramaların doğrulanması ve azaltıcı stratejilerin basit çevresel güçlendirmenin ötesine geçmesi önemlidir. OpenStack gibi çok kiracılı mimariler özellikle hypervisor güvenlik açıklarına yatkındır ve bu güvenlik açığı, güvenlik açığı yönetimi için sistemin kritik bir parçası haline gelir.

source: See the chapter on :doc:`../secure-communication` for more specific recommendations and server configurations for HTTPS configurations, including the configuration of HSTS.
de: Weitere Informationen finden Sie im Kapitel :doc:`../secure-communication` für spezifischere Empfehlungen und Serverkonfigurationen für HTTPS-Konfigurationen inklusive der Konfiguration von HSTS.
id: Lihat bab di :doc:`../secure-communication` untuk rekomendasi lebih spesifik dan konfigurasi server untuk konfigurasi HTTPS, termasuk konfigurasi HSTS.
tr_tr: HSTS yapılandırması da dahil olmak üzere HTTPS konfigürasyonları için daha özel öneriler ve sunucu yapılandırmaları için :doc:`../secure-communication` bölümüne bakın.

source: Segmented network in *share servers* back-end mode
de: Segmentiertes Netzwerk in *share servers* Back-End-Modus
id: Jaringan tersegmentasi di *share servers * mode back-end
tr_tr: **paylaşım sunucusu* arka uç kipinde bölünmüş ağ

source: Select an auditor.
de: Wählen Sie einen Auditor aus.
id: Pilih auditor.
tr_tr: Bir denetçi seçin.

source: Selecting an auditor can be challenging. Ideally, you are looking for someone with experience in cloud compliance audits. OpenStack experience is another big plus. Often it is best to consult with people who have been through this process for referrals. Cost can vary greatly depending on the scope of the engagement and the audit firm considered.
de: Die Auswahl eines Auditors kann herausfordernd sein. Im Idealfall suchen Sie jemanden mit Erfahrung in Cloud Compliance Audits. OpenStack Erfahrung ist ein weiteres großes Plus. Oft ist es am besten, mit Leuten zu konsultieren, die diesen Prozess auf Empfehlung durchgemacht haben. Die Kosten können je nach Umfang des Engagements und der betrachteten Prüfungsgesellschaft stark variieren.
id: Memilih auditor bisa menjadi tantangan. Idealnya, Anda mencari seseorang yang berpengalaman dalam audit kepatuhan awan. Pengalaman OpenStack adalah plus besar lainnya. Seringkali yang terbaik adalah berkonsultasi dengan orang-orang yang telah melalui proses ini untuk referensi. Biaya dapat sangat bervariasi tergantung pada cakupan perjanjian dan perusahaan audit yang dipertimbangkan.
tr_tr: Denetçi seçmek zor olabilir. İdeal olarak, bulut uyumu denetimleri konusunda tecrübeli birini ararsınız. OpenStack deneyimi başka bir büyük artı. Genellikle tavsiyeleri almak için bu süreçten geçen insanlarla danışmak en iyisidir. Maliyet, katılımın kapsamına ve denetlenen firmaya göre büyük ölçüde değişebilir.

source: Selecting supporting software
de: Auswahl der unterstützenden Software
id: Memilih perangkat lunak pendukung
tr_tr: Destekleyici yazılım seçme

source: Selection criteria
de: Auswahlkriterium
id: Kriteria seleksi
tr_tr: Seçim kriteri

source: Selects highest possible security cipher in the negotiation phase. These typically have keys of length 128 bits or longer.
de: Wählt in der Verhandlungsphase die höchstmögliche Sicherheitskurve aus. Diese haben typischerweise Schlüssel mit einer Länge von 128 Bits oder länger.
id: Memilih sekuriti keamanan tertinggi dalam tahap negosiasi. Ini biasanya memiliki kunci dengan panjang 128 bit atau lebih.
tr_tr: Müzakere aşamasında mümkün olan en üst düzeyde güvenlik şifresini seçer. Bunların tipik olarak 128 bit uzunluğundaki anahtarları vardır.

source: Serious organized crime
de: Ernstes organisiertes Verbrechen
id: Kejahatan terorganisir serius
tr_tr: Ciddi organize suç

source: Server hardening
de: Serverhärtung
id: Pengerasan server
tr_tr: Sunucu sıkılaştırma

source: Servers in the cloud, including undercloud and overcloud infrastructure, should implement hardening best practices. As OS and server hardening is common, applicable best practices including but not limited to logging, user account restrictions, and regular updates will not be covered here, but should be applied to all infrastructure.
de: Server in der Cloud, einschließlich undercloud und overcloud Infrastruktur, sollten Hardening Best Practices implementieren. Da die Betriebssystem- und Serverhärtung üblich ist, gelten die bewährten Vorgehensweisen, einschließlich, aber nicht beschränkt auf die Protokollierung, Benutzerkontenbeschränkungen und regelmäßige Aktualisierungen werden hier nicht behandelt, sondern sollten auf alle Infrastrukturen angewendet werden.
id: Server di awan, termasuk infrastruktur yang undercloud dan overcloud, harus menerapkan praktik terbaik pengerasan. Karena pengerasan OS dan server biasa terjadi, praktik terbaik yang berlaku termasuk namun tidak terbatas pada logging, batasan akun pengguna, dan pembaruan reguler tidak akan dibahas di sini, namun harus diterapkan pada semua infrastruktur.
tr_tr: Asgari bulut ve aşırı bulut altyapı da dahil olmak üzere buluttaki sunucular, en iyi yöntemlerle sıkılaştırmalıdır. İS ve sunucu sıkılaştırması yaygın olduğundan, günlüğe kaydetme, kullanıcı hesabı kısıtlamaları ve düzenli güncellemeler ile sınırlı olmaksızın geçerli en iyi yöntemler burada ele alınmayacak, ancak tüm altyapılara uygulanmalıdır.

source: Service
de: Bedienung
tr_tr: Servisler

source: Service Organization Controls (SOC) 2 is a self attestation of controls that affect the security, availability, and processing integrity of the systems a service organization uses to process users' data and the confidentiality and privacy of information processed by these system. Examples of users are those responsible for governance of the service organization, customers of the service organization, regulators, business partners, suppliers, and others who have an understanding of the service organization and its controls.
de: Service Organization Controls (SOC) 2 ist eine Selbstbescheinigung von Kontrollen, die die Sicherheit, Verfügbarkeit und Verarbeitung der Integrität der Systeme beeinflussen, die eine Dienstleistungsorganisation verwendet, um die Daten der Benutzer zu verarbeiten und die Vertraulichkeit und die Privatsphäre der von diesem System verarbeiteten Informationen zu schützen. Beispiele für Benutzer sind Verantwortliche für die Governance der Serviceorganisation, Kunden der Serviceorganisation, Regulierungsbehörden, Geschäftspartner, Lieferanten und andere, die ein Verständnis der Serviceorganisation und ihrer Kontrollen haben.
id: Service Organization Controls (SOC) 2 adalah pengesahan diri terhadap kontrol yang mempengaruhi keamanan, ketersediaan, dan integritas proses sistem yang digunakan oleh organisasi layanan untuk memproses data pengguna dan kerahasiaan dan privasi informasi yang diproses oleh sistem ini. Contoh pengguna adalah mereka yang bertanggung jawab atas tata kelola organisasi layanan, pelanggan dari organisasi layanan, regulator, mitra bisnis, pemasok, dan pihak lain yang memiliki pemahaman tentang organisasi layanan dan kontrolnya.
tr_tr: Servis Kuruluşu Denetimleri (SOC) 2, bir hizmet organizasyonunun kullanıcı verilerini işlemek için kullandığı sistemlerin güvenlik, kullanılabilirlik ve işleme bütünlüğünü etkileyen denetimlerin ve bu sistem tarafından işlenen bilgilerin gizliliğinin ve mahremiyetinin kendine özgü bir ispatıdır. Kullanıcı örnekleri, hizmet organizasyonunun yönetimi, hizmet organizasyonunun müşterileri, düzenleyiciler, iş ortakları, tedarikçiler ve hizmet organizasyonu ve kontrollerini anlayan diğer kişilerdir.

source: Service Organization Controls (SOC) 3 is a trust services report for service organizations. These reports are designed to meet the needs of users who want assurance on the controls at a service organization related to security, availability, processing integrity, confidentiality, or privacy but do not have the need for or the knowledge necessary to make effective use of a SOC 2 Report. These reports are prepared using the AICPA/Canadian Institute of Chartered Accountants (CICA) Trust Services Principles, Criteria, and Illustrations for Security, Availability, Processing Integrity, Confidentiality, and Privacy. Because they are general use reports, SOC 3 Reports can be freely distributed or posted on a website as a seal.
de: Service Organisation Controls (SOC) 3 ist ein Trust Services Report für Service-Organisationen. Diese Berichte sind so konzipiert, dass sie den Bedürfnissen der Nutzer gerecht werden, die die Kontrolle über die Kontrollen bei einer Serviceorganisation im Zusammenhang mit Sicherheit, Verfügbarkeit, Verarbeitungsintegrität, Vertraulichkeit oder Privatsphäre wünschen, aber nicht die Notwendigkeit oder das notwendige Wissen benötigen, um eine effektive Nutzung zu ziehen aus dem SOC 2 Report. Diese Reports werden mit dem AICPA/Canadian Institute of Chartered Accountants (CICA) Trust Services Principles, Criteria, and Illustrations for Security, Availability, Processing Integrity, Confidentiality, and Privacy erstellt. Weil die Reports Allgemeingut sind, können SOC 3 Reports frei verteilt oder auf einer Website als Siegel gepostet werden.
id: Service Organization Controls (SOC) 3 adalah laporan layanan kepercayaan untuk organisasi layanan. Laporan ini dirancang untuk memenuhi kebutuhan pengguna yang menginginkan kepastian kontrol pada organisasi layanan yang berkaitan dengan keamanan, ketersediaan, integritas pemrosesan, kerahasiaan, atau privasi namun tidak memerlukan atau pengetahuan yang diperlukan untuk memanfaatkan secara efektif SOC 2 Report. Laporan ini disiapkan dengan menggunakan AICPA/Canadian Institute of Chartered Accountants (CICA) Trust Services Principles, Criteria, and Illustrations for Security, Availability, Processing Integrity, Confidentiality, and Privacy. Karena mereka adalah laporan penggunaan umum, SOC 3 Reports dapat didistribusikan secara gratis atau diposkan di situs web sebagai meterai.
tr_tr: Servis Organizasyonu Denetimleri (SOC) 3, servis organizasyonları için bir güvenlilik hizmetleri raporudur. Bu raporlar, bir servis organizasyonundaki güvenlik, kullanılabilirlik, işleme bütünlüğü, gizlilik veya gizlilik ile ilgili kontroller konusunda güvence isteyen kullanıcıların ihtiyaçlarını karşılamak üzere tasarlanmıştır; ancak, bu hizmetlerin etkinliğini sağlamak için gerekli bilgiye veya bilgiye ihtiyaç duymazlar. SOC 2 Raporu. Bu raporlar, AICPA / Kanadalı Yeminli Mali Müşavirler Enstitüsü (CICA) Güven Hizmetleri İlkeleri, Kriterleri ve Güvenlik, Kullanılabilirlik, İşleme Dürüstlük, Gizlilik ve Gizlilik İçin İllüstrasyonlar kullanılarak hazırlanmıştır. Genel kullanım raporları oldukları için, SOC 3 Raporları bir web sitesinde mühür olarak serbestçe dağıtılabilir veya yayınlanabilir.

source: Service Organization Controls (SOC) criteria are defined by the `American Institute of Certified Public Accountants <http://www.aicpa.org/>`_ (AICPA). SOC controls assess relevant financial statements and assertions of a :term:`service provider`, such as compliance with the Sarbanes-Oxley Act. SOC 1 is a replacement for Statement on Auditing Standards No. 70 (SAS 70) Type II report. These controls commonly include physical data centers in scope.
de: Service-Organization Controls (SOC) Kriterien sind definiert durch die `American Institute of Certified Public Accountants <http://www.aicpa.org/> ``(AICPA). SOC-Kontrollen beurteilen relevante finanzielle Statements und Erklärungen eines :term:`service provider`, wie z.B. die Einhaltung des Sarbanes-Oxley Act. SOC 1 ist ein Ersatz für Statement on Auditing Standards Nr. 70 (SAS 70) Typ II report. Diese Kontrollen beinhalten häufig physische Rechenzentren im Geltungsbereich.
id: Kriteria Service Organization Controls (SOC) didefinisikan oleh `American Institute of Certified Public Accountants <http://www.aicpa.org/>`_ (AICPA). Kontrol SOC menilai laporan keuangan dan asersi yang relevan dari :term:`service provider`, seperti kepatuhan terhadap Sarbanes-Oxley Act. SOC 1 adalah pengganti Statement on Auditing Standards No. 70 (SAS 70) Tipe II report. Kontrol ini biasanya mencakup cakupan data fisik.
tr_tr: Servis Organizasyonu Kontrolleri (SOC) kriterleri, `American Institute of Certified Public Accountants <http://www.aicpa.org/>`__ (AICPA) tarafından tanımlanmaktadır. SOC kontrolleri, Sarbanes-Oxley Yasası'na uygunluk gibi bir :term: `hizmet sağlayıcısı`'nın ilgili mali tablolarını ve iddialarını değerlendirir. SOC 1, Denetim Standartları No.70 (SAS 70) Tip II raporu Beyannamesinin yerine geçer. Bu kontroller genelde fiziksel veri merkezlerini kapsar.

source: Service architecture diagram
de: Dienstarchitekturdiagramm
id: Diagram arsitektur layanan
tr_tr: Servis mimari diyagramı

source: Service authorization
de: Serviceberechtigung
id: Otorisasi layanan
tr_tr: Servis yetkilendirmesi

source: Service name
de: Dienstname
tr_tr: Servis adı

source: Services select their respective API endpoints based on the OpenStack service catalog. These services might not obey the listed public or internal API end point values. This can lead to internal management traffic being routed to external API endpoints.
de: Services wählen ihre jeweiligen API-Endpunkte auf Basis des OpenStack-Servicekatalogs aus. Diese Dienste können nicht den aufgeführten öffentlichen oder internen API-Endpunktwerten gehorchen. Dies kann dazu führen, dass interner Verwaltungsverkehr zu externen API-Endpunkten geleitet wird.
id: Layanan memilih endpoints API masing-masing berdasarkan katalog layanan OpenStack. Layanan ini mungkin tidak mematuhi nilai endpoints API publik atau internal yang terdaftar. Hal ini dapat menyebabkan lalu lintas manajemen internal diarahkan ke endpoints API eksternal.
tr_tr: Servisler, OpenStack servis kataloğuna göre kendi API uç noktalarını seçer. Bu servis listelenmiş genel ya da iç API uç nokta değerlerine uymayabilir. Bu, iç yönetim trafiğinin dış API uç noktalarından yönlendirilmesine yol açabilir.

source: Services, protocols, and ports
de: Dienste, Protokolle und Ports
id: Layanan, protokol, dan port

source: Services, protocols, and ports being utilized in the OpenStack deployment.
de: Dienste, Protokolle und Ports, die in der OpenStack Installation benutzt werden.
id: Layanan, protokol, dan port yang digunakan dalam pengerahan OpenStack.
