Repository: openstack/security-doc
Catalog: security-guide/source/locale/*/LC_MESSAGES/security-guide.po
Languages: de, id, tr_tr

source: Dashboard provides tools for developers to avoid creating XSS vulnerabilities, but they only work if developers use them correctly. Audit any custom dashboards, paying particular attention to use of the ``mark_safe`` function, use of ``is_safe`` with custom template tags, the ``safe`` template tag, anywhere auto escape is turned off, and any JavaScript which might evaluate improperly escaped data.
de: Dashboard bietet Tools für Entwickler, um XSS-Schwachstellen zu vermeiden, aber sie funktionieren nur, wenn Entwickler sie korrekt verwenden. Überprüfen Sie alle benutzerdefinierten Dashboards und achten Sie besonders auf die Verwendung der ``mark_safe``-Funktion, verwenden Sie ``is_safe`` mit benutzerdefinierten Template-Tags, die ``Safe``Template-Tag, überall Auto-Escape ist ausgeschaltet und JavaScript die falsch ausgefallene Daten auswerten könnten.
id: Dasbor menyediakan alat bagi pengembang untuk menghindari kerentanan XSS, namun hanya berfungsi jika pengembang menggunakannya dengan benar. Mengaudit setiap dasbor kustom, memperhatikan penggunaan fungsi ``mark_safe``, penggunaan ``is_safe`` dengan tag template khusus, tag template ``safe``, di mana saja pelarian otomatis (auto escape) dimatikan, dan JavaScript apa pun yang bisa mengevaluasi data lolos (escaped data) dengan tidak semestinya.
tr_tr: Panel, geliştiricilere XSS güvenlik açıklarını önlemek için araçlar sağlar, ancak geliştiriciler bunları doğru kullanırsa çalışırlar. ``mark_safe`` işlevinin kullanımına, özel şablon etiketleriyle ``is_safe`` kullanımı, otomatik şapka etiketi, otomatik kaçış kapatıldığı her yerde ve herhangi bir JavaScript'in kullanıldığı özel gösterge panolarını denetleyin bu da yanlış bir şekilde kaçılan verileri değerlendirebilir.

source: Dashboard's default configuration uses `django_compressor <http://django-compressor.readthedocs.org/>`_ to compress and minify CSS and JavaScript content before serving it. This process should be statically done before deploying the dashboard, rather than using the default in-request dynamic compression and copying the resulting files along with deployed code or to the CDN server. Compression should be done in a non-production build environment. If this is not practical, we recommend disabling resource compression entirely. Online compression dependencies (less, Node.js) should not be installed on production machines.
de: Dashboard-Standardkonfiguration verwendet `django_compressor <http://django-compressor.readthedocs.org/>`_ zum Komprimieren und Minimieren von CSS und JavaScript-Inhalt vor der Auslieferung. Dieser Vorgang sollte vor dem Bereitstellen des Dashboards statisch durchgeführt werden, anstatt die standardmäßige dynamische Komprimierung in der Anforderung zu verwenden und die resultierenden Dateien zusammen mit dem bereitgestellten Code oder dem CDN-Server zu kopieren. Kompression sollte in einer Nicht-Produktions-Build-Umgebung durchgeführt werden. Wenn dies nicht praktisch ist, empfehlen wir, die Ressourcenkomprimierung vollständig zu deaktivieren. Online-Kompressionsabhängigkeiten (less, Node.js) sollten nicht auf Produktionsmaschinen installiert werden.
id: Konfigurasi default dasbor menggunakan `django_compressor <http://django-compressor.readthedocs.org/>`_ untuk memampatkan dan memperkecil isi CSS dan JavaScript sebelum menayangkannya. Proses ini harus dilakukan secara statis sebelum menerapkan dasbor, daripada menggunakan kompresi dinamis dalam permintaan default dan menyalin file yang dihasilkan beserta kode yang dikerahkan atau ke server CDN. Kompresi harus dilakukan di lingkungan pembangun non produksi. Jika ini tidak praktis, sebaiknya nonaktifkan kompresi sumber daya sepenuhnya. Ketergantungan kompresi online (less, Node.js) tidak boleh dipasang pada mesin produksi.
tr_tr: Panelin varsayılan yapılandırması, CSS ve JavaScript içeriğini sunmadan önce sıkıştırmak ve küçültmek için `django_compressor <http://django-compressor.readthedocs.org/>` _ kullanır. Bu işlem varsayılan olarak isteğe bağlı dinamik sıkıştırmayı kullanmadan ve sonuçlanan dosyaları dağıtılan kodla birlikte veya CDN sunucusuna kopyalamak yerine, gösterge tablosunu dağıtmadan önce statik olarak yapılmalıdır. Sıkıştırma, üretim dışı bir yapı ortamında yapılmalıdır. Bu pratik değilse, kaynak sıkıştırmasını tamamen devre dışı bırakmanızı öneririz. Çevrimiçi sıkıştırma bağımlılıkları (less, Node.js) üretim makinelerine yüklenmemelidir.

source: Data
de: Daten
tr_tr: Veri

source: Data Classification defines a method for classifying and handling information, often to protect customer information from accidental or deliberate theft, loss, or inappropriate disclosure. Most commonly, this involves classifying information as sensitive or non-sensitive, or as personally identifiable information (PII). Depending on the context of the deployment various other classifying criteria may be used (government, health-care). The underlying principle is that data classifications are clearly defined and in-use. The most common protective mechanisms include industry standard encryption technologies.
de: Data Classification definiert eine Methode zum Klassifizieren und Handhaben von Informationen, oft zum Schutz von Kundeninformationen vor versehentlichem oder vorsätzlichem Diebstahl, Verlust oder unangemessener Offenlegung. Am häufigsten handelt es sich dabei um die Klassifizierung von Informationen als sensible oder nicht sensible oder als persönlich identifizierbare Informationen (PII). Abhängig vom Kontext des Einsatzes können verschiedene andere Klassifizierungskriterien verwendet werden (Regierung, Gesundheitswesen). Das Grundprinzip ist, dass Datenklassifizierungen klar definiert und in Gebrauch sind. Die häufigsten Schutzmechanismen umfassen Industriestandard-Verschlüsselungstechnologien.
id: Klasifikasi Data mendefinisikan metode untuk mengklasifikasi dan menangani informasi, seringkali untuk melindungi informasi pelanggan dari pencurian, kehilangan, atau pengungkapan yang tidak disengaja atau disengaja. Paling umum, ini mengklasifikasikan informasi sebagai informasi sensitif atau tidak sensitif, atau sebagai personally identifiable information (PII). Bergantung pada konteks penerapan berbagai kriteria klasifikasi lainnya dapat digunakan (government, health-care). Prinsip dasarnya adalah klasifikasi data didefinisikan secara jelas dan digunakan. Mekanisme perlindungan yang paling umum termasuk teknologi enkripsi standar industri.
tr_tr: Veri Sınıflaması, müşteri bilgilerini yanlışlıkla veya kasıtlı olarak çalınması, kaybı veya uygunsuz şekilde ifşa etmemesi için bilgilerin sınıflandırılması ve ele alınması için bir yöntem tanımlar. En yaygın olarak, bu bilgi hassas veya hassas olmayan olarak veya kişisel olarak tanımlanabilir bilgi (PII) olarak sınıflandırmayı içerir. Dağıtımın bağlamına bağlı olarak, çeşitli sınıflandırma kriterleri kullanılabilir (hükümet, sağlık bakımı). Temel ilke, veri sınıflandırmalarının açıkça tanımlanmış ve kullanımda olmasıdır. En yaygın koruyucu mekanizmalar endüstri standardı şifreleme teknolojilerini içerir.

source: Data asset impact analysis
de: Analyse der Datenanalyse
id: Analisis dampak aset data
tr_tr: Veri varlık etkileri analizi

source: Data assets
de: Datenvermögen
id: Aset data
tr_tr: Veri varlıkları

source: Data assets are user data, high-value data, configuration items, authorization tokens or other items that an attacker may target. The set of data items will vary between projects, but in general it should be considered as classes of data which are vital to the intended operation of the project. The level of detail required is somewhat dependent on the context. Data can usually be grouped, such as 'user data', 'secret data', or 'configuration files', but may be singular, like 'admin identity token' or 'user identity token', or 'database configuration file'.
de: Datenvermögen sind Benutzerdaten, hochwertige Daten, Konfigurationselemente, Berechtigungsmarken oder andere Gegenstände, auf die ein Angreifer zielen kann. Die Menge der Datenelemente variiert zwischen den Projekten, aber im Allgemeinen sollte sie als Klassen von Daten betrachtet werden, die für den beabsichtigten Betrieb des Projekts von entscheidender Bedeutung sind. Der erforderliche Detaillierungsgrad ist etwas vom Kontext abhängig. Daten können in der Regel gruppiert werden, z. B. 'Benutzerdaten', 'geheime Daten' oder 'Konfigurationsdateien', können aber auch singulär sein, wie 'admin identity token' oder 'user identity token' oder 'database configuration file'.
id: Aset data adalah data pengguna, data bernilai tinggi, item konfigurasi, token otorisasi atau item lain yang mungkin ditargetkan oleh penyerang. Kumpulan item data akan bervariasi antar proyek, namun secara umum harus dianggap sebagai kelas data yang sangat penting untuk pengoperasian proyek yang dimaksud. Tingkat detail yang dibutuhkan agak tergantung pada konteksnya. Data biasanya dapat dikelompokkan, seperti 'user data', 'secret data', atau 'configuration files', namun mungkin tunggal, seperti 'admin identity token' atau 'user identity token', atau 'database configuration file'.
tr_tr: Veri varlıkları, bir saldırganın hedefleyebileceği kullanıcı verileri, yüksek değerli veriler, yapılandırma öğeleri, yetkilendirme belirteçleri veya diğer öğelerdir. Veri kalemleri projelere göre değişir, ancak genel olarak projenin amaçlanan çalışması için hayati önem taşıyan veri sınıfları olarak düşünülmelidir. Gerekli detay seviyesi biraz bağlama bağlıdır. Veriler genellikle 'kullanıcı verileri', 'gizli veriler' veya 'yapılandırma dosyaları' gibi gruplanabilir, ancak 'yönetici kimliği belirteci' veya 'kullanıcı kimliği belirteci' veya 'veritabanı yapılandırma dosyası' gibi tekil olabilir.

source: Data assets should include a statement of where that asset is persisted.
de: Das Datenvermögen sollte eine Erklärung enthalten, wo dieser Vermögenswert bestanden hat.
id: Aset data harus mencakup pernyataan di mana aset tersebut bertahan.
tr_tr: Veri varlıkları, varlığın nerede kalacağına dair bir bildirim içermelidir.

source: Data classification
de: Datenklassifizierung
id: Klasifikasi Data
tr_tr: Veri sıfınlandırması

source: Data disposal
de: Datenentsorgung
id: Pembuangan data
tr_tr: Veri yok etme

source: Data encryption
de: Datenverschlüsselung
id: Enkripsi data
tr_tr: Veri şifreleme

source: Data formats and transformations
de: Datenformate und Transformationen
id: Format dan transformasi data
tr_tr: Veri biçimi ve dönüşümler

source: Data not securely erased
de: Daten nicht sicher gelöscht
id: Data tidak terhapus secara aman
tr_tr: Veri güvenli silinmedi

source: Data passed to OpenStack Compute's configuration-drive extension
de: Daten an die Konfigurations-Laufwerk-Erweiterung von OpenStack Compute übergeben
id: Data dikirimkan ke ekstensi configuration-drive OpenStack Compute
tr_tr: OpenStack Hesaplama'nın yapılandırma yönelimli uzantıya aktarılan verisi

source: Data privacy concerns
de: Datenschutzbedürfnisse
id: Masalah privasi data
tr_tr: Veri gizililiği endişeleri

source: Data processing
de: Datenverarbeitung
id: Pengolahan data
tr_tr: Veriş işleme

source: Data processing interacts directly with several openstack services:
de: Die Datenverarbeitung interagiert direkt mit mehreren Openstack-Diensten:
id: Pengolahan data berinteraksi langsung dengan beberapa layanan openstack:
tr_tr: Veri işleme, doğrudan birkaç openstack servisi ile etkileşime geçer:

source: Data processing resources (clusters, jobs, and data sources) are segregated by projects defined within the Identity service. These resources are shared within a project and it is important to understand the access needs of those who are using the service. Activities within projects (for example launching clusters, uploading jobs, etc.) can be restricted further through the use of role-based access controls.
de: Datenverarbeitungsressourcen (Cluster, Jobs und Datenquellen) werden durch Projekte getrennt, die im Identitätsdienst definiert sind. Diese Ressourcen werden in einem Projekt geteilt und es ist wichtig, die Zugangsbedürfnisse derjenigen zu verstehen, die den Dienst nutzen. Aktivitäten im Rahmen von Projekten (z.B. Starten von Clustern, Hochladen von Aufträgen etc.) können durch den Einsatz rollenbasierter Zugriffskontrollen weiter eingeschränkt werden.
id: Sumber daya pengolahan data (clusters, jobs, and data sources) dipisahkan oleh proyek yang didefinisikan dalam layanan Identitas. Sumber daya ini dibagi dalam sebuah proyek dan penting untuk memahami kebutuhan akses mereka yang menggunakan layanan ini. Kegiatan dalam proyek (misalnya, launching clusters, uploading jobs, dll.) dapat dibatasi lebih jauh melalui penggunaan role-based access control.
tr_tr: Veri işleme kaynakları (kümeler, işler ve veri kaynakları) Kimlik hizmeti içinde tanımlanan projeler tarafından ayrılmıştır. Bu kaynaklar bir proje içinde paylaşılır ve hizmeti kullananların erişim ihtiyaçlarını anlamak önemlidir. Projelerdeki faaliyetler (örneğin, kümelenme başlatma, iş yükleme, vb.), Rol tabanlı erişim denetimlerini kullanarak daha da kısıtlanabilir.

source: Data residency
de: Datenresidenz
id: Data residensi
tr_tr: Veri ikamesi

source: Database (MySQL): MySQL database to store barbican state data related to its managed entities and their metadata.
de: Datenbank (MySQL): MySQL-Datenbank zum Speichern von barbican-Statusdaten im Zusammenhang mit ihren verwalteten Einheiten und deren Metadaten.
id: Database (MySQL): Database MySQL untuk menyimpan barbican state data yang terkait dengan entitas yang dikelola dan metadata mereka.
tr_tr: Veritabanı (MySQL): Yönetilen varlıklar ve metaverileri ile ilgili barbican durum verilerini saklamak için MySQL veritabanı.

source: Database access control
de: Datenbankzugriffskontrolle
id: Kontrol akses Database
tr_tr: Veritabanı erişim kontrolü

source: Database authentication and access control
de: Datenbank-Authentifizierung und Zugriffskontrolle
id: Database otentikasi dan kontrol akses
tr_tr: Veritabanı kimlik doğrulaması ve erişim kontrolü

source: Database back end considerations
de: Datenbank-Back-End-Überlegungen
id: Pertimbangan back end database
tr_tr: Veritabanı arka uç hususları

source: Database server
de: Datenbankserver
id: Server Database
tr_tr: Veritabanı sunucusu

source: Database server IP address binding
de: Datenbank-Server-IP-Adresse binden
id: Alamat IP server database mengikat
tr_tr: Veritabanı sunucusu IP adresi bağlama

source: Database transport
de: Datenbanktransport
id: Transportasi database
tr_tr: Veritabanı taşıma

source: Database transport security
de: Datenbanktransport Sicherheit
id: Keamanan transportasi database
tr_tr: Veritabanı taşıma güvenliği

source: Databases
de: Datenbanken
tr_tr: Veritabanları

source: Debug
de: Debuggen
tr_tr: Hata ayıklama

source: Default setting is True.
de: Die Standardeinstellung ist True.
id: Pengaturan default menjadi True.
tr_tr: Öntanımlı ayar True.

source: Demonstration to a neutral third-party that system security controls are implemented and operating effectively, in compliance with in-scope standards and regulations, is required before many information systems achieve certified status. Many certifications require periodic audits to ensure continued certification, considered part of an overarching continuous monitoring practice.
de: Demonstration zu einem neutralen Drittanbieter, dass die Systemsicherheitskontrollen in Übereinstimmung mit den Instandhaltungsstandards und -vorschriften wirksam umgesetzt und betrieben werden, bevor viele Informationssysteme einen zertifizierten Status erreichen. Viele Zertifizierungen erfordern regelmäßige Audits, um eine fortgesetzte Zertifizierung zu gewährleisten, die als Teil einer übergreifenden kontinuierlichen Monitoring-Praxis gilt.
id: Demonstrasi kepada pihak ketiga yang netral bahwa kontrol keamanan sistem diimplementasikan dan beroperasi secara efektif, sesuai dengan standar dan peraturan di dalam ruang, diperlukan sebelum banyak sistem informasi mendapatkan status bersertifikat. Banyak sertifikasi memerlukan audit berkala untuk memastikan sertifikasi lanjutan, yang dianggap sebagai bagian dari keseluruhan praktik pemantauan berkelanjutan.
tr_tr: Birçok bilgi sistemi onaylı statüye erişmeden önce, sistem güvenlik kontrollerinin uygulanması ve etkin bir şekilde ve kapsam içi standartlara ve yönetmeliklere uygun olarak çalıştırılmasının tarafsız bir üçüncü şahsa gösterilmesi gerekmektedir. Pek çok sertifika, sürekli bir izleme uygulamasının bir parçası olarak görülen ve devam eden sertifikasyonun sağlanması için periyodik denetimler gerektirir.

source: Denial of Service refers to an exploited vulnerability that may cause service or system disruption. This includes both distributed attacks to overwhelm network resources, and single-user attacks that are typically caused through resource allocation bugs or input induced system failure flaws.
de: Denial of Service bezieht sich auf eine ausgebeutete Sicherheitsanfälligkeit, die zu Service- oder Systemstörungen führen kann. Dies umfasst sowohl verteilte Angriffe, um Netzwerkressourcen zu überwältigen, als auch Einzelbenutzerangriffe, die typischerweise durch Ressourcenzuweisungsfehler oder eingegebene Systemausfallfehler verursacht werden.
id: Denial of Service mengacu pada kerentanan yang dieksploitasi yang dapat menyebabkan gangguan layanan atau sistem. Ini termasuk serangan terdistribusi untuk membanjiri sumber daya jaringan, dan serangan pengguna tunggal yang biasanya disebabkan oleh bug alokasi sumber daya atau kekurangan kegagalan sistem yang disebabkan masukan.
tr_tr: Hizmet Reddi, hizmete veya sistemin bozulmasına neden olabilecek bir istismar güvenlik açığı anlamına gelir. Buna aşırı yüklü ağ kaynaklarına yönelik dağıtılmış saldırılar ve genellikle kaynak tahsisi hataları veya girişe bağlı sistem hatası kusurları nedeniyle oluşan tek kullanıcı saldırıları da dahildir.

source: Depending on the strategy selected, in the event of a failure the node will either fail to boot or it can report the failure back to another entity in the cloud. For secure boot, the node will fail to boot and a provisioning service within the management security domain must recognize this and log the event. For boot attestation, the node will already be running when the failure is detected. In this case the node should be immediately quarantined by disabling its network access. Then the event should be analyzed for the root cause. In either case, policy should dictate how to proceed after a failure. A cloud may automatically attempt to re-provision a node a certain number of times. Or it may immediately notify a cloud administrator to investigate the problem. The right policy here will be deployment and failure mode specific.
de: Abhängig von der gewählten Strategie wird im Falle eines Fehlers der Knoten entweder nicht gestartet oder er kann den Fehler an eine andere Entität in der Cloud melden. Für einen sicheren Start wird der Knoten nicht booten und ein Bereitstellungsdienst innerhalb der Verwaltungssicherheitsdomäne muss dies erkennen und das Ereignis protokollieren. Für die Boot-Bescheinigung wird der Knoten bereits ausgeführt, wenn der Fehler erkannt wird. In diesem Fall sollte der Knoten sofort durch die Deaktivierung seines Netzwerkzugriffs unter Quarantäne gestellt werden. Dann sollte das Ereignis für die Grundursache analysiert werden. In beiden Fällen sollte die Richtlinie diktieren, wie man nach einem Ausfall vorgehen soll. Eine Cloud kann automatisch versuchen, einen Knoten eine bestimmte Anzahl von Malen wiederzugeben. Oder es kann sofort einen Cloud-Administrator benachrichtigen, um das Problem zu untersuchen. Die richtige Richtlinie hier ist die Bereitstellung und Fehler Modus spezifisch.
id: Bergantung pada strategi yang dipilih, jika terjadi kegagalan, node akan gagal booting atau dapat melaporkan kegagalan kembali ke entitas lain di awan. Untuk boot aman, node terjadi gagal booting dan kemudian layanan provisioning dalam domain keamanan manajemen harus mengenali ini dan mencatat kejadian. Untuk pengesahan booting, node sudah akan berjalan saat failure terdeteksi. Dalam hal ini node harus segera dikarantina dengan menonaktifkan akses jaringannya. Maka event tersebut harus dianalisis untuk akar permasalahannya. Dalam kasus tersebut, kebijakan harus mendikte bagaimana melanjutkan setelah kegagalan. Awan secara otomatis dapat mencoba menyediakan kembali node beberapa kali. Atau mungkin segera memberitahu administrator awan untuk menyelidiki masalahnya. Kebijakan yang tepat disini akan bersifat deployment dan failure mode yang spesifik.
tr_tr: Seçilen stratejiye bağlı olarak, bir arıza durumunda, düğüm önyükleme başarısız olur veya başarısızlığı buluttaki başka bir öğeye tekrar rapor edebilir. Güvenli önyükleme için düğüm önyükleme başarısız olur ve yönetim güvenlik alanı içindeki bir sağlama hizmeti bunu tanır ve olayı günlüğe kaydetmelidir. Önyükleme doğrulaması için, hata tespit edildiğinde düğüm zaten çalışıyor demektir. Bu durumda, düğüm, ağ erişimini devre dışı bırakarak derhal karantinaya alınmalıdır. O zaman olay, kök sebep için analiz edilmelidir. Her iki durumda da, politika bir başarısızlıktan sonra ne şekilde ilerleyeceklerini belirlemelidir. Bir bulut otomatik olarak bir düğüme belirli sayıda tekrar sağlanmaya çalışabilir. Veya problemi araştırması için hemen bir bulut yöneticisine bilgi verebilir. Burada doğru politika, dağıtım ve hata modu özel olacaktır.

source: Deploy automated testing tools to ensure that the cloud remains compliant over time.
de: Bereitstellen automatisierter Test-Tools, um sicherzustellen, dass die Cloud im Laufe der Zeit konform bleibt.
id: Terapkan alat uji otomatis untuk memastikan bahwa awan tetap sesuai dengan waktu.
tr_tr: Bulutun zaman içinde uyumlu olmasını sağlamak için otomatik test araçlarını kullanın.

source: Deploy the dashboard behind a secure :term:`HTTPS <Hypertext Transfer Protocol Secure (HTTPS)>` server by using a valid, trusted certificate from a recognized certificate authority (CA). Private organization-issued certificates are only appropriate when the root of trust is pre-installed in all user browsers.
de: Bereitstellen des Dashboards hinter einem sicheren :term:`HTTPS <Hypertext Transfer Protocol Secure (HTTPS)>`Server mit einem gültigen, vertrauenswürdigen Zertifikat von einer anerkannten Zertifizierungsstelle (CA). Private Organisationen ausgestellte Zertifikate sind nur dann sinnvoll, wenn die Wurzel des Vertrauens in allen Benutzerbrowsern vorinstalliert ist.
id: Terapkan dasbor di belakang yang aman :term:`HTTPS <Hypertext Transfer Protocol Secure (HTTPS)>` server dengan menggunakan sertifikat terpercaya dan valid dari certificate authority (CA) yang dikenali. Sertifikat yang diterbitkan oleh organisasi private hanya sesuai bila akar kepercayaan telah terinstal di semua browser pengguna.
tr_tr: Gösterilen bir sertifika yetkilisinin (CA) geçerli ve güvenilir bir sertifikasını kullanarak ön panelin güvenli bir :term:`HTTPS <Hiper Metin Aktarım Protokolü Güvenli (HTTPS)>` sunucusunun arkasına yerleştirin. Özel organizasyon tarafından verilen sertifikaların güveninin kökü, tüm kullanıcı tarayıcılarına önceden yüklendiğinde uygundur.
