Repository: openstack/security-doc
Catalog: security-guide/source/locale/*/LC_MESSAGES/security-guide.po
Languages: de, id, tr_tr

source: All bugs, OSSAs and OSSNs are publicly disseminated through the openstack-dev mailinglist with the [security] topic in the subject line. We recommend subscribing to this list as well as mail filtering rules that ensure OSSNs, OSSAs, and other important advisories are not missed. The openstack-dev mailinglist is managed through `http://lists.openstack.org/cgi-bin/mailman/listinfo/openstack-dev <http://lists.openstack.org/cgi-bin/mailman/listinfo/openstack-dev>`_. The openstack-dev list has a high traffic rate, and filtering is discussed in the thread `http://lists.openstack.org/pipermail/openstack-dev/2013-November/019233.html <http://lists.openstack.org/pipermail/openstack-dev/2013-November/019233.html>`_.
de: Alle Bugs, OSSAs und OSSNs werden öffentlich über die openstack-dev Mailingliste mit dem Thema [security] in der Betreffzeile verbreitet. Wir empfehlen Ihnen, diese Liste sowie Mail-Filter-Regeln, damit Sie die OSSNs, OSSAs und andere wichtige Hinweise nicht verpassen. Die openstack-dev Mailingliste wird über `http://lists.openstack.org/cgi-bin/mailman/listinfo/openstack-dev <http://lists.openstack.org/cgi-bin/mailman/listinfo/openstack-dev>`_ verwaltet. Die openstack-dev-Liste hat eine hohe Verkehrsrate, und die Filterung wird im Thread `http://lists.openstack.org/pipermail/openstack-dev/2013-November/019233.html" diskutiert <http://lists.openstack.org/pipermail/openstack-dev/2013-November/019233.html>`_.

source: All custom user metadata names
de: Alle benutzerdefinierten Benutzer Metadaten Namen
tr_tr: Tüm özel kullanıcı metaveri isimleri

source: All custom user object metadata values. For example, metadata sent using ``X-Object-Meta-`` prefixed headers with PUT or POST requests
de: Alle benutzerdefinierten Benutzerobjekt-Metadatenwerte. Zum Beispiel werden Metadaten, die mit ``X-Object-Meta-``vorangestellten Headern mit PUT- oder POST-Anforderungen gesendet wurden
id: Semua nilai metadata objek pengguna khusus. Misalnya, metadata dikirim menggunakan header header ``X-Object-Meta-`` yang diawali dengan permintaan PUT atau POST
tr_tr: Tüm özel kullanıcı nesne metaveri değerleri. Örneğin, metaveriler, PUT veya POST istekleri olan "X-Object-Meta-` "önekli başlıkları kullanılarak gönderildi

source: All database communications be isolated to a management network
de: Alle Datenbankkommunikationen werden in ein Management-Netzwerk integriert
id: Semua komunikasi database diisolasi ke jaringan manajemen
tr_tr: Tüm veritabanı iletişimleri bir yönetim ağına ayrılmış

source: All domains should be secured with TLS, including the management domain services and intra-service communications. TLS provides the mechanisms to ensure authentication, non-repudiation, confidentiality, and integrity of user communications to the OpenStack services and between the OpenStack services themselves.
de: Alle Domains sollten mit TLS gesichert werden, einschließlich der Management-Domain-Services und Intra-Service-Kommunikation. TLS stellt die Mechanismen zur Verfügung, um die Authentifizierung, Nicht-Ablehnung, Vertraulichkeit und Integrität der Benutzer-Kommunikation zu den OpenStack-Diensten und zwischen den OpenStack-Diensten selbst zu gewährleisten.
id: Semua domain harus diamankan dengan TLS, termasuk layanan domain manajemen dan komunikasi intra-layanan. TLS menyediakan mekanisme untuk memastikan otentikasi, non-penolakan, kerahasiaan, dan integritas komunikasi pengguna terhadap layanan OpenStack dan antara layanan OpenStack itu sendiri.
tr_tr: Tüm etki alanları, yönetim alanı servisleri ve servis içi iletişimler de dahil TLS ile güvence altına alınmalıdır. TLS, OpenStack servislerine ve OpenStack servisleri arasındaki kullanıcı iletişiminin doğruluğunu, reddedilmemesini, gizliliğini ve bütünlüğünü sağlamak için mekanizmalar sağlar.

source: All entry points into a system
de: Alle Einstiegspunkte in ein System
id: Semua titik masuk (entry point) masuk ke sistem
tr_tr: Tüm sisteme giriş noktaları

source: All of the above are valid concerns, but none of them prevent SSL/TLS from being used on the management network. Let's consider the next deployment model.
de: Alle oben genannten sind gültige Bedenken, aber keiner von ihnen verhindert, dass SSL/TLS im Management-Netzwerk verwendet wird. Betrachten wir das nächste Einsatzmodell.
id: Semua hal di atas adalah masalah yang valid, namun tidak ada satupun yang mencegah SSL/TLS digunakan pada jaringan manajemen. Mari pertimbangkan model penerapan berikutnya.
tr_tr: Yukarıdakilerin hepsi geçerli endişeler, ancak hiçbiri SSL/TLS'nin yönetim ağında kullanılmasını engellemez. Bir sonraki dağıtım modelini düşünelim.

source: All of the services within an OpenStack project access a single database. There are presently no reference policies for creating table or row based access restrictions to the database.
de: Alle Services innerhalb eines OpenStack-Projekts greifen auf eine einzige Datenbank zu. Es gibt derzeit keine Referenzrichtlinien zum Erstellen von Tabellen- oder Zeilenbasierten Zugriffsbeschränkungen für die Datenbank.
id: Semua layanan dalam proyek OpenStack mengakses database tunggal. Saat ini tidak ada kebijakan referensi untuk membuat batasan akses berbasis tabel atau baris ke database.
tr_tr: Bir OpenStack projesindeki tüm servisler tek bir veritabanına erişir. Veritabanına tablo veya satır bazlı erişim kısıtlamaları oluşturmak için şu anda referans politikası yoktur.

source: All share drivers that use the OpenStack Compute service do not use network plug-ins. In Mitaka release it is Windows and Generic drivers. These share drives have other options and use different approach.
de: Alle Freigabe-Treiber, die den OpenStack Compute-Dienst verwenden, verwenden keine Netzwerk-Plug-Ins. In Mitaka Release ist es Windows und Generic Treiber. Diese Freigabe-Laufwerke haben andere Optionen und verwenden einen unterschiedliche Ansatz.
id: Semua driver share yang menggunakan layanan OpenStack Compute tidak menggunakan plug-in jaringan. Di Mitaka rilis itu adalah driver Windows dan Generic. Drive berbagi ini memiliki pilihan lain dan menggunakan pendekatan yang berbeda.
tr_tr: OpenStack Hesaplama servisini kullanan tüm paylaşım sürücüleri, ağ eklentileri kullanmaz. Mitaka sürümünde Windows ve Genel sürücülerdir. Bu paylaşımlı sürücüler başka seçeneklere sahiptirler ve farklı yaklaşımlar kullanmaktadırlar.

source: Allow confined virtual guests to interact with the sanlock.
de: Erlaube beschränkten virtuellen Gästen, mit dem Sanlock zu interagieren.
id: Biarkan virtual gues terbatas untuk berinteraksi dengan sanlock.
tr_tr: Kapatılan sanal konukların sanlock ile etkileşime girmesine izin ver.

source: Allow virt to manage CIFS mounted files.
de: Erlaube virt, CIFS-Dateien zu verwalten.
id: Izinkan virt untuk mengelola file yang dipasang CIFS.
tr_tr: Sanallaştrmanın CIFS ile bağlanmış dosyaları yönetmesine izin ver.

source: Allow virt to manage NFS mounted files.
de: Erlaube virt, NFS-Dateien zu verwalten.
id: Izinkan virt untuk mengelola file yang dipasang NFS.
tr_tr: Sanallaştırmanın NFS ile bağlanmış dosyaları yönetmesine izin ver.

source: Allow virt to manage device configuration (PCI).
de: Erlaube virt, die Gerätekonfiguration (PCI) zu verwalten.
id: Izinkan virt untuk mengatur konfigurasi perangkat (PCI).
tr_tr: Sanallaştırmanın aygıt yapılandırmasını (PCI) yönetmesine izin ver.

source: Allow virt to read FUSE mounted files.
de: Erlaube virt, FUSE-Dateien zu lesen.
id: Izinkan virt untuk membaca file yang dipasang FUSE.
tr_tr: Sanallaştırmanın FUSE ile bağlanmış dosyaları okumasına izin ver.

source: Allow virt to use USB devices.
de: Erlaube virt, USB-Geräte zu verwenden.
id: Izinkan virt untuk menggunakan perangkat USB.
tr_tr: Sanallaştırmanın USB cihazları kullanmasına izin ver.

source: Allow virt to use serial or parallel communication ports.
de: Erlauben Sie virt, serielle oder parallele Kommunikationsschnittstellen zu verwenden.
id: Izinkan virt untuk menggunakan port komunikasi serial atau paralel.
tr_tr: Sanallaştırmanın seri ya da paralel haberleşme bağlantı noktalarını kullanmasına izin ver.

source: Allow virtual machine to interact with the X Window System.
de: Erlaube virtuelle Maschine, mit dem X-Window-System zu interagieren.
id: Biarkan mesin virtual berinteraksi dengan X Window System.
tr_tr: Sanal makinenin X Pencere Sistemi ile etkileşime geçmesine izin ver.

source: Allows a regular expression to validate user password complexity.
de: Ermöglicht einen regulären Ausdruck, um die Komplexität des Benutzerpassworts zu überprüfen.
id: Mengizinkan ekspresi reguler untuk memvalidasi kompleksitas kata sandi pengguna.
tr_tr: Kullanıcı parolası karmaşıklığını doğrulamak için düzenli ifade kullanılmasını sağlar.

source: Allows a user to authenticate with the Identity service to exchange the :term:`unscoped token` for a :term:`scoped token`, by providing a project ID or a domain ID.
de: Ermöglicht es einem Benutzer, sich mit dem Identity-Dienst zu authentifizieren, um den Begriff: `unscoped token` für einen :term:`scoped token` auszutauschen, indem er eine Projekt-ID oder eine Domain-ID bereitstellt.
tr_tr: Bir kullanıcının, bir proje kimliği veya etki alanı kimliği sağlayarak bir :term`kapsamın altındaki belirteç` için :term:`kapsam dışı belirteç` değiştirerek Kimlik hizmetiyle kimlik doğrulamasını yapmasına izin verir.

source: Allows a user to use all OpenStack services apart from the Identity service.
de: Ermöglicht einem Benutzer, alle OpenStack-Dienste außer dem Identity-Dienst zu verwenden.
tr_tr: Bir kullanıcının Kimlik servisi dışındaki tüm OpenStack servislerini kullanmasına izin verir.

source: Allows secure login to nodes and guest VMs
de: Ermöglicht eine sichere Anmeldung an Knoten und Gast-VMs
id: Mengizinkan login yang aman ke node dan VM tamu

source: Also known as Data Execution Prevention (DEP), ensures that data sections of the executable can not be executed.
de: Auch bekannt als Data Execution Prevention (DEP), stellt sicher, dass Datenabschnitte der ausführbaren Datei nicht ausgeführt werden können.
id: Juga dikenal sebagai Data Execution Prevention (DEP), memastikan bahwa bagian data executable tidak dapat dijalankan.
tr_tr: Veri Çalıştırma Engellemesi (DEP) olarak da bilinen, yürütülebilir dosyanın veri bölümlerinin çalıştırılmamasını sağlar.

source: Also of note is the Identity service. Users of the Data processing service will need appropriate roles in their projects to allow the provisioning of instances for their clusters. Installations that use the proxy domain configuration require special consideration. See :ref:`data-processing-proxy-domains`. Specifically, the Data processing service will need the ability to create users within the proxy domain.
de: Bemerkenswert ist auch der Identitätsdienst. Benutzer des Datenverarbeitungsdienstes benötigen entsprechende Rollen in ihren Projekten, um die Bereitstellung von Instanzen für ihre Cluster zu ermöglichen. Installationen, die die Proxy-Domänenkonfiguration verwenden, erfordern besondere Berücksichtigung. Siehe :ref:`data-processing-proxy-domains`. Insbesondere benötigt der Datenverarbeitungsdienst die Möglichkeit, Benutzer innerhalb der Proxy-Domäne zu erstellen.
id: Yang juga diperhatikan adalah layanan Identitas. Pengguna layanan pengolahan data memerlukan peran yang sesuai dalam proyek mereka untuk memungkinkan penyediaan instance untuk cluster mereka. Instalasi yang menggunakan konfigurasi domain proxy memerlukan pertimbangan khusus. Lihat :ref:`data-processing-proxy-domains`. Secara khusus, layanan pengolahan data memerlukan kemampuan untuk membuat pengguna dalam domain proxy.
tr_tr: Ayrıca, Kimlik servisi de dikkat çekiyor. Veri işleme servisinin kullanıcıları, kendi kümeleri için örneklerin hazırlanmasına izin vermek için projelerinde uygun rollere ihtiyaç duyacaktır. Vekil etki alanı yapılandırmasını kullanan yüklemeler özel bir önem arzetmektedir. Bakınız :ref:`data-processing-proxy-domains`. Özellikle Veri işleme servisi, vekil etki alanı içinde kullanıcı oluşturma yeteneğine ihtiyaç duyacaktır.

source: Alternate measures to provide data privacy, in the creation and destruction of ephemeral storage, will be somewhat dependent on the chosen hypervisor and the OpenStack Compute plug-in.
de: Alternative Maßnahmen zur Bereitstellung von Datenschutz, bei der Erstellung und Zerstörung von kurzlebigen Speicherung, werden von dem gewählten Hypervisor und dem OpenStack Compute Plug-In etwas abhängig sein.
id: Langkah alternatif untuk memberikan privasi data, dalam penciptaan dan penghancuran penyimpanan sementara, akan tergantung pada hypervisor yang dipilih dan plug-in OpenStack Compute.
tr_tr: Geçici depolamanın yaratılması ve yok edilmesinde veri gizliliği sağlamak için alternatif tedbirler biraz seçilen üst düzey yönetici ve OpenStack Hesaplama eklentisine bağlı olacaktır.

source: Although SPICE has many advantages over VNC, the spice-html5 browser integration currently does not allow administrators to take advantage of the benefits. To take advantage of SPICE features like multi-monitor, USB pass through, we recommend administrators use a standalone SPICE client within the management network.
de: Obwohl SPICE viele Vorteile gegenüber VNC hat, ermöglicht die Spice-html5 Browser-Integration derzeit nicht, dass Administratoren die Vorteile nutzen können. Um die Vorteile von SPICE-Funktionen wie Multi-Monitor, USB-Durchlauf zu nutzen, empfehlen wir Administratoren, einen eigenständigen SPICE-Client im Management-Netzwerk zu nutzen.
id: Meski SPICE memiliki banyak kelebihan dibanding VNC, integrasi browser spice-html5 saat ini tidak memungkinkan administrator memanfaatkan keuntungannya. Untuk memanfaatkan fitur SPICE seperti multi-monitor, melewati USB, sebaiknya administrator menggunakan klien SPICE mandiri di dalam jaringan manajemen.
tr_tr: SPICE'in VNC'ye kıyasla pek çok avantajı olmasına rağmen, spice-html5 tarayıcı entegrasyonu şu anda yöneticilerin avantajlarından faydalanmasına izin vermiyor. Çoklu monitör, USB geçişi gibi SPICE özelliklerinden yararlanmak için, yöneticilerin yönetim ağı içinde bağımsız bir SPICE istemcisi kullanmalarını öneriyoruz.

source: Although we recommend using the OpenStack Volume Encryption feature, Block Storage supports a large variety of alternative back-ends for supplying mountable volumes, and some of these may also provide volume encryption. Since there are so many `back-ends <https://docs.openstack.org/cinder/latest/drivers.html>`_, and since information from each vendor must be obtained, it is outside the scope of this guide to specify recommendations for implementing encryption in any of them.
de: Obwohl wir die OpenStack Volume Encryption-Funktion verwenden, unterstützt Block Storage eine Vielzahl von alternativen Backends für die Bereitstellung von installierbaren Volumes, und einige davon können auch eine Volumenverschlüsselung bereitstellen. Da gibt es so viele `back-ends <https://docs.openstack.org/cinder/latest/drivers.html>`_, und da Informationen von jedem Anbieter erhalten werden müssen, ist es außerhalb des Geltungsbereichs dieses Leitfadens, Empfehlungen für die Implementierung der Verschlüsselung in jedem von ihnen zu geben.
id: Meskipun kami merekomendasikan penggunaan fitur OpenStack Volume Encryption, Block Storage mendukung beragam alternatif back-end untuk memasok volume mountable, dan beberapa di antaranya juga menyediakan enkripsi volume. Karena ada begitu banyak `back-ends <https://docs.openstack.org/cinder/latest/drivers.html>`_, dan karena informasi dari masing-masing vendor harus diperoleh, di luar ruang lingkup panduan ini untuk menentukan rekomendasi untuk menerapkan enkripsi di dalamnya.

source: Although you may desire to break these domains down further (we later discuss where this may be appropriate), we generally refer to four distinct security domains which form the bare minimum that is required to deploy any OpenStack cloud securely. These security domains are:
de: Obwohl Sie es wünschen, diese Domains weiter zu unterteilen (wir diskutieren weiter, wo dies angebracht sein kann), beziehen wir uns in der Regel auf vier verschiedene Sicherheitsdomänen, die das bloße Minimum bilden, das erforderlich ist, um eine beliebige OpenStack-Cloud sicher zu implementieren. Diese Sicherheitsdomänen sind:
id: Meskipun Anda mungkin ingin memecah domain ini lebih jauh (kami kemudian membahas di mana hal ini mungkin sesuai), biasanya kami mengacu pada empat domain keamanan yang berbeda yang membentuk standar minimum yang diperlukan untuk menyebarkan awan OpenStack dengan aman. Domain keamanan ini adalah:
tr_tr: Bu alanları daha da kırmak isteyebilirsiniz (daha sonra bunun uygun olabileceğini tartışacağız), genellikle OpenStack bulutunu güvenli bir şekilde dağıtmak için gereken en düşük seviyeyi oluşturan dört farklı güvenlik alanına atıfta bulunuruz. Bu güvenlik etki alanları şunlardır:

source: An IP address or host name of a security service.
de: Eine IP-Adresse oder ein Hostname eines Sicherheitsdienstes.
id: Alamat IP atau nama host dari sebuah layanan keamanan.
tr_tr: Güvenlik servisinin sunucu adı ya da IP adresi.

source: An Information Security Management System (ISMS) is a comprehensive set of policies and processes that an organization creates and maintains to manage risk to information assets. The most common ISMS for cloud deployments is `ISO/IEC 27001/2 <http://www.27000.org/iso-27001.htm>`_, which creates a solid foundation of security controls and practices for achieving more stringent compliance certifications. This standard was updated in 2013 to reflect the growing use of cloud services and places more emphasis on measuring and evaluating how well an organization's ISMS is performing.
de: Ein Information Security Management System (ISMS) ist ein umfassendes Set von Richtlinien und Prozessen, die eine Organisation erstellt und verwaltet, um das Risiko für Informationswerte zu verwalten. Das häufigste ISMS für Cloud-Implementierungen ist "ISO/IEC 27001/2" <http://www.27000.org/iso-27001.htm>`_, die eine solide Grundlage für Sicherheitskontrollen und -praktiken für die Erreichung strengerer Compliance-Zertifizierungen schafft. Dieser Standard wurde im Jahr 2013 aktualisiert, um den wachsenden Einsatz von Cloud-Services widerzuspiegeln und legt mehr Wert darauf, zu messen und zu bewerten, wie gut das ISMS in einer Organisation ausgführt wird.
id: An Information Security Management System (ISMS) adalah seperangkat kebijakan dan proses yang komprehensif yang diciptakan dan dikelola oleh sebuah organisasi untuk mengelola risiko terhadap aset informasi. ISMS yang paling umum untuk pengerahan awan adalah `ISO/IEC 27001/2 <http://www.27000.org/iso-27001.htm>`_, yang menciptakan fondasi yang kuat dari kontrol keamanan dan praktik untuk mencapai sertifikasi kepatuhan yang lebih ketat. Standar ini diperbarui pada tahun 2013 untuk mencerminkan meningkatnya penggunaan layanan awan dan tempat-tempat yang lebih menekankan pada pengukuran dan evaluasi seberapa baik kinerja ISMS organisasi.
tr_tr: Bir Bilgi Güvenliği Yönetim Sistemi (ISMS), bir organizasyonun bilgi varlıkları için riski yönetmek için oluşturduğu ve koruduğu kapsamlı bir politika ve süreçler dizisidir. Bulut dağıtımları için en yaygın ISMS, `ISO / IEC 27001/2 <http://www.27000.org/iso-27001.htm>`_ olup, daha katı uyum sertifikası sağlamak için sağlam bir güvenlik kontrolü ve uygulaması zemini oluşturmaktadır. Bu standart, bulut hizmetlerinin gittikçe artan kullanımını yansıtacak şekilde 2013 yılında güncellendi ve bir kuruluşun ISMS'in ne kadar iyi performans gösterdiğini ölçmek ve değerlendirmek için daha fazla önem verdi.

source: An Object Storage account is not a user account or credential. The following explains the relations:
de: Ein Objektspeicherkonto ist kein Benutzerkonto oder Anmeldeinformation. Im Folgenden werden die Beziehungen erläutert:
id: Akun Object Storage bukanlah akun pengguna atau kredensial. Berikut ini menjelaskan hubungan:
tr_tr: Nesne Depolama hesabı, bir kullanıcı hesabı veya kimlik bilgisi değildir. İlişkiler şu şekilde açıklanmaktadır:

source: An Object Storage installation does not have to be on the Internet and could also be a private cloud with the public switch a part of the organization's internal network infrastructure.
de: Eine Objektspeicherinstallation muss nicht im Internet sein und könnte auch eine private Cloud gegen eine public Cloud als ein Teil der internen Netzwerkinfrastruktur des Unternehmens switchen.
id: Instalasi Object Storage tidak harus ada di Internet dan juga bisa menjadi awan private dengan tombol publik sebagai bagian dari infrastruktur jaringan internal organisasi.
tr_tr: Nesne Deposu kurulumunun İnternet'te olması gerekmez ve ayrıca kamuya açık switch, organizasyonun dahili ağ altyapısının bir parçası olan özel bir bulut olabilir.

source: An OpenStack deployment may require compliance activities for many purposes, such as regulatory and legal requirements, customer need, privacy considerations, and security best practices. The Compliance function is important for the business and its customers. Compliance means adhering to regulations, specifications, standards and laws. It is also used when describing an organizations status regarding assessments, audits, and certifications. Compliance, when done correctly, unifies and strengthens the other security topics discussed in this guide.
de: Eine OpenStack-Bereitstellung kann Compliance-Aktivitäten für viele Zwecke erfordern, wie z. B. regulatorische und rechtliche Anforderungen, Kundenbedürfnisse, Datenschutzerklärungen und Sicherheitsbestimmungen. Die Compliance-Funktion ist für das Unternehmen und seine Kunden wichtig. Compliance bedeutet die Einhaltung von Vorschriften, Spezifikationen, Normen und Gesetzen. Es wird auch bei der Beschreibung eines Unternehmensstatus in Bezug auf Beurteilungen, Audits und Zertifizierungen verwendet. Compliance, wenn es richtig gemacht wird, vereint und stärkt die anderen Sicherheitsthemen, die in diesem Leitfaden behandelt werden.
id: Penyebaran OpenStack mungkin memerlukan aktivitas kepatuhan untuk berbagai tujuan, seperti persyaratan peraturan dan hukum, kebutuhan pelanggan, pertimbangan privasi, dan praktik terbaik keamanan. Fungsi Kepatuhan penting bagi bisnis dan pelanggannya. Kepatuhan berarti mematuhi peraturan, spesifikasi, standar dan undang-undang. Ini juga digunakan saat menggambarkan status organisasi mengenai penilaian, audit, dan sertifikasi. Kepatuhan, bila dilakukan dengan benar, menyatukan dan memperkuat topik keamanan lainnya yang dibahas dalam panduan ini.
tr_tr: Bir OpenStack kurulumu, düzenleyici ve yasal gereklilikler, müşteri ihtiyaçları, gizlilik konuları ve en iyi güvenlik uygulamaları gibi birçok amaçla uyum faaliyetleri gerektirebilir. Uyumluluk işlevi, iş ve müşterileri için önemlidir. Uyum, yönetmeliklere, şartnamelere, standartlara ve kanunlara uymak demektir. Değerlendirme, denetim ve sertifikalarla ilgili bir kuruluş statüsünü tanımlarken de kullanılır. Uyum, doğru yapıldığında, bu kılavuzda tartışılan diğer güvenlik konularını birleştirir ve güçlendirir.
