Repository: openstack/security-doc
Catalog: security-guide/source/locale/*/LC_MESSAGES/security-guide.po
Languages: de, id, tr_tr

source: The following compiler options are recommend for GCC when compiling QEMU:
de: Bei der Kompilierung von QEMU werden folgende Compiler-Optionen für GCC empfohlen:
id: Pilihan kompilator berikut direkomendasikan untuk GCC saat mengkompilasi QEMU:
tr_tr: Aşağıdaki derleyici seçenekleri GCC için, QEMU derlenirken önerilir:

source: The following data are encrypted while at rest in swift:
de: Die folgenden Daten werden verschlüsselt, während sie in Ruhe sind:
id: Data berikut dienkripsi saat istirahat dengan cepat:
tr_tr: Aşağıdaki veriler, swift'te dururken şifrelenir:

source: The following diagram presents a conceptual view of how the Data processing service fits into the greater OpenStack ecosystem.
de: Das folgende Schaubild stellt eine konzeptionelle Sicht dar, wie der Datenverarbeitungsdienst in das größere OpenStack-Ökosystem passt.
id: Diagram berikut menyajikan pandangan konseptual tentang bagaimana layanan pemrosesan Data sesuai dengan ekosistem OpenStack yang lebih besar.
tr_tr: Aşağıdaki diyagram, Veri işleme servisinin daha büyük OpenStack ekosistemine nasıl uyduğuna dair kavramsal bir görüntü sunar.

source: The following example shows a PKI token. Note that token id values are typically 3500 bytes. In this example, the value has been truncated.
de: Das folgende Beispiel zeigt ein PKI-Token. Beachten Sie, dass Token-ID-Werte typischerweise 3500 Bytes sind. In diesem Beispiel wurde der Wert abgeschnitten.

source: The following example shows how the service can restrict access to create, update and delete resources to only those users which have the role of ``cloud_admin``, which has been defined as being the conjunction of ``role = admin`` and ``domain_id = admin_domain_id``, while the get and list resources are made available to users which have the role of ``cloud_admin`` or ``admin``.
de: Das folgende Beispiel zeigt, wie der Dienst den Zugriff auf das Erstellen, Aktualisieren und Löschen von Ressourcen auf nur diejenigen Benutzer beschränken kann, die die Rolle von ``cloud_admin``haben, die als die Konjunktion von ``role = admin``und `definiert wurde `domain_id = admin_domain_id``, während die get- und list-Ressourcen für Benutzer zur Verfügung gestellt werden, die die Rolle von ``cloud_admin`` oder ``admin`` haben.
id: Contoh berikut menunjukkan bagaimana layanan dapat membatasi akses untuk membuat, memperbarui dan menghapus sumber daya hanya untuk pengguna yang memiliki peran ``cloud_admin``, yang telah didefinisikan sebagai gabungan dari ``role = admin`` dan ``domain_id = admin_domain_id``, sedangkan sumber daya get and list tersedia bagi pengguna yang memiliki peran ``cloud_admin`` atau ``admin``.
tr_tr: Aşağıdaki örnek, servisin, yalnızca ``role = admin`` ve ``role_management`` işlevlerinin birleşimi olarak tanımlanan ``cloud_admin`` rolü olan kullanıcılara kaynak oluşturma, güncelleme ve silme erişimini nasıl sınırlandırabileceğini göstermektedir. ``domain_id = admin_domain_id``, get ve liste kaynakları ise ``cloud_admin`` veya ``admin`` rolü olan kullanıcılar tarafından kullanılabilir.

source: The following figure demonstrates one possible network architecture.
de: Die folgende Abbildung zeigt eine mögliche Netzwerkarchitektur.
id: Gambar berikut menunjukkan satu kemungkinan arsitektur jaringan.
tr_tr: Aşağıdaki görsel olası bir ağ mimarisini göstermektedir.

source: The following figure shows an architectural and networking flow diagram of the OpenStack Networking components:
de: Die folgende Abbildung zeigt ein architektonisches und vernetztes Flussdiagramm der OpenStack Networking Komponenten:
id: Gambar berikut menunjukkan diagram alir arsitektur dan jaringan komponen OpenStack Networking:
tr_tr: Aşağıdaki resim OpenStack Ağ bileşenlerinin mimari ve ağ akış diyagramlarını göstermektedir:

source: The following is a list of Control Frameworks that an organization can use to build their security controls.
de: Im Folgenden finden Sie eine Liste von Control Frameworks, die eine Organisation zum Erstellen ihrer Sicherheitskontrollen verwenden kann.
id: Berikut ini adalah daftar Control Frameworks yang dapat digunakan organisasi untuk membangun kontrol keamanan mereka.
tr_tr: Aşağıdaki, bir organizasyonun kendi güvenlik kontrollerini oluştururken kullanabileceği Kontrol Çatılarının bir listesidir.

source: The following lines should be added in the system-wide MySQL configuration file:
de: Folgende Zeilen sollten in der systemweiten MySQL-Konfigurationsdatei hinzugefügt werden:
id: Baris berikut harus ditambahkan di file konfigurasi system-wide MySQL:
tr_tr: Sistem geneli MySQL yapılandırma dosyasına aşağıdaki satırlar eklenmelidir:

source: The following lines should be added in the system-wide PostgreSQL configuration file, ``postgresql.conf``.
de: Die folgenden Zeilen sollten in der systemweiten PostgreSQL-Konfigurationsdatei ``postgresql.conf`` hinzugefügt werden.
id: Baris berikut harus ditambahkan di file konfigurasi system-wide PostgreSQL, ``postgresql.conf``.
tr_tr: Sistem geneli PostgreSQL yapılandırma dosyası ``postgresql.conf`` a aşağıdaki satırlar eklenmelidir.

source: The following lines should be added to the system-wide RabbitMQ configuration file, typically ``/etc/rabbitmq/rabbitmq.config``:
de: Folgende Zeilen sollten der systemweiten RabbitMQ-Konfigurationsdatei hinzugefügt werden, typischerweise ``/etc/rabbitmq/rabbitmq.config``:
id: Baris berikut harus ditambahkan ke file konfigurasi RabbitMQ sistem secara keseluruhan ``/etc/rabbitmq/rabbitmq.config``:
tr_tr: Aşağıdaki satırlar sistem genelindeki RabbitMQ yapılandırma dosyasına eklenmelidir, genellikle ``/etc/rabbitmq/rabbitmq.config``:

source: The following table calls out these features by common hypervisor platforms.
de: Die folgende Tabelle ruft diese Funktionen durch gängige Hypervisor-Plattformen auf.
id: Tabel berikut memanggil fitur ini oleh platform hypervisor umum.
tr_tr: Aşağıdaki tablodaki bu özellikleri yaygın hipervizör platformları kullanmaktadır.

source: The functionality and integration are still evolving. We will access the features in the next release and make recommendations.
de: Die Funktionalität und Integration entwickeln sich immer noch. Wir werden in der nächsten Version auf die Funktionen zugreifen und Empfehlungen abgeben.
id: Fungsionalitas dan integrasi masih terus berkembang. Kami akan mengakses fitur di rilis berikutnya dan membuat rekomendasi.
tr_tr: İşlevsellik ve entegrasyon hala gelişiyor. Bir sonraki sürümdeki özelliklere erişeceğiz ve tavsiyelerde bulunacağız.

source: The generation and collection of logs is an important component of securely monitoring an OpenStack infrastructure. Logs provide visibility into the day-to-day actions of administrators, tenants, and guests, in addition to the activity in the compute, networking, and storage and other components that comprise your OpenStack deployment.
de: Die Erzeugung und Sammlung von Protokollen ist ein wichtiger Bestandteil der sicheren Überwachung einer OpenStack-Infrastruktur. Logs bieten neben der Aktivität in der Compute-, Networking- und Storage- und anderen Komponenten, die Ihre OpenStack-Implementierung umfassen, die täglichen Aktionen von Administratoren, Tenants und Gästen.
id: Generasi dan koleksi log merupakan komponen penting untuk memantau infrastruktur OpenStack secara aman. Log memberikan visibilitas ke tindakan administrator, penyewa, dan tamu sehari-hari, selain aktivitas dalam penghitungan, jaringan, dan penyimpanan dan komponen lainnya yang menyusun penerapan OpenStack Anda.
tr_tr: Günlüklerin oluşturulması ve toplanması, bir OpenStack altyapısının güvenli bir şekilde izlenmesinin önemli bir bileşenidir. Günlükler, OpenStack dağıtımınızı oluşturan hesaplama, ağ oluşturma ve depolama ve diğer bileşenlerdeki etkinliklere ek olarak yöneticilerin, kiracılardaki ve konukların günlük işlemlerine görünürlük sağlar.

source: The goal of security review in the OpenStack community is to identify weaknesses in design or implementation of OpenStack projects. While rare, these weaknesses could potentially have catastrophic effects on the security of an OpenStack deployment, and therefore work should be undertaken to minimize the likelihood of these defects in released projects. The OpenStack Security Project asserts that once a security review of a project has been completed, the following are known and documented:
de: Das Ziel der Sicherheitsüberprüfung in der OpenStack-Community ist es, Schwachstellen bei der Gestaltung oder Implementierung von OpenStack-Projekten zu identifizieren. Zwar könnten diese Schwächen potenziell katastrophale Auswirkungen auf die Sicherheit eines OpenStack-Einsatzes haben und deshalb sollte die Arbeit unternommen werden, um die Wahrscheinlichkeit dieser Mängel bei freigegebenen Projekten zu minimieren. Das OpenStack Security Project behauptet, dass nach dem Abschluss einer Sicherheitsüberprüfung eines Projektes folgendes bekannt und dokumentiert ist:
id: Tujuan tinjauan keamanan di komunitas OpenStack adalah untuk mengidentifikasi kelemahan dalam perancangan atau pelaksanaan proyek OpenStack. Meskipun jarang terjadi, kelemahan ini berpotensi menimbulkan dampak bencana terhadap keamanan penempatan OpenStack, dan oleh karena itu, pekerjaan harus dilakukan untuk meminimalkan kemungkinan cacat pada proyek yang diluncurkan. OpenStack Security Project menegaskan bahwa setelah tinjauan keamanan atas sebuah proyek selesai, berikut ini diketahui dan didokumentasikan:
tr_tr: OpenStack topluluğunda güvenlik incelemesinin amacı, OpenStack projelerinin tasarımında veya uygulamasındaki zayıflıkları tespit etmektir. Nadiren de olsa, bu zayıflıklar bir OpenStack dağıtımının güvenliğinde felaket yaratacak etkilere sahip olabilir ve bu nedenle yayınlanan projelerdeki bu kusurların olasılığını en aza indirgemek için çalışmalar yapılmalıdır. OpenStack Güvenlik Projesi, bir projenin güvenlik incelemesinin tamamlanmasının ardından aşağıdakilerin bilinir ve belgelendirildiğini iddia eder:

source: The importance of encrypting data on behalf of tenants is largely related to the risk assumed by a provider that an attacker could access tenant data. There may be requirements here in government, as well as requirements per-policy, in private contract, or even in case law in regard to private contracts for public cloud providers. It is recommended that a risk assessment and legal consul advised before choosing tenant encryption policies.
de: Die Bedeutung der Verschlüsselung von Daten im Auftrag der Tenant ist weitgehend mit dem Risiko verbunden, das von einem Anbieter angenommen wurde, dass ein Angreifer auf Tenantdaten zugreifen könnte. Es können hier Anforderungen in der Regierung, sowie Anforderungen pro-Politik, im privaten Vertrag oder sogar im Fall von Recht in Bezug auf private Verträge für öffentliche Cloud-Anbieter. Es wird empfohlen, dass eine Risikobewertung und ein Rechtsberater vor der Auswahl der Tenantverschlüsselungsrichtlinien empfohlen wurden.
id: Pentingnya mengenkripsi data atas nama penyewa sebagian besar terkait dengan risiko yang diasumsikan oleh penyedia bahwa penyerang dapat mengakses data penyewa. Mungkin ada persyaratan di sini di pemerintahan, serta persyaratan per-kebijakan, kontrak pribadi, atau bahkan dalam kasus hukum berkaitan dengan kontrak pribadi untuk penyedia awan publik. Dianjurkan agar penilaian risiko dan konsul hukum disarankan sebelum memilih kebijakan enkripsi penyewa.
tr_tr: Kiracı adına veri şifrelemenin önemi, bir sağlayıcı tarafından üstlenilen ve bir saldırganın kiracı verilere erişebileceği riski ile büyük ölçüde ilişkilidir. Burada, hükümette, politikalar başına, özel sözleşmede veya kamu mülk tedarikçileri için özel sözleşmelere ilişkin kanunlarda dahi şartlar gerekebilir. Kiracı şifreleme politikaları seçmeden önce bir risk değerlendirmesi ve yasal konsül önerilir.

source: The information security management system preserves the confidentiality, integrity, and availability of information by applying a risk management process and gives confidence to interested parties that risks are adequately managed.
de: Das Informationssicherheitsmanagementsystem bewahrt die Vertraulichkeit, Integrität und Verfügbarkeit von Informationen durch die Anwendung eines Risikomanagementprozesses und gibt den Interessenten Vertrauen, dass Risiken angemessen verwaltet werden.
id: Sistem manajemen keamanan informasi menjaga kerahasiaan, integritas, dan ketersediaan informasi dengan menerapkan proses manajemen risiko dan memberikan kepercayaan kepada pihak yang berkepentingan bahwa risiko dikelola secara memadai.
tr_tr: Bilgi güvenliği yönetim sistemi, bir risk yönetimi süreci uygulayarak bilgilerin gizliliğini, bütünlüğünü ve erişilebilirliğini korur ve ilgili taraflara risklerin yeterince yönetildiğine güven verir.

source: The information system will receive a security category as defined in Federal Information Processing Standards Publication 199 (FIPS 199). These categories reflect the potential impact of system compromise.
de: Das Informationssystem erhält eine Sicherheitskategorie, wie sie in der Federal Information Processing Standards Publikation 199 (FIPS 199) definiert ist. Diese Kategorien spiegeln die potenziellen Auswirkungen des Systemkompromisses wider.
id: Sistem informasi akan menerima kategori keamanan sebagaimana didefinisikan dalam Federal Information Processing Standards Publication 199 (FIPS 199). Kategori ini mencerminkan potensi dampak kompromi sistem.
tr_tr: Bilgi sistemi Federal Bilgi İşleme Standartları Yayın 199 (FIPS 199) 'da tanımlanan bir güvenlik kategorisi alacaktır. Bu kategoriler, sistemin tehlikelerinin potansiyel etkisini yansıtmaktadır.

source: The initial program loader (IPL) code will most likely be the PXE firmware, assuming the node deployment strategy outlined above. Therefore, the secure boot or boot attestation process can measure all of the early stage boot code, such as BIOS, firmware, the PXE firmware, and the kernel image. Ensuring that each node has the correct versions of these pieces installed provides a solid foundation on which to build the rest of the node software stack.
de: Der erste Programm-Loader (IPL)-Code wird höchstwahrscheinlich die PXE-Firmware sein, vorausgesetzt, dass die Knoten-Implementierungsstrategie oben skizziert ist. Daher kann der sichere Boot- oder Boot-Bescheinigungsprozess alle frühen Start-Boot-Code wie BIOS, Firmware, die PXE-Firmware und das Kernel-Image messen. Sicherstellen, dass jeder Knoten die richtigen Versionen dieser Stücke installiert hat, bietet eine solide Grundlage, auf der der Rest des Knoten-Software-Stacks zu bauen ist.
id: Kode initial program loader (IPL) kemungkinan besar adalah firmware PXE, dengan asumsi strategi penyebaran node yang diuraikan di atas. Oleh karena itu, proses pengesahan booting atau booting yang aman dapat mengukur semua kode boot tahap awal, seperti BIOS, firmware, firmware PXE, dan kernel image. Memastikan bahwa setiap node memiliki versi yang benar dari potongan-potongan ini yang terpasang memberikan fondasi yang kokoh untuk membangun tumpukan perangkat lunak node lainnya.
tr_tr: Yukarıda açıklanan düğüm dağıtım stratejisi varsayılarak, ilk program yükleyici (IPL) kodu büyük olasılıkla PXE yazılımı olacaktır. Bu nedenle, güvenli önyükleme veya önyükleme onaylama işlemi, BIOS, üretici yazılımı, PXE yazılımı ve çekirdek görüntüsü gibi tüm erken aşama önyükleme kodunu ölçebilir. Her bir düğümün, bu parçaların doğru sürümlerini yüklediğinden emin olun, kalan düğüm yazılım yığını oluşturmak için sağlam bir temel oluşturur.

source: The initial work on this book was conducted in an overly air-conditioned room that served as our group office for the entirety of the documentation sprint.
de: Die anfängliche Arbeit an diesem Buch wurde in einem übermäßig klimatisierten Raum durchgeführt, der als Gruppenbüro für die Gesamtheit des Dokumentationssprints diente.
id: Karya awal buku ini dilakukan di ruangan yang terlalu ber-AC yang berfungsi sebagai kantor kelompok kami untuk keseluruhan sprint dokumentasi.
tr_tr: Bu kitaptaki ilk eser, aşırı derecede klimalı bir odada verildi. Bu oda, belgelendirme sprintinin tamamında grup ofisimiz olarak görev yaptı.

source: The interfaces listing captures interfaces within the scope of the review. This includes connections between blocks on the architecture diagram which cross a trust boundary or do not use an industry standard encryption protocol such as TLS or SSH. For each interface the following information is captured:
de: Die Schnittstellenliste erfasst Schnittstellen im Rahmen der Überprüfung. Dazu gehören Verbindungen zwischen Blöcken auf dem Architekturdiagramm, die eine Vertrauensgrenze überschreiten oder kein Industriestandardverschlüsselungsprotokoll wie TLS oder SSH verwenden. Für jede Schnittstelle werden folgende Informationen erfasst:
id: Daftar antarmuka menangkap antarmuka dalam lingkup tinjauan. Ini termasuk koneksi antara blok pada diagram arsitektur yang melintasi batas kepercayaan atau tidak menggunakan protokol enkripsi standar industri seperti TLS atau SSH. Untuk setiap antarmuka informasi berikut diambil:
tr_tr: Arabirimler listesi, inceleme alanı içindeki arayüzleri yakalar. Bu, bir güven sınırını aşan veya TLS veya SSH gibi endüstri standardı şifreleme protokolünü kullanmayan mimari şemasındaki bloklar arasındaki bağlantıları içerir. Her arabirim için aşağıdaki bilgiler toplanır:

source: The key manager of your choice can be used with Openstack if Castellan plugin has been written for that key manager. Once that plugin has been written, it is relatively trivial to use the plugin either directly or behind Barbican.
de: Der Schlüsselverwalter Ihrer Wahl kann mit Openstack verwendet werden, wenn Castellan-Plugin für diesen Schlüsselverwalter geschrieben wurde. Sobald das Plugin geschrieben wurde, ist es relativ trivial, das Plugin entweder direkt oder hinter Barbican zu benutzen.
id: Key manager pilihan Anda dapat digunakan dengan Openstack jika plugin Castellan telah ditulis untuk key manager tersebut. Setelah plugin itu ditulis, relatif sepele untuk menggunakan plugin baik secara langsung maupun di belakang Barbican.

source: The libvirt plug-in for compute may maintain ephemeral storage directly on a filesystem, or in LVM. Filesystem storage generally will not overwrite data when it is removed, although there is a guarantee that dirty extents are not provisioned to users.
de: Das libvirt-Plug-in für compute kann eine kurzlebige Speicherung direkt auf einem Dateisystem oder in LVM aufrechterhalten. Dateispeicherspeicherung wird im Allgemeinen keine Daten überschreiben, wenn es entfernt wird, obwohl es eine Garantie gibt, dass verschmutzte Extents nicht für Benutzer bereitgestellt werden.
id: Plugin libvirt untuk menghitung dapat menyimpan penyimpanan sesaat secara langsung pada filesystem, atau di LVM. Penyimpanan filesystem umumnya tidak akan menimpa data saat dilepas, meski ada jaminan bahwa luapan limbah (dirty extent) tidak tersedia bagi pengguna.
tr_tr: Hesaplama için libvirt eklentisi, doğrudan bir dosya sisteminde veya LVM'de geçici saklama kapasitesini koruyabilir. Kirli kapsamların kullanıcılara sağlanmadığına dair bir garanti olmasına rağmen, dosya sistemi depolama genellikle kaldırıldığında verilerin üzerine yazmaz.

source: The management of the security critical parameters of the system is performed by administrative users. A set of commands that require root privileges (or specific roles when RBAC is used) are used for system management. Security parameters are stored in specific files that are protected by the access control mechanisms of the system against unauthorized access by users that are not administrative users.
de: Die Verwaltung der sicherheitskritischen Parameter des Systems erfolgt durch administrative Benutzer. Ein Satz von Befehlen, die Root-Berechtigungen erfordern (oder bestimmte Rollen, wenn RBAC verwendet wird) werden für die Systemverwaltung verwendet. Sicherheitsparameter werden in bestimmten Dateien gespeichert, die durch die Zugriffssteuerungsmechanismen des Systems gegen unbefugten Zugriff durch Benutzer geschützt sind, die keine Administratorbenutzer sind.
id: Pengelolaan parameter kritis keamanan sistem dilakukan oleh pengguna administratif. Satu set perintah yang memerlukan hak istimewa root (atau peran spesifik saat RBAC digunakan) digunakan untuk pengelolaan sistem. Parameter keamanan disimpan dalam file tertentu yang dilindungi oleh mekanisme kontrol akses dari sistem terhadap akses yang tidak sah oleh pengguna yang bukan pengguna administratif.
tr_tr: Sistemin güvenlik kritik parametrelerinin yönetimi idari kullanıcılar tarafından gerçekleştirilir. Sistem yönetimi için kök ayrıcalıkları (veya RBAC kullanıldığında belirli roller) gerektiren bir dizi komut kullanılır. Güvenlik parametreleri, sistemin erişim kontrol mekanizmaları tarafından, yönetimsel kullanıcılar olmayan kullanıcılar tarafından yetkisiz erişime karşı korunan belirli dosyalarda saklanır.

source: The management security domain is where services interact. Sometimes referred to as the "control plane", the networks in this domain transport confidential data such as configuration parameters, user names, and passwords. Command and Control traffic typically resides in this domain, which necessitates strong integrity requirements. Access to this domain should be highly restricted and monitored. At the same time, this domain should still employ all of the security best practices described in this guide.
de: Die Verwaltungssicherheitsdomäne ist, wo Dienste interagieren. Manchmal auch als "control plane" bezeichnet, transportieren die Netzwerke in diesem Bereich vertrauliche Daten wie Konfigurationsparameter, Benutzernamen und Passwörter. Command- und Control-Traffic befindet sich in dieser Domain, was eine starke Integritätsanforderung erfordert. Der Zugriff auf diese Domain sollte stark eingeschränkt und überwacht werden. Gleichzeitig sollte diese Domain immer noch alle in dieser Anleitung beschriebenen Sicherheitsbestimmungen verwenden.
id: Domain keamanan manajemen adalah tempat layanan berinteraksi. Terkadang disebut sebagai "control plane", jaringan dalam domain ini mengangkut data rahasia seperti parameter konfigurasi, nama pengguna, dan kata sandi. Lalu lintas Command and Control biasanya berada di domain ini, yang memerlukan persyaratan integritas yang kuat. Akses ke domain ini harus sangat dibatasi dan dipantau. Pada saat yang sama, domain ini harus tetap menerapkan semua praktik terbaik keamanan yang dijelaskan dalam panduan ini.
tr_tr: Yönetim güvenlik etki alanı, servislerin etkileşimde bulunduğu yerdir. Bazen "kontrol düzlemi" olarak anılan ağlar, bu alandaki yapılandırma parametreleri, kullanıcı adları ve parolalar gibi gizli verileri taşır. Komuta ve Kontrol trafiği genellikle bu alandadır ve bu da güçlü bütünlük gerekliliklerini gerektirir. Bu alana erişim son derece kısıtlanmış ve izlenmelidir. Aynı zamanda, bu alan adı bu kılavuzda açıklanan tüm güvenlik en iyi yöntemlerini kullanmaya devam etmelidir.

source: The manila configuration file ``manila.conf`` may be placed anywhere. The path ``/etc/manila/manila.conf`` is expected by default.
de: Die Manila-Konfigurationsdatei ``manila.conf``kann überall platziert werden. Der Pfad ``/etc/manila/manila.conf``wird standardmäßig erwartet.
id: File konfigurasi manila ``manila.conf`` dapat ditempatkan dimana saja. Path ``/etc/manila/manila.conf`` diharapkan secara default.
tr_tr: Manila yapılandırma dosyası ``manila.conf`` herhangi bir yerde olabilir. ``/etc/manila/manila.conf`` öntanımlı yoldur.
