Repository: openstack/security-doc
Catalog: security-guide/source/locale/*/LC_MESSAGES/security-guide.po
Languages: de, id, tr_tr

source: Operators protect sensitive information in cloud deployments by using various applications of cryptography. For example, encrypting data at rest or signing an image to prove that it has not been tampered with. In all cases, these cryptographic capabilities require some sort of *key material* in order to operate.
de: Operatoren schützen sensitive Informationen in Cloud-Bereitstellungen durch Benutzung verschiedener Kryptographie-Applikationen. Zum Beispiel, verschlüsselte Daten in Ruhezustand oder ein signiertes Abbild, dass nicht manipuliert wurde. In allen Fällen brauchen diese kryptographischen Werte *Schlüsselinformationen*, um ihren Dienst ausüben zu können.
id: Operator melindungi informasi sensitif dalam penyebaran awan dengan menggunakan berbagai aplikasi kriptografi. Misalnya, mengenkripsi data saat istirahat atau menandatangani gambar untuk membuktikan bahwa foto itu tidak dirusak. Dalam semua kasus, kemampuan kriptografi ini memerlukan semacam *key material* agar bisa beroperasi.

source: Opportunities to encrypt data for users are present:
de: Möglichkeiten zur Verschlüsselung von Daten für Benutzer sind vorhanden:
id: Kesempatan mengenkripsi data untuk pengguna sekarang:
tr_tr: Kullanıcılar için verileri şifrelemek için fırsatlar mevcuttur:

source: Option ROM configuration and data
de: Option ROM-Konfiguration und Daten
id: Pilihan konfigurasi dan data ROM
tr_tr: Seçenek ROM yaplandırma ve veri

source: Optionally, if using SASL with Qpid specify the SASL mechanisms in use by adding:
de: Optional können Sie bei Verwendung von SASL mit Qpid die verwendeten SASL-Mechanismen angeben, indem Sie Folgendes hinzufügen:
id: Opsional, jika menggunakan SASL dengan Qpid tentukan mekanisme SASL yang digunakan dengan menambahkan:
tr_tr: İsteğe bağlı olarak, Qpid ile SASL kullanılıyorsa, kullanımdaki SASL mekanizmalarını aşağıdakileri ekleyerek belirtin:

source: Optionally, if you wish to restrict the set of SSL ciphers used for the encrypted connection. See `ciphers <https://www.openssl.org/docs/manmaster/man1/ciphers.html>`_ for a list of ciphers and the syntax for specifying the cipher string:
de: Optional, wenn Sie die Menge der SSL-Cipher, die für die verschlüsselte Verbindung verwendet werden, einschränken möchten. Siehe `Cipher <https://www.openssl.org/docs/manmaster/man1/ciphers.html>`_ für eine Liste der Cipher und die Syntax für die Angabe der Chiffrierzeichenfolge:
id: Opsional, jika Anda ingin membatasi sekumpulan ciphers SSL yang digunakan untuk koneksi terenkripsi. Lihat `ciphers <https://www.openssl.org/docs/manmaster/man1/ciphers.html>`_ untuk daftar ciphers dan sintaks untuk menentukan string cipher:
tr_tr: İsteğe bağlı olarak, şifreli bağlantı için kullanılan SSL şifrelemeleri kümesini kısıtlamak isterseniz. Şifrelere ilişkin bir liste ve şifre dizesini belirten sözdizimi için `şifreler <https://www.openssl.org/docs/manmaster/man1/ciphers.html>`_ 'a bakınız:

source: Orchestration
de: Orchestrierung
tr_tr: Orkestrasyon

source: Organization name
de: Name der Organisation
id: Nama Organisasi
tr_tr: Organizasyon adı

source: Organizations may desire to implement external authentication for compatibility with existing authentication services or to enforce stronger authentication policy requirements. Although passwords are the most common form of authentication, they can be compromised through numerous methods, including keystroke logging and password compromise. External authentication services can provide alternative forms of authentication that minimize the risk from weak passwords.
de: Organisationen können eine externe Authentifizierung für die Kompatibilität mit vorhandenen Authentifizierungsdiensten implementieren oder um strengere Anforderungen an die Authentifizierungsrichtlinie zu erzwingen. Obwohl Passwörter die häufigste Form der Authentifizierung sind, können sie durch zahlreiche Methoden, einschließlich Keystroke Logging und Passwort Kompromiss kompromittiert werden. Externe Authentifizierungsdienste können alternative Authentifizierungsformen bereitstellen, die das Risiko von schwachen Passwörtern minimieren.
id: Organisasi mungkin ingin menerapkan otentikasi eksternal untuk kompatibilitas dengan layanan autentikasi yang ada atau untuk menerapkan persyaratan kebijakan otentikasi yang lebih kuat. Meskipun password adalah bentuk otentikasi yang paling umum, namun dapat dikompromikan melalui banyak metode, termasuk logging keystroke dan kompromi kata sandi. Layanan otentikasi eksternal dapat memberikan bentuk otentikasi alternatif yang meminimalkan risiko dari lemahnya kata kunci.
tr_tr: Organizasyonlar, varolan kimlik doğrulama servislerine uyumluluk için harici kimlik doğrulama uygulamak veya daha güçlü bir kimlik doğrulama ilkesi zorunluluğu uygulamak isteyebilir. Şifreleme, kimlik doğrulamasının en yaygın biçimi olmasına rağmen, tuş günlüğü ve parola kaptırma da dahil olmak üzere çok sayıda yöntemle ele geçirilebilirler. Dış kimlik doğrulama servisleri, zayıf parolalardan kaynaklanan riski en aza indiren alternatif kimlik doğrulama biçimleri sağlayabilir.

source: Other events that are actionable are networking bridges going down, ip tables being flushed on compute nodes and consequential loss of access to instances resulting in unhappy customers.
de: Andere Ereignisse, die umsetzbar sind, sind Netzwerk-Brücken, die nach unten gehen, IP-Tabellen, die auf Compute-Knoten gelöscht werden, und folglicher Verlust des Zugriffs auf Instanzen, die zu unglücklichen Kunden führen.
id: Event lain yang dapat ditindaklanjuti adalah jaringan jembatan yang mati, tabel ip disiram (flushed) pada node perhitungan dan hilangnya akses terhadap instance yang mengakibatkan pelanggan yang tidak bahagia.
tr_tr: Olabilecek diğer olaylar, ağ köprüleri, hesaplama düğümlerinde boşaltılan ip tabloları ve dolayısıyla memnuniyetsiz müşterilere neden olan örneklere erişim kaybıdır.

source: Other notable items
de: Andere bemerkenswerte Artikel
id: Barang penting lainnya
tr_tr: Diğer önemli ögeler

source: Other solutions exist including KeyWhiz, Confidant, Conjur, EJSON, Knox and Red October, however it is outside the scope of this document to cover every Key Manager available.
de: Andere Lösungen existieren, einschließlich KeyWhiz, Confidant, Conjur, EJSON, Knox und Red October, jedoch ist es nicht in den Anwendungsbereich dieses Dokuments, jeden verfügbaren Schlüsselmanager abzudecken.
id: Solusi lain ada termasuk KeyWhiz, Confidant, Conjur, EJSON, Knox dan Red October, namun berada di luar cakupan dokumen ini untuk mencakup setiap Key Manager yang ada.

source: Other supporting technology
de: Andere unterstützende Technologie
id: Teknologi pendukung lainnya
tr_tr: Diğer destekleyici teknoloji

source: Others (KVM, and more):
de: Andere (KVM und mehr):
id: Lainnya (KVM, dan lainnya):
tr_tr: Diğerleri (KVM ve dahası):

source: Out of band management interfaces also often include graphical machine console access. It is often possible, although not necessarily default, that these interfaces are encrypted. Consult with your system software documentation for encrypting these interfaces.
de: Out-of-Band-Management-Schnittstellen auch oft grafische Maschinenkonsolenzugriff. Es ist oft möglich, wenn auch nicht unbedingt standardmäßig, dass diese Schnittstellen verschlüsselt sind. Wenden Sie sich an Ihre Systemsoftware-Dokumentation zur Verschlüsselung dieser Schnittstellen.
id: Antarmuka manajemen Out of band juga sering menyertakan akses konsol mesin grafis. Hal ini sering mungkin, meski belum tentu default, bahwa interface ini dienkripsi. Konsultasikan dengan dokumentasi perangkat lunak sistem Anda untuk mengenkripsi antarmuka ini.
tr_tr: Bant dışı yönetim arabirimleri ayrıca genellikle grafik makine konsolu erişimi içerir. Varsayılan olmamasına rağmen, bu arabirimlerin şifrelendiği sıklıkla mümkündür. Bu arabirimleri şifrelemek için sistem yazılım belgelerinize başvurun.

source: Out-of-band management interface
de: Out-of-Band-Management-Schnittstelle
id: Antarmuka manajemen out-of-band
tr_tr: Bant dışı yönetim arayüzü

source: Out-of-band management interfaces, such as IPMI
de: Out-of-Band-Management-Schnittstellen wie IPMI
id: Antarmuka manajemen out-of-band, seperti IPMI
tr_tr: IPMI gibi bant dışı yönetim arabirimleri

source: Outbound attacks and reputational risk
de: Outbound-Angriffe und Reputationsrisiken
id: Serangan outbound dan risiko reputasi
tr_tr: Dışarı giden saldırılar ve itibar riski

source: Overlapping IP addresses
de: Überlappende IP-Adressen
id: Alamat IP yang tumpang tindih
tr_tr: Örtüşen IP adresleri

source: Overview
de: Übersicht
id: Ikhtisar

source: PCI-SIG I/O virtualization
de: PCI-SIG I/O-Virtualisierung
id: Virtualisasi PCI-SIG I/O
tr_tr: PCI-SIG G/Ç sanallaştırması

source: PCR-10 to PCR-23
de: PCR-10 bis PCR-23
tr_tr: PCR-10'dan PCR-23'a

source: PKI and PKIZ tokens
de: PKI und PKIZ Token
tr_tr: PKI ve PKIZ belirteçleri

source: PKI and PKIZ tokens are deprecated and not supported in Ocata. They are nearly identical and share the same payload. They are signed documents that contain the authentication content, as well as the service catalog. Depending on the size of the OpenStack deployment, PKI tokens can be very long. PKI and PKIZ tokens typically exceed 1600 bytes length. The length of a PKI or PKIZ token is dependent on the size of the deployment. Bigger service catalogs will result in longer token lengths. The Identity service uses public and private key pairs and certificates in order to create and validate these tokens. The difference between the two is PKIZ tokens are compressed to help mitigate the size issues of PKI.
de: PKI- und PKIZ-Token werden in Ocata abgelehnt und nicht unterstützt. Sie sind fast identisch und teilen sich die gleiche Nutzlast. Sie sind signierte Dokumente, die den Authentifizierungsinhalt enthalten, sowie den Servicekatalog. Abhängig von der Größe der OpenStack-Bereitstellung können PKI-Token sehr lang sein. PKI- und PKIZ-Token übersteigen typischerweise 1600 Bytes Länge. Die Länge eines PKI- oder PKIZ-Tokens hängt von der Größe des Einsatzes ab. Größere Servicekataloge führen zu längeren Tokenlängen. Der Identitätsdienst verwendet öffentliche und private Schlüsselpaare und Zertifikate, um diese Token zu erstellen und zu validieren. Der Unterschied zwischen den beiden ist, dass PKIZ-Token komprimiert werden, um die Größenprobleme von PKI zu mildern.
tr_tr: PKI ve PKIZ belirteçleri kullanımdan kaldırılmıştır ve Oacata'da desteklenmemektedir. Neredeyse aynıdırlar ve aynı yükü paylaşıyorlar. Kimlik doğrulama içeriğini ve servis kataloğunu içeren imzalanmış belgelerdir. OpenStack dağıtımının boyutuna bağlı olarak PKI belirteçleri çok uzun olabilir. PKI ve PKIZ belirteçleri genellikle 1600 bayt uzunluğunu aşıyor. PKI veya PKIZ belirtecinin uzunluğu, dağıtımın boyutuna bağlıdır. Daha büyük hizmet katalogları, daha uzun belirteç uzunluklarıyla sonuçlanır. Kimlik servisi, bu belirteçleri oluşturmak ve doğrulamak için ortak ve özel anahtar çiftlerini ve sertifikaları kullanır. İkisi arasındaki fark, PKI boyutundaki sorunları hafifletmek için sıkıştırılan PKIZ belirteçleri.

source: PKI builds the framework on which to provide encryption algorithms, cipher modes, and protocols for securing data and authentication. We strongly recommend securing all services with Public Key Infrastructure (PKI), including the use of TLS for API endpoints. It is impossible for the encryption or signing of transports or messages alone to solve all these problems. Hosts themselves must be secure and implement policy, namespaces, and other controls to protect their private credentials and keys. However, the challenges of key management and protection do not reduce the necessity of these controls, or lessen their importance.
de: PKI baut das Framework auf, auf dem Verschlüsselungsalgorithmen, Chiffriermodi und Protokolle zur Sicherung von Daten und Authentifizierung bereitgestellt werden können. Wir empfehlen dringend, alle Dienste mit Public Key Infrastructure (PKI) zu sichern, einschließlich der Verwendung von TLS für API Endpunkte. Es ist unmöglich für die Verschlüsselung oder Signierung von Transporten oder Nachrichten allein, um alle diese Probleme zu lösen. Hosts selbst müssen sicher sein und implementieren Policy, Namespaces und andere Steuerelemente, um ihre privaten Anmeldeinformationen und Schlüssel zu schützen. Allerdings reduzieren die Herausforderungen der Schlüsselverwaltung und des Schutzes nicht die Notwendigkeit dieser Kontrollen oder verringern ihre Bedeutung.
id: PKI membangun kerangka kerja untuk menyediakan algoritma enkripsi, mode cipher, dan protokol untuk mengamankan data dan otentikasi. Kami sangat menyarankan untuk mengamankan semua layanan dengan Public Key Infrastructure (PKI), termasuk penggunaan TLS untuk API endpoint. Tidak mungkin untuk enkripsi atau penandatanganan transport atau pesan saja untuk menyelesaikan semua masalah ini. Host sendiri harus aman dan menerapkan kebijakan, ruang nama, dan kontrol lainnya untuk melindungi kredensial dan kunci pribadi mereka. Namun, tantangan pengelolaan dan perlindungan utama tidak mengurangi perlunya pengendalian ini, atau mengurangi kepentingan mereka.
tr_tr: PKI, veri ve kimlik doğrulamayı güvence altına almak için şifreleme algoritmaları, şifre modları ve protokoller sunacak çatıyı oluşturur. API uç noktaları için TLS kullanımı da dahil olmak üzere, tüm hizmetleri Genel Anahtar Altyapısı (PKI) ile sağlamanız önerilir. Tüm bu sorunları çözmek için tek başına nakliye veya mesajların şifrelenmesi veya imzalanması imkansızdır. Ev sahiplerinin kendileri güvende olmalı ve özel kimlik bilgilerini ve anahtarlarını korumak için ilke, ad alanları ve diğer denetimleri uyguluyor olmalıdır. Bununla birlikte, anahtar yönetim ve koruma zorlukları, bu kontrollerin gerekliliğini azaltmaz veya önemini azaltmaz.

source: PRIVATE(data network)
de: PRIVATE (Datennetzwerk)
tr_tr: PRIVATE(veri ağı)

source: Password management applications such as `KeePassX <http://www.keepassx.org>`_ and `Password Safe <http://www.pwsafe.org>`_ can be useful as most support the generation of strong passwords and periodic reminders to generate new passwords. Most importantly, the password store remains unlocked only briefly, which reduces the risk of password exposure and unauthorized resource access through browser or system compromise.
de: Passwort-Management-Anwendungen wie `KeePassX <http://www.keepassx.org>``und `Password Safe <http://www.pwsafe.org>`_ können nützlich sein, da die meisten Unterstützung die Erzeugung von starken Passwörtern und periodischen Erinnerungen, um neue Passwörter zu generieren. Am wichtigsten ist, dass der Passwort-Shop nur kurzzeitig freigeschaltet bleibt, was das Risiko von Passwort-Exposition und unberechtigtem Ressourcen-Zugriff durch Browser oder System-Kompromiss reduziert.
id: Aplikasi manajemen password seperti `KeePassX <http://www.keepassx.org>` _ dan `Password Safe <http://www.pwsafe.org>` _ dapat berguna karena sebagian besar mendukung pembuatan kata kunci yang kuat dan berkala. Pengingat untuk menghasilkan password baru. Yang terpenting, penyimpanan kata sandi tetap tidak terkunci hanya sebentar, yang mengurangi risiko pembongkaran kata sandi dan akses sumber yang tidak sah melalui browser atau membahayakan (compromise) sistem.
tr_tr: `KeePassX <http://www.keepassx.org>`_ ve `Password Safe <http://www.pwsafe.org>` gibi parola yönetimi uygulamaları, güçlü parolaların üretilmesini ve periyodik olarak yeni parolalar üretmeleri için hatırlatmalar yaptığı için yararlı olabilir. En önemlisi, parola deposunun kilidi yalnızca kısa bir süre kalır; bu, parolaların açığa çıkma riskini ve tarayıcı veya sistem açığı yoluyla yetkisiz kaynak erişimi riskini azaltır.

source: Password management should be an integral part of your cloud administration plan. A definitive tutorial about passwords is beyond the scope of this book; however, cloud administrators should refer to the best practices recommended in Chapter 4 of NIST Special Publication `Guide to Enterprise Password Management <http://csrc.nist.gov/publications/drafts/800-118/draft-sp800-118.pdf>`_.
de: Das Passwort-Management sollte ein integraler Bestandteil Ihres Cloud-Administrations-Plans sein. Ein definitives Tutorial über Passwörter geht über den Rahmen dieses Buches hinaus; Cloud-Administratoren sollten sich jedoch auf die bewährten Praktiken beziehen, die in Kapitel 4 von NIST Special Publication `Guide to Enterprise Password Management empfohlen werden <http://csrc.nist.gov/publications/drafts/800-118/draft-sp800-118.pdf>`_.
id: Manajemen kata sandi harus menjadi bagian integral dari rencana administrasi awan Anda. Tutorial definitif tentang kata sandi berada di luar cakupan buku ini; Namun, administrator awan harus mengacu pada praktik terbaik yang direkomendasikan di Chapter 4 of NIST Special Publication `Guide to Enterprise Password Management <http://csrc.nist.gov/publications/drafts/800-118/draft-sp800-118.pdf > `_.
tr_tr: Parola yönetimi, bulut yönetim planınızın ayrılmaz bir parçası olmalıdır. Parolalar hakkında kesin bir eğitim, bu kitabın kapsamı dışındadır; Ancak, bulut yöneticileri, NIST Özel Yayın `Kurumsal Parola Yönetimi Rehberi'nde <http://csrc.nist.gov/publications/drafts/800-118/draft-sp800-118.pdf>`_ Bölüm 4'te önerilen en iyi uygulamalara dikkat etmelidir.

source: Password policy enforcement
de: Kennwortrichtlinienerzwingung
id: Penegakan kebijakan password
tr_tr: Parola politikası zorlama

source: Passwords
de: Passwörter
id: Password (kata sandi)
tr_tr: Parolalar

source: Passwords in Config Files
de: Passwörter in Konfigurationsdateien
id: Password di File Config

source: Paste and middleware
de: Paste und Middleware
id: Tempel dan middleware
tr_tr: Paste ve ara katman

source: Per-instance or per-object encryption is preferable over, in descending order, per-project, per-tenant, per-host, and per-cloud aggregations. This recommendation is inverse to the complexity and difficulty of implementation. Presently, in some projects it is difficult or impossible to implement encryption as loosely granular as even per-tenant. We recommend implementors make a best-effort in encrypting tenant data.
de: Per-Instanz- oder Per-Objekt-Verschlüsselung ist über, in absteigender Reihenfolge, pro Projekt, per-tenant, per-host und per-Cloud-Aggregationen. Diese Empfehlung ist umgekehrt auf die Komplexität und Schwierigkeit der Umsetzung. Gegenwärtig ist es bei einigen Projekten schwierig oder unmöglich, die Verschlüsselung so granular wie sogar per-tenant zu implementieren. Wir empfehlen, dass die Implementierer bei der Verschlüsselung von Tenantdaten Bestmöglichstes tun.
id: Enkripsi per-instance atau per-object lebih disukai, dalam urutan menurun, agregat per-project, per-tenant, per-host, dan per-cloud. Rekomendasi ini bertentangan dengan kompleksitas dan kesulitan pelaksanaannya. Saat ini, dalam beberapa proyek sulit atau tidak mungkin menerapkan enkripsi seperti granulasi longgar bahkan per-tenant. Sebaiknya pelaksana melakukan upaya terbaik dalam mengenkripsi data penyewa.
tr_tr: Örnek başına veya nesne başına şifreleme, azalan düzende, proje başına, kiracı başına, sunucu başına ve bulut başına toplamaya göre tercih edilir. Bu öneri, uygulanmanın karmaşıklığına ve zorluğuna aykırıdır. Günümüzde bazı projelerde, şifrelemeyi, kiracı başına kadar ayrıntılı olarak uygulamak zor ya da imkânsızdır. Uygulayıcıların, kiracı verilerini şifrelemek için ellerinden geleni yapmalarını öneririz.

source: Performing Federation authentication
de: Durchführen der Föderationsauthentifizierung
tr_tr: Federasyon kimlik doğrulamasını gerçekleştirme

source: Periodic access and log reviews are required to ensure authentication, authorization, and accountability in a service deployment. Specific guidance for OpenStack on these topics are discussed in-depth in :ref:`monitoring-and-logging`.
de: Periodische Zugriffs- und Protokollüberprüfungen sind erforderlich, um Authentifizierung, Autorisierung und Rechenschaftspflicht in einer Dienstbereitstellung zu gewährleisten. Spezielle Anleitungen für OpenStack zu diesen Themen werden ausführlich diskutiert in :ref:`monitoring-and-logging`.
id: Akses berkala dan tinjauan log diperlukan untuk memastikan otentikasi, otorisasi, dan akuntabilitas dalam penyebaran layanan. Petunjuk khusus untuk OpenStack mengenai topik ini dibahas secara mendalam di :ref:`monitoring-and-logging`.
tr_tr: Bir servisdağıtımında kimlik doğrulama, yetkilendirme ve hesap verebilirlik sağlamak için periyodik erişim ve günlük incelemeleri gereklidir. Bu konularda OpenStack için özel rehberlik ayrıntılı olarak ele alınmaktadır :ref:`monitoring-and-logging`.

source: Permissions for API calls for different users and their roles are determined by :ref:`policies <shared_fs_policies>` like in other OpenStack services.
de: Berechtigungen für API-Aufrufe für verschiedene Benutzer und ihre Rollen werden bestimmt durch:ref:`policy <shared_fs_policies>`wie in anderen OpenStack-Diensten.
id: Izin untuk panggilan API untuk pengguna yang berbeda dan peran mereka ditentukan oleh :ref:`policies <shared_fs_policies>` seperti di layanan OpenStack lainnya.
tr_tr: Farklı kullanıcılar ve rolleri için API çağrıları için izinler, diğer OpenStack servislerinde olduğu gibi :ref:`policies <shared_fs_policies>` tarafından belirlenir.

source: Phases of an audit
de: Phasen eines Audits
id: Tahapan audit
tr_tr: Bir denetlemenin aşamaları

source: Physical hardware (PCI passthrough)
de: Physikalische Hardware (PCI Passthrough)
id: Perangkat keras fisik (passthrough PCI)
tr_tr: Fiziksel donanım (PCI ile)

source: Places values on the stack and verifies their presence to help prevent buffer overflow attacks.
de: Platziert Werte auf dem Stapel und überprüft ihre Anwesenheit, um Pufferüberlaufangriffe zu verhindern.
id: Tempatkan nilai pada stack dan verifikasi keberadaan mereka untuk membantu mencegah serangan buffer overflow.
tr_tr: Arabellek taşması saldırılarını önlemeye yardımcı olması için değerleri yığına yerleştirir ve varlığını doğrular.

source: Platform specific
de: Plattformspezifisch
tr_tr: Platforma özgü

source: Platform specific, often Initramfs
de: Plattformspezifisch, oft Initramfs
tr_tr: Platforma özgü, genellikle Initramfs

source: Platform specific, often kernel, kernel extensions, and drivers
de: Plattformspezifische, oft Kernel-, Kernel-Erweiterungen und Treiber
id: Platform specific, often kernel, kernel extensions, dan drivers
tr_tr: Platforma özgü, genellikle çekirdek, çekirdek uzantıları ve sürücüler

source: Plug-ins other than Open vSwitch may also include similar mitigation measures; it is recommended you enable this feature, where appropriate.
de: Plug-Ins außer Open vSwitch können auch ähnliche Maßnahmen zur Schadensbegrenzung enthalten. Es empfiehlt sich, diese Funktion gegebenenfalls zu aktivieren.
id: Plug-in selain Open vSwitch mungkin juga mencakup langkah-langkah mitigasi yang serupa; Sebaiknya aktifkan fitur ini, bila sesuai.
tr_tr: Açık vSwitch dışındaki eklentiler de benzer azaltma önlemlerini içerebilir; uygunsa, bu özelliği etkinleştirmeniz önerilir.

source: Policies
de: Richtlinien
id: Kebijakan
tr_tr: İlkeler

source: Policy changes
de: Richtlinienänderungen
id: Perubahan kebijakan
tr_tr: İlke değişiklikleri
