Repository: openstack/security-doc
Catalog: security-guide/source/locale/*/LC_MESSAGES/security-guide.po
Languages: de, id, tr_tr

source: An OpenStack deployment will likely need to demonstrate compliance with an organization's Privacy Policy, with the U.S.-E.U. Safe Harbor framework, the ISO/IEC 29100:2011 privacy framework or with other privacy-specific guidelines. In the U.S. the AICPA has `defined 10 privacy areas of focus <http://www.aicpa.org/interestareas/informationtechnology/resources/privacy/generallyacceptedprivacyprinciples/>`_, OpenStack deployments within a commercial environment may desire to attest to some or all of these principles.
de: Eine OpenStack-Bereitstellung muss voraussichtlich die Einhaltung der Datenschutzbestimmungen eines Unternehmens mit dem US-EU-Safe-Harbor-Framework, dem ISO/IEC 29100: 2011-Datenschutz-Framework oder mit anderen Datenschutzrichtlinien erklären. In den USA hat die AICPA `defined 10 privacy areas of focus <http://www.aicpa.org/interestareas/informationtechnology/resources/privacy/generallyacceptedprivacyprinciples/> ` Bestand und OpenStack-Bereitstellungen innerhalb einer kommerziellen Umgebung können auf einige oder alle diese Prinzipien zu zurückgreifen.
id: Penyebaran OpenStack kemungkinan akan perlu menunjukkan kepatuhan terhadap Privacy Policy organisasi, dengan A.S.-E.U. Kerangka kerja Safe Harbor, kerangka privasi ISO/IEC 29100: 2011 atau dengan pedoman khusus privasi lainnya. Di A.S., AICPA memiliki `defined 10 privacy areas of focus <http://www.aicpa.org/interestareas/informationtechnology/resources/privacy/generallyacceptedprivacyprinciples/>`_, Penyebaran OpenStack dalam lingkungan komersial mungkin ingin membuktikan beberapa atau semua prinsip ini.
tr_tr: Bir OpenStack dağıtımının büyük olasılıkla bir organizasyonun Gizlilik Politikası ile olan uyumluluğunu ABD-E.U. Safe Harbor çerçevesi, ISO/IEC 29100:2011 gizlilik çerçevesi veya diğer gizlilik özel talimatları ile sunması gerekir. ABD'de AICPA, `odaklanmanın 10 gizlilik alanını <http://www.aicpa.org/interestareas/informationtechnology/resources/privacy/generallyacceptedprivacyprinciples/>`_ tanımladı. Ticari bir ortamdaki OpenStack dağıtımları, bunlardan bazılarını veya tümünü doğrulamak isteyebilir.

source: An administrator and users as share owners can manage the :ref:`access to the shares <shared_fs_share_acl>` by creating access rules with authentication though an IP address, user, group, or TLS certificates. Authentication methods depend on which share driver and security service you configure and use.
de: Ein Administrator und Benutzer als Freigabebesitzer können die :ref:`Zugriff auf die Freigabe verwalten <shared_fs_share_acl>`durch die Erstellung von Zugriffsregeln mit Authentifizierung durch eine IP-Adresse, Benutzer-, Gruppen- oder TLS-Zertifikate. Authentifizierungsmethoden hängen davon ab, welchen Share-Treiber und Sicherheitsdienst Sie konfigurieren und verwenden.
id: Administrator dan pengguna sebagai pemilik share dapat mengelola :ref:`access to the shares <shared_fs_share_acl>` dengan membuat aturan akses dengan otentikasi meskipun sertifikat alamat IP, pengguna, grup, atau TLS. Metode otentikasi bergantung pada share driver dan layanan keamanan yang Anda konfigurasikan dan gunakan.
tr_tr: Bir yönetici ve paylaşım sahipleri olarak kullanıcılar, bir IP adresi, kullanıcı, grup veya TLS sertifikaları üzerinden kimlik doğrulama ile erişim kuralları oluşturarak :ref:`paylaşımlara erişimi <shared_fs_share_acl>` yönetebilir. Kimlik doğrulama yöntemleri, hangi paylaşım sürücüsüne ve yapılandırdığınız ve kullandığınız güvenlik servisine bağlıdır.

source: An administrator can create and delete share types, and also manage extra specifications that give them meaning inside the Shared File Systems service. Tenants can list the share types and can use them to create new shares. For details of managing the share types, see `Shared File Systems API <https://developer.openstack.org/api-ref-share-v2.html#share-type>`_ and `Share types managing <https://docs.openstack.org/admin-guide/shared_file_systems_share_types.html>`_ documentation.
de: Ein Administrator kann Freigabetypen erstellen und löschen sowie zusätzliche Spezifikationen verwalten, die ihnen in dem Shared File Systems Service entsprechen. Die Tenant können die Anteilstypen auflisten und sie zur Erstellung neuer Freigaben verwenden. Weitere Informationen zum Verwalten der Freigabetypen finden Sie unter APD der Shared File Systems <https://developer.openstack.org/api-ref-share-v2.html#share-type>`_ und` Freigabearten verwalten <https://docs.openstack.org/admin-guide/shared_file_systems_share_types.html>`_ dokumentation

source: An administrator rather than a share driver manages the bare metal storage with some net interface insteadof the presence of the share servers.
de: Ein Administrator verwaltet anstelle eines Share-Treibers den Bare-Metal-Speicher mit einer net-Schnittstelle statt der Anwesenheit der Share-Server.
id: Administrator bukannya share driver mengelola penyimpanan bare metal dengan beberapa net interface bukannya keberadaan share server.
tr_tr: Paylaşım sürücüsü yerine yönetici, düz depolama paylaşım sunucuları yerine bazı net arayüzlerle yönetir.

source: An agreed set of findings and/or defects
de: Ein vereinbarter Satz von Erkenntnissen und/oder Mängeln
id: Kumpulan temuan dan/atau cacat yang disepakati
tr_tr: Birlikte anlaşılan bulgu ve/veya kusur seti

source: An audit has four distinct phases, though most stakeholders and control owners will only participate in one or two. The four phases are Planning, Fieldwork, Reporting and Wrap-up. Each of these phases is discussed below.
de: Ein Audit hat vier verschiedene Phasen, obwohl die meisten Stakeholder und Kontrollbesitzer nur an einem oder zwei teilnehmen werden. Die vier Phasen sind Planung, Feldarbeit, Reporting und Nachbearbeitung. Jede dieser Phasen wird nachfolgend diskutiert.
id: Audit memiliki empat tahap yang berbeda, walaupun sebagian besar pemangku kepentingan dan pemilik kontrol hanya akan berpartisipasi dalam satu atau dua. Keempat tahapan tersebut adalah Planning, Fieldwork, Reporting and Wrap-up. Masing-masing tahap ini dibahas di bawah ini.
tr_tr: Bir denetimin dört farklı aşaması vardır, ancak çoğu taraf ve kontrol sahibi yalnızca tek veya iki olarak katılacaktır. Dört evre, Planlama, Saha Çalışması, Raporlama ve Özetleme'dir. Bu aşamaların her biri aşağıda tartışılmıştır.

source: An authoritative list of software components may be critical when assessing the impact of a compromise or vulnerability in a library, application or class of software.
de: Eine maßgebliche Liste von Softwarekomponenten kann bei der Bewertung der Auswirkungen eines Kompromisses oder einer Anfälligkeit in einer Bibliothek, Anwendung oder Klasse von Software kritisch sein.
id: Daftar komponen perangkat lunak yang otoritatif mungkin penting saat menilai dampak kompromi atau kerentanan di perpustakaan, aplikasi atau kelas perangkat lunak.
tr_tr: Yazılım bileşenlerinin yetkili bir listesi, bir kütüphanede, uygulamada veya yazılım sınıfında bir ödün veya güvenlik açığı etkisini değerlendirirken kritik olabilir.

source: An encrypted tunnel is created between libvirtd processes on both source and destination hosts.
de: Ein verschlüsselter Tunnel wird zwischen libvirtd Prozessen auf Quell- und Zielhosts erstellt.
id: Terowongan terenkripsi dibuat antara proses libvirtd pada host sumber dan tujuan.
tr_tr: Hem kaynak hem de hedef bilgisayarlarda libvirtd işlemleri arasında şifrelenmiş bir tünel oluşturulur.

source: An ephemeral disk encryption feature addresses data privacy. The ephemeral disk is a temporary work space used by the virtual host operating system. Without encryption, sensitive user information could be accessed on this disk, and vestigial information could remain after the disk is unmounted. As of the Kilo release, the following ephemeral disk encryption features are supported:
de: Eine kurzlebige Festplattenverschlüsselungsfunktion adressiert den Datenschutz. Die kurzlebige Festplatte ist ein temporärer Arbeitsbereich, der vom virtuellen Host-Betriebssystem verwendet wird. Ohne Verschlüsselung können sensible Benutzerinformationen auf dieser Festplatte abgerufen werden, und es können rastische Informationen verbleiben, nachdem die Festplatte nicht bereitgestellt wurde. Seit der Kilo-Version werden die folgenden ephemeren Festplattenverschlüsselungsfunktionen unterstützt:
id: Fitur enkripsi disk fana (singkat) membahas privasi data. Disk fana adalah ruang kerja sementara yang digunakan oleh sistem operasi virtual host. Tanpa enkripsi, informasi pengguna yang sensitif dapat diakses pada disk ini, dan informasi sisa bisa tetap ada setelah disk tidak terpasang. Pada rilis Kilo, fitur enkripsi disk darurat berikut didukung:
tr_tr: Geçici bir disk şifreleme özelliği veri gizliliğini ele alır. Geçici disk sanal makine işletim sistemi tarafından kullanılan geçici bir çalışma alanıdır. Şifreleme olmadan bu diskte hassas kullanıcı bilgileri erişilebilir ve disk ayrıştırıldıktan sonra kestirici bilgiler kalabilir. Kilo sürümü itibariyle aşağıdaki kısa ömürlü disk şifreleme özellikleri desteklenmektedir:

source: An example diagram from the OpenStack Object Storage Administration Guide (2013)
de: Ein Beispieldiagramm aus dem OpenStack Object Storage Administrationshandbuch (2013)
id: Diagram contoh dari OpenStack Object Storage Administration Guide (2013)
tr_tr: OpenStack Nesne Depolama Yönetimi Kılavuzu'ndaki (2013) örnek bir şema

source: An example of those secrets that require keystone authentication are passwords and keys owned by specific projects. These include, for instance, encryption keys for a project's encrypted cinder volumes or signing keys for a project's glance images.
de: Ein Beispiel für solche Geheimnisse, die eine Keystone-Authentifizierung erfordern, sind Passwörter und Schlüssel, die bestimmten Projekten gehören. Dazu gehören beispielsweise Verschlüsselungsschlüssel für verschlüsselte Cinder-Volumes eines Projekts oder Signier-Schlüssel für die Glance-Abbilder eines Projekts.
id: Contoh dari rahasia yang memerlukan otentikasi keystone adalah password dan kunci yang dimiliki oleh proyek tertentu. Ini termasuk, misalnya, kunci enkripsi untuk volume cinder terenkripsi proyek atau signing key untuk glance image proyek.

source: An exception process is an important component of an ISMS. When certain actions are not compliant with security policies that an organization has defined, they must be logged. Appropriate justification, description and mitigation details need to be included, and signed off by appropriate authorities. OpenStack default configurations may vary in meeting various compliance criteria, areas that fail to meet compliance requirements should be logged, with potential fixes considered for contribution to the community.
de: Ein Ausnahmeprozess ist ein wichtiger Bestandteil eines ISMS. Wenn bestimmte Aktionen nicht mit Sicherheitsrichtlinien übereinstimmen, die eine Organisation definiert hat, müssen sie protokolliert werden. Angemessene Rechtfertigungs-, Beschreibungs- und Abhilfemaßnahmen müssen einbezogen und von entsprechenden Behörden unterzeichnet werden. OpenStack-Standardkonfigurationen können bei der Erfüllung verschiedener Compliance-Kriterien variieren, Bereiche, die nicht mit Compliance-Anforderungen übereinstimmen, sollten protokolliert werden, wobei potenzielle Korrekturen für den Beitrag zur Community berücksichtigt werden.
id: Proses pengecualian adalah komponen penting dari ISMS. Bila tindakan tertentu tidak sesuai dengan kebijakan keamanan yang ditetapkan organisasi, mereka harus masuk log. Pembenaran yang tepat, deskripsi dan rincian mitigasi perlu disertakan, dan ditandatangani oleh pihak berwenang yang pantas. Konfigurasi default OpenStack dapat bervariasi dalam memenuhi berbagai kriteria kepatuhan, area yang gagal memenuhi persyaratan kepatuhan harus dicatat, dengan potensi perbaikan dianggap sebagai kontribusi bagi masyarakat.
tr_tr: İstisna süreci, bir ISMS'in önemli bir bileşenidir. Bazı eylemler, bir organizasyonun tanımladığı güvenlik ilkeleri ile uyumlu olmadığında, günlüklenmesi gerekir. Uygun gerekçe, açıklama ve azaltma ayrıntılarının dahil edilmesi ve uygun otoriteler tarafından imzalanması gerekir. OpenStack varsayılan yapılandırmaları, çeşitli uygunluk kriterlerini karşılamak bakımından farklılık gösterebilir, uyumluluk gereksinimlerini karşılayamayan alanlar kaydedilmeli ve topluluğa katkıda bulunmak için olası düzeltmeler düşünülmelidir.

source: An existing security service entity can be associated with share network entities that inform the Shared File Systems service about security and network configuration for a group of shares. You can also see the list of all security services for a specified share network and disassociate them from a share network.
de: Eine bestehende Sicherheitsdiensteinheit kann mit Share-Netzwerk-Entitäten verknüpft werden, die den Shared File Systems-Dienst über die Sicherheit und die Netzwerkkonfiguration für eine Gruppe von Aktien informieren. Sie können auch die Liste aller Sicherheitsdienste für ein bestimmtes Freigabenetzwerk anzeigen und diese aus einem Freigabenetzwerk aufheben.
id: Entitas layanan keamanan yang ada dapat dikaitkan dengan entitas jaringan share yang menginformasikan layanan Shared File Systems tentang keamanan dan konfigurasi jaringan untuk sekelompok share. Anda juga dapat melihat daftar semua layanan keamanan untuk jaringan share tertentu dan melepaskannya dari jaringan share.
tr_tr: Varolan bir güvenlik servisi varlığı, Paylaşımlı Dosya Sistemleri servisine bir grup hisse için güvenlik ve ağ yapılandırması hakkında bilgi veren paylaşım ağı varlıklarıyla ilişkilendirilebilir. Belirli bir paylaşım ağı için tüm güvenlik servislerinin listesini görebilir ve bunları bir paylaşım ağından ayırabilirsiniz.

source: An optional system to which a CA delegates certain management functions, this includes functions such as, authentication of end entities before they are issued a certificate by a CA.
de: Ein optionales System, zu dem eine CA bestimmte Verwaltungsfunktionen delegiert, beinhaltet dies Funktionen wie die Authentifizierung von Endentitäten, bevor sie ein Zertifikat von einer CA ausgestellt haben.
id: Sistem opsional dimana CA mendelegasikan fungsi manajemen tertentu, ini mencakup fungsi seperti, otentikasi entitas akhir sebelum dikeluarkan sertifikat oleh CA.
tr_tr: Bir CA'nın belirli yönetim işlevlerini devrettiği isteğe bağlı bir sistem; bu, bir CA tarafından bir sertifika verilmeden önce son varlıkların kimlik doğrulaması gibi işlevleri içerir.

source: An optional system to which a CA delegates the publication of certificate revocation lists.
de: Ein optionales System, an das eine CA die Veröffentlichung von Zertifikatssperrlisten delegiert.
id: Sistem opsional dimana CA mendelegasikan publikasi daftar pencabutan sertifikat.
tr_tr: Sertifika iptal listelerinin bir CA tarafından delege edilmesi için isteğe bağlı bir sistem.

source: An overview of all services running within the cloud infrastructure.
de: Eine Übersicht aller Dienste, die in der Cloud-Infrastruktur laufen.
id: Ikhtisar semua layanan yang berjalan di dalam infrastruktur awan.

source: Andrew Hay is the Director of Applied Security Research at CloudPassage, Inc. where he leads the security research efforts for the company and its server security products purpose-built for dynamic public, private, and hybrid cloud hosting environments.
de: Andrew Hay ist Direktor für Angewandte Sicherheitsforschung bei CloudPassage, Inc., wo er die Sicherheitsforschungsbemühungen für das Unternehmen und seine Server-Sicherheitsprodukte für dynamische öffentliche, private und hybride Cloud-Hosting-Umgebungen einsetzt.
id: Andrew Hay adalah Direktur Applied Security Research di CloudPassage, Inc. di mana dia memimpin upaya penelitian keamanan untuk perusahaan dan produk keamanan server yang dibuat khusus untuk lingkungan hosting awan publik, private, dan hibrida yang dinamis.
tr_tr: Andrew Hay, CloudPassage, Inc.'de Uygulamalı Güvenlik Araştırmaları Direktörü olarak şirket için güvenlik araştırma çabalarını ve dinamik kamu, özel ve melez bulut barındırma ortamları için tasarlanmış sunucu güvenlik ürünlerini yönetmektedir.

source: Annual, role-specific, security training is a mandatory requirement for almost all compliance certifications and attestations. To optimize the effectiveness of security training, a common method is to provide role specific training, for example to developers, operational personnel, and non-technical employees. Additional cloud security or OpenStack security training based on this hardening guide would be ideal.
de: Jährliche, rollenspezifische, Sicherheitstraining ist eine obligatorische Voraussetzung für fast alle Compliance-Zertifizierungen und Bescheinigungen. Um die Effektivität des Sicherheitstrainings zu optimieren, ist eine gängige Methode, eine rollenspezifische Ausbildung anzubieten, beispielsweise für Entwickler, operatives Personal und nicht-technische Mitarbeiter. Zusätzliche Cloud-Sicherheit- oder OpenStack-Sicherheitstraining auf Basis dieses Hardening-Guides wären ideal.
id: Pelatihan keamanan ,role-specific, tahunan adalah persyaratan wajib untuk hampir semua sertifikasi kepatuhan dan pengesahan. Untuk mengoptimalkan efektivitas pelatihan keamanan, metode yang umum adalah memberikan pelatihan khusus peran, misalnya kepada pengembang, personil operasional, dan pegawai non-teknis. Keamanan awan tambahan atau pelatihan keamanan OpenStack berdasarkan panduan pengerasan ini akan ideal.
tr_tr: Yıllık, role özgü, güvenlik eğitimi hemen hemen tüm uyumluluk sertifikaları ve tasdikleri için zorunlu bir gerekliliktir. Güvenlik eğitiminin etkinliğini en iyi duruma getirmek için ortak bir yöntem, örneğin geliştiricilere, operasyon personeli ve teknik olmayan çalışanlara role özel eğitim sağlamaktır. Ek sertifika kılavuzuna dayalı ek bulut güvenliği veya OpenStack güvenlik eğitimi ideal olacaktır.

source: Another as a private interface with access to the storage nodes.
de: Eine andere als private Schnittstelle mit Zugriff auf die Speicherknoten.
id: Lain sebagai antarmuka pribadi dengan akses ke node penyimpanan.
tr_tr: Depolama düğümlerine erişim ile gizli bir arayüz olarak diğeri.

source: Another feature in OpenStack Networking is Load-Balancer-as-a-service (LBaaS). The LBaaS reference implementation is based on HA-Proxy. There are third-party plug-ins in development for extensions in OpenStack Networking to provide extensive L4-L7 functionality for virtual interface ports.
de: Ein weiteres Merkmal in OpenStack Networking ist Load-Balancer-as-a-Service (LBaaS). Die LBaaS-Referenzimplementierung basiert auf HA-Proxy. Es gibt Drittanbieter-Plug-Ins in der Entwicklung für Erweiterungen in OpenStack Networking, um umfangreiche L4-L7-Funktionalität für virtuelle Schnittstellen-Ports bereitzustellen.
id: Fitur lain di OpenStack Networking adalah Load-Balancer-as-a-service (LBaaS). Implementasi referensi LBaaS didasarkan pada HA-Proxy. Ada plug-in pihak ketiga dalam pengembangan untuk ekstensi di OpenStack Networking untuk menyediakan fungsionalitas L4-L7 yang luas untuk port antarmuka virtual.
tr_tr: OpenStack Ağ'daki diğer bir özellik de hizmet-olarak-yük-dengeleyici (LBaaS). LBaaS referans uygulaması HA-Proxy'ye dayalıdır. Sanal arabirim bağlantı noktaları için geniş L4-L7 işlevselliği sağlamak için OpenStack Ağ'daki uzantılar için geliştirilmiş üçüncü taraf eklentileri bulunmaktadır.

source: Another thing to look into when selecting a hypervisor platform is the availability of specific security features. In particular, features. For example, Xen Server's XSM or Xen Security Modules, sVirt, Intel TXT, or AppArmor.
de: Eine andere Sache zu suchen bei der Auswahl einer Hypervisor-Plattform ist die Verfügbarkeit von bestimmten Sicherheits-Features. Besonders Merkmale. Zum Beispiel Xen Server XSM oder Xen Security Modules, sVirt, Intel TXT oder AppArmor.
id: Hal lain yang perlu diperhatikan saat memilih platform hypervisor adalah tersedianya fitur keamanan tertentu. Secara khusus, fitur. Misalnya, Xen Server XSM atau Xen Security Modules, sVirt, Intel TXT, atau AppArmor.
tr_tr: Bir hipervizör platformunu seçerken dikkat etmeniz gereken bir diğer husus, belirli güvenlik özelliklerinin bulunmasıdır. Özellikle özellikleri. Örneğin, Xen Server'ın XSM veya Xen Güvenlik Modülleri, Sanal, Intel TXT veya AppArmor.

source: Any changes to ``/etc/manila/policy.json`` are effective immediately, which allows new policies to be implemented while the Shared File Systems service is running. Manual modification of the policy can have unexpected side effects and is not encouraged. For details, see `The policy.json file <https://docs.openstack.org/ocata/config-reference/policy-json-file.html>`_.
de: Alle Änderungen an ``/etc/manila/policy.json``sind sofort wirksam, so dass neue Richtlinien implementiert werden können, während der Shared File Systems Service läuft. Manuelle Änderung der Politik kann unerwartete Nebenwirkungen haben und wird nicht gefördert. Weitere Informationen finden Sie unter `Die Datei policy.json <https://docs.openstack.org/ocata/config-reference/policy-json-file.html>`_.
id: Setiap perubahan pada ``/etc/manila/policy.json`` berlaku efektif, yang memungkinkan kebijakan baru diterapkan sementara layanan Shared File Systems berjalan. Modifikasi manual dari kebijakan tersebut dapat menimbulkan efek samping yang tidak diharapkan dan tidak dianjurkan. Untuk detailnya, lihat `The policy.json file <https://docs.openstack.org/ocata/config-reference/policy-json-file.html>`_.
tr_tr: ``/etc/manila/policy.json`` dosyasında yapılan değişiklikler hemen etkindir ve paylaşımlı dosya sistemleri çalışırken yeni ilkeler uygulanır. Politikanın elle değiştirilmesi beklenmeyen yan etkilere neden olabilir ve tavsiye edilmez. Ayrıntılar için bkz. `policy.json dosyası <https://docs.openstack.org/ocata/config-reference/policy-json-file.html>`_.

source: Any data assets in transit across that interface
de: Alle Datenbestände im Transit über diese Schnittstelle
id: Aset data apa pun yang transit di antarmuka itu
tr_tr: Bu arabirimde geçiş yapan herhangi bir veri varlığı

source: Any data or metadata not included in the list above are not encrypted, including:
de: Alle Daten oder Metadaten, die nicht in der obigen Liste enthalten sind, sind nicht verschlüsselt, einschließlich:
id: Data atau metadata yang tidak termasuk dalam daftar di atas tidak dienkripsi, termasuk:
tr_tr: Yukarıdaki listede yer almayan herhangi bir veri veya metaveriler, aşağıdakiler dahil olmak üzere şifrelenmez:

source: Any domains without a domain-specific configuration file will use options in the primary ``keystone.conf`` file.
de: Alle Domains ohne domänenspezifische Konfigurationsdatei verwenden Optionen in der primären ``keystone.conf``Datei.
id: Setiap domain tanpa file konfigurasi domain-specific akan menggunakan opsi di file `keystone.conf`` utama.
tr_tr: Alana özel bir yapılandırma dosyası olmayan herhangi bir alan birincil ``keystone.conf`` dosyasında seçenekleri kullanacaktır.
