Repository: openstack/security-doc
Catalog: security-guide/source/locale/*/LC_MESSAGES/security-guide.po
Languages: de, id, tr_tr

source: Network plug-ins allow to use any functions, configurations of the OpenStack Networking and Legacy networking services. One can use any network segmentation that the Networking service supports, you can use flat networks or VLAN-segmented networks of the Legacy networking (nova-network) service, or you can use plug-ins for specifying networks independently from OpenStack networking services. For more information of how to use different network plug-ins, see `Shared File Systems service Network plug-ins <https://docs.openstack.org/admin-guide/shared_file_systems_network_plugins.html#network-plug-ins>`_.
de: Netzwerk-Plug-Ins erlauben es, alle Funktionen, Konfigurationen der OpenStack Networking und Legacy Networking Services zu nutzen. Man kann jede Netzwerksegmentierung nutzen, die der Networking Service unterstützt, Sie können flache Netzwerke oder VLAN-segmentierte Netzwerke des Legacy Networking (nova-network) Service nutzen oder Plugins für die Festlegung von Netzwerken unabhängig von OpenStack Networking Services. Weitere Informationen zur Verwendung verschiedener Netzwerk-Plug-Ins finden Sie unter `Shared File Systems Service-Netzwerk-Plug-Ins <https://docs.openstack.org/admin-guide/shared_file_systems_network_plugins.html#network-plug-ins>`_.
id: Jaringan plug-in memungkinkan untuk menggunakan fungsi apapun, konfigurasi layanan jaringan OpenStack Networking and Legacy. Seseorang dapat menggunakan segmentasi jaringan yang didukung oleh layanan Networking, Anda dapat menggunakan jaringan datar atau jaringan terstruktur VLAN dari jaringan jaringan Legacy (nova-network), atau Anda dapat menggunakan plug-in untuk menentukan jaringan secara terpisah dari layanan jaringan OpenStack. Untuk informasi lebih lanjut tentang cara menggunakan berbagai plug-in jaringan, lihat `Shared File Systems service Network plug-ins <https://docs.openstack.org/admin-guide/shared_file_systems_network_plugins.html#network-plug-ins>`_.
tr_tr: Ağ eklentileri, OpenStack Ağ ve Eski Ağ servisinin herhangi bir işlevini, yapılandırmasını kullanmanıza izin verir. Birisi, Ağ servisinin desteklediği herhangi bir ağ bölümlemesini kullanabilir, Düz ağları veya Eski ağ oluşturma (yeni ağ) servisinin VLAN bölmeli ağlarını kullanabilir veya OpenStack ağ servisinden bağımsız olarak ağlar belirlemek için eklentileri kullanabilirsiniz. Farklı ağ eklentilerinin nasıl kullanılacağıyla ilgili daha fazla bilgi için bkz. `Paylaşımlı Dosya Sistemleri servisi Ağ eklentileri <https://docs.openstack.org/admin-guide/shared_file_systems_network_plugins.html#network-plug-ins>`_.

source: Network policy
de: Netzwerkpolicy
id: Kebijakan jaringan
tr_tr: Ağ kuralı

source: Network security
de: Netzwerksicherheit
id: Keamanan jaringan
tr_tr: Ağ güvenliği

source: Network services
de: Netzwerkdienste
id: Layanan jaringan
tr_tr: Ağ servisleri

source: Network services extensions
de: Netzwerkdienste Erweiterungen
id: Ekstensi layanan jaringan
tr_tr: Ağ servisleri uzantıları

source: Network topology
de: Netzwerktopologie
id: Topologi jaringan
tr_tr: Ağ topolojisi

source: Network tunneling encapsulates each tenant/network combination with a unique "tunnel-id" that is used to identify the network traffic belonging to that combination. The tenant's L2 network connectivity is independent of physical locality or underlying network design. By encapsulating traffic inside IP packets, that traffic can cross Layer-3 boundaries, removing the need for preconfigured VLANs and VLAN trunking. Tunneling adds a layer of obfuscation to network data traffic, reducing the visibility of individual tenant traffic from a monitoring point of view.
de: Das Netzwerk-Tunneling kapselt jede Tenant-/Netzwerkkombination mit einer einzigartigen "Tunnel-ID", die verwendet wird, um den Netzwerkverkehr zu identifizieren, der zu dieser Kombination gehört. Die L2-Netzwerkkonnektivität des Tenants ist unabhängig von physischer Lokalität oder zugrunde liegendem Netzwerkdesign. Durch das Einkapseln von Datenverkehr in IP-Paketen kann dieser Verkehr Layer-3-Grenzen überschreiten, wodurch die Notwendigkeit für vorkonfigurierte VLANs und VLAN-Trunking entfernt wird. Tunneln fügt eine Verschiebungsschicht für den Netzwerkdatenverkehr hinzu, wodurch die Sichtbarkeit des einzelnen Tenantverkehrs aus Überwachungssicht verringert wird.
id: Jaringan tunneling merangkum masing-masing penyewa jaringan kombinasi dengan unik "tunnel-id" yang digunakan untuk mengidentifikasi lalu lintas jaringan milik kombinasi itu. Konektivitas jaringan L2 penyewa tidak bergantung pada lokasi fisik atau disain jaringan yang mendasarinya. Dengan mengenkapsulasi lalu lintas di dalam paket IP, lalu lintas tersebut dapat melintasi batas Layer-3, menghapus kebutuhan akan VLAN yang telah dikonfigurasikan sebelumnya dan trunking VLAN. Tunneling menambahkan lapisan obfuscation ke lalu lintas data jaringan, mengurangi visibilitas lalu lintas penyewa individu dari sudut pandang pemantauan.
tr_tr: Ağ tünellemesi, her bir kiracı/ağ kombinasyonunu, bu kombinasyona ait olan ağ trafiğini tanımlamak için kullanılan benzersiz bir "tünel-kimliği" ile saklar. Kiracının L2 ağ bağlantısı fiziksel yerellikten veya alttaki ağ tasarımından bağımsızdır. Trafiği IP paketleri içine sızdırarak, bu trafik Katman 3'ün sınırlarını aşabilir ve önceden yapılandırılmış VLAN'lara ve VLAN kanalına ihtiyaç duymaz. Tünel oluşturma, ağ veri trafiğine karmaşık bir katman katarak, bireysel kiracı trafiğinin bir izleme bakış açısıyla görünürlüğünü azaltır.

source: Network virtualization
de: Netzwerkvirtualisierung
id: Virtualisasi jaringan
tr_tr: Ağ sanallaştırması

source: Networking
de: Vernetzung
tr_tr: Ağ

source: Networking API endpoints
de: Netzwerk-API-Endpunkte
tr_tr: Ağ API uç noktaları

source: Networking architecture
de: Netzwerkarchitektur
id: Arsitektur jaringan
tr_tr: Ağ mimarisi

source: Networking services
de: Netzwerkdienste
id: Layanan Networking
tr_tr: Ağ servisleri

source: Networking services limitations
de: Beschränkungen der Netzwerkdienste
id: Keterbatasan layanan jaringan
tr_tr: Ağ servisleri sınırlandırmaları

source: Networking services security best practices
de: Netzwerk-Service-Sicherheit Best Practices
id: Praktik terbaik keamanan layanan jaringan
tr_tr: Ağ servisleri güvenliğinin en iyi yöntemleri

source: Never allow the wild card origin.
de: Niemals den wild card origin zulassen.
id: Jangan biarkan wild card origin.
tr_tr: Joker kökene asla izin vermeyin.

source: Never configure CSRF or session cookies to have a wild card domain with a leading dot. Horizon's session and CSRF cookie should be secured when deployed with HTTPS:
de: Konfiguriere nie CSRF oder Session Cookies, um eine Wild Card Domain mit einem führenden Punkt zu haben. Horizons Session und CSRF Cookie sollten gesichert werden, wenn sie mit HTTPS eingesetzt werden:
id: Jangan pernah mengonfigurasi CSRF atau cookie sesi untuk memiliki wild card domain dengan dot terkemuka. Sesi Horizon dan cookie CSRF harus diamankan saat dikerahkan dengan HTTPS:
tr_tr: CSRF'yi veya oturum çerezlerini, önde gelen bir nokta içeren bir joker alan adına sahip olacak şekilde yapılandırmayın. Horizon'un oturumu ve CSRF çerezi, HTTPS ile yayına alındığında güvenli hale getirilmelidir:

source: No IPv6 support for L3 agents
de: Keine IPv6-Unterstützung für L3-Agenten
id: Tidak ada dukungan IPv6 untuk agen L3
tr_tr: L3 aracıları için IPv6 desteği yok

source: No MD5. MD5 is not collision resistant, and thus not acceptable for Message Authentication Codes (MAC) or signatures.
de: Kein MD5. MD5 ist nicht kollisionsresistent und daher für Message Authentication Codes (MAC) oder Signaturen nicht akzeptabel.
id: Tidak ada MD5. MD5 tidak tahan benturan, dan karenanya tidak dapat diterima untuk Message Authentication Codes (MAC) atau signatures.
tr_tr: MD5 yok. MD5 çarpışmaya dayanıklı değildir ve bu nedenle Mesaj Doğrulama Kodları (MAC) veya imzalar için kabul edilemez.

source: No RC4. RC4 has flaws in the context of TLS V3. See `On the Security of RC4 in TLS and WPA <http://cr.yp.to/streamciphers/rc4biases-20130708.pdf>`_.
de: Kein RC4. RC4 hat Fehler im Zusammenhang mit TLS V3. Siehe `Mit der Sicherheit von RC4 in TLS und WPA <http://cr.yp.to/streamciphers/rc4biases-20130708.pdf>`_.
id: Tidak ada RC4. RC4 memiliki kekurangan dalam konteks TLS V3. Lihat `On the Security of RC4 in TLS and WPA <http://cr.yp.to/streamciphers/rc4biases-20130708.pdf>`_.
tr_tr: RC4 yok. RC4'ün TLS V3 bağlamında kusurları var. Bkz. `RC4'ün TLS ve WPA'daki Güvenliği Hakkında <http://cr.yp.to/streamciphers/rc4biases-20130708.pdf>`_.

source: No new users will be added to the Identity back end, but the Identity service requires group-based role assignments to authorize federated users. The Federation mapping function will map the user into local Identity service groups objects, and hence to local role assignments.
de: Es werden keine neuen Benutzer zum Identity-Backend hinzugefügt, aber der Identity-Service erfordert gruppenbasierte Rollenzuweisungen, um föderierte Benutzer zu autorisieren. Die Föderationszuordnungsfunktion kartiert den Benutzer in lokale Identitätsdienstgruppenobjekte und damit auf lokale Rollenzuweisungen.
tr_tr: Kimlik arka uçuna hiçbir yeni kullanıcı eklenmeyecek, ancak Kimlik servisi federe kullanıcıları yetkilendirmek için grup tabanlı rol atamalarını gerektiriyor. Federasyon haritalama işlevi, kullanıcıyı yerel Kimlik servisi grupları nesnelerine ve dolayısıyla yerel rol atamalarına eşleyecektir.

source: Node hardening
de: Knotenhärtung
id: Pengerasan node
tr_tr: Düğüm sıkılaştırma

source: Node provisioning
de: Knoten-Provisionierung
id: Penyediaan Node
tr_tr: Düğüm sağlamak

source: Nodes in the cloud—including compute, storage, network, service, and hybrid nodes—should have an automated provisioning process. This ensures that nodes are provisioned consistently and correctly. This also facilitates security patching, upgrading, bug fixing, and other critical changes. Since this process installs new software that runs at the highest privilege levels in the cloud, it is important to verify that the correct software is installed. This includes the earliest stages of the boot process.
de: Knoten in der Cloud - einschließlich Compute-, Storage-, Netzwerk-, Service- und Hybrid-Knoten - sollten einen automatisierten Provisioning-Prozess haben. Dadurch wird sichergestellt, dass die Knoten konsequent und korrekt bereitgestellt werden. Dies erleichtert auch das Sicherheitspatching, das Upgrade, die Fehlerbehebung und andere kritische Änderungen. Da dieser Prozess neue Software installiert, die auf den höchsten Berechtigungsstufen in der Cloud läuft, ist es wichtig zu überprüfen, ob die richtige Software installiert ist. Dazu gehören die frühesten Stufen des Bootvorgangs.
id: Node di awan -termasuk komputasi, penyimpanan, jaringan, layanan, dan node hibrida- harus memiliki proses penyediaan otomatis. Hal ini memastikan bahwa node ditetapkan secara konsisten dan benar. Ini juga memfasilitasi keamanan patch, upgrade, perbaikan bug, dan perubahan penting lainnya. Karena proses ini menginstal perangkat lunak baru yang berjalan pada tingkat hak istimewa tertinggi di awan, penting untuk memastikan perangkat lunak yang benar diinstal. Ini termasuk tahap awal proses boot.
tr_tr: Buluttaki —hesaplama, depolama, ağ, servis ve karma düğümler dahil olmak üzere— düğümlerin otomatik bir hazırlık sürecine sahip olması gerekir. Bu, düğümlerin tutarlı ve doğru şekilde hazırlanmasını sağlar. Bu aynı zamanda güvenlik yamalama, yükseltme, hata düzeltme ve diğer kritik değişiklikleri kolaylaştırır. Bu işlem, bulutun en yüksek ayrıcalık düzeyinde çalışan yeni bir yazılım yüklediğinden, doğru yazılımın yüklü olduğunu doğrulamanız önemlidir. Bu, önyükleme işleminin en erken aşamalarını da içerir.

source: Nodes should use Preboot eXecution Environment (PXE) for provisioning. This significantly reduces the effort required for redeploying nodes. The typical process involves the node receiving various boot stages—that is progressively more complex software to execute— from a server.
de: Knoten sollten Preboot eXecution Environment (PXE) für die Bereitstellung verwenden. Dies verringert den Aufwand für die Wiederherstellung von Knoten erheblich. Der typische Prozess beinhaltet, dass der Knoten verschiedene Bootstufen empfängt - das ist schrittweise komplexere Software, um von einem Server auszuführen.
id: Node harus menggunakan Preboot eXecution Environment (PXE) untuk penyediaan. Hal ini secara signifikan mengurangi upaya yang diperlukan untuk memindahkan node. Proses yang khas melibatkan node yang menerima berbagai tahap boot -yaitu perangkat lunak yang semakin kompleks untuk dijalankan- dari server.
tr_tr: Düğümler, hazırlık için Önyükleme Öncesi Ortam (PXE) kullanmalıdır. Bu düğümleri yeniden dağıtmak için gereken çabayı önemli ölçüde azaltır. Tipik süreç, düğümün çeşitli önyükleme aşamalarını —aşamalı olarak çalıştırılması daha karmaşık bir yazılım olan— aldığı bir sunucudan yapılır.

source: Note that Castellan does not provide any authentication. It simply passes through the authentication credentials (a Keystone token, for example) to the back-end.
de: Beachten Sie, dass Castellan keine Authentifizierung bereitstellt. Es übergibt einfach die Authentifizierungsdaten (zum Beispiel ein Keystone-Token) an das Backend.
id: Perhatikan bahwa Castellan tidak memberikan otentikasi apapun. Ini hanya melewati kredensial otentikasi (token Keystone, misalnya) ke back-end.

source: Note that if the LDAP system has attributes defined for the user such as admin, finance, HR etc, these must be mapped into roles and groups within Identity for use by the various OpenStack services. The ``/etc/keystone/keystone.conf`` file maps LDAP attributes to Identity attributes.
de: Beachten Sie, dass, wenn das LDAP-System Attribute für den Benutzer definiert hat, wie z.B. Admin, Finanzen, HR usw., diese in Rollen und Gruppen innerhalb von Identity für die Verwendung durch die verschiedenen OpenStack- Dienste abgebildet werden müssen. Die ``/etc/keystone/ keystone.conf``-Datei ordnet LDAP-Attribute zu Identitätsattributen zu.
id: Perhatikan bahwa jika sistem LDAP memiliki atribut yang didefinisikan untuk pengguna seperti admin, finance, HR dll, ini harus dipetakan ke dalam peran dan kelompok di dalam Identity untuk digunakan oleh berbagai layanan OpenStack. File ``/etc/keystone/keystone.conf`` memetakan atribut LDAP ke atribut Identitas.
tr_tr: LDAP sistemi kullanıcı için yönetici, finans, HR vb gibi tanımlanmış niteliklere sahipse, bunların çeşitli OpenStack servisleri tarafından kullanılmak üzere Kimlik içindeki roller ve gruplar halinde eşleştirilmesi gerektiğini unutmayın. ``/etc/keystone/keystone.conf`` dosyası, LDAP özniteliklerini Kimlik niteliklerine eşleştirir.

source: Note that the OpenStack `Ephemeral disk encryption <https://docs.openstack.org/security-guide/tenant-data/data-encryption.html>`__ feature provides a means of improving ephemeral storage privacy and isolation, during both active use as well as when the data is to be destroyed. As in the case of encrypted block storage, one can simply delete the encryption key to effectively destroy the data.
de: Beachten Sie, dass die OpenStack `Ephemeral Disk Verschlüsselung <https://docs.openstack.org/security-guide/tenant-data/data-encryption.html> `__ Feature bietet ein Mittel zur Verbesserung der kurzlebigen Speicher Privatsphäre und Isolation, sowohl bei der aktiven Nutzung als auch wenn die Daten zu zerstören sind. Wie im Fall des verschlüsselten Blockspeichers kann man einfach den Verschlüsselungsschlüssel löschen, um die Daten effektiv zu zerstören.
id: Perhatikan bahwa OpenStack fitur `Ephemeral disk encryption <https://docs.openstack.org/security-guide/tenant-data/data-encryption.html>`__ menyediakan sarana untuk meningkatkan privasi penyimpanan sementara dan isolasi, selama penggunaan aktif maupun saat data dihancurkan. Seperti dalam kasus penyimpanan blok terenkripsi, seseorang dapat dengan mudah menghapus kunci enkripsi untuk menghancurkan data secara efektif.
tr_tr: OpenStack `Geçici disk şifrelemesi <https://docs.openstack.org/security-guide/tenant-data/data-encryption.html>`__ özelliği, hem etkin hem de geçici depolama gizliliğini ve izolasyonunu iyileştirme aracı sağlar veriler ne zaman imha edileceği gibi kullanın. Şifreli blok depolaması durumunda olduğu gibi, verileri etkili bir şekilde yok etmek için şifreleme anahtarını basitçe silebilirsiniz.

source: Note that there may be a key size limitation from the backend key manager that could require the use of 'key_size = 256', which would only provide an AES key size of 128-bits. XTS requires it's own "tweak key" in addition to the encryption key AES requires. This is typically expressed as a single large key. In this case, using the 512-bit setting, 256 bits will be used by AES and 256 bits by XTS. (see NIST_)
de: Beachten Sie, dass es eine Schlüsselgrößenbeschränkung vom Backend Key Manager gibt, die die Verwendung von 'key_size = 256' erfordern könnte, die nur eine AES-Schlüsselgröße von 128 Bits liefern würde. XTS erfordert seinen eigenen "Tweak Key" zusätzlich zu den Verschlüsselungsschlüssel AES erfordert. Dies wird typischerweise als ein einzelner Schlüssel ausgedrückt. In diesem Fall werden unter Verwendung der 512-Bit-Einstellung 256 Bits von AES und 256 Bits von XTS verwendet. (siehe NIST_)
id: Perhatikan bahwa mungkin ada batasan ukuran kunci dari manajer kunci backend yang memerlukan penggunaan 'key_size = 256', yang hanya akan memberikan ukuran kunci AES 128-bit. XTS membutuhkan "tweak key" itu sendiri selain kunci enkripsi yang dibutuhkan AES. Hal ini biasanya dinyatakan sebagai satu kunci besar. Dalam kasus ini, dengan menggunakan pengaturan 512-bit, 256 bit akan digunakan oleh AES dan 256 bit oleh XTS. (lihat NIST_)
tr_tr: Arka plan anahtarı yöneticisinden, yalnızca 128 bitlik AES anahtar boyutu sağlayacak olan 'key_size = 256' kullanılmasını gerektirebilecek bir anahtar boyutu sınırlaması olabileceğini unutmayın. XTS, AES'in gerektirdiği şifreleme anahtarına ek olarak kendi "ince ayar anahtarı"nın olmasını gerektirir. Bu genellikle tek bir büyük anahtar olarak ifade edilir. Bu durumda, 512 bitlik ayar kullanılarak, AES tarafından 256 bit ve XTS tarafından 256 bit kullanılacaktır. (bkz. NIST_)

source: Note this command only adds the ability to communicate over SSL and is non-exclusive. Other access methods that may allow unencrypted transport should be disabled so that SSL is the sole access method.
de: Beachten Sie, dass dieser Befehl nur die Möglichkeit gibt, über SSL zu kommunizieren und nicht exklusiv ist. Andere Zugriffsmethoden, die einen unverschlüsselten Transport zulassen, sollten deaktiviert werden, so dass SSL die einzige Zugriffsmethode ist.
id: Perhatikan perintah ini hanya menambahkan kemampuan untuk berkomunikasi melalui SSL dan tidak eksklusif. Metode akses lain yang memungkinkan pengangkutan yang tidak dienkripsi harus dinonaktifkan sehingga SSL adalah satu-satunya metode akses.
tr_tr: Bu komutu yalnızca SSL üzerinden iletişim kurma yeteneğini ekler ve özel değildir. Şifrelenmemiş aktarmaya izin verebilecek diğer erişim yöntemleri devre dışı bırakılmalıdır, böylece SSL tek erişim yöntemidir.

source: Note this needs to be added before your reject all rule which might be:
de: Beachten Sie, dass dies hinzugefügt werden muss, bevor Sie alle Regeln ablehnen:
tr_tr: Bu işlemin, tümünü reddet kuralından önce eklenmesi gerektiği unutmayın:

source: Note, as nova-conductor only applies to OpenStack Compute, direct database access from compute hosts may still be necessary for the operation of other OpenStack components such as Telemetry (ceilometer), Networking, and Block Storage.
de: Beachten Sie, dass Nova-Conductor nur für OpenStack Compute gilt, direkter Datenbankzugriff von Compute-Hosts für den Betrieb anderer OpenStack-Komponenten wie Telemetrie (Ceilometer), Networking und Block Storage kann ausserdem noch erforderlich sein.
id: Catatan, karena nova-konduktor hanya berlaku untuk OpenStack Compute, akses database langsung dari host komputasi mungkin masih diperlukan untuk pengoperasian komponen OpenStack lainnya seperti Telemetry (ceilometer), Networking, dan Block Storage.
tr_tr: nova-conductr yalnızca OpenStack Hesaplama için geçerli olduğundan, hesaplama ana makinelerinden doğrudan veritabanı erişimi, Telemetri (ceilometre), Ağ Oluşturma ve Blok Depolama Alanı gibi diğer OpenStack bileşenleri için hala gerekli olabilir.

source: Note, however, that authentication via IP is the least secure type of authentication.
de: Beachten Sie jedoch, dass die Authentifizierung über IP die am wenigsten sichere Authentifizierung ist.
id: Namun, perhatikan bahwa otentikasi melalui IP adalah jenis otentikasi yang paling tidak aman.
tr_tr: Bununla birlikte, IP üzerinden kimlik doğrulama, en az güvenli kimlik doğrulama türüdür.

source: Note, legacy nova-network security groups are applied to all virtual interface ports on an instance using iptables.
de: Anmerkung, Legacy-Nova-Netzwerk-Sicherheitsgruppen werden auf alle virtuellen Schnittstellen-Ports auf einer Instanz mit iptables angewendet.
id: Perhatikan, grup keamanan nova-jaringan legacy diterapkan ke semua port antarmuka virtual pada sebuah instance menggunakan iptable.
tr_tr: Not: eski nova-network güvenlik grupları, bir örnekteki tüm sanal arabirim portlarına iptables kullanarak uygulanır.

source: Note, the ``tcp_listeners`` option is set to ``[]`` to prevent it from listening on a non-SSL port. The ``ssl_listeners`` option should be restricted to only listen on the management network for the services.
de: Beachten Sie, dass die ``tcp_listeners``Option auf ``[] ``gesetzt ist, um zu verhindern, dass es auf einem Nicht-SSL-Port zuhört. Die `` ssl_listeners``Option sollte eingeschränkt werden, um nur das Management- Netzwerk für die Dienste zu hören.
id: Perhatikan, opsi ``tcp_listeners`` diset ke ``[]`` untuk mencegahnya mendengarkan port non-SSL. Opsi ``ssl_listeners`` harus dibatasi hanya untuk mendengarkan pada jaringan manajemen untuk layanan.
tr_tr: Not: ``tcp_listeners`` seçeneği, SSL olmayan bir portta dinlemesini önlemek için ``[]`` ya ayarlıdır. ``ssl_listeners`` seçeneği yalnızca yönetim ağında servisler için dinlenmek için sınırlandırılmalıdır.

source: Nova compute service depends on an external authentication and authorization service. In a typical deployment this dependency will be fulfilled by the keystone service.
de: Der Nova-Compute-Service hängt von einem externen Authentifizierungs- und Autorisierungsdienst ab. In einem typischen Einsatz wird diese Abhängigkeit durch den Keystone-Service erfüllt.
id: Layanan komputasi Nova bergantung pada layanan otentikasi dan otorisasi eksternal. Dalam penyebaran tipikal, ketergantungan ini akan dipenuhi oleh layanan keystone.
tr_tr: Nova hesaplama servisi, harici kimlik doğrulama ve yetkilendirme hizmetine bağlıdır. Tipik bir dağıtımda bu bağımlılık, keystone servisi ile yerine getirilecek.
