Repository: openstack/security-doc
Catalog: security-guide/source/locale/*/LC_MESSAGES/security-guide.po
Languages: de, id, tr_tr

source: "... any information about an individual maintained by an agency, including (1) any information that can be used to distinguish or trace an individual's identity, such as name, social security number, date and place of birth, mother's maiden name, or biometric records; and (2) any other information that is linked or linkable to an individual, such as medical, educational, financial, and employment information..."
de: "... alle Informationen über eine von einer Agentur verwaltete Person, einschließlich (1) aller Informationen, die zur Unterscheidung oder Verfolgung der Identität eines Individuums verwendet werden können, wie Name, Sozialversicherungsnummer, Geburtsdatum und Geburtsort, Mädchenname der Mutter, oder biometrische Aufzeichnungen und (2) alle anderen Informationen, die mit einer Person verknüpft oder verknüpft sind, wie medizinische, Bildungs-, Finanz- und Beschäftigungsinformationen ... "
id: "... informasi tentang seseorang yang dipelihara oleh agen, termasuk (1) informasi apa pun yang dapat digunakan untuk membedakan atau melacak identitas individu, seperti nama, nomor jaminan sosial, tanggal dan tempat lahir, nama gadis ibu, Atau catatan biometrik; dan (2) informasi lain yang terkait atau dapat dihubungkan dengan individu, seperti informasi medis, pendidikan, keuangan, dan pekerjaan ... "
tr_tr: "... bir ajans tarafından tutulan bir kişi hakkında, (1) kişinin kimliğini ayırt etmek veya izlemek için kullanılabilecek ad, sosyal güvenlik numarası, doğum yeri ve tarihi, annenin kızlık soyadı, ya da biyometrik kayıtlar ve (2) tıbbi, eğitimsel, finansal ve istihdam bilgileri gibi bir kişiye bağlanabilen ya da bağlanabilen diğer bilgiler..."

source: "Anchor is a public key infrastructure (PKI) service, which uses automated certificate request validation to automate issuing decisions. Certificates are issued for short time periods (typically 12-48 hours) to avoid the flawed revocation issues associated with CRLs and OCSP."
de: "Anchor ist ein Public Key Infrastructure (PKI) Service, der automatisierte Zertifikatsanforderungsvalidierung verwendet, um die Erteilung von Entscheidungen zu automatisieren. Zertifikate werden für kurze Zeiträume (typischerweise 12-48 Stunden) ausgegeben, um die fehlerhaften Widerrufsfragen, die mit CRLs und OCSP verbunden sind, zu vermeiden."
id: "Anchor adalah layanan public key infrastructure (PKI), yang menggunakan validasi permintaan sertifikat otomatis untuk mengotomatisasi keputusan penerbitan. Sertifikat dikeluarkan untuk periode waktu yang singkat (biasanya 12-48 jam) untuk menghindari masalah flawed revocation (pembatalan cacat) yang terkait dengan CRL dan OCSP."
tr_tr: "Çapa, kararların verilmesini otomatikleştirmek için otomatik sertifika isteği doğrulamasını kullanan bir ortak anahtar altyapısı (PKI) servisidir. Sertifikalar, CRL'ler ve OCSP ile ilgili hatalı iptal sorunlarını önlemek için kısa sürelerle (genellikle 12-48 saat) yayınlanmaktadır."

source: "The `Federal Risk and Authorization Management Program <http://www.fedramp.gov>`_ (FedRAMP) is a government-wide program that provides a standardized approach to security assessment, authorization, and continuous monitoring for cloud products and services". NIST 800-53 is the basis for both FISMA and FedRAMP which mandates security controls specifically selected to provide protection in cloud environments. FedRAMP can be extremely intensive from specificity around security controls, and the volume of documentation required to meet government standards.
de: "Das `Federal Risk and Authorization Management Program <http://www.fedramp.gov>`_ (FedRAMP) ist ein staatliches Programm, das einen standardisierten Ansatz für die Sicherheitsbewertung, die Genehmigung und die kontinuierliche Überwachung von Cloud-Produkten und -Dienstleistungen bietet." NIST 800-53 ist die Basis für FISMA und FedRAMP, um Schutz in Cloud-Umgebungen zu bieten. FedRAMP kann von der Spezifität um Sicherheitskontrollen extrem intensiv sein und das Dokumentationsvolumen, das erforderlich ist, um Regierungsstandards zu erfüllen.
id: "The `Federal Risk and Authorization Management Program <http://www.fedramp.gov>`_ (FedRAMP) adalah program pemerintah yang menyediakan pendekatan standar untuk penilaian keamanan, otorisasi, dan pemantauan berkelanjutan untuk produk dan layanan awan. "NIST 800-53 adalah basis untuk FISMA dan FedRAMP yang mengamanatkan kontrol keamanan yang secara khusus dipilih untuk memberikan perlindungan di awan. Lingkungan FedRAMP bisa sangat intensif dari spesifisitas seputar kontrol keamanan, dan volume dokumentasi yang dibutuhkan untuk memenuhi standar pemerintah.
tr_tr: "`Federal Risk ve Yetkilendirme Yönetim Programı (http://www.fedramp.gov)` _ (FedRAMP), bulut ürünleri ve hizmetleri için güvenlik değerlendirmesi, yetkilendirme ve sürekli izleme için standart bir yaklaşım sağlayan hükümet çapında bir programdır ". NIST 800-53, bulut ortamlarında koruma sağlamak için özel olarak seçilmiş güvenlik kontrollerini zorlayan FISMA ve FedRAMP için temel oluşturmaktadır. FedRAMP, güvenlik kontrolleri etrafındaki özgüllükten ve hükümet standartlarını karşılamak için gereken belgelerin hacminden son derece yoğun olabilir.

source: "The sanitization process removes information from the media such that the information cannot be retrieved or reconstructed. Sanitization techniques, including clearing, purging, cryptographic erase, and destruction, prevent the disclosure of information to unauthorized individuals when such media is reused or released for disposal." `NIST Special Publication 800-53 Revision 4 <http://nvlpubs.nist.gov/nistpubs/SpecialPublications/NIST.SP.800-53r4.pdf>`__
de: "Der Sanierungsprozess entfernt Informationen aus den Medien, so dass die Informationen nicht abgerufen oder rekonstruiert werden können. Sanitisierungstechniken, einschließlich Löschen, Reinigen, kryptografische Löschung und Zerstörung, verhindern die Offenlegung von Informationen an nicht autorisierte Personen, wenn diese Medien wiederverwendet oder zur Entsorgung freigegeben werden." `NIST Spezielle Publikation 800-53 Revision 4 <http://nvlpubs.nist.gov/nistpubs/SpecialPublications/NIST.SP.800-53r4.pdf> `__
tr_tr: "Temizleme süreci, bilgilerin alınamaması veya yeniden oluşturulması için medyadan bilgi kaldırılmasını sağlar. Temizleme, tasfiye, kriptografik silme ve imha etme dahil olmak üzere temizleme teknikleri, bu tür bir medya yeniden kullanıma girdiğinde veya bertaraf edilmek üzere serbest bırakıldığında bilgilerin yetkisiz kişilere açıklanmasını engeller ." `NIST Özel Yayın 800-53 Revizyon 4 <http://nvlpubs.nist.gov/nistpubs/SpecialPublications/NIST.SP.800-53r4.pdf>`__

source: **Example. Access instances through a custom network namespace**
de: **Beispiel. Zugriff auf Instanzen über einen benutzerdefinierten Netzwerk-Namespace **
tr_tr: **Örnek. Örneklere özel bir ağ ad alanı aracılığıyla erişin**

source: **Example. Access instances through a specified relay machine**
de: **Beispiel. Zugriffsinstanzen über eine spezifizierte Relaismaschine **
tr_tr: **Örnek. Örneklere belirli bir geçiş makinesi aracılığıyla erişin**

source: **Example. Allow all methods to all users (default policy)**
de: **Beispiel. Alle Methoden für alle Benutzer zulassen (Standardrichtlinie)**
tr_tr: **Örnek. Tüm kullanıcılara tüm metodları izin ver (öntanımlı ilke)**

source: **Example. Configuring TLS access to the controller**
de: **Beispiel. Konfigurieren des TLS-Zugriffs auf den Controller **
tr_tr: **Örnek. Kontrolcüye TLS erişimini yapılandırmak**

source: **Example. Configuring for a proxy domain named “dp_proxy”**
de: **Beispiel. Konfigurieren für eine Proxy-Domäne mit dem Namen "dp_proxy" **
tr_tr: **Örnek. “dp_proxy” adında bir vekil alan adı ayarlamak**

source: **Example. Disallow image registry manipulations to non-admin users**
de: **Beispiel. Deaktivieren Sie Abbildregistrierungsmanipulationen an Nicht-Admin-Benutzer **
tr_tr: **Örnek. Yönetici olmayan kullanıcılara resim kaydı düzenlemelerini yasakla**

source: **Example. Enabling rootwrap usage and showing the default command**
de: **Beispiel. Aktivieren der Rootwrap-Nutzung und Anzeigen des Standardbefehls**
tr_tr: **Örnek. rootwrap kullanımını açmak ve öntanımlı komutu göstermek**

source: **Example. Setting the log level higher than warning and specifying an output file.**
de: **Beispiel. Einstellen des Log-Pegels höher als Warnung und Angabe einer Ausgabedatei**
tr_tr: **Örnek. Uyarı seviyesinden daha yüksek günlük seviyesine ayarlama ve çıktı dosyasını belirleme.**

source: **Fail:** If TLS is not enabled on the HTTP server.
de: **Fail:** Wenn TLS auf dem HTTP-Server nicht aktiviert ist.
id: **Fail:** Jika TLS tidak diaktifkan pada server HTTP.
tr_tr: **Başarısız:** HTTP sunucunuzda TLS etkin değil ise.

source: **Fail:** If ``insecure_debug`` under ``[DEFAULT]`` section in ``/etc/keystone/keystone.conf`` is true.
de: **Fail:** Wenn ``insecure_debug``unter ``[DEFAULT] ``Abschnitt in ``/ etc/keystone/keystone.conf`` true ist.
id: **Fail:** Jika ``insecure_debug`` di bawah bagian ``[DEFAULT] `` di ``/etc/keystone/keystone.conf`` benar adanya.
tr_tr: **Başarısız:** Eğer ``/etc/keystone/keystone.conf`` dosyasındaki ``[DEFAULT]`` bölümündeki ``insecure_debug`` true ise.

source: **Fail:** If permissions are not set to at least 640.
de: **Fail:** Wenn die Berechtigungen nicht auf mindestens 640 festgelegt sind.
id: **Fail:** Jika izin tidak diatur ke setidaknya 640.
tr_tr: **Başarısız:** Eğer yetkileri en az 640 değilse.

source: **Fail:** If permissions are set greater than 640.
de: **Fail:** Wenn Berechtigungen grösser als 640 gesetzt sind.
id: **Fail:** Jika permission ditetapkan lebih besar dari 640.

source: **Fail:** If the above commands do not return any output, it is possible that the user and group ownership may have been set to any user other than root or any group other than barbican.
de: **Fail:** Wenn die obigen Befehle keine Ausgabe zurückgeben, ist es möglich, dass die Benutzer- und Gruppeneigentümer möglicherweise auf einen anderen Benutzer als root oder eine andere Gruppe als barbican gesetzt wurden.
id: **Fail:** Jika perintah di atas tidak mengembalikan output apapun, kemungkinan kepemilikan pengguna dan grup mungkin telah ditetapkan ke pengguna selain root atau grup selain barbican.

source: **Fail:** If the above commands do not return any output, the user and group ownership might have set to any user other than ``root`` or any group other than ``nova``.
de: **Fail:** Wenn die oben genannten Befehle keine Ausgabe zurückgeben, kann das Benutzer- und Gruppeneigentum auf einen anderen Benutzer als ``root`` oder eine andere Gruppe als ``nova``eingestellt haben.
id: **Fail:** Jika perintah di atas tidak mengembalikan output apa pun, kepemilikan pengguna dan grup mungkin telah ditetapkan ke pengguna selain ``root`` atau grup selain ``nova``.
tr_tr: ** Başarısız: ** Yukarıdaki komutlar herhangi bir çıktı döndürmezse, kullanıcı ve grup sahipliği ``root`` haricindeki herhangi bir kullanıcıya veya ``nova`` haricindeki herhangi bir gruba ayarlanmış olabilir.

source: **Fail:** If the above commands do not return any output.
de: **Fail:** Wenn die oben genannten Befehle keine Ausgabe zurückgeben.
id: **Fail:** Jika perintah di atas tidak mengembalikan output apapun.
tr_tr: **Başarısız:** Yukarıdaki komut herhangi bir çıktı döndürmez.

source: **Fail:** If the above commands does not return any output as the user and group ownership might have set to any user other than root or any group other than cinder.
de: **Fail:** Wenn die obigen Befehle keine Ausgabe zurückgeben, da die Besitzer und Gruppeneigentümer möglicherweise auf einen anderen Benutzer als root oder eine andere Gruppe als cinder eingestellt sind.
id: **Fail:** Jika perintah di atas tidak mengembalikan output apapun karena kepemilikan pengguna dan grup mungkin telah ditetapkan ke pengguna selain root atau grup selain cinder.
tr_tr: **Başarısız:** Kullanıcı ve grup sahibi root ve cinder haricinde bir şeye ayarlandığı için üstteki komutlar herhangi bir çıktı döndürmezse.

source: **Fail:** If the above commands does not return any output as the user and group ownership might have set to any user other than root or any group other than horizon.
de: **Fail:** Wenn die oben genannten Befehle keine Ausgabe zurückgeben, da der Benutzer- und Gruppenbesitz auf einen anderen Benutzer als root oder eine andere Gruppe als den horizon eingestellt haben könnte.
id: **Fail:** Jika perintah di atas tidak mengembalikan output apa pun karena kepemilikan user dan grup mungkin telah ditetapkan ke user selain root atau grup selain horizon.
tr_tr: **Başarısız:** Kullanıcı sahipliği root değilse ve grup sahipliği horizon değilse eğer yukarıdaki komutlar hiçbir çıktı dönmez.

source: **Fail:** If the above commands does not return any output as the user and group ownership might have set to any user other than root or any group other than manila.
de: **Fail:** Wenn die obigen Befehle keine Ausgabe zurückgeben, da der Benutzer- und Gruppeneigentum auf einen anderen Benutzer als root oder eine andere Gruppe als manila eingestellt ist.
id: **Fail:** Jika perintah di atas tidak mengembalikan output apa pun karena kepemilikan pengguna dan grup mungkin telah ditetapkan ke pengguna selain root atau grup selain manila.
tr_tr: **Başarısız:** Yukarıdaki komutlar kullanıcı ve grup sahipliği root'tan veya manila dışındaki herhangi bir gruba ayarlanmış olduğu için herhangi bir çıktı döndürmezse.

source: **Fail:** If the above commands does not return any output as the user and group ownership might have set to any user other than root or any group other than neutron.
de: **Fail:** Wenn die oben genannten Befehle keine Ausgabe zurückgeben, da die Benutzer- und Gruppeneigentümer möglicherweise auf einen anderen Benutzer als root oder eine andere Gruppe als neutron eingestellt sind.
id: **Fail:** Jika perintah di atas tidak mengembalikan output apa pun karena kepemilikan pengguna dan grup mungkin telah ditetapkan ke pengguna selain root atau grup selain neutron.
tr_tr: **Başarısız:** Eğer yukarıdaki komutlar hiçbir çıktı dönmezse, kullanıcı ve grup sahipliği root ve neutron haricinde bir şey ise.

source: **Fail:** If the above commands does not return any output as the user or group ownership might have set to any user other than keystone.
de: **Fail:** Wenn die oben genannten Befehle keine Ausgabe zurückgeben, da der Benutzer- oder Gruppeneigentum auf einen anderen Benutzer als keystone eingestellt ist.
id: **Fail:** Jika perintah di atas tidak mengembalikan output apa pun karena pengguna atau kepemilikan grup mungkin telah ditetapkan ke pengguna selain keystone.
tr_tr: **Başarısız:** Yukarıdaki komut hiçbir çıktı dönmezse, kullanıcı veya grup sahipliği keystone haricinde başka bir kullanıcı ise.

source: **Fail:** If the parameter ``authtoken`` is missing under the ``pipeline:barbican-api-keystone`` section in ``barbican-api-paste.ini``.
de: **Fail:** Wenn der Parameter ``authtoken`` unter der ``pipeline:barbican-api-keystone`` Sektion in ``barbican-api-paste.ini`` nicht vorhanden ist.
id: **Fail:** Jika parameternya ``authtoken`` hilang di bawah bagian ``pipeline:barbican-api-keystone`` dalam ``barbican-api-paste.ini``.

source: **Fail:** If value of parameter ``CSRF_COOKIE_SECURE`` in ``/etc/openstack-dashboard/local_settings.py`` is set to ``False``.
de: **Fail:** Wenn der Wert des Parameters ``CSRF_COOKIE_SECURE``in ``/etc /openstack-dashboard/local_settings.py``auf ``False`` gesetzt ist.
id: **Fail:** Jika nilai parameter ``CSRF_COOKIE_SECURE`` di ```/etc/openstack-dashboard/local_settings.py`` diatur ke ``False``.
tr_tr: **Başarısız:** ``/etc/openstack-dashboard/local_settings.py`` dosyasındaki ``CSRF_COOKIE_SECURE`` parametresinin değeri ``False`` ise.

source: **Fail:** If value of parameter ``DISABLE_PASSWORD_REVEAL`` in ``/etc/openstack-dashboard/local_settings.py`` is set to ``False``.
de: **Fail:** Wenn der Wert des Parameters ``DISABLE_PASSWORD_REVEAL``in `` / etc/openstack-dashboard/local_settings.py`` auf ``False``gesetzt ist.
id: **Fail:** Jika nilai parameter ``DISABLE_PASSWORD_REVEAL`` di ``/etc/openstack-dashboard/local_settings.py`` diatur ke ``False``.
tr_tr: **Başarısız:** Eğer ``/etc/openstack-dashboard/local_settings.py`` dosyasındaki ``DISABLE_PASSWORD_REVEAL`` parametresinin değeri ``False`` ise.

source: **Fail:** If value of parameter ``DISALLOW_IFRAME_EMBED`` in ``/etc/openstack-dashboard/local_settings.py`` is set to ``False``.
de: **Fail:** Wenn der Wert des Parameters ``DISALLOW_IFRAME_EMBED``in ``/ etc/openstack-dashboard/local_settings.py``auf ``False``gesetzt ist.
id: **Fail:** Jika nilai parameter ``DISALLOW_IFRAME_EMBED`` di ``/etc/openstack-dashboard/local_settings.py`` diatur ke ``False``.
tr_tr: **Başarısız:** ``/etc/openstack-dashboard/local_settings.py`` dosyasındaki ``DISALLOW_IFRAME_EMBED`` parametresinin değeri ``False`` ise.

source: **Fail:** If value of parameter ``ENFORCE_PASSWORD_CHECK`` in ``/etc/openstack-dashboard/local_settings.py`` is set to ``False``.
de: **Fail:** Wenn der Wert des Parameters ``ENFORCE_PASSWORD_CHECK``in ``/ etc/openstack-dashboard/local_settings.py`` auf ``False``gesetzt ist.
id: **Fail:** Jika nilai parameter `` ENFORCE_PASSWORD_CHECK`` di ``/etc/openstack-dashboard/local_settings.py`` diatur ke ``False``.
tr_tr: **Başarısız:** ``/etc/openstack-dashboard/local_settings.py`` dosyasında ``ENFORCE_PASSWORD_CHECK`` parametresi ``False`` ise.

source: **Fail:** If value of parameter ``PASSWORD_AUTOCOMPLETE`` in ``/etc/openstack-dashboard/local_settings.py`` is set to ``on``.
de: **Fail:** Wenn der Wert des Parameters ``PASSWORD_AUTOCOMPLETE``in ``/ etc/openstack-dashboard/local_settings.py`` auf ``on``gesetzt ist.
id: **Fail:** Jika nilai parameter ``PASSWORD_AUTOCOMPLETE`` di ``/etc/openstack-dashboard/local_settings.py`` diatur ke ``on``.
tr_tr: **Başarısız:** Eğer ``/etc/openstack-dashboard/local_settings.py`` dosyasındaki ``PASSWORD_AUTOCOMPLETE`` parametresinin değeri ``on`` ise.

source: **Fail:** If value of parameter ``PASSWORD_VALIDATOR`` in ``/etc/openstack-dashboard/local_settings.py`` is set to allow all `"regex": '.*'`
de: **Fail:** Wenn der Wert des Parameters ``PASSWORD_VALIDATOR``in ``/etc /openstack-dashboard/local_settings.py``gesetzt ist, um alle `\regex\: '.*'` zu erlauben.
id: **Fail:** Jika nilai parameter ``PASSWORD_VALIDATOR`` di ``/etc/openstack-dashboard/local_settings.py`` disetel untuk mengizinkan semua `" regex ": '. *'`
tr_tr: **Başarısız:** ``/etc/openstack-dashboard/local_settings.py`` dosyasında ``PASSWORD_VALIDATOR`` parametresi `"regex": '.*',` ise.

source: **Fail:** If value of parameter ``SECURE_PROXY_SSL_HEADER`` in ``/etc/openstack-dashboard/local_settings.py`` is not set to ``'HTTP_X_FORWARDED_PROTO', 'https'`` or commented out.
de: **Fail:** Wenn der Wert des Parameters ``SECURE_PROXY_SSL_HEADER``in `` / etc/openstack-dashboard/local_settings.py``nicht auf `` ``'HTTP_X_FORWARDED_PROTO', 'https'`` gesetzt oder auskommentiert ist.
id: **Fail:** Jika nilai parameter ``SECURE_PROXY_SSL_HEADER`` di ``/etc/openstack-dashboard/local_settings.py`` tidak disetel ke ``'HTTP_X_FORWARDED_PROTO', 'https'`` atau berkomentar.
tr_tr: **Başarısız:** Eğer ``/etc/openstack-dashboard/local_settings.py`` dosyasındaki ``SECURE_PROXY_SSL_HEADER`` parametresinin değeri ``'HTTP_X_FORWARDED_PROTO', 'https'`` değil ise ya da yorum satırı ise.

source: **Fail:** If value of parameter ``SESSION_COOKIE_HTTPONLY`` in ``/etc/openstack-dashboard/local_settings.py`` is set to ``False``.
de: **Fail:** Wenn der Wert des Parameters ``SESSION_COOKIE_HTTPONLY``in `` / etc/openstack-dashboard/local_settings.py``auf ``False`` gesetzt ist.
id: **Fail:** Jika nilai parameter ``SESSION_COOKIE_HTTPONLY`` di ``/etc/openstack-dashboard/local_settings.py`` diatur ke ``False``.
tr_tr: **Başarısız:** Eğer ``/etc/openstack-dashboard/local_settings.py`` dosyasındaki ``SESSION_COOKIE_HTTPONLY`` parametresinin değeri ``False`` ise.

source: **Fail:** If value of parameter ``SESSION_COOKIE_SECURE`` in ``/etc/openstack-dashboard/local_settings.py`` is set to ``False``.
de: **Fail:** Wenn der Wert des Parameters ``SESSION_COOKIE_SECURE``in ``/ etc/openstack-dashboard/local_settings.py``auf ``False`` gesetzt ist.
id: **Fail:** Jika nilai parameter ``SESSION_COOKIE_SECURE`` di ``/etc/openstack-dashboard/local_settings.py`` diatur ke ``False``.
tr_tr: **Başarısız:** ``/etc/openstack-dashboard/local_settings.py`` dosyasındaki ``SESSION_COOKIE_SECURE`` parametresi ``False`` ise.

source: **Fail:** If value of parameter ``api_insecure`` under ``[glance]`` section in ``/etc/nova/nova.conf`` is set to ``True``, or if value of parameter ``api_servers`` under ``[glance]`` section in ``/etc/nova/nova.conf`` is set to a value that does not start with ``https://``.
de: **Fail:** Wenn der Wert des Parameters ``api_insecure`` unter dem ``[glance] ``Abschnitt in ``/etc/nova/nova.conf`` auf ``True`` gesetzt ist oder der Wert von des Parameter ``api_servers``unter dem ``[glance] ``Abschnitt in ``/etc/nova/nova.conf`` auf einen Wert gesetzt ist, der nicht mit ``https:// ``beginnt.
id: **Fail:** Jika nilai parameter ``api_insecure`` di bawah bagian ``[glance] `` di ``/etc/nova/nova.conf`` diatur ke ``True``, atau jika nilai parameter ``api_servers`` di bawah bagian ``[glance]`` di ``/etc/nova/nova.conf`` diatur ke nilai yang tidak dimulai dengan ``https://``.
tr_tr: **Başarılı:** ``/etc/nova/nova.conf`` dosyasındaki ``[glance]`` bölümündeki ``api_insecure`` parametresinin değeri ``True`` ise ve ``/etc/nova/nova.conf`` dosyasındaki ``[glance]`` bölümündeki ``api_servers`` parametresinin değeri ``https://`` ile başlayan bir değer değil ise.

source: **Fail:** If value of parameter ``auth_protocol`` under ``[keystone_authtoken]`` section in ``barbican.conf`` is set to ``http``, or if value of parameter ``identity_uri`` under ``[keystone_authtoken]`` section in ``barbican.conf`` is not set to Identity API endpoint starting with ``https://`` or value of parameter ``insecure`` under the same ``[keystone_authtoken]`` section in the same ``barbican.conf`` is set to ``True``.
de: ** Fail: ** Wenn der Wert des Parameters ``auth_protocol ``unter ``[keystone_authtoken]`` in ``barbican.conf`` auf ``http`` gesetzt ist oder wenn der Wert des Parameters ``identity_uri``unter ``[keystone_authtoken]``Abschnitt in ``barbican.conf`` ist nicht auf den Identity API Endpunkt gesetzt, der mit ``https: //`` beginnt oder Wert des Parameters ``insecure`` unter demselben ``[ keystone_authtoken] `` Abschnitt im selben `` barbican.conf`` ist auf ``True`` gesetzt.
id: **Fail:** Jika nilai parameter ``auth_protocol`` di bawah bagian ``[keystone_authtoken]``dalam ``barbican.conf`` diatur ke ``http``, atau jika nilai parameter ``identity_uri`` di bawah bagian ``[keystone_authtoken]`` dalam ``barbican.conf`` tidak disetel ke Identity API endpoint yang dimulai dengan ``https://`` atau nilai parameter ``insecure`` dibawah bagian ``[keystone_authtoken]`` yang sama dalam ``barbican.conf`` yang sama diatur ke ``True``.
