Repository: openstack/security-doc
Catalog: security-guide/source/locale/*/LC_MESSAGES/security-guide.po
Languages: de, id, tr_tr

source: Check-Block-02: Are strict permissions set for configuration files?
de: Check-Block-02: Sind strenge Berechtigungen für Konfigurationsdateien festgelegt?
id: Check-Block-02: Apakah izin ketat diatur untuk file konfigurasi?
tr_tr: Check-Block-02: Yapılandırma dosyaları için sıkı izinler ayarlandı mı?

source: Check-Block-03: Is keystone used for authentication?
de: Check-Block-03: Wird Keystone für die Authentifizierung verwendet?
id: Check-Block-03: Apakah keystone digunakan untuk otentikasi?
tr_tr: Check-Block-03: Kimlik doğrulama için keystone kullanıldı mı?

source: Check-Block-04: Is TLS enabled for authentication?
de: Check-Block-04: Ist TLS für die Authentifizierung aktiviert?
id: Check-Block-04: Apakah TLS diaktifkan untuk otentikasi?
tr_tr: Check-Block-04: Kimlik doğrulama için TLS etkinleştirilidi mi?

source: Check-Block-05: Does cinder communicate with nova over TLS?
de: Check-Block-05: Wird Cinder mit Nova über TLS kommunizieren?
id: Check-Block-05: Apakah cinder berkomunikasi dengan nova over TLS?
tr_tr: Check-Block-05: Cinder, nova ile TLS üzerinden haberleşiyor mu?

source: Check-Block-06: Does cinder communicate with glance over TLS?
de: Check-Block-06: Kommuniziert Cinder mit Glance über TLS?
id: Check-Block-06: Apakah cinder berkomunikasi dengan melirik (glance over) TLS?
tr_tr: Check-Block-06: Cinder, glance ile TLS üzerinden haberleşiyor mu?

source: Check-Block-07: Is NAS operating in a secure environment?
de: Check-Block-07: Ist der NAS-Betrieb in einer sicheren Umgebung?
id: Check-Block-07: Apakah NAS beroperasi di lingkungan yang aman?
tr_tr: Check-Block-07: NAS güvenli bir ortamda çalışıyor mu?

source: Check-Block-08: Is max size for the body of a request set to default (114688)?
de: Check-Block-08: Ist die maximale Größe für den Körper einer Anforderung auf Default gesetzt (114688)?
id: Check-Block-08: Apakah ukuran maks untuk body permintaan ditetapkan ke default (114688)?
tr_tr: Check-Block-08: Bir isteğin gövdesinin azami boyutu öntanımlı (114688) olarak ayarlandı mı?

source: Check-Block-09: Is the volume encryption feature enabled?
de: Check-Block-09: Ist die Volumenverschlüsselungsfunktion aktiviert?
id: Check-Block-09: Apakah fitur encryption volume diaktifkan?
tr_tr: Check-Block-09: Hacim şifreleme özelliği etkin mi?

source: Check-Compute-01: Is user/group ownership of config files set to root/nova?
de: Check-Compute-01: Ist User/Group Besitz von Konfigurationsdateien auf root/nova gesetzt?
id: Check-Compute-01: Apakah kepemilikan user/group dari file konfigurasi diatur ke root/nova?
tr_tr: Check-Compute-01: Yapılandırma dosyalarının kullanıcı/grup sahipleri root/nova mı?

source: Check-Compute-02: Are strict permissions set for configuration files?
de: Check-Compute-02: Sind für Konfigurationsdateien strenge Berechtigungen festgelegt?
id: Check-Compute-02: Apakah izin ketat diatur untuk file konfigurasi?
tr_tr: Check-Compute-02: Yapılandırma dosyalarındaki izinler sıkı mı?

source: Check-Compute-03: Is keystone used for authentication?
de: Check-Compute-03: Wird Keystone für die Authentifizierung verwendet?
id: Check-Compute-03: Apakah keystone digunakan untuk otentikasi?
tr_tr: Check-Compute-03: Kimlik doğrulamada keystone kullanıldı mı?

source: Check-Compute-04: Is secure protocol used for authentication?
de: Check-Compute-04: Wird ein sicheres Protokoll für die Authentifizierung verwendet?
id: Check-Compute-04: Apakah protokol aman digunakan untuk otentikasi?
tr_tr: Check-Compute-04: Kimlik doğrulama için güvenli bir protokol kullanıldı mı?

source: Check-Compute-05: Does Nova communicate with Glance securely?
de: Check-Compute-05: Ist Nova mit dem Blick sicher zu kommunizieren?
id: Check-Compute-05: Apakah Nova berkomunikasi dengan Glance dengan aman?
tr_tr: Check-Compute-05: Nova, Glance ile güvenli bir şekilde haberleşiyor mu?

source: Check-Dashboard-01: Is user/group of config files set to root/horizon?
de: Check-Dashboard-01: Ist Benutzer/Gruppe von Konfigurationsdateien auf root/horizon gesetzt?
id: Check-Dashboard-01: Apakah user/grup file konfigurasi diset ke root/horizon?
tr_tr: Check-Dashboard-01: Yapılandırma dosyalarının kullanıcı/grup ayarları root/horizon mu?

source: Check-Dashboard-02: Are strict permissions set for horizon configuration files?
de: Check-Dashboard-02: Sind strenge Berechtigungen für Horizon-Konfigurationsdateien festgelegt?
id: Check-Dashboard-02: Apakah izin ketat diatur untuk file konfigurasi horizon?
tr_tr: Check-Dashboard-02: Horizon yapılandırma dosyaları için sıkı izinler ayarlandı mı?

source: Check-Dashboard-03: Is ``DISALLOW_IFRAME_EMBED`` parameter set to ``True``?
de: Check-Dashboard-03: Ist ``DISALLOW_IFRAME_EMBED``Parameter auf ``True`` gesetzt?
id: Check-Dashboard-03: Apakah parameter ``DISALLOW_IFRAME_EMBED`` disetel ke `` True``?
tr_tr: Check-Dashboard-03: ``DISALLOW_IFRAME_EMBED`` parametresi ``True`` mu?

source: Check-Dashboard-04: Is ``CSRF_COOKIE_SECURE`` parameter set to ``True``?
de: Check-Dashboard-04: Ist ``CSRF_COOKIE_SECURE``Parameter auf ``True`` gesetzt?
id: Check-Dashboard-04: Apakah parameter ``CSRF_COOKIE_SECURE`` disetel ke ``True``?
tr_tr: Check-Dashboard-04: ``CSRF_COOKIE_SECURE`` parametresi ``True`` mu?

source: Check-Dashboard-05: Is ``SESSION_COOKIE_SECURE`` parameter set to ``True``?
de: Check-Dashboard-05: Ist ``SESSION_COOKIE_SECURE``Parameter auf ``True`` gesetzt?
id: Check-Dashboard-05: Apakah parameter ``SESSION_COOKIE_SECURE`` disetel ke ``True``?
tr_tr: Check-Dashboard-05: ``SESSION_COOKIE_SECURE`` parametresi ``True`` mu?

source: Check-Dashboard-06: Is ``SESSION_COOKIE_HTTPONLY`` parameter set to ``True``?
de: Check-Dashboard-06: Ist ``SESSION_COOKIE_HTTPONLY``Parameter auf ``True`` gesetzt?
id: Check-Dashboard-06: Apakah parameter ``SESSION_COOKIE_HTTPONLY`` disetel ke ``True``?
tr_tr: Check-Dashboard-06: ``SESSION_COOKIE_HTTPONLY`` parametresinin değeri ``True`` mu?

source: Check-Dashboard-07: Is ``PASSWORD_AUTOCOMPLETE`` set to ``False``?
de: Check-Dashboard-07: Ist ``PASSWORD_AUTOCOMPLETE``auf ``False``gesetzt?
id: Check-Dashboard-07: Apakah ``PASSWORD_AUTOCOMPLETE`` disetel ke ``False``?
tr_tr: Check-Dashboard-07: ``PASSWORD_AUTOCOMPLETE`` parametresinin değeri ``False`` mu?

source: Check-Dashboard-08: Is ``DISABLE_PASSWORD_REVEAL`` set to ``True``?
de: Check-Dashboard-08: Ist ``DISABLE_PASSWORD_REVEAL``auf ``True``gesetzt?
id: Check-Dashboard-08: Apakah ``DISABLE_PASSWORD_REVEAL`` disetel ke ``True``?
tr_tr: Check-Dashboard-08: ``DISABLE_PASSWORD_REVEAL`` parametresi ``True`` mu?

source: Check-Dashboard-09: Is ``ENFORCE_PASSWORD_CHECK`` set to ``True``?
de: Check-Dashboard-09: Ist ``ENFORCE_PASSWORD_CHECK`` auf ``True``gesetzt?
id: Check-Dashboard-09: Apakah ``ENFORCE_PASSWORD_CHECK`` disetel ke ``True``?
tr_tr: Check-Dashboard-09: ``ENFORCE_PASSWORD_CHECK`` değeri ``True`` mu?

source: Check-Dashboard-10: Is ``PASSWORD_VALIDATOR`` configured?
de: Check-Dashboard-10: Ist ``PASSWORD_VALIDATOR``konfiguriert?
id: Check-Dashboard-10: Apakah ``PASSWORD_VALIDATOR`` dikonfigurasi?
tr_tr: Check-Dashboard-10: ``PASSWORD_VALIDATOR`` yapılandırıldı mı?

source: Check-Dashboard-11: Is ``SECURE_PROXY_SSL_HEADER`` configured?
de: Check-Dashboard-11: Ist ``SECURE_PROXY_SSL_HEADER``konfiguriert?
id: Check-Dashboard-11: Apakah ``SECURE_PROXY_SSL_HEADER`` dikonfigurasi?
tr_tr: Check-Dashboard-11: ``SECURE_PROXY_SSL_HEADER`` yapılandırıldı mı?

source: Check-Identity-01: Is user/group ownership of config files set to keystone?
de: Check-Identity-01: Ist Benutzer/Gruppenbesitz von Konfigurationsdateien auf Keystone gesetzt?
id: Check-Identity-01: Apakah kepemilikan user/group dari file konfigurasi diatur ke keystone?
tr_tr: Check-Identity-01: Yapılandırma dosyalarının kullanıcı/grup sahipliği keystone mu?

source: Check-Identity-02: Are strict permissions set for Identity configuration files?
de: Check-Identity-02: Sind die Berechtigungen für Identitätskonfigurationsdateien festgelegt?
id: Check-Identity-02: Apakah izin ketat ditetapkan untuk file konfigurasi Identity?
tr_tr: Check-Identity-02: Kimlik yapılandırma dosyaları için sıkı izinler ayarlandı mı?

source: Check-Identity-03: is TLS enabled for Identity?
de: Check-Identity-03: Ist TLS für Identity aktiviert?
id: Check-Identity-03: Apakah TLS diaktifkan untuk Identity?
tr_tr: Check-Identity-03: Kimlik için TLS etkinleştirildi mi?

source: Check-Identity-04: Does Identity use strong hashing algorithms for PKI tokens?
de: Check-Identity-04: Verwendet Identity starke Hash-Algorithmen für PKI-Token?
id: Check-Identity-04: Apakah Identity menggunakan algoritma hashing yang kuat untuk token PKI?
tr_tr: Check-Identity-04: Kimlik, PKI belirteçleri için güçlü özet algoritmeları kullanıyor mu?

source: Check-Identity-05: Is ``max_request_body_size`` set to default (114688)?
de: Check-Identity-05: Ist ``max_request_body_size``auf Standard gesetzt (114688)?
id: Check-Identity-05: Apakah ``max_request_body_size`` disetel ke default (114688)?
tr_tr: Check-Identity-05: ``max_request_body_size`` parametresinin değeri öntanımlıya (114688) ayarlandı mı?

source: Check-Identity-06: Disable admin token in ``/etc/keystone/keystone.conf``
de: Check-Identity-06: Deaktivieren Sie das Admin-Token in ``/etc/keystone/keystone.conf``
id: Check-Identity-06:Nonaktifkan token admin masuk ``/etc/keystone/keystone.conf``
tr_tr: Check-Identity-06: ``/etc/keystone/keystone.conf`` dosyasındaki yönetici belirtecini devre dışı bırakmak

source: Check-Identity-08: Use fernet token in ``/etc/keystone/keystone.conf``
de: Check-Identity-08: Benutzt Fernet-Token in ``/etc/keystone/keystone.conf``
id: Check-Identity-08: Gunakan token fernet di ``/etc/keystone/keystone.conf``

source: Check-Image-01: Is user/group ownership of config files set to root/glance?
de: Check-Image-01: Ist Benutzer/Gruppenbesitz von Konfigurationsdateien auf root/glance gesetzt?
id: Check-Image-01: Apakah kepemilikan user/group dari file konfigurasi diset ke root/glance?
tr_tr: Check-Image-01: Yapılandırma dosyalarının kullanıcı/grup sahipliği root/glance mi?

source: Check-Image-02: Are strict permissions set for configuration files?
de: Check-Image-02: Sind für Konfigurationsdateien strenge Berechtigungen festgelegt?
id: Check-Image-02: Apakah izin ketat diatur untuk file konfigurasi?
tr_tr: Check-Image-02: Yapılandırma dosyaları için sıkı izinler ayarlandı mı?

source: Check-Image-03: Is keystone used for authentication?
de: Check-Image-03: Wird Keystone für die Authentifizierung verwendet?
id: Check-Image-03: Apakah keystone digunakan untuk otentikasi?
tr_tr: Check-Image-03: Kimlik doğrulama için keystone kullanıldı mı?

source: Check-Image-04: Is TLS enabled for authentication?
de: Check-Image-04: Ist TLS zur Authentifizierung aktiviert?
id: Check-Image-04: Apakah TLS diaktifkan untuk otentikasi?
tr_tr: Check-Image-04: Kimlik doğrulama için TLS etkinleştirildi mi?

source: Check-Key-Manager-01: Is the ownership of config files set to root/barbican?
de: Check-Key-Manager-01: Ist der Eigentümer der Konfigurationsdatei gesetzt auf root/barbican?
id: Check-Key-Manager-01: Apakah kepemilikan file konfigurasi diset ke root/barbican?

source: Check-Key-Manager-02: Are strict permissions set for configuration files?
de: Check-Key-Manager-02: Sind für Konfigurationsdateien strenge Berechtigungen festgelegt?
id: Check-Key-Manager-02: Apakah izin ketat diatur untuk file konfigurasi?

source: Check-Key-Manager-03: Is OpenStack Identity used for authentication?
de: Check-Key-Manager-03: Wird OpenStack Identity zur Authentifizierung verwendet?
id: Check-Key-Manager-03: Apakah OpenStack Identity digunakan untuk otentikasi?

source: Check-Key-Manager-04: Is TLS enabled for authentication?
de: Check-Key-Manager-04: Ist TLS zur Authentifizierung aktiviert?
id: Check-Key-Manager-04: Apakah TLS diaktifkan untuk otentikasi?

source: Check-Neutron-01: Is user/group ownership of config files set to root/neutron?
de: Check-Neutron-01: Ist User/Group Besitz von Konfigurationsdateien auf root/neutron gesetzt?
id: Check-Neutron-01: Apakah kepemilikan user/group dari file konfigurasi diset ke root/neutron?
tr_tr: Check-Neutron-01: Yapılandırma dosyalarının kullanıcı/grup sahipliği root/neutron mu?

source: Check-Neutron-02: Are strict permissions set for configuration files?
de: Check-Neutron-02: Sind strenge Berechtigungen für Konfigurationsdateien festgelegt?
id: Check-Neutron-02: Apakah izin ketat diatur untuk file konfigurasi?
tr_tr: Check-Neutron-02: Yapılandırma dosyaları için sıkı izinler ayarlandı mı?

source: Check-Neutron-03: Is keystone used for authentication?
de: Check-Neutron-03: Ist Keystone für die Authentifizierung verwendet?
id: Check-Neutron-03: Apakah keystone digunakan untuk otentikasi?
tr_tr: Check-Neutron-03: Kimlik doğrulama için keystone kullanıldı mı?

source: Check-Neutron-04: Is secure protocol used for authentication?
de: Check-Neutron-04: Ist sicheres Protokoll für die Authentifizierung verwendet?
id: Check-Neutron-04: Apakah protokol aman digunakan untuk otentikasi?
tr_tr: Check-Neutron-04: Kimlik doğrulama için güvenli protokol kullanıldı mı?

source: Check-Neutron-05: Is TLS enabled on Neutron API server?
de: Check-Neutron-05: Ist TLS auf Neutron API Server aktiviert?
id: Check-Neutron-05: Apakah TLS diaktifkan pada server API Neutron?
tr_tr: Check-Neutron-05: Neutron API sunucusunda TLS etkinleştirildi mi?

source: Check-Shared-01: Is user/group ownership of config files set to root/manila?
de: Check-Shared-01: Ist User/Group Besitz von Konfigurationsdateien auf root/manila gesetzt?
id: Check-Shared-01: Apakah user/group kepemilikan file konfigurasi diset ke root/manila?
tr_tr: Check-Shared-01: Yapılandırma dosyalarının kullanıcı/grup sahipliği root/manila mı?

source: Check-Shared-02: Are strict permissions set for configuration files?
de: Check-Shared-02: Sind strenge Berechtigungen für Konfigurationsdateien festgelegt?
id: Check-Shared-02: Apakah ada izin ketat diatur untuk file konfigurasi?
tr_tr: Check-Shared-02: Yapılandırma dosyalarının izinleri sıkı olarak ayarlandı mı?

source: Check-Shared-03: Is OpenStack Identity used for authentication?
de: Check-Shared-03: Wird OpenStack Identity für die Authentifizierung verwendet?
id: Check-Shared-03: Apakah OpenStack Identity digunakan untuk otentikasi?
tr_tr: Check-Shared-03: Kimlik doğrulama için OpenStack Kimlik kullanıldı mı?

source: Check-Shared-04: Is TLS enabled for authentication?
de: Check-Shared-04: Ist TLS für die Authentifizierung aktiviert?
id: Check-Shared-04: Apakah TLS diaktifkan untuk otentikasi?
tr_tr: Check-Shared-04: Kimlik doğrulama için TLS etkinleştirildi mi?

source: Check-Shared-05: Does Shared File Systems contact with Compute over TLS?
de: Check-Shared-05: Gemeinsame Dateisysteme kontaktieren sich mit Compute über TLS?
id: Check-Shared-05: Apakah Shared File Systems kontak dengan Compute over TLS?
tr_tr: Check-Shared-05: Paylaşımlı Dosya Sistemleri, Hesaplama ile TLS üzerinden mi haberleşiyor?

source: Check-Shared-06: Does Shared File Systems contact with Networking over TLS?
de: Check-Shared-06: Gemeinsame Dateisysteme kontaktieren sich mit Networking über TLS?
id: Check-Shared-06: Apakah Shared File Systems kontak dengan Networking over TLS?
tr_tr: Check-Shared-06: Paylaşımlı Dosya Sistemleri Ağ ile TLS üzerinden mi haberleşiyor?

source: Check-Shared-07: Does Shared File Systems contact with Block Storage over TLS?
de: Check-Shared-07: Gemeinsame Dateisysteme kontaktieren sich mit Block Storage über TLS?
id: Check-Shared-07: Apakah Shared File Systems kontak dengan Block Storage over TLS?
tr_tr: Check-Shared-07: Paylaşımlı Dosya Sistemleri Blok Depolama ile TLS üzerinden mi haberleşiyor?

source: Check-Shared-08: Is max size for the request body set to default (114688)?
de: Check-Shared-08: Ist die maximale Größe für das Anforderungskörper auf den Standard eingestellt (114688)?
id: Check-Shared-08: Apakah ukuran maksimal untuk badan permintaan diatur ke default (114688)?
tr_tr: Check-Shared-08: İstek gövdesinin azami boyutu öntanımlı (114688) olarak ayarlandı mı?

source: Checklist
de: Checkliste
id: Daftar periksa
tr_tr: Kontrol listesi

source: Cinder supports an NFS driver which works differently than a traditional block storage driver. The NFS driver does not actually allow an instance to access a storage device at the block level. Instead, files are created on an NFS share and mapped to instances, which emulates a block device. Cinder supports secure configuration for such files by controlling the file permissions when cinder volumes are created. Cinder configuration can also control whether file operations are run as the root user or the current OpenStack process user.
de: Cinder unterstützt einen NFS-Treiber, der anders arbeitet als ein herkömmlicher Blockspeichertreiber. Der NFS-Treiber erlaubt nicht, dass eine Instanz auf Blockspeicher auf ein Speichergerät zugreift. Stattdessen werden Dateien auf einer NFS-Freigabe erstellt und auf Instanzen abgebildet, die ein Blockgerät emuliert. Cinder unterstützt die sichere Konfiguration für solche Dateien, indem es die Dateiberechtigungen steuert, wenn Cinder-Volumes erstellt werden. Die Cinder-Konfiguration kann auch steuern, ob Dateiverwendungen als Root-Benutzer oder der aktuelle OpenStack-Prozessbenutzer ausgeführt werden.
id: Cinder mendukung driver NFS yang bekerja berbeda dari driver penyimpanan blok tradisional. Driver NFS sebenarnya tidak mengizinkan sebuah instance untuk mengakses perangkat penyimpanan di tingkat blok. Sebagai gantinya, file dibuat pada pembagian NFS dan dipetakan ke instance, yang mengemulasi perangkat blokir. Cinder mendukung konfigurasi yang aman untuk file seperti itu dengan mengendalikan hak akses file saat volume cinder dibuat. Konfigurasi cinder juga dapat mengontrol apakah operasi file dijalankan sebagai pengguna root atau pengguna proses OpenStack saat ini.
tr_tr: Cinder, geleneksel blok depolama srücülerinden farklı bir şekilde çalışan NFS sürücüsünü destekler. NFS sürücüsü, depolama aygıtına blok seviyesinde erişimine aslında izin vermez. Bunun yerine, dosyalar NFS paylaşımında oluşturulur ve örneklere eşlenir. Cinder, cinder bolümleri oluşturulurken dosya izinlerini kontrol ederek güvenli yapılandırma destekler. Cinder yapılandırması ayrıca dosya işlemlerinin root kullanıcısı ya da OpenStack süreç kullanıcısı ile mi çalıştırılacağını edileceiğini kontrol edebilir.

source: Cinder volume data
de: Cinder Volumen Daten
id: Data volume Cinder
tr_tr: Cinder hacim verisi

source: Cipher string options are separated by ":", while "!" provides negation of the immediately following element. Element order indicates preference unless overridden by qualifiers such as HIGH. Let us take a closer look at the elements in the above sample strings.
de: Cipher-String-Optionen werden durch ":" getrennt, während "!" eine Negation des unmittelbar folgenden Elements bedeutet. Element-Reihenfolge zeigt Präferenz an, wenn sie nicht durch Qualifikationen wie HIGH überschrieben wird. Schauen wir uns die Elemente in den obigen Sample-Strings genauer an.
id: Pilihan string cipher dipisahkan oleh ":", while "!" memberikan penolakan dari elemen berikut ini. Urutan elemen menunjukkan preferensi kecuali diganti oleh kualifikasi seperti HIGH. Mari kita lihat lebih dekat unsur-unsur dalam contoh string di atas.
tr_tr: Şifreleme dizgesi seçenekleri ":" ile ayrılırken "!" hemen takip eden ögenin tersini sağlar. Öğe sırası, HIGH gibi niteleyiciler tarafından geçersiz kılınmadığı sürece tercihi gösterir. Yukarıdaki örnek dizesindeki öğelere daha yakından bir göz atalım.

source: Cipher suites using the `RSA <https://en.wikipedia.org/wiki/RSA_%28cryptosystem%29>`_ exchange, authentication or either respectively.
de: Cipher Suiten mit dem `RSA <https://en.wikipedia.org/wiki/RSA_%28cryptosystem%29>``Austausch, Authentifizierung oder entweder.
id: Cipher suite menggunakan `RSA <https://en.wikipedia.org/wiki/RSA_%28cryptosystem%29>`_ pertukaran, otentikasi atau masing-masing.
tr_tr: Şifreleme takımları, `RSA <https://en.wikipedia.org/wiki/RSA_%28cryptosystem%29>` _ değiştirme, kimlik doğrulama veya sırasıyla kullanır.

source: Client authentication with TLS requires certificates be issued to services. These certificates can be signed by an external or internal certificate authority. OpenStack services check the validity of certificate signatures against trusted CAs by default and connections will fail if the signature is not valid or the CA is not trusted. Cloud deployers may use self-signed certificates. In this case, the validity check must be disabled or the certificate should be marked as trusted. To disable validation of self-signed certificates, set ``insecure=False`` in the ``[filter:authtoken]`` section in the ``/etc/nova/api.paste.ini`` file. This setting also disables certificates for other components.
de: Die Client-Authentifizierung mit TLS verlangt, dass Zertifikate an Dienste ausgegeben werden. Diese Zertifikate können von einer externen oder internen Zertifizierungsstelle unterzeichnet werden. OpenStack-Dienste überprüfen die Gültigkeit von Zertifikatsignaturen standardmäßig auf vertrauenswürdige CAs und Verbindungen werden fehlschlagen, wenn die Signatur nicht gültig ist oder die Zertifizierungsstelle nicht vertraut ist. Cloud-Implementierer können selbst signierte Zertifikate verwenden. In diesem Fall muss die Gültigkeitsprüfung deaktiviert oder das Zertifikat als vertrauenswürdig markiert werden. Um die Validierung von selbst signierten Zertifikaten zu deaktivieren, setzen Sie ``insecure=False`` im ``[filter: authtoken] `` Abschnitt in der ``/etc/nova/api.paste.ini``Datei. Diese Einstellung deaktiviert auch Zertifikate für andere Komponenten.
id: Otentikasi klien dengan TLS mengharuskan sertifikat dikeluarkan untuk layanan. Sertifikat ini dapat ditandatangani oleh otoritas sertifikat eksternal atau internal. Layanan OpenStack memeriksa validitas tanda tangan sertifikat terhadap CA yang terpercaya secara default dan koneksi akan gagal jika tanda tangan tidak valid atau CA tidak dipercaya. Penyebar awan dapat menggunakan sertifikat yang ditandatangani sendiri. Dalam kasus ini, pemeriksaan validitas harus dinonaktifkan atau sertifikat harus ditandai sebagai terpercaya. Untuk menonaktifkan validasi sertifikat self-signed, set ``insecure = False`` di bagian ``[filter: authtoken]`` di file ``/etc/nova/api.paste.ini``. Pengaturan ini juga menonaktifkan sertifikat untuk komponen lainnya.
tr_tr: TLS ile istemci kimlik doğrulaması, servislere sertifika verilmesini gerektirir. Bu sertifikalar, harici veya dahili bir sertifika otoritesi tarafından imzalanabilir. OpenStack servisleri, sertifika imzalarının güvenilir CA'lara karşı geçerliliğini kontrol eder ve imza geçerli değilse veya CA güvenilir değilse bağlantılar başarısız olur. Bulut dağıtımcıları kendinden imzalı sertifikalar kullanabilir. Bu durumda, geçerlilik denetimi devre dışı bırakılmalıdır veya sertifika güvenilir olarak işaretlenmelidir. Kendi kendine imzalanan sertifikaların geçerliliğini kaldırmak için, ``/etc/nova/api.paste.ini`` dosyasındaki ``[filter:authtoken]`` bölümünde ``insecure=False`` değerini ayarlayın. Bu ayar, diğer bileşenlerin sertifikalarını da devre dışı bırakır.

source: Client->API Process *[TLS]*:
de: Client->API-Prozess *[TLS]*:
tr_tr: İstemci->API Süreci *[TLS]*:
