Repository: openstack/security-doc
Catalog: security-guide/source/locale/*/LC_MESSAGES/security-guide.po
Languages: de, id, tr_tr

source: A federated user may request a :term:`scoped token`, by using the unscoped token. A project or domain may be specified by either ID or name. An ID is sufficient to uniquely identify a project or domain. For example,
de: Ein föderierter Benutzer kann einen :term:`scoped token` anfordern, indem er das nicht kopierte Token verwendet. Ein Projekt oder eine Domain kann entweder durch ID oder Name angegeben werden. Eine ID genügt, um ein Projekt oder eine Domäne eindeutig zu identifizieren. Beispielsweise,
tr_tr: Bir federe kullanıcı, kapsamsız belirteç kullanarak, :term:`kapsamlı belirteç` isteyebilir. Bir proje veya etki alanı kimliği veya adı tarafından belirtilebilir. Bir kimlik, bir projeyi veya alan adını benzersiz şekilde tanımlamak için yeterlidir. Örneğin,

source: A hardware infection occurs when an instance makes a malicious modification to the firmware or some other part of a device. As this device is used by other instances or the host OS, the malicious code can spread into those systems. The end result is that one instance can run code outside of its security domain. This is a significant breach as it is harder to reset the state of physical hardware than virtual hardware, and can lead to additional exposure such as access to the management network.
de: Eine Hardware-Infektion tritt auf, wenn eine Instanz eine bösartige Änderung an der Firmware oder einem anderen Teil eines Geräts vornimmt. Da dieses Gerät von anderen Instanzen oder dem Host-Betriebssystem verwendet wird, kann sich der bösartige Code in diese Systeme verteilen. Das Endergebnis ist, dass eine Instanz Code außerhalb ihrer Sicherheitsdomäne ausführen kann. Dies ist eine signifikante Verletzung, da es schwieriger ist, den Zustand der physischen Hardware als die virtuelle Hardware zurückzusetzen und kann zu einer zusätzlichen Belichtung wie dem Zugriff auf das Verwaltungsnetzwerk führen.
id: Sebuah infeksi perangkat keras terjadi ketika sebuah instance membuat modifikasi berbahaya ke firmware atau bagian lain dari perangkat. Karena perangkat ini digunakan oleh instance lain atau host OS, kode berbahaya dapat menyebar ke sistem tersebut. Hasil akhirnya adalah satu instance dapat menjalankan kode di luar domain keamanannya. Ini adalah pelanggaran yang signifikan karena lebih sulit untuk mengatur ulang keadaan perangkat keras fisik daripada perangkat keras virtual, dan dapat menyebabkan pembukaan (exposure) tambahan seperti akses ke jaringan manajemen.
tr_tr: Bir donanımsal bozulma, bir örnek donanım yazılımında veya bir aygıtın bazı bölümlerinde kötü amaçlı bir değişiklik yaparsa oluşur. Bu aygıt, başka örneklerle veya ana bilgisayar işletim sistemi tarafından kullanıldığı için, kötü niyetli kod bu sistemlere yayılabilir. Sonuçta, bir örnek güvenlik alanının dışında bir kod çalıştırabilir. Fiziksel donanımın durumunu sanal donanımdan daha zor hale getirdiği için bu durum önemli bir ihlaldir ve yönetim ağına erişim gibi ilave riske neden olabilir.

source: A hybrid cloud is defined by NIST as a composition of two or more distinct cloud infrastructures, such as private, community, or public, that remain unique entities, but are bound together by standardized or proprietary technology that enables data and application portability, such as cloud bursting for load balancing between clouds. For example, an online retailer might present their advertising and catalogue on a public cloud that allows for elastic provisioning. This would enable them to handle seasonal loads in a flexible, cost-effective fashion. Once a customer begins to process their order, they are transferred to a more secure private cloud that is PCI compliant.
de: Eine Hybrid-Cloud wird von NIST als Komposition von zwei oder mehr verschiedenen Cloud-Infrastrukturen definiert, wie z.B. Private, Community oder Public, die eindeutige Entitäten bleiben, aber durch eine standardisierte oder proprietäre Technologie miteinander verbunden sind, die Daten- und Anwendungsportabilität ermöglicht Cloud Bursting für Lastausgleich zwischen Clouds. Zum Beispiel kann ein Online-Händler seine Werbung und Katalog auf einer öffentlichen Cloud präsentieren, die eine elastische Bereitstellung ermöglicht. Dies würde es ihm ermöglichen, saisonale Lasten in einer flexiblen, kostengünstigen Weise zu behandeln. Sobald ein Kunde beginnt, seine Bestellung zu verarbeiten, werden sie auf das sicherere private Cloud-Backend übertragen, das PCI-konform ist.
id: Sebuah awan hibrida didefinisikan oleh NIST sebagai komposisi dari dua atau lebih infrastruktur awan yang berbeda, seperti private, community, atau public, yang tetap merupakan entitas unik, namun terikat bersama oleh teknologi standar atau proprietary yang memungkinkan portabilitas data dan aplikasi, seperti cloud bursting untuk load balancing antara awan. Misalnya, peritel online dapat menampilkan iklan dan katalog mereka di awan publik yang memungkinkan penyediaan elastis. Ini akan memungkinkan mereka menangani beban musiman dengan cara yang fleksibel dan hemat biaya. Begitu pelanggan mulai memproses pesanan mereka, mereka akan ditransfer ke awan pribadi yang lebih aman yang sesuai dengan PCI.

source: A hypervisor runs independent virtual machines. This hypervisor can run in an operating system or directly on the hardware (called baremetal). Updates to the hypervisor are not propagated down to the virtual machines. For example, if a deployment is using XenServer and has a set of Debian virtual machines, an update to XenServer will not update anything running on the Debian virtual machines.
de: Ein Hypervisor betreibt unabhängige virtuelle Maschinen. Dieser Hypervisor kann in einem Betriebssystem oder direkt auf der Hardware laufen (genannt Baremetal). Updates zum Hypervisor werden nicht auf die virtuellen Maschinen übertragen. Wenn zum Beispiel eine Bereitstellung XenServer verwendet und eine Reihe von virtuellen Maschinen hat, wird ein Update auf XenServer nichts aktualisieren, was auf den virtuellen Maschinen ausgeführt wird.
id: Sebuah hypervisor menjalankan mesin virtual independen. Hypervisor ini bisa berjalan di sistem operasi atau langsung pada perangkat keras (disebut baremetal). Pembaruan hypervisor tidak disebarkan ke mesin virtual. Misalnya, jika penggelaran menggunakan XenServer dan memiliki satu set mesin virtual Debian, pembaruan ke XenServer tidak akan memperbarui apa pun yang berjalan di mesin virtual Debian.
tr_tr: Bir hipervizör, bağımsız sanal makineleri çalıştırır. Bu hipervizör bir işletim sisteminde veya doğrudan donanımda (baremetal olarak adlandırılır) çalışabilir. Hipervizördeki güncellemeler, sanal makinelere iletilmez. Örneğin, bir dağıtım, XenServer'ı kullanıyorsa ve bir Debian sanal makinelerine sahipse, XenServer'a yapılan bir güncelleme, Debian sanal makinelerinde çalışan bir şeyi güncelleyemez.

source: A list of known plug-ins provided by the open source community or by SDN companies that work with OpenStack Networking is available at `OpenStack neutron plug-ins and drivers wiki page <https://wiki.openstack.org/wiki/Neutron_Plugins_and_Drivers>`__.
de: Eine Liste der bekannten Plug-Ins, die von der Open-Source-Community oder von SDN-Unternehmen bereitgestellt werden, die mit OpenStack Networking arbeiten, ist unter `OpenStack Neutron-Plug-Ins und Treiber-Wiki-Seite verfügbar <https://wiki.openstack.org/wiki/Neutron_Plugins_and_Drivers>`__.
id: Daftar plug-in yang diketahui disediakan oleh komunitas open source atau oleh perusahaan SDN yang bekerja dengan OpenStack Networking tersedia di `OpenStack neutron plug-ins and drivers wiki page <https://wiki.openstack.org/wiki/Neutron_Plugins_and_Drivers>`__.
tr_tr: Açık kaynak topluluğu veya OpenStack Ağ ile çalışan SDN şirketleri tarafından sağlanan bilinen eklentilerin bir listesi `OpenStack neutron eklentileri ve sürücüler wiki sayfası <https://wiki.openstack.org/wiki/Neutron_Plugins_and_Drivers>`__ adresinde bulunabilir.

source: A list of the components of the deployed project excluding external entities. Each component should be named and have a brief description of its purpose, and be labeled with the primary technology used (e.g. Python, MySQL, RabbitMQ).
de: Eine Liste der Komponenten des eingesetzten Projekts ohne externe Entitäten. Jede Komponente sollte benannt werden und eine kurze Beschreibung ihres Zweckes haben und mit der verwendeten Primärtechnologie (z.B. Python, MySQL, RabbitMQ) beschriftet werden.
id: Daftar komponen proyek yang dikerahkan tidak termasuk entitas eksternal. Setiap komponen harus diberi nama dan memiliki deskripsi singkat tentang tujuannya, dan diberi label dengan teknologi utama yang digunakan (misalnya Python, MySQL, RabbitMQ).
tr_tr: Dış öğeleri hariç tutarak dağıtılan projenin bileşenleri listesi. Her bileşen adlandırılmalı ve amacına ilişkin kısa bir açıklama yapmalı ve kullanılan birincil teknoloji ile etiketlenmelidir (ör. Python, MySQL, RabbitMQ).

source: A list of the expected primary users of the implemented architecture and their use-cases. 'Users' can either be actors or other services within OpenStack.
de: Eine Liste der erwarteten Primärbenutzer der implementierten Architektur und ihrer Anwendungsfälle. 'Benutzer' können entweder Akteure oder andere Dienste in OpenStack sein.
id: Daftar pengguna primer yang diharapkan dari arsitektur yang diterapkan dan use-case nya. 'Users' bisa jadi aktor atau layanan lainnya di dalam OpenStack.
tr_tr: Uygulanan mimarinin beklenen birincil kullanıcılarının ve kullanım durumlarının bir listesi. 'Kullanıcılar', aktörler veya OpenStack içindeki diğer servisler olabilir.

source: A local directory can also be used (``local``), but is considered insecure and not suitable for a production enviroment.
de: Es kann auch ein lokales Verzeichnis benutzt werden (``local``), aber das ist für Produktionseinsätze nicht zweckdienlich.

source: A mutual authentication network protocol using 'tickets' to secure communication between client and server. The Kerberos ticket-granting ticket can be used to securely provide tickets for a given service.
de: Ein gegenseitiges Authentifizierungsnetzwerk mit 'Tickets' zur sicheren Kommunikation zwischen Client und Server. Das Kerberos Ticket-Granting-Ticket kann verwendet werden, um sicher Tickets für einen bestimmten Service zu erbringen.
id: Protokol jaringan otentikasi bersama menggunakan 'tickets' untuk mengamankan komunikasi antara client dan server. Tiket Kerberos ticket-granting dapat digunakan untuk menyediakan tiket secara aman dengan layanan yang ada.
tr_tr: İstemci ve sunucu arasındaki iletişimi sağlamak için 'biletler' kullanan karşılıklı kimlik doğrulama ağı protokolü. Kerberos bilet verme bileti, belirli bir hizmet için güvenli bir şekilde bilet sağlamada kullanılabilir.

source: A network topology should be provided with highlights specifically calling out the data flows and bridging points between the security domains. Network ingress and egress points should be identified along with any OpenStack logical system boundaries. Multiple diagrams might be needed to provide complete visual coverage of the system. A network topology document should include virtual networks created on behalf of tenants by the system along with virtual machine instances and gateways created by OpenStack.
de: Eine Netzwerktopologie sollte mit Highlights versehen werden, die ausdrücklich die Datenströme und Brückenpunkte zwischen den Sicherheitsdomänen aufruft. Netzwerk-Eingangs- und Ausgangspunkte sollten mit allen offenen logischen Systemgrenzen identifiziert werden. Es können mehrere Diagramme benötigt werden, um eine vollständige visuelle Abdeckung des Systems zu gewährleisten. Ein Netzwerk-Topologie-Dokument sollte virtuelle Netzwerke enthalten, die im Auftrag von Tenants durch das System zusammen mit virtuellen Maschineninstanzen und Gateways erstellt wurden, die von OpenStack erstellt wurden.
id: Topologi jaringan harus dilengkapi dengan highlight (sorotan) yang secara khusus memanggil arus data dan bridging point (titik penjembatan) di antara domain keamanan. Network ingress dan egress point harus diidentifikasi bersamaan dengan batasan sistem logis OpenStack manapun. Beberapa diagram mungkin diperlukan untuk menyediakan cakupan visual lengkap dari sistem. Dokumen topologi jaringan harus mencakup jaringan virtual yang dibuat atas nama penyewa oleh sistem beserta instance mesin virtual dan gateway yang dibuat oleh OpenStack.

source: A notable difference in the attack surface of public clouds is that they must provide internet access to their services. Instance connectivity, access to files over the internet and the ability to interact with the cloud controlling fabric such as the API endpoints and dashboard are must-haves for the public cloud.
de: Ein bemerkenswerter Unterschied in der Angriffsfläche der öffentlichen Clouds ist, dass sie Internet-Zugang zu ihren Dienstleistungen bieten müssen. Instanz-Konnektivität, Zugriff auf Dateien über das Internet und die Fähigkeit, mit dem Cloud-Controlling-Gewebe wie die API-Endpunkte und Dashboard zu interagieren, sind Must-Haves für die öffentliche Cloud.
id: Perbedaan yang mencolok di permukaan serangan awan publik adalah mereka harus menyediakan akses internet ke layanan mereka. Instance connectivity, akses ke file melalui internet dan kemampuan untuk berinteraksi dengan cloud controlling fabric seperti API endpoint dan dasbor menjadi harus dimiliki (must-have) bagi awan publik.
tr_tr: Kamu bulutlarının saldırı yüzeyinde göze çarpan önemli bir farklılık, servislerine internet erişimi sağlamaları gerektiğidir. Örnek bağlantı, internet üzerinden dosyalara erişim ve bulut kumandasını API uç noktaları ve panel gibi etkileşim kurma yeteneği, genel bulut için zorunludur.

source: A password for a user, if you specify a user name.
de: Ein Passwort für einen Benutzer, wenn Sie einen Benutzernamen angeben.
id: Kata sandi untuk pengguna, jika Anda menentukan nama pengguna.
tr_tr: Eğer kullanıcı adı belirtirseniz, kullanıcı için parola.

source: A policy engine and its configuration file, ``policy.json``, within OpenStack Networking provides a method to provide finer grained authorization of users on project networking methods and objects. The OpenStack Networking policy definitions affect network availability, network security and overall OpenStack security. Cloud architects and operators should carefully evaluate their policy towards user and project access to administration of network resources. For a more detailed explanation of OpenStack Networking policy definition, please refer to the `Authentication and authorization section <https://docs.openstack.org/admin-guide/networking_auth.html>`__ in the OpenStack Administrator Guide.
de: Eine Policy Engine und ihre Konfigurationsdatei, ``policy.json``, innerhalb von OpenStack Networking bietet eine Methode, um eine feinkörnige Autorisierung von Benutzern auf Projektnetzwerkmethoden und -objekten zu ermöglichen. Die OpenStack Networking-Richtliniendefinitionen beeinflussen die Netzwerkverfügbarkeit, die Netzwerksicherheit und die gesamte OpenStack-Sicherheit. Cloud-Architekten und Betreiber sollten ihre Politik gegenüber dem Nutzer- und Projektzugang auf die Verwaltung von Netzwerkressourcen sorgfältig auswerten. Eine ausführlichere Erläuterung der OpenStack Networking-Richtliniendefinition finden Sie im Abschnitt "Authentifizierung und Autorisierung" <https://docs.openstack.org/admin-guide/networking_auth.html>`__ im OpenStack Administrator Guide.
id: Sebuah mesin kebijakan dan file konfigurasinya, ``policy.json``, di dalam OpenStack Networking menyediakan metode untuk memberikan otorisasi pengguna yang lebih halus mengenai metode dan objek jaringan proyek. Definisi kebijakan OpenStack Networking mempengaruhi ketersediaan jaringan, keamanan jaringan dan keamanan OpenStack secara keseluruhan. Arsitek dan operator awan harus hati-hati mengevaluasi kebijakan mereka terhadap akses pengguna dan proyek untuk administrasi sumber daya jaringan. Untuk penjelasan lebih rinci tentang definisi kebijakan OpenStack Networking, lihat `Authentication and authorization section <https://docs.openstack.org/admin-guide/networking_auth.html> `__ di Panduan Administrator OpenStack.
tr_tr: OpenStack Ağında bir ilke motoru ve yapılandırma dosyası olan ``policy.json``, proje ağları yöntemleri ve nesneleri üzerinde kullanıcıların daha hassas bir şekilde yetkilendirilmesini sağlamak için bir yöntem sağlar. OpenStack Ağ ilkesi tanımları, ağ kullanılabilirliği, ağ güvenliği ve genel OpenStack güvenliğini etkiler. Bulut mimarları ve operatörleri, kullanıcılara yönelik politika ve ağ kaynaklarının yönetimine proje erişimi açısından dikkatle değerlendirme yapmalıdır. OpenStack Ağ ilkesi tanımının daha ayrıntılı bir açıklaması için lütfen OpenStack Yönetici Kılavuzu'ndaki `Kimlik doğrulama ve yetkilendirme bölümü <https://docs.openstack.org/admin-guide/networking_auth.html>`__ sayfasına bakın.

source: A policy rule determines under which circumstances the API call is permitted. The ``/etc/manila/policy.json`` file has rules where action is always permitted, when the rule is an empty string: ``""``; the rules based on the user role or rules; rules with boolean expressions. Below is a snippet of the ``policy.json`` file for the Shared File Systems service. From one OpenStack release to another it can be changed.
de: Eine Richtlinienregel bestimmt, unter welchen Umständen der API-Aufruf erlaubt ist. Die ``/etc/manila/policy.json``Datei hat Regeln, wo Aktion immer erlaubt ist, wenn die Regel eine leere Zeichenfolge ist: ``\\ ``; die Regeln, die auf der Benutzerrolle basieren; Regeln mit booleschen Ausdrücken. Unten ist ein Snippet der ``policy.json``Datei für den Shared File Systems Service. Von einem OpenStack Release zum anderen kann es sich ändern.
id: Aturan kebijakan menentukan keadaan yang diizinkan API diizinkan. File ``/etc/manila/policy.json`` memiliki aturan di mana tindakan selalu diizinkan, bila aturan adalah string kosong: ``""``; aturan berdasarkan peran atau aturan pengguna; aturan dengan ekspresi boolean. Berikut adalah cuplikan dari file ``policy.json`` untuk layanan Shared File Systems. Dari satu rilis OpenStack ke yang lain itu bisa diubah.
tr_tr: Hangi şartlar altında API çağrısına izin verileceğini belirleyen bir ilke kuralı. ``/etc/manila/policy.json`` dosyasında kural boş bir dizge olduğunda eylemin her zaman izin verildiği kurallar vardır: ``""``; kurallar kullanıcı rolüne veya kurallarına dayanır; boolean ifadeleri ile kurallar. Aşağıda, Paylaşımlı Dosya Sistemleri servisi için ``policy.json`` dosyasının bir bölümüdür. Bir OpenStack sürümünden diğerine değişebilir.

source: A production quality cloud should always use tools to automate configuration and deployment. This eliminates human error, and allows the cloud to scale much more rapidly. Automation also helps with continuous integration and testing.
de: Eine Produktionsqualität-Cloud sollte immer Werkzeuge benutzen, um die Konfiguration und Bereitstellung zu automatisieren. Dies beseitigt menschlicheFehler und lässt die Cloud viel schneller skalieren. Automatisierung hilft auch bei kontinuierlicher Integration und Prüfung.
id: Awan kualitas produksi harus selalu menggunakan alat untuk mengotomatisasi konfigurasi dan penyebaran. Ini menghilangkan kesalahan manusia, dan memungkinkan awan untuk skala jauh lebih cepat. Otomasi juga membantu dengan integrasi dan pengujian terus menerus.
tr_tr: Bir yayın kalitesindeki bulut her zaman yapılandırmayı ve kurulumu otomatikleştirmek için araçlar kullanmalıdır. Bu, insan hatasını ortadan kaldırır ve bulutun çok daha hızlı ölçeklenmesini sağlar. Otomasyon, sürekli entegrasyon ve test etme konusunda da yardımcı olur.

source: A proxy node should have at least two interfaces (physical or virtual): one public and one private. Firewalls or service binding might protect the public interface. The public facing service is an HTTP web server that processes end-point client requests, authenticates them, and performs the appropriate action. The private interface does not require any listening services, but is instead used to establish outgoing connections to storage nodes on the private storage network.
de: Ein Proxy-Knoten sollte mindestens zwei Schnittstellen (physisch oder virtuell) haben: eine öffentliche und eine private. Firewalls oder Service-Bindung schützen die öffentliche Schnittstelle. Der Public-Face-Service ist ein HTTP-Webserver, der Endpunkt-Client-Anfragen verarbeitet, authentifiziert und die entsprechende Aktion ausführt. Die private Schnittstelle benötigt keine Listener-Dienste, sondern wird stattdessen verwendet, um ausgehende Verbindungen zu Speicherknoten im privaten Speichernetzwerk herzustellen.
id: Sebuah node proxy harus memiliki setidaknya dua antarmuka (fisik atau virtual): satu publik dan satu pribadi. Firewall atau layanan yang mengikat bisa melindungi antarmuka publik. Layanan yang dihadapi publik adalah server web HTTP yang memproses permintaan klien end-point, mengotentikasi mereka, dan melakukan tindakan yang sesuai. Antarmuka pribadi tidak memerlukan layanan listening, namun digunakan untuk membuat koneksi keluar ke node penyimpanan pada jaringan penyimpanan pribadi.
tr_tr: Bir vekil düğümün en az iki arabirimi (fiziksel veya sanal) olması gerekir: biri kamu, diğeri gizli. Güvenlik duvarları veya servis bağlama, genel arabirimi koruyabilir. Halka açık servis, son nokta istemci isteklerini işleyen, kimlik doğrulamalarını yapan ve uygun eylemi gerçekleştiren bir HTTP web sunucusudur. Özel arabirim herhangi bir dinleme servisi gerektirmez, bunun yerine özel depolama ağı üzerindeki depolama düğümlerine giden bağlantılar kurmak için kullanılır.

source: A risk assessment framework identifies risks within an organization or service, and specifies ownership of these risks, along with implementation and mitigation strategies. Risks apply to all areas of the service, from technical controls to environmental disaster scenarios and human elements. For example, a malicious insider. Risks can be rated using a variety of mechanisms. For example, likelihood versus impact. An OpenStack deployment risk assessment can include control gaps.
de: Ein Risikobewertungsrahmen identifiziert Risiken innerhalb einer Organisation oder Dienstleistung und legt die Eigentümer der Risiken sowie die Implementierungs- und Abschwächungsstrategien fest. Die Risiken gelten für alle Bereiche des Dienstes, von technischen Kontrollen bis hin zu Umweltkatastrophenszenarien und menschlichen Elementen. Zum Beispiel ein bösartiger Insider. Risiken können mit einer Vielzahl von Mechanismen bewertet werden. Zum Beispiel, Wahrscheinlichkeit versus Auswirkungen. Eine OpenStack-Implementierungsrisikobewertung kann Steuerungslücken beinhalten.
id: Kerangka penilaian risiko mengidentifikasi risiko di dalam organisasi atau layanan, dan menentukan kepemilikan risiko ini, bersamaan dengan strategi implementasi dan mitigasi. Risiko berlaku untuk semua area layanan, mulai dari kontrol teknis hingga skenario bencana lingkungan dan elemen manusia. Misalnya orang jahat. Resiko dapat dinilai dengan menggunakan berbagai mekanisme. Misalnya, likelihood versus impact. Penilaian risiko pengerahan OpenStack dapat mencakup kesenjangan kontrol.
tr_tr: Bir risk değerlendirme çatısı, bir organizasyonda veya hizmette riskleri tanımlar ve uygulama ve azaltma stratejileri ile birlikte bu risklerin sahipliğini belirtir. Riskler, teknik kontrollerden çevre felaket senaryolarına ve insan unsurlarına kadar, hizmetin tüm alanlarına uygulanır. Örneğin, içeriden bir kötü niyetli. Riskler çeşitli mekanizmalar kullanılarak derecelendirilebilir. Örneğin olasılıkla çarpışma. Bir OpenStack dağıtım risk değerlendirmesi, kontrol boşluklarını içerebilir.
